*          DATA SET CTLNKFDD   AT LEVEL 005 AS OF 04/26/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA22FDD      DATE 04/26/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
STRFSTH  DS    XL8                                                              
STRFST   DS    CL79     2    2   79  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL79     3    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     4    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     5    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     6    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     7    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     8    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  U N             T        Y              
STRLSTH  DS    XL8                                                              
STRLST   DS    CL79    22    2   79  A  U N             T        Y              
STRLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
STRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
