*          DATA SET CTLNKFED   AT LEVEL 003 AS OF 04/26/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA22FED      DATE 04/26/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ELMLOADH DS    XL8                                                              
ELMLOAD  DS    CL6      4    2    6  L  P H             T        Y              
ELMHDRH  DS    XL8                                                              
ELMHDR   DS    CL4      4   10    4  A  P N             T        Y              
ELMDESCH DS    XL8                                                              
ELMDESC  DS    CL5      5    2    5  A  P N             T        Y              
ELMINPH  DS    XL8                                                              
ELMINP   DS    CL70     5   10   70  A  P N             T    I   Y              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70     6   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70     7   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70     8   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70     9   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    10   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    11   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    12   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    13   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    14   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    15   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    16   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    17   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    18   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    19   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    20   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    21   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    22   10   70  A  P N             T        Y              
ELMLDSCH DS    XL8                                                              
ELMLDSC  DS    CL5     23    2    5  A  P N             T        Y              
ELMLINFH DS    XL8                                                              
ELMLINF  DS    CL70    23   10   70  A  P N             T        Y              
ELMPFKH  DS    XL8                                                              
ELMPFK   DS    CL79    24    2   79  A  P H             T        Y              
ELMLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
ELMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1848 BYTES                            
