*          DATA SET CTMAD14TSS AT LEVEL 020 AS OF 04/22/93                      
      DC X'00',AL2(36)                                                          
      DC C'HDR*PSJMBWPTUNCT 009N            NN '                                
      DC X'00',AL2(138)                                                         
      DC C'INS*16161616     199305011     P4CB                        '         
      DC C'16000.00                       '                                     
      DC C'19930320199304201993040111111111N               '                    
OPT1  DS 0C                                                                     
      DC X'00',AL2(OPT1X-OPT1-3)                                                
      DC C'OPT*THIS IS A FREEFORM COMMENT THIS IS THE SECOND'                   
OPT1X DS 0C                                                                     
OPT2  DS 0C                                                                     
      DC X'00',AL2(OPT2X-OPT2-3)                                                
      DC C'OPT*AC=16'                                                           
OPT2X DS 0C                                                                     
OPT3  DS 0C                                                                     
      DC X'00',AL2(OPT3X-OPT3-3)                                                
      DC C'OPT*PI=PLACE OPPOSITE TOC'                                           
OPT3X DS 0C                                                                     
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930601      PG BW                       '         
      DC C'4500.00                        '                                     
      DC C'19930406199305201993050122222222N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'NOP*16161616     19930704      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'NOP*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930705      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930706      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930707      DEIS                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930708      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930709      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930710      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930711      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930712      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930713      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930714      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930715      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930716      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930717      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930718      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930719      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930720      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930721      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930722      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930723      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930724      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930725      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930726      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930727      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930728      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930729      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930730      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930801      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930802      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930803      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930804      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930805      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930806      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930807      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930808      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930809      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930810      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930811      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930812      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930813      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930814      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930815      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930816      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930817      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930818      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930819      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930820      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930821      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930822      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930823      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930824      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930825      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930826      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930827      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930828      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930829      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930830      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930901      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930902      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930903      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930904      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930905      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930906      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930907      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930908      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930909      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930910      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930911      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930912      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930913      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930914      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930915      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930916      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930917      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930918      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930919      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930920      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930921      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930922      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930923      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930924      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930925      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930926      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930927      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930928      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930929      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19930930      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931001      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931002      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931003      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931004      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931005      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931006      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931007      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931008      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931009      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931010      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931011      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931012      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931013      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931014      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931015      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931016      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931017      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931018      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931019      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931020      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931021      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931022      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931023      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931024      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931025      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931026      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931027      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931028      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931029      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931030      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931101      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931102      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931103      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931104      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931105      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931106      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931107      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931108      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*16161616     19931109      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'19930601199307011993061466666666N               '                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(4),C'EOP*',X'00',AL2(138)               
      DC C'INS*8765432101   19930601      4C SPREAD                   '         
      DC C'60000.00                       '                                     
      DC C'19930401                33333333N               '                    
OPT4  DS 0C                                                                     
      DC X'00',AL2(OPT4X-OPT4-3)                                                
      DC C'OPT*IB=ENTERED AS IB COMMENT'                                        
OPT4X DS 0C                                                                     
OPT5  DS 0C                                                                     
      DC X'00',AL2(OPT5X-OPT5-3)                                                
      DC C'OPT*BD=APR12'                                                        
OPT5X DS 0C                                                                     
OPT6  DS 0C                                                                     
      DC X'00',AL2(OPT6X-OPT6-3)                                                
      DC C'OPT*CU=2'                                                            
OPT6X DS 0C                                                                     
      DC X'00',AL2(4),C'EIN*',X'00',AL2(4),C'EOP*',X'00',AL2(138)               
      DC C'INS*87654321     199306161     P4CB                        '         
      DC C'32000.00                                               '             
      DC C'44444444N               '                                            
OPT7  DS 0C                                                                     
      DC X'00',AL2(OPT7X-OPT7-3)                                                
      DC C'OPT*COPY=TUN-CT-123456'                                              
OPT7X DS 0C                                                                     
OPT8  DS 0C                                                                     
      DC X'00',AL2(OPT8X-OPT8-3)                                                
      DC C'OPT*CAP=CAP REPLACED WITH OVERRIDE'                                  
OPT8X DS 0C                                                                     
      DC X'00',AL2(4),C'EIN*',X'00',AL2(138)                                    
      DC C'INS*87654321     19930617      P4CB                        '         
      DC C'32000.00                                               '             
      DC C'55555555N               '                                            
OPT9  DS 0C                                                                     
      DC X'00',AL2(OPT9X-OPT9-3)                                                
      DC C'OPT*CD=4'                                                            
OPT9X DS 0C                                                                     
      DC X'00',AL2(4),C'EIN*',X'00',AL2(4),C'EOP*'                              
      DC X'FF'                     END OF TABLE                                 
