*          DATA SET CTMAD14TST AT LEVEL 165 AS OF 09/24/93                      
TSTX1 DC X'00',AL2(8)                                                           
      DC C'SIG*999N'                                                            
      DC X'00',AL2(36)                                                          
      DC C'HDR*PSJMBWPGP GPA097NE1 I         NN'                                
*&&UK                                                                           
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930702      BARNSIDE                    '         
      DC C'N1000.00                       '                                     
      DC C'                1993040211111112'                                    
      DC X'00',AL2(51)                                                          
      DC C'OPT*THIS IS A COMMENT LINE 1                       '                 
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930705GP123                  50 2   3   '         
      DC C'2000                           '                                     
      DC C'                1993050211111113'                                    
      DC X'00',AL2(51)                                                          
      DC C'ZZZ*GPC                                            '                 
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930707GP123                  XYZ2   3   '         
      DC C'2000                           '                                     
      DC C'                1993050211111114'                                    
      DC X'00',AL2(51)                                                          
      DC C'ZZZ*GPA,GPB                                        '                 
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*123456789    19930528      10X10.25                    '         
      DC C'           1.5750              '                                     
      DC C'                19930501      27'                                    
      DC X'00',AL2(51)                                                          
      DC C'OPT*THIS IS A COMMENT LINE 1                       '                 
      DC X'00',AL2(51)                                                          
      DC C'OPT*THIS IS A COMMENT LINE 2                       '                 
      DC X'00',AL2(51)                                                          
      DC C'OPT*CLE=129I                                       '                 
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930601      REC15                       '         
      DC C'4500.00                        '                                     
      DC C'19930407199305201993050127      '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930602      REC20                       '         
      DC C'5500.00                        '                                     
      DC C'199304071993052019930501   27   '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930606      REC17                       '         
      DC C'5500.00                        '                                     
      DC C'199304071993052019930501  44    '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930607      REC17                       '         
      DC C'4500.00                        '                                     
      DC C'199304071993052019930501  1     '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930609      REC17                       '         
      DC C'5500.00                        '                                     
      DC C'199304071993052019930501FRED    '                                    
      DC X'00',AL2(51)                                                          
      DC C'OPT*THIS IS COMMENT LINE 1                         '                 
      DC X'00',AL2(51)                                                          
      DC C'OPT*THIS IS COMMENT LINE 2                         '                 
      DC X'00',AL2(51)                                                          
      DC C'OPT*THIS IS COMMENT LINE 2                         '                 
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'NOP*00000001     19930609      REC17                       '         
      DC C'4500.00                        '                                     
      DC C'199304071993052019930501DAVID   '                                    
      DC X'00',AL2(4),C'NOP*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'NOP*00000001     19930609      REC17                       '         
      DC C'5500.00                        '                                     
      DC C'199304071993052019930501MIKE    '                                    
      DC X'00',AL2(4),C'NOP*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*00000001     19930609      REC17                       '         
      DC C'4500.00                        '                                     
      DC C'199304071993052019930501BRUCE   '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(4),C'EOP*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*16161616     19930614      REC25                       '         
      DC C'4500.00                        '                                     
      DC C'199304071993052019930501  AL    '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'NOP*16161616     19930615      REC25                       '         
      DC C'1500.00                        '                                     
      DC C'199304071993052019930501PAUL    '                                    
      DC X'00',AL2(4),C'NOP*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*16161616     19930616      REC25                       '         
      DC C'4500.00                        '                                     
      DC C'19930407199305201993050111111111'                                    
      DC X'00',AL2(4),C'EIN*'                                                   
*&&                                                                             
      DC X'00',AL2(122)                                                         
      DC C'INS*123456780    19930101      REC25                       '         
      DC C'4500.00                        '                                     
      DC C'199304071993052019930501BRUCE   '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(4),C'EOP*'                                                   
      DC X'00',AL2(122)                                                         
      DC C'INS*333333333    19930102      REC25                       '         
      DC C'4500.00                        '                                     
      DC C'199304071993052019930501DAVID   '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
*&&UK                                                                           
      DC X'00',AL2(122)                                                         
      DC C'INS*16161616     19930705      REC37                       '         
      DC C'43000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*16161616     19930706      REC45                       '         
      DC C'12000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*16161616     19930717      REC58                       '         
      DC C'X2000.00                       '                                     
      DC C'199306011993070219930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'NOP*16161616     19930720      REC80                       '         
      DC C'22000.00                       '                                     
      DC C'199306011993070219930614        '                                    
      DC X'00',AL2(51)                                                          
      DC C'NOP*THIS IS A COMMENT                              '                 
      DC X'00',AL2(4),C'NOP*'                                                   
*&&                                                                             
      DC X'00',AL2(4),C'EOP*'                                                   
      DC X'FF'                     END OF TABLE                                 
*                                                                               
TSTX2 DC X'00',AL2(36)                                                          
      DC C'HDR*PSJMBWPTUNCT 009N            NN '                                
      DC X'00',AL2(122)                                                         
      DC C'INS*87654321     19930528      REC11                       '         
      DC C'4500.00                        '                                     
      DC C'199304061993052019930501        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*87654321     19930601      REC15                       '         
      DC C'4500.00                        '                                     
      DC C'199304061993052019930501        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'NOP*87654321     19930704      REC20                       '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'NOP*',X'00',AL2(122)                                    
      DC C'INS*87654321     19930705      REC37                       '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*87654321     19930706      REC45                       '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*87654321     19930717      REC58                       '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*87654321     19930720      REC85                       '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*'                                                   
      DC X'00',AL2(4),C'EOP*'                                                   
      DC X'FF'                     END OF TABLE                                 
*                                                                               
*                                                                               
*                                                                               
      DC X'00',AL2(36)                                                          
      DC C'HDR*PSJMBWPTUNCT 009N            NN '                                
      DC X'00',AL2(122)                                                         
      DC C'INS*16161616     199305011     P4CB                        '         
      DC C'16000.00                       '                                     
      DC C'199303201993042019930401        '                                    
OPT1  DS 0C                                                                     
      DC X'00',AL2(OPT1X-OPT1-3)                                                
      DC C'OPT*THIS IS A FREEFORM COMMENT THIS IS THE SECOND'                   
OPT1X DS 0C                                                                     
OPT2  DS 0C                                                                     
      DC X'00',AL2(OPT2X-OPT2-3)                                                
      DC C'OPT*AC=16'                                                           
OPT2X DS 0C                                                                     
OPT3  DS 0C                                                                     
      DC X'00',AL2(OPT3X-OPT3-3)                                                
      DC C'OPT*PI=PLACE OPPOSITE TOC'                                           
OPT3X DS 0C                                                                     
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*16161616     19930601      PG BW                       '         
      DC C'4500.00                        '                                     
      DC C'199304061993052019930501        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'NOP*16161616     19930704      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'NOP*',X'00',AL2(122)                                    
      DC C'INS*16161616     19930705      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*16161616     19930706      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*16161616     19930707      DEIS                        '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*16161616     19931108      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*16161616     19931109      P4CB                        '         
      DC C'22000.00                       '                                     
      DC C'199306011993070119930614        '                                    
      DC X'00',AL2(4),C'EIN*',X'00',AL2(4),C'EOP*',X'00',AL2(122)               
      DC C'INS*8765432101   19930601      4C SPREAD                   '         
      DC C'60000.00                       '                                     
      DC C'19930401                        '                                    
OPT4  DS 0C                                                                     
      DC X'00',AL2(OPT4X-OPT4-3)                                                
      DC C'OPT*IB=ENTERED AS IB COMMENT'                                        
OPT4X DS 0C                                                                     
OPT5  DS 0C                                                                     
      DC X'00',AL2(OPT5X-OPT5-3)                                                
      DC C'OPT*BD=APR12'                                                        
OPT5X DS 0C                                                                     
OPT6  DS 0C                                                                     
      DC X'00',AL2(OPT6X-OPT6-3)                                                
      DC C'OPT*CU=2'                                                            
OPT6X DS 0C                                                                     
      DC X'00',AL2(4),C'EIN*',X'00',AL2(4),C'EOP*',X'00',AL2(122)               
      DC C'INS*87654321     199306161     P4CB                        '         
      DC C'32000.00                                               '             
      DC C'        '                                                            
OPT7  DS 0C                                                                     
      DC X'00',AL2(OPT7X-OPT7-3)                                                
      DC C'OPT*COPY=TUN-CT-123456'                                              
OPT7X DS 0C                                                                     
OPT8  DS 0C                                                                     
      DC X'00',AL2(OPT8X-OPT8-3)                                                
      DC C'OPT*CAP=CAP REPLACED WITH OVERRIDE'                                  
OPT8X DS 0C                                                                     
      DC X'00',AL2(4),C'EIN*',X'00',AL2(122)                                    
      DC C'INS*87654321     19930617      P4CB                        '         
      DC C'32000.00                                               '             
      DC C'        '                                                            
OPT9  DS 0C                                                                     
      DC X'00',AL2(OPT9X-OPT9-3)                                                
      DC C'OPT*CD=4'                                                            
OPT9X DS 0C                                                                     
      DC X'00',AL2(4),C'EIN*',X'00',AL2(4),C'EOP*'                              
      DC X'FF'                     END OF TABLE                                 
