*          DATA SET CTPROFFD   AT LEVEL 013 AS OF 05/02/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA03FFD      DATE 05/02/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PROHDRH  DS    CL8                                                              
PROHDR   DS    CL60     1    2   60  L  P N             T        Y              
PROSRVH  DS    CL8                                                              
PROSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P H             T        Y              
PROACTNH DS    CL8                                                              
PROACTN  DS    CL8      2   10    8  A  U N        M    T    I   Y    1         
PROACTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      2   19    6  L  P H             T        Y              
PROSYSH  DS    CL8                                                              
PROSYS   DS    CL8      2   27    8  A  U N             T        Y    2         
PROSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      2   36    7  L  P H             T        Y              
PROPRGH  DS    CL8                                                              
PROPRG   DS    CL5      2   44    5  A  U N             T        Y    3         
PROPRGX  DS    CL8                                                              
PRODESCH DS    CL8                                                              
PRODESC  DS    CL30     2   50   30  A  P N             T        Y              
PROUHDH  DS    CL8                                                              
PROUHD   DS    CL7      3    2    7  L  P H             T        Y              
PROUIDH  DS    CL8                                                              
PROUID   DS    CL8      3   10    8  A  P N             T        Y    4         
PROUIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      3   19    5  L  P N             T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL8      3   27    8  A  U H             T        Y    5         
PROMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      3   36    6  L  P N             T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL8      3   44    8  A  U H             T        Y    6         
PROCLIX  DS    CL8                                                              
PROHEREH DS    CL8                                                              
PROHERE  DS    CL79     5    2   79  A  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 448  BYTES                            
