*          DATA SET CTPUBD5D   AT LEVEL 003 AS OF 07/13/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA15D5D      DATE 07/13/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    4    4  A  P N             T        Y              
MNTTYPH  DS    CL8                                                              
MNTTYP   DS    CL1      5   10    1  A  P N             T        Y              
MNTTYNH  DS    CL8                                                              
MNTTYN   DS    CL8      5   12    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   22    5  A  P N             T        Y              
MNTTITH  DS    CL8                                                              
MNTTIT   DS    CL50     5   29   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79     6    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79     7    1   79  A  P N             T        Y              
MNTMOR1H DS    CL8                                                              
MNTMOR1  DS    CL2      8    1    2  L  P N             T        Y              
MNTIS1H  DS    CL8                                                              
MNTIS1   DS    CL75     9    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    10    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    1   75  A  P N             T        Y              
MNTISXH  DS    CL8                                                              
MNTISX   DS    CL75    22    1   75  A  P N             T        Y              
MNTMORLH DS    CL8                                                              
MNTMORL  DS    CL2     22   79    2  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    23    2   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
MNTSCRLH DS    CL8                                                              
MNTSCRL  DS    CL5     24   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    24   18   18  A  P N             T        Y              
MNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1608 BYTES                            
