*          DATA SET CTPUBD1D   AT LEVEL 004 AS OF 07/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA15D1D      DATE 07/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    4    4  A  P N             T        Y              
MNTTYPH  DS    CL8                                                              
MNTTYP   DS    CL1      5   10    1  A  P N             T        Y              
MNTTYNH  DS    CL8                                                              
MNTTYN   DS    CL8      5   12    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   22    5  A  P N             T        Y              
MNTTITH  DS    CL8                                                              
MNTTIT   DS    CL50     5   29   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  A  P N             T        Y              
MNTTRMH  DS    CL8                                                              
MNTTRM   DS    CL20     6   14   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7   41   14  A  P N             T        Y              
MNTAD1H  DS    CL8                                                              
MNTAD1   DS    CL17     8    2   17  A  P N             T        Y              
MNTSZ1H  DS    CL8                                                              
MNTSZ1   DS    CL19     8   21   19  A  P N             T        Y              
MNTADIH  DS    CL8                                                              
MNTADI   DS    CL17     8   41   17  A  P N             T        Y              
MNTSZIH  DS    CL8                                                              
MNTSZI   DS    CL19     8   59   19  A  P N             T        Y              
MNTAD2H  DS    CL8                                                              
MNTAD2   DS    CL17     9    2   17  A  P N             T        Y              
MNTSZ2H  DS    CL8                                                              
MNTSZ2   DS    CL19     9   21   19  A  P N             T        Y              
MNTADJH  DS    CL8                                                              
MNTADJ   DS    CL17     9   41   17  A  P N             T        Y              
MNTSZJH  DS    CL8                                                              
MNTSZJ   DS    CL19     9   59   19  A  P N             T        Y              
MNTAD3H  DS    CL8                                                              
MNTAD3   DS    CL17    10    2   17  A  P N             T        Y              
MNTSZ3H  DS    CL8                                                              
MNTSZ3   DS    CL19    10   21   19  A  P N             T        Y              
MNTADKH  DS    CL8                                                              
MNTADK   DS    CL17    10   41   17  A  P N             T        Y              
MNTSZKH  DS    CL8                                                              
MNTSZK   DS    CL19    10   59   19  A  P N             T        Y              
MNTAD4H  DS    CL8                                                              
MNTAD4   DS    CL17    11    2   17  A  P N             T        Y              
MNTSZ4H  DS    CL8                                                              
MNTSZ4   DS    CL19    11   21   19  A  P N             T        Y              
MNTADLH  DS    CL8                                                              
MNTADL   DS    CL17    11   41   17  A  P N             T        Y              
MNTSZLH  DS    CL8                                                              
MNTSZL   DS    CL19    11   59   19  A  P N             T        Y              
MNTAD5H  DS    CL8                                                              
MNTAD5   DS    CL17    12    2   17  A  P N             T        Y              
MNTSZ5H  DS    CL8                                                              
MNTSZ5   DS    CL19    12   21   19  A  P N             T        Y              
MNTADMH  DS    CL8                                                              
MNTADM   DS    CL17    12   41   17  A  P N             T        Y              
MNTSZMH  DS    CL8                                                              
MNTSZM   DS    CL19    12   59   19  A  P N             T        Y              
MNTAD6H  DS    CL8                                                              
MNTAD6   DS    CL17    13    2   17  A  P N             T        Y              
MNTSZ6H  DS    CL8                                                              
MNTSZ6   DS    CL19    13   21   19  A  P N             T        Y              
MNTADNH  DS    CL8                                                              
MNTADN   DS    CL17    13   41   17  A  P N             T        Y              
MNTSZNH  DS    CL8                                                              
MNTSZN   DS    CL19    13   59   19  A  P N             T        Y              
MNTAD7H  DS    CL8                                                              
MNTAD7   DS    CL17    14    2   17  A  P N             T        Y              
MNTSZ7H  DS    CL8                                                              
MNTSZ7   DS    CL19    14   21   19  A  P N             T        Y              
MNTADOH  DS    CL8                                                              
MNTADO   DS    CL17    14   41   17  A  P N             T        Y              
MNTSZOH  DS    CL8                                                              
MNTSZO   DS    CL19    14   59   19  A  P N             T        Y              
MNTAD8H  DS    CL8                                                              
MNTAD8   DS    CL17    15    2   17  A  P N             T        Y              
MNTSZ8H  DS    CL8                                                              
MNTSZ8   DS    CL19    15   21   19  A  P N             T        Y              
MNTADPH  DS    CL8                                                              
MNTADP   DS    CL17    15   41   17  A  P N             T        Y              
MNTSZPH  DS    CL8                                                              
MNTSZP   DS    CL19    15   59   19  A  P N             T        Y              
MNTAD9H  DS    CL8                                                              
MNTAD9   DS    CL17    16    2   17  A  P N             T        Y              
MNTSZ9H  DS    CL8                                                              
MNTSZ9   DS    CL19    16   21   19  A  P N             T        Y              
MNTADQH  DS    CL8                                                              
MNTADQ   DS    CL17    16   41   17  A  P N             T        Y              
MNTSZQH  DS    CL8                                                              
MNTSZQ   DS    CL19    16   59   19  A  P N             T        Y              
MNTADAH  DS    CL8                                                              
MNTADA   DS    CL17    17    2   17  A  P N             T        Y              
MNTSZAH  DS    CL8                                                              
MNTSZA   DS    CL19    17   21   19  A  P N             T        Y              
MNTADRH  DS    CL8                                                              
MNTADR   DS    CL17    17   41   17  A  P N             T        Y              
MNTSZRH  DS    CL8                                                              
MNTSZR   DS    CL19    17   59   19  A  P N             T        Y              
MNTADBH  DS    CL8                                                              
MNTADB   DS    CL17    18    2   17  A  P N             T        Y              
MNTSZBH  DS    CL8                                                              
MNTSZB   DS    CL19    18   21   19  A  P N             T        Y              
MNTADSH  DS    CL8                                                              
MNTADS   DS    CL17    18   41   17  A  P N             T        Y              
MNTSZSH  DS    CL8                                                              
MNTSZS   DS    CL19    18   59   19  A  P N             T        Y              
MNTADCH  DS    CL8                                                              
MNTADC   DS    CL17    19    2   17  A  P N             T        Y              
MNTSZCH  DS    CL8                                                              
MNTSZC   DS    CL19    19   21   19  A  P N             T        Y              
MNTADTH  DS    CL8                                                              
MNTADT   DS    CL17    19   41   17  A  P N             T        Y              
MNTSZTH  DS    CL8                                                              
MNTSZT   DS    CL19    19   59   19  A  P N             T        Y              
MNTADDH  DS    CL8                                                              
MNTADD   DS    CL17    20    2   17  A  P N             T        Y              
MNTSZDH  DS    CL8                                                              
MNTSZD   DS    CL19    20   21   19  A  P N             T        Y              
MNTADUH  DS    CL8                                                              
MNTADU   DS    CL17    20   41   17  A  P N             T        Y              
MNTSZUH  DS    CL8                                                              
MNTSZU   DS    CL19    20   59   19  A  P N             T        Y              
MNTADFH  DS    CL8                                                              
MNTADF   DS    CL17    21    2   17  A  P N             T        Y              
MNTSZFH  DS    CL8                                                              
MNTSZF   DS    CL19    21   21   19  A  P N             T        Y              
MNTADVH  DS    CL8                                                              
MNTADV   DS    CL17    21   41   17  A  P N             T        Y              
MNTSZVH  DS    CL8                                                              
MNTSZV   DS    CL19    21   59   19  A  P N             T        Y              
MNTADGH  DS    CL8                                                              
MNTADG   DS    CL17    22    2   17  A  P N             T        Y              
MNTSZGH  DS    CL8                                                              
MNTSZG   DS    CL19    22   21   19  A  P N             T        Y              
MNTADWH  DS    CL8                                                              
MNTADW   DS    CL17    22   41   17  A  P N             T        Y              
MNTSZWH  DS    CL8                                                              
MNTSZW   DS    CL19    22   59   19  A  P N             T        Y              
MNTADHH  DS    CL8                                                              
MNTADH   DS    CL17    23    2   17  A  P N             T        Y              
MNTSZHH  DS    CL8                                                              
MNTSZH   DS    CL19    23   21   19  A  P N             T        Y              
MNTADXH  DS    CL8                                                              
MNTADX   DS    CL17    23   41   17  A  P N             T        Y              
MNTSZXH  DS    CL8                                                              
MNTSZX   DS    CL19    23   59   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    24    2   76  A  P N             T        Y              
MNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1952 BYTES                            
