*          DATA SET CTREQFFD   AT LEVEL 001 AS OF 12/09/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA04FFD      DATE 12/09/08                 
         SPACE 1                                                                
TA04FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BVRHDRH  DS    XL8                                                              
BVRHDR   DS    CL60     1    2   60  A  P N             T        Y              
BVRSRVH  DS    XL8                                                              
BVRSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      3    2    9  A  P N             T        Y              
BVRNAMEH DS    XL8                                                              
BVRNAME  DS    CL17     3   14   17  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      3   32    6  A  P N             T        Y              
BVRNUMH  DS    XL8                                                              
BVRNUM   DS    CL10     3   39   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      3   50    3  A  P N             T        Y              
BVRWHYH  DS    XL8                                                              
BVRWHY   DS    CL22     3   54   22  A  U N             T        Y              
BVRMEDH  DS    XL8                                                              
BVRMED   DS    CL2      3   78    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     4    2   11  A  P N             T        Y              
BVRDESTH DS    XL8                                                              
BVRDEST  DS    CL10     4   14   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   32    6  A  P N             T        Y              
BVROUTH  DS    XL8                                                              
BVROUT   DS    CL10     4   39   10  A  U N             T        Y              
BVRRNAMH DS    XL8                                                              
BVRRNAM  DS    CL22     4   54   22  A  P N             N        Y              
BVRFRSTH DS    XL8                                                              
BVRFRST  DS    CL1      5   14    1  A  U N             T        Y              
BVRLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
BVRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
