*          DATA SET CTREPLUTAB AT LEVEL 011 AS OF 04/16/19                      
*                                                                               
         DS    0F                                                               
DEVTBLL  EQU   9                                                                
DEVTBL   DC    CL8'TERMINAL',X'01'                                              
         DC    CL8'TRM     ',X'01'                                              
         DC    CL8'PRINTER ',X'81'                                              
         DC    CL8'PRT     ',X'81'                                              
         DC    CL8'PC      ',X'02'                                              
         DC    CL8'PC      ',X'02'                                              
         DC    CL8'WEB     ',X'04'                                              
         DC    CL8'WEB     ',X'04'                                              
         DC    CL8'SHUTTLE ',X'82'                                              
         DC    CL8'SHT     ',X'82'                                              
         DC    X'00'                                                            
*                                                                               
         DS    0F                                                               
TYPTBLL  EQU   9                                                                
TYPTBL   DC    CL8'3270    ',X'01'                                              
         DC    CL8'TWX     ',X'02'                                              
         DC    CL8'3780    ',X'03'                                              
         DC    X'00'                                                            
                                                                                
**********************************************************************          
* ++INCLUDED IN CTREPLUID AND CTGEN0D                                           
**********************************************************************          
         DS    0F                                                               
NODETBLL EQU   4                                                                
NODETBL  DC    C'   ',X'00',C'DDN',X'01',C'ATL',X'02',C'CHI',X'03'              
         DC    C'LAX',X'04',C'DDL',X'05',C'DAL',X'06',C'TOR',X'07'              
         DC    C'BLN',X'08',C'JWN',X'09',C'DET',X'0A',C'DDG',X'0B'              
         DC    C'MAN',X'0C',C'LEE',X'0D',C'AGB',X'0E',C'NYT',X'0F'              
         DC    C'FFT',X'10',C'HAM',X'11',C'FRA',X'12',C'HOL',X'13'              
         DC    C'IBM',X'14',C'WAN',X'15',C'LOC',X'16',C'ABC',X'17'              
         DC    C'NBC',X'18',C'CBS',X'19',C'ABU',X'1A',C'LDN',X'1B'              
         DC    C'LEO',X'1C',C'SNI',X'1D',C'TN3',X'1E',C'OSA',X'1F'              
         DC    C'FLO',X'20'                                                     
NODETBLX DC    0C                                                               
         DC    X'FF'                                                            
         EJECT                                                                  
