*          DATA SET CTREQFCD   AT LEVEL 001 AS OF 12/09/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA04FCD      DATE 12/09/08                 
         SPACE 1                                                                
TA04FCD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL24     6    2   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23     6   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     6   56   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     7    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19     7   29   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23     7   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23     8    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19     8   29   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25     8   56   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     9    2   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   56    1  A  U N             T        Y              
MNULAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
MNUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 368  BYTES                            
