*          DATA SET CTSFMD3D   AT LEVEL 010 AS OF 06/25/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AD3D      DATE 06/25/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
ENPDICTH DS    CL8                                                              
ENPDICT  DS    CL8      5   10    8  A   U    H         T    I   Y   12         
ENPDICTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
ENPSUMMH DS    CL8                                                              
ENPSUMM  DS    CL1      6   10    1  A   U    N         T        Y   13         
ENPSUMMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A   P    N         T        Y              
ENPDISKH DS    CL8                                                              
ENPDISK  DS    CL1      7   10    1  A   U    N         T        Y   14         
ENPDISKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    N         T        Y              
ENPLANGH DS    CL8                                                              
ENPLANG  DS    CL3      8   10    3  A   U    N         T        Y  122         
ENPLANGX DS    CL8                                                              
ENPTAGH  DS    CL8                                                              
ENPTAG   DS    CL1      9    2    1  A   P    N         T        Y              
ENPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ENPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 144  BYTES                            
