*          DATA SET CTSFMC1D   AT LEVEL 004 AS OF 03/09/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AC1D      DATE 03/09/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
SFMREPH  DS    CL8                                                              
SFMREP   DS    CL3      5   10    3  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
SFMREPNH DS    CL8                                                              
SFMREPN  DS    CL10     7   14   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
SFMREPXH DS    CL8                                                              
SFMREPX  DS    CL10     8   14   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A  U N             T        Y              
SFMREP1H DS    CL8                                                              
SFMREP1  DS    CL50     9    5   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y              
SFMREP2H DS    CL8                                                              
SFMREP2  DS    CL50    10    5   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y              
SFMREP3H DS    CL8                                                              
SFMREP3  DS    CL50    11    5   50  A  P N             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 312  BYTES                            
