*          DATA SET CTSFMD2D   AT LEVEL 024 AS OF 01/11/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AD2D      DATE 01/11/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    H         T        Y              
SFMLANGH DS    CL8                                                              
SFMLANG  DS    CL3      5   10    3  A   U    N         T        Y   10         
SFMLANGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    H         T        Y              
SFMSYSH  DS    CL8                                                              
SFMSYS   DS    CL7      5   28    7  A   U    N         T    I   Y   20         
SFMSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  A   P    N         T        Y              
SFMPRGH  DS    CL8                                                              
SFMPRG   DS    CL7      5   46    7  A   U    N         T        Y   30         
SFMPRGX  DS    CL8                                                              
SFMTAGH  DS    CL8                                                              
SFMTAG   DS    CL1      6    2    1  A   P    N         T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 120  BYTES                            
