*          DATA SET CTSFMB6D   AT LEVEL 003 AS OF 02/27/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AB6D      DATE 02/27/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MQUAPPH  DS    XL8                                                              
MQUAPP   DS    CL8      5   10    8  A  U N             T    I   N              
         DS    XL8                                                              
         DS    CL9      5   20    9  A  P H             T        Y              
MQUTYPH  DS    XL8                                                              
MQUTYP   DS    CL1      5   31    1  A  U N             T        Y              
MQUTYPNH DS    XL8                                                              
MQUTYPN  DS    CL20     5   34   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   56    3  A  P H             T        Y              
MQUIDNH  DS    XL8                                                              
MQUIDN   DS    CL5      5   61    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   77    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
MQUOWNH  DS    XL8                                                              
MQUOWN   DS    CL3      7   15    3  A  U N             T        N              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
MQUNAMEH DS    XL8                                                              
MQUNAME  DS    CL48     8   15   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
MQUDESCH DS    XL8                                                              
MQUDESC  DS    CL60     9   15   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
MQUOVNH  DS    XL8                                                              
MQUOVN   DS    CL1     11   15    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P N             T        Y              
MQUTSTH  DS    XL8                                                              
MQUTST   DS    CL1     13   15    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
MQUBCH   DS    XL8                                                              
MQUBC    DS    CL1     14   15    1  A  U N             T        Y              
MQUTAGH  DS    XL8                                                              
MQUTAG   DS    CL1     15    2    1  A  P N             T        Y              
MQULAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MQUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
