*          DATA SET CTSFMBDD   AT LEVEL 006 AS OF 09/22/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ABDD      DATE 09/22/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
LSTSYSH  DS    CL8                                                              
LSTSYS   DS    CL1      6   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   15    3  A  P N             T        Y              
LSTMEDH  DS    CL8                                                              
LSTMED   DS    CL1      6   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   25    3  A  P N             T        Y              
LSTREPH  DS    CL8                                                              
LSTREP   DS    CL4      6   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   17   11  A  P N             T        Y              
LSTSELH  DS    CL8                                                              
LSTSEL   DS    CL3      8    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60     8   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60     9   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    10   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    11   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    12   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    13   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    14   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    15   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    16   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    18   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    19   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    20   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    21   10   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    22   10   60  A  P N             T        Y              
LSTTAGH  DS    CL8                                                              
LSTTAG   DS    CL1     23    2    1  A  P N             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1320 BYTES                            
