*          DATA SET CTSFM97D   AT LEVEL 001 AS OF 08/15/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0A97D      DATE 08/15/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
IPRSNIDH DS    XL8                                                              
IPRSNID  DS    CL39     5   13   39  A  U H             T    I   Y    1         
IPRSNIDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
IPRLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
IPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 88   BYTES                            
