*          DATA SET CTSFM92D   AT LEVEL 009 AS OF 09/18/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0A92D      DATE 09/18/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     5    2   11  A  P H             T        Y              
DCNSRCH  DS    XL8                                                              
DCNSRC   DS    CL8      5   14    8  A  U N             T    I   Y    0         
DCNSRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   24    8  A  P H             T        Y              
DCNSUBFH DS    XL8                                                              
DCNSUBF  DS    CL8      5   33    8  A  U N             T        Y    0         
DCNSUBFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     5   45   11  A  P N             T        Y              
DCNAUIDH DS    XL8                                                              
DCNAUID  DS    CL10     5   57   10  A  U N             T        Y    0         
DCNAUIDX DS    XL8                                                              
DCNAGYCH DS    XL8                                                              
DCNAGYC  DS    CL4      5   68    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
DCNBOOKH DS    XL8                                                              
DCNBOOK  DS    CL12     6    7   12  A  U N             T        Y    0         
DCNBOOKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   24    8  A  P N             T        Y              
DCNBTYPH DS    XL8                                                              
DCNBTYP  DS    CL2      6   33    2  A  U N             T        Y    0         
DCNBTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   45    6  A  P N             T        Y              
DCNCLIH  DS    XL8                                                              
DCNCLI   DS    CL3      6   52    3  A  U N             T        Y    0         
DCNCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   59    8  A  P H             T        Y              
DCNPSWDH DS    XL8                                                              
DCNPSWD  DS    CL8      6   68    8  A  U N             T        Y    0         
DCNPSWDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     7    2   30  A  P N             T        Y              
DCNLTYPH DS    XL8                                                              
DCNLTYP  DS    CL1      7   33    1  A  U H             T        Y    0         
DCNLTYPX DS    XL8                                                              
DCNLTYDH DS    XL8                                                              
DCNLTYD  DS    CL31     7   37   31  A  P N             T        Y              
DCNMKTSH DS    XL8                                                              
DCNMKTS  DS    CL78     8    2   78  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  U H             T        Y              
DCNMKTXH DS    XL8                                                              
DCNMKTX  DS    CL78    15    2   78  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4     16    2    4  A  P N             T        Y              
DCNFASTH DS    XL8                                                              
DCNFAST  DS    CL18    16   12   18  A  U H             T        Y    0         
DCNFASTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   40    4  A  P N             T        Y              
DCNPS2H  DS    XL8                                                              
DCNPS2   DS    CL18    16   50   18  A  U H             T        Y    0         
DCNPS2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17    2    4  A  P N             T        Y              
DCNPROGH DS    XL8                                                              
DCNPROG  DS    CL18    17   12   18  A  U H             T        Y    0         
DCNPROGX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17   40    4  A  P N             T        Y              
DCNXQHRH DS    XL8                                                              
DCNXQHR  DS    CL18    17   50   18  A  U H             T        Y    0         
DCNXQHRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18    2    4  A  P N             T        Y              
DCNTPTH  DS    XL8                                                              
DCNTPT   DS    CL18    18   12   18  A  U H             T        Y    0         
DCNTPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   40    4  A  P N             T        Y              
DCNPAVH  DS    XL8                                                              
DCNPAV   DS    CL18    18   50   18  A  U H             T        Y    0         
DCNPAVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19    2    4  A  P N             T        Y              
DCNNTIH  DS    XL8                                                              
DCNNTI   DS    CL18    19   12   18  A  U H             T        Y    0         
DCNNTIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   40    4  A  P N             T        Y              
DCNMPAH  DS    XL8                                                              
DCNMPA   DS    CL18    19   50   18  A  U H             T        Y    0         
DCNMPAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20    2    4  A  P N             T        Y              
DCNDPTH  DS    XL8                                                              
DCNDPT   DS    CL18    20   12   18  A  U H             T        Y    0         
DCNDPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   40    4  A  P N             T        Y              
DCNRDPH  DS    XL8                                                              
DCNRDP   DS    CL18    20   50   18  A  U H             T        Y    0         
DCNRDPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
DCNJULH  DS    XL8                                                              
DCNJUL   DS    CL18    21   12   18  A  U H             T        Y    0         
DCNJULX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   40    6  A  P N             T        Y              
DCNSHRSH DS    XL8                                                              
DCNSHRS  DS    CL18    21   50   18  A  U H             T        Y    0         
DCNSHRSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
DCNXSPLH DS    XL8                                                              
DCNXSPL  DS    CL18    22   12   18  A  U H             T        Y    0         
DCNXSPLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   40    4  A  P N             T        Y              
DCNPUTSH DS    XL8                                                              
DCNPUTS  DS    CL18    22   50   18  A  U H             T        Y    0         
DCNPUTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     23    2    4  A  P N             T        Y              
DCNADIH  DS    XL8                                                              
DCNADI   DS    CL18    23   12   18  A  U H             T        Y    0         
DCNADIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     23   40    6  A  P N             T        Y              
DCNS7MIH DS    XL8                                                              
DCNS7MI  DS    CL18    23   50   18  A  U H             T        Y    0         
DCNS7MIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
DCNE7MIH DS    XL8                                                              
DCNE7MI  DS    CL18    24   12   18  A  U H             T        Y    0         
DCNE7MIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     24   40    6  A  P N             T        Y              
DCNSPDMH DS    XL8                                                              
DCNSPDM  DS    CL18    24   50   18  A  U H             T        Y    0         
DCNSPDMX DS    XL8                                                              
DCNLSTXH DS    XL8                                                              
DCNLSTX  DS    CL1     24   78    1  A  P N             T        Y              
DCNLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
DCNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
