*          DATA SET CTSFMBADS  AT LEVEL 001 AS OF 03/06/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ABAD      DATE 03/06/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFMMEDAH DS    CL8                                                              
SFMMEDA  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL12     5   20   12  A  P H             T        Y              
SFMAGRTH DS    CL8                                                              
SFMAGRT  DS    CL5      5   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19     7    2   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
SFMREP1H DS    CL8                                                              
SFMREP1  DS    CL10     9    2   10  A  P N             T        Y              
SFMOVR1H DS    CL8                                                              
SFMOVR1  DS    CL2      9   15    2  A  U N             T        Y              
SFMREP2H DS    CL8                                                              
SFMREP2  DS    CL10     9   22   10  A  P N             T        Y              
SFMOVR2H DS    CL8                                                              
SFMOVR2  DS    CL2      9   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     9   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   35    2  A  U N             T        Y              
SFMLRPLH DS    CL8                                                              
SFMLRPL  DS    CL10    15   42   10  A  P N             T        Y              
SFMLOVLH DS    CL8                                                              
SFMLOVL  DS    CL2     15   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17    2    9  A  P N             T        Y              
SFMTRP1H DS    CL8                                                              
SFMTRP1  DS    CL10    18    2   10  A  P N             T        Y              
SFMTOR1H DS    CL8                                                              
SFMTOR1  DS    CL2     18   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   35    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   35    2  A  U N             T        Y              
SFMREPLH DS    CL8                                                              
SFMREPL  DS    CL10    22   42   10  A  P N             T        Y              
SFMOVRLH DS    CL8                                                              
SFMOVRL  DS    CL2     22   55    2  A  U N             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1136 BYTES                            
