*          DATA SET CTSFM95D   AT LEVEL 002 AS OF 10/24/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0A95D      DATE 10/24/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
IPMSNIDH DS    XL8                                                              
IPMSNID  DS    CL39     5   13   39  A  U H             T    I   Y    1         
IPMSNIDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   53    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
IPMPIDH  DS    XL8                                                              
IPMPID   DS    CL10     7   15   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
IPMIDSH  DS    XL8                                                              
IPMIDS   DS    CL65     8   15   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  A  P N             T        Y              
IPMID2H  DS    XL8                                                              
IPMID2   DS    CL65     9   15   65  A  U N             T        Y              
IPMID3H  DS    XL8                                                              
IPMID3   DS    CL65    10   15   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12    2    4  A  P N             T        Y              
IPMMASKH DS    XL8                                                              
IPMMASK  DS    CL39    12   15   39  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  P N             T        Y              
IPMPUIDH DS    XL8                                                              
IPMPUID  DS    CL60    13   15   60  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
IPMRNAMH DS    XL8                                                              
IPMRNAM  DS    CL60    14   15   60  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
IPMDESH  DS    XL8                                                              
IPMDES   DS    CL60    15   15   60  L  U H             T        Y              
         DS    XL8                                                              
         DS    CL10    17    2   10  A  P N             T        Y              
IPMSMINH DS    XL8                                                              
IPMSMIN  DS    CL39    17   15   39  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
IPMSMAXH DS    XL8                                                              
IPMSMAX  DS    CL39    18   15   39  L  P N             T        Y              
IPMTAGH  DS    XL8                                                              
IPMTAG   DS    CL1     18   78    1  A  P N             T        Y              
IPMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
IPMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 824  BYTES                            
