*          DATA SET CTSFMA6D   AT LEVEL 019 AS OF 09/26/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AA6D      DATE 09/26/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SFLSBFH  DS    XL8                                                              
SFLSBF   DS    CL7      5   10    7  A  U H             T    I   Y    0         
SFLSBFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SFLSRCH  DS    XL8                                                              
SFLSRC   DS    CL3      5   28    3  A  U H             T        Y    0         
SFLSRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SFLSTATH DS    XL8                                                              
SFLSTAT  DS    CL5      5   46    5  A  U H             T        Y    0         
SFLSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   75    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     7    2   78  A  P N             T        Y              
SFLSELH  DS    XL8                                                              
SFLSEL   DS    CL3      8    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     8    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
SFLTAGH  DS    XL8                                                              
SFLTAG   DS    CL1     22    2    1  A  P N             T        Y              
SFLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SFLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1520 BYTES                            
