*          DATA SET CTSFME5D   AT LEVEL 005 AS OF 07/07/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AE5D      DATE 07/07/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
RLSCTRYH DS    CL8                                                              
RLSCTRY  DS    CL11     6   10   11  A   U    N         T        Y   22         
RLSCTRYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   38    7  A   P    N         T        Y              
RLSFILTH DS    CL8                                                              
RLSFILT  DS    CL30     6   46   30  A   U    N         T        Y   30         
RLSFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35     8    2   35  A   P    H         T        Y              
RLSSELH  DS    CL8                                                              
RLSSEL   DS    CL3      9    2    3  A   U    N         T        Y              
RLSDATAH DS    CL8                                                              
RLSDATA  DS    CL31     9    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    10    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    11    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    12    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    13    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    14    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    15    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    16    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    17    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    18    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    19    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    20    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    21    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    22    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    23    6   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    24    6   31  A   P    N         T        Y              
RLSLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
RLSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 958  BYTES                            
