*          DATA SET CTSFMABDS  AT LEVEL 007 AS OF 03/27/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AABD      DATE 03/27/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    2    8  L  P H             T        Y              
SFMAXNH  DS    CL8                                                              
SFMAXN   DS    CL7      6   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   22    1  A  P N             T        Y              
SFMTAGH  DS    CL8                                                              
SFMTAG   DS    CL1      6   78    1  A  P N             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 56   BYTES                            
