*          DATA SET CTSFMF2D   AT LEVEL 039 AS OF 05/09/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AF2D      DATE 05/09/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  L  P H             T        Y              
SFMLANGH DS    CL8                                                              
SFMLANG  DS    CL3      5   10    3  A  U N             T        Y   10         
SFMLANGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  L  P H             T        Y              
SFMSYSH  DS    CL8                                                              
SFMSYS   DS    CL7      5   28    7  A  U N             T    I   Y   20         
SFMSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  L  P H             T        Y              
SFMPROGH DS    CL8                                                              
SFMPROG  DS    CL7      5   46    7  A  U N             T        Y   30         
SFMPROGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   56    6  L  P H             T        Y              
SFMSCRNH DS    CL8                                                              
SFMSCRN  DS    CL3      5   64    3  A  U N             T        Y   40         
SFMSCRNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6    2    5  L  P H             T        Y              
SFMFLDH  DS    CL8                                                              
SFMFLD   DS    CL3      6   10    3  A  U N             T        Y   50         
SFMFLDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   20    4  L  P H             T        Y              
SFMPAGEH DS    CL8                                                              
SFMPAGE  DS    CL3      6   28    3  A  U N             T        Y   60         
SFMPAGEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   35    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  L  P H             T        Y              
SFMHEADH DS    CL8                                                              
SFMHEAD  DS    CL26     6   46   26  A  U N             T        Y   70         
SFMHEADX DS    CL8                                                              
SFMFILLH DS    CL8                                                              
SFMFILL  DS    CL75     7    2   75  A  P N             T        Y    0         
SFMFILLX DS    CL8                                                              
SFMTXTH  DS    CL8                                                              
SFMTXT   DS    CL75     8    2   75  L  U N             T        Y   80         
SFMTXTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75     9    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    10    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    11    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    12    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    13    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    14    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    15    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    16    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    17    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    18    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    19    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    20    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    21    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    22    2   75  L  U N             T        Y   80         
         DS    CL8                                                              
SFMTXTLH DS    CL8                                                              
SFMTXTL  DS    CL75    23    2   75  L  U N             T        Y   80         
SFMTXTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    24    2   75  L  P H             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1904 BYTES                            
