*          DATA SET CTSFM6D    AT LEVEL 001 AS OF 07/24/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AC6D      DATE 07/24/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
STAMEDH  DS    CL8                                                              
STAMED   DS    CL1      5    9    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    H         T        Y              
STAIDH   DS    CL8                                                              
STAID    DS    CL7      5   29    7  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    H         T        Y              
STARCDEH DS    CL8                                                              
STARCDE  DS    CL3      7   12    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL14     7   25   14  A   P    N         T        Y              
STADATEH DS    CL8                                                              
STADATE  DS    CL8      7   41    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12     7   51   12  A   P    N         T        Y              
STAPREPH DS    CL8                                                              
STAPREP  DS    CL3      7   65    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A   P    N         T        Y              
STAOUTCH DS    CL8                                                              
STAOUTC  DS    CL1      8   16    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   25   10  A   P    N         T        Y              
STAFAXH  DS    CL8                                                              
STAFAX   DS    CL14     8   37   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  A   P    N         T        Y              
STAAMCH  DS    CL8                                                              
STAAMC   DS    CL4      9   19    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15     9   25   15  A   P    N         T        Y              
STANMCH  DS    CL8                                                              
STANMC   DS    CL4      9   42    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20     9   51   20  A   P    N         T        Y              
STAMKTAH DS    CL8                                                              
STAMKTA  DS    CL3      9   74    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    10    2   17  A   P    N         T        Y              
STAHMCH  DS    CL8                                                              
STAHMC   DS    CL5     11    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   51    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23    2    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23    9    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   16    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   23    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   30    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   37    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   44    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   51    5  A   U    N         T        Y              
STAHMCLH DS    CL8                                                              
STAHMCL  DS    CL5     23   58    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A   P    N         T        Y              
STALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
STAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
