*          DATA SET CTSFMD9D   AT LEVEL 004 AS OF 07/08/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AD9D      DATE 07/08/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SFRTYPEH DS    CL8                                                              
SFRTYPE  DS    CL1      5    7    1  A  U H             T    I   Y   10         
SFRTYPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   10    3  A  P N             T        Y              
SFRMSGNH DS    CL8                                                              
SFRMSGN  DS    CL5      5   14    5  A  U H             T        Y   15         
SFRMSGNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
SFRNAMEH DS    CL8                                                              
SFRNAME  DS    CL8      5   28    8  A  U H             T        Y   20         
SFRNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
SFRAPPLH DS    CL8                                                              
SFRAPPL  DS    CL4      5   46    4  A  U H             T        Y   25         
SFRAPPLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   56    5  A  P N             T        Y              
SFRDATEH DS    CL8                                                              
SFRDATE  DS    CL16     5   64   16  A  U H             T        Y   26         
SFRDATEX DS    CL8                                                              
SFRTAGH  DS    CL8                                                              
SFRTAG   DS    CL1      6    2    1  A  P N             T        Y              
SFRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 192  BYTES                            
