*          DATA SET CTSFMFAD   AT LEVEL 019 AS OF 10/18/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AFAD      DATE 10/18/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
SFMSYPGH DS    CL8                                                              
SFMSYPG  DS    CL5      5   10    5  A   U    N         T    I   Y  100         
SFMSYPGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    H         T        Y              
SFMPANLH DS    CL8                                                              
SFMPANL  DS    CL8      5   28    8  A   U    N         T        N  105         
SFMPANLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   38    3  A   P    N         T        Y              
SFMAGCYH DS    CL8                                                              
SFMAGCY  DS    CL2      5   42    2  A   U    N         T        Y  110         
SFMAGCYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   45    3  A   P    N         T        Y              
SFMMEDIH DS    CL8                                                              
SFMMEDI  DS    CL1      5   49    1  A   U    N         T        Y  115         
SFMMEDIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   51    3  A   P    N         T        Y              
SFMCLNTH DS    CL8                                                              
SFMCLNT  DS    CL3      5   55    3  A   U    N         T        Y  120         
SFMCLNTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   59    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   60    6  A   P    N         T        Y              
SFMSCRLH DS    CL8                                                              
SFMSCRL  DS    CL2      5   67    2  A   U    N         T        Y  125         
SFMSCRLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
SFMCMDH  DS    CL8                                                              
SFMCMD   DS    CL26     6   10   26  A   U    N         T        Y  130         
SFMCMDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78     7    2   78  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL78     8    2   78  A   P    H         T        Y              
SFMSTH   DS    CL8                                                              
SFMST    DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24     9   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      9   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    10   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     10   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    11   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    12   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    13   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    14   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    15   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    16   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    17   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    18   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    19   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    20   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    21   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   74    5  A   P    N         T        Y              
SFMLSLNH DS    CL8                                                              
SFMLSLN  DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22    6    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     22   27    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    22   30   24  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   55    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   57    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   59    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   63    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   65    3  A   U    N         T        Y              
SFMENDH  DS    CL8                                                              
SFMEND   DS    CL5     22   74    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL74    23    1   74  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL40    24    1   40  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL27    24   51   27  L   P    H         T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2984 BYTES                            
