*          DATA SET CTSFMD0D   AT LEVEL 003 AS OF 05/23/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AD0D      DATE 05/23/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
MNTSYSH  DS    CL8                                                              
MNTSYS   DS    CL1      5   10    1  A  U N             T    I   Y    1         
MNTSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
MNTMEDH  DS    CL8                                                              
MNTMED   DS    CL1      5   28    1  A  U N             T        Y    2         
MNTMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
MNTAORH  DS    CL8                                                              
MNTAOR   DS    CL2      5   46    2  A  U N             T        Y    3         
MNTAORX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
MNTADVH  DS    CL8                                                              
MNTADV   DS    CL3      6   10    3  A  U N             T        Y    4         
MNTADVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
MNTAGYH  DS    CL8                                                              
MNTAGY   DS    CL2      6   28    2  A  U N             T        Y    5         
MNTAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   50    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
MNTAGNMH DS    CL8                                                              
MNTAGNM  DS    CL20     7   10   20  A  U N             T        Y    6         
MNTAGNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   38    4  A  P N             T        Y              
MNTCTLH  DS    CL8                                                              
MNTCTL   DS    CL10     7   46   10  A  U N             T        Y    9         
MNTCTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   60    6  A  P N             T        Y              
MNTFLTRH DS    CL8                                                              
MNTFLTR  DS    CL3      7   70    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   38    8  A  P N             T        Y              
MNTSTRH  DS    CL8                                                              
MNTSTR   DS    CL8      8   48    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   60    8  A  P N             T        Y              
MNTENDH  DS    CL8                                                              
MNTEND   DS    CL8      8   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   14    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   38    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   62    6  A  P N             T        Y              
MNTCLTH  DS    CL8                                                              
MNTCLT   DS    CL7     11    2    7  A  U N             T        Y              
MNTCLT2H DS    CL8                                                              
MNTCLT2  DS    CL7     11   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   50    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   50    7  A  U N             T        Y              
MNTCLSTH DS    CL8                                                              
MNTCLST  DS    CL7     23   62    7  A  U N             T        Y              
MNTTAGH  DS    CL8                                                              
MNTTAG   DS    CL1     24    2    1  A  P N             T        Y              
MNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1616 BYTES                            
