*          DATA SET CTSFMB7D   AT LEVEL 029 AS OF 02/07/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AB7D      DATE 02/07/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
PLSTSYMH DS    CL8                                                              
PLSTSYM  DS    CL7      6   10    7  A   U    N         T    I   Y              
PLSTSYMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    H         T        Y              
PLSTPRGH DS    CL8                                                              
PLSTPRG  DS    CL8      6   28    8  A   U    N         T        Y              
PLSTPRGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   38    5  A   P    H         T        Y              
PLSTSTFH DS    CL8                                                              
PLSTSTF  DS    CL8      6   46    8  A   U    N         T        Y              
PLSTSTFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   60    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      8   10    8  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      8   20    8  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10     8   30   10  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      8   42    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL12     8   48   12  A   P    H         T        Y              
PLSSELH  DS    CL8                                                              
PLSSEL   DS    CL3      9    2    3  A   U    N         T        Y              
PLSSELX  DS    CL8                                                              
PLSTDSCH DS    CL8                                                              
PLSTDSC  DS    CL74     9    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A   P    N         T        Y              
PLSTAGH  DS    CL8                                                              
PLSTAG   DS    CL1     24    2    1  A   P    N         T        Y              
PLSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PLSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
