*          DATA SET CTSFMB8D   AT LEVEL 002 AS OF 07/16/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AB8D      DATE 07/16/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFMMEDAH DS    XL8                                                              
SFMMEDA  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
SFMSTATH DS    XL8                                                              
SFMSTAT  DS    CL6      5   28    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      5   40    9  A  P H             T        Y              
SFMEDATH DS    XL8                                                              
SFMEDAT  DS    CL8      5   50    8  A  U N             T        Y              
SFMCALLH DS    XL8                                                              
SFMCALL  DS    CL6      5   62    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   74    1  A  P N             T        Y              
SFMDSKAH DS    XL8                                                              
SFMDSKA  DS    CL13     6   66   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     7    2   20  A  P N             T        Y              
SFMCREPH DS    XL8                                                              
SFMCREP  DS    CL3      7   23    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   30    8  A  P N             T        Y              
SFMDATEH DS    XL8                                                              
SFMDATE  DS    CL8      7   41    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   51    8  A  P N             T        Y              
SFMPREPH DS    XL8                                                              
SFMPREP  DS    CL3      7   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     8    2   20  A  P N             T        Y              
SFMCRP2H DS    XL8                                                              
SFMCRP2  DS    CL50     8   23   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     9    2   20  A  P N             T        Y              
SFMNSTAH DS    XL8                                                              
SFMNSTA  DS    CL6      9   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   30    8  A  P N             T        Y              
SFMNSDTH DS    XL8                                                              
SFMNSDT  DS    CL8      9   41    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    11    2   16  A  P N             T        Y              
SFMCITYH DS    XL8                                                              
SFMCITY  DS    CL2     11   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   30   12  A  P N             T        Y              
SFMRIDH  DS    XL8                                                              
SFMRID   DS    CL10    11   45   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   30   12  A  P N             T        Y              
SFMDLIDH DS    XL8                                                              
SFMDLID  DS    CL10    12   45   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13    2   18  A  P N             T        Y              
SFMEINVH DS    XL8                                                              
SFMEINV  DS    CL1     13   23    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   30    7  A  P N             T        Y              
SFMBLTOH DS    XL8                                                              
SFMBLTO  DS    CL25    13   45   25  A  U N             T        Y              
SFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 584  BYTES                            
