*          DATA SET CTSFME7D   AT LEVEL 006 AS OF 01/21/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AE7D      DATE 01/21/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  L  P N             T        Y              
SFRSYSH  DS    CL8                                                              
SFRSYS   DS    CL1      5   10    1  A  U H             T    I   Y    0         
SFRSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  L  P N             T        Y              
SFRMODH  DS    CL8                                                              
SFRMOD   DS    CL8      5   28    8  A  U N             T        N    0         
SFRMODX  DS    CL8                                                              
SFRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 72   BYTES                            
