*          DATA SET CTSFMF5D   AT LEVEL 010 AS OF 07/09/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AF5D      DATE 07/09/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     6    2   12  A   P    H         T        Y              
RTECTRYH DS    CL8                                                              
RTECTRY  DS    CL11     6   20   11  A   U    H         T    I   Y   22         
RTECTRYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     8    2   14  A   P    H         T        Y              
RTEDATEH DS    CL8                                                              
RTEDATE  DS    CL8      8   20    8  A   U    N         T        Y   24         
RTEDATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8   38    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13    10    2   13  A   P    H         T        Y              
RTERATEH DS    CL8                                                              
RTERATE  DS    CL9     10   20    9  A   U    N         T        Y   28         
RTERATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    10   38   24  A   P    N         T        Y              
RTETABH  DS    CL8                                                              
RTETAB   DS    CL1     11   20    1  A   U    Z         T        Y              
RTELAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RTEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 192  BYTES                            
