*          DATA SET CTSFMEFD   AT LEVEL 005 AS OF 04/26/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AEFD      DATE 04/26/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    N         T        Y              
SFRFMTH  DS    CL8                                                              
SFRFMT   DS    CL1      5   10    1  A   U    N         T    I   Y   10         
SFRFMTX  DS    CL8                                                              
SFRTAGH  DS    CL8                                                              
SFRTAG   DS    CL1      6    2    1  A   P    N         T        Y              
SFRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 48   BYTES                            
