*          DATA SET CTSFMDDD   AT LEVEL 033 AS OF 10/27/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ADDD      DATE 10/27/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
DTPSYPGH DS    CL8                                                              
DTPSYPG  DS    CL5      5   10    5  A  U H             T    I   Y    0         
DTPSYPGX DS    CL8                                                              
DTPTAGH  DS    CL8                                                              
DTPTAG   DS    CL1      6    2    1  A  P N             T        Y              
DTPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DTPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 48   BYTES                            
