*          DATA SET CTSFM81D   AT LEVEL 001 AS OF 05/29/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0A81D      DATE 05/29/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     5    2   12  A  P H             T        Y              
SCLVNDRH DS    XL8                                                              
SCLVNDR  DS    CL10     5   15   10  A  U N             T        Y   10         
SCLVNDRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     6    2   12  A  P H             T        Y              
SCLPTRH  DS    XL8                                                              
SCLPTR   DS    CL3      6   15    3  A  U N             T        Y   20         
SCLPTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     6   25   12  A  P H             T        Y              
SCLSTAH  DS    XL8                                                              
SCLSTA   DS    CL10     6   38   10  A  U N             T        Y   21         
SCLSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     6   55   14  A  P H             T        Y              
SCLAGYH  DS    XL8                                                              
SCLAGY   DS    CL3      6   70    3  A  U N             T        Y   22         
SCLAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
SCLOFCH  DS    XL8                                                              
SCLOFC   DS    CL2      7   15    2  A  U N             T        Y   25         
SCLOFCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL35     9    2   35  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL40     9   39   40  A  P H             T        Y              
SCLSELH  DS    XL8                                                              
SCLSEL   DS    CL3     10    2    3  A  U N             T        Y              
SCLITMH  DS    XL8                                                              
SCLITM   DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    24    7   74  A  P N             T        Y              
SCLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
