*          DATA SET CTSFMC4D   AT LEVEL 001 AS OF 10/08/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AC4D      DATE 10/08/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
RPTOPTSH DS    XL8                                                              
RPTOPTS  DS    CL12     5   10   12  A  U N             T        Y              
RPTTAGH  DS    XL8                                                              
RPTTAG   DS    CL1      6    2    1  A  P N             T        Y              
RPTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
RPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 48   BYTES                            
