*          DATA SET CTSFMACD   AT LEVEL 008 AS OF 06/08/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AACD      DATE 06/08/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
ZENCLTH  DS    CL8                                                              
ZENCLT   DS    CL3      6   10    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y              
ZENCLTNH DS    CL8                                                              
ZENCLTN  DS    CL20     8   15   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P H             T        Y              
ZENACCOH DS    CL8                                                              
ZENACCO  DS    CL5      9   15    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   78    1  A  P N             T        Y              
ZENLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ZENWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 128  BYTES                            
