*          DATA SET CTSFMCAD   AT LEVEL 004 AS OF 06/27/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ACAD      DATE 06/27/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      5    2    8  L  P N             T        Y              
SFMFAXCH DS    CL8                                                              
SFMFAXC  DS    CL7      5   13    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  L  P N             T        Y              
SFMSUBCH DS    CL8                                                              
SFMSUBC  DS    CL6      5   49    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
SFMFAXNH DS    CL8                                                              
SFMFAXN  DS    CL16     7   13   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
SFMATTH  DS    CL8                                                              
SFMATT   DS    CL25     9   13   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
SFMTELEH DS    CL8                                                              
SFMTELE  DS    CL16    11   13   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
SFMMSG1H DS    CL8                                                              
SFMMSG1  DS    CL65    13   13   65  A  U N             T        Y              
SFMMSG2H DS    CL8                                                              
SFMMSG2  DS    CL65    14   13   65  A  U N             T        Y              
SFMMSG3H DS    CL8                                                              
SFMMSG3  DS    CL65    15   13   65  A  U N             T        Y              
SFMMSG4H DS    CL8                                                              
SFMMSG4  DS    CL65    16   13   65  A  U N             T        Y              
SFMMSG5H DS    CL8                                                              
SFMMSG5  DS    CL65    17   13   65  A  U N             T        Y              
SFMMSG6H DS    CL8                                                              
SFMMSG6  DS    CL65    18   13   65  A  U N             T        Y              
SFMMSG7H DS    CL8                                                              
SFMMSG7  DS    CL65    19   13   65  A  U N             T        Y              
SFMMSG8H DS    CL8                                                              
SFMMSG8  DS    CL65    20   13   65  A  U N             T        Y              
SFMTAGH  DS    CL8                                                              
SFMTAG   DS    CL1     21    2    1  A  P N             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 816  BYTES                            
