*          DATA SET CTSFMBAD   AT LEVEL 001 AS OF 08/11/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ABAD      DATE 08/11/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFMMEDAH DS    XL8                                                              
SFMMEDA  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL12     5   20   12  A  P H             T        Y              
SFMAGRTH DS    XL8                                                              
SFMAGRT  DS    CL5      5   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     5   56   10  A  P H             T        Y              
SFMTREPH DS    XL8                                                              
SFMTREP  DS    CL1      5   67    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   69    1  A  P N             T        Y              
SFMRLBLH DS    XL8                                                              
SFMRLBL  DS    CL9      7    2    9  A  P H             T        Y              
SFMREP1H DS    XL8                                                              
SFMREP1  DS    CL10     8    2   10  A  P N             T        Y              
SFMOVR1H DS    XL8                                                              
SFMOVR1  DS    CL2      8   13    2  A  U N             T        Y              
SFMREPCH DS    XL8                                                              
SFMREPC  DS    CL3      8   16    3  A  P Z             T        Y              
SFMREP2H DS    XL8                                                              
SFMREP2  DS    CL10     8   19   10  A  P N             T        Y              
SFMOVR2H DS    XL8                                                              
SFMOVR2  DS    CL2      8   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10     8   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      8   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10     8   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      8   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10     9   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10     9   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10     9   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    10   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    10   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    10   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    11   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    11   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    11   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    12   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    12   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    12   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    13   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    13   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    13   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    14   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    14   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    14   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    15   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    15   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    15   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    16   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    16   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    17    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    17   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    17   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    17   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    18   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    18   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    19    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    19   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    19   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    19   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    20   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    20   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    21    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    21   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    21   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    21   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    22    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    22   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    22   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    23    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    23   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    23   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   50    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    23   53   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   67    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    24    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     24   13    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   16    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    24   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     24   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   33    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    24   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     24   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   50    3  A  P Z             T        Y              
SFMLRPLH DS    XL8                                                              
SFMLRPL  DS    CL10    24   53   10  A  P N             T        Y              
SFMLOVLH DS    XL8                                                              
SFMLOVL  DS    CL2     24   64    2  A  U N             T        Y              
SFMLRCLH DS    XL8                                                              
SFMLRCL  DS    CL3     24   67    3  A  P Z             T        Y              
SFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2768 BYTES                            
