*          DATA SET CTSFMB4D   AT LEVEL 021 AS OF 10/05/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AB4D      DATE 10/05/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    H         T        Y              
MSLSTAFH DS    CL8                                                              
MSLSTAF  DS    CL8      6   10    8  A   U    N         T    I   Y              
MSLSTAFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL5      8   10    5  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      8   20    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      8   46    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      8   56    8  A   P    H         T        Y              
MSLSELH  DS    CL8                                                              
MSLSEL   DS    CL1      9    2    1  A   U    N         T        Y              
MSLSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A   P    N         T        Y              
MSLTAGH  DS    CL8                                                              
MSLTAG   DS    CL1     24    2    1  A   P    N         T        Y              
MSLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1496 BYTES                            
