*          DATA SET CTSFMF6D   AT LEVEL 007 AS OF 03/01/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AF6D      DATE 03/01/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      5    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      6    2    9  A   P    H         T        Y              
PRNIDH   DS    CL8                                                              
PRNID    DS    CL10     6   13   10  A   U    H         T    I   Y              
PRNIDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    H         T        Y              
PRNLINEH DS    CL8                                                              
PRNLINE  DS    CL4      8   13    4  A   U    H         T        Y              
PRNLINEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    H         T        Y              
PRNOPOLH DS    CL8                                                              
PRNOPOL  DS    CL2     10   13    2  A   U    H         T        Y              
PRNOPOLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10   20    8  A   P    H         T        Y              
PRNNPOLH DS    CL8                                                              
PRNNPOL  DS    CL2     10   30    2  A   U    H         T        Y              
PRNNPOLX DS    CL8                                                              
PRNLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 155  BYTES                            
