*          DATA SET CTSFMEED   AT LEVEL 001 AS OF 09/21/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AEED      DATE 09/21/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFLMEDH  DS    XL8                                                              
SFLMED   DS    CL1      5   10    1  A  U N             T    I   Y    5         
SFLMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SFLSRCH  DS    XL8                                                              
SFLSRC   DS    CL1      5   28    1  A  U N             T        Y   10         
SFLSRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
SFLMKTH  DS    XL8                                                              
SFLMKT   DS    CL3      5   46    3  A  U N             T        Y   15         
SFLMKTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      5   56    9  A  P N             T        Y              
SFLBKTH  DS    XL8                                                              
SFLBKT   DS    CL2      5   68    2  A  U N             T        Y   17         
SFLBKTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SFLNUMH  DS    XL8                                                              
SFLNUM   DS    CL4      6   10    4  A  U N             T        Y   20         
SFLNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL45     8    2   45  A  P N             T        Y              
SFLSELH  DS    XL8                                                              
SFLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
SFLTAGH  DS    XL8                                                              
SFLTAG   DS    CL1     24    2    1  A  P N             T        Y              
SFLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SFLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1648 BYTES                            
