*          DATA SET CTSFMCBD   AT LEVEL 004 AS OF 07/11/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ACBD      DATE 07/11/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     6    2   20  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL5      8    5    5  L   P    H         T        Y              
SFCPHS1H DS    CL8                                                              
SFCPHS1  DS    CL6      8   15    6  A   U    N         T    I   Y    5         
SFCPHS1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9    5    4  L   P    N         T        Y              
SFCLNG1H DS    CL8                                                              
SFCLNG1  DS    CL3      9   15    3  A   U    N         T        Y   10         
SFCLNG1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10    5    5  L   P    N         T        Y              
SFCLVL1H DS    CL8                                                              
SFCLVL1  DS    CL1     10   15    1  A   U    N         T        Y   15         
SFCLVL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL5     15    5    5  L   P    H         T        Y              
SFCPHS2H DS    CL8                                                              
SFCPHS2  DS    CL6     15   15    6  A   U    N         T        Y    5         
SFCPHS2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     16    5    4  L   P    N         T        Y              
SFCLNG2H DS    CL8                                                              
SFCLNG2  DS    CL3     16   15    3  A   U    N         T        Y   10         
SFCLNG2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     17    5    5  L   P    N         T        Y              
SFCLVL2H DS    CL8                                                              
SFCLVL2  DS    CL1     17   15    1  A   U    N         T        Y   15         
SFCLVL2X DS    CL8                                                              
SFCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 256  BYTES                            
