*          DATA SET CTSFMC8D   AT LEVEL 002 AS OF 01/24/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AC8D      DATE 01/24/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
RCMMEDAH DS    XL8                                                              
RCMMEDA  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
RCMSTATH DS    XL8                                                              
RCMSTAT  DS    CL6      5   28    6  A  U N             T        Y              
RCMCALLH DS    XL8                                                              
RCMCALL  DS    CL6      5   40    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   52    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
RCMGREPH DS    XL8                                                              
RCMGREP  DS    CL3      7   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   24    8  A  P N             T        Y              
RCMGDTEH DS    XL8                                                              
RCMGDTE  DS    CL8      7   34    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     7   47   16  A  P N             T        Y              
RCMGBTOH DS    XL8                                                              
RCMGBTO  DS    CL1      7   64    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
RCMLREPH DS    XL8                                                              
RCMLREP  DS    CL3      8   15    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      8   24    8  A  P N             T        Y              
RCMLDTEH DS    XL8                                                              
RCMLDTE  DS    CL8      8   34    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     8   47   16  A  P N             T        Y              
RCMLBTOH DS    XL8                                                              
RCMLBTO  DS    CL1      8   64    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL41    12    2   41  A  P N             T        Y              
RCML1GRH DS    XL8                                                              
RCML1GR  DS    CL3     13    2    3  A  P H             T        Y              
RCML1EDH DS    XL8                                                              
RCML1ED  DS    CL8     13   12    8  A  P H             T        Y              
RCML1LRH DS    XL8                                                              
RCML1LR  DS    CL3     13   24    3  A  P N             T        Y              
RCML1BTH DS    XL8                                                              
RCML1BT  DS    CL1     13   36    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   36    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   36    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   36    1  A  P N             T        Y              
RCML5GRH DS    XL8                                                              
RCML5GR  DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   36    1  A  P N             T        Y              
RCMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
RCMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 552  BYTES                            
