*          DATA SET CTSFMDCD   AT LEVEL 022 AS OF 04/28/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ADCD      DATE 04/28/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
ADDMEDH  DS    CL8                                                              
ADDMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL9      5   20    9  A  P H             T        Y              
ADDIDH   DS    CL8                                                              
ADDID    DS    CL10     5   31   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL17     5   43   17  A  P N             T        Y              
ADDLOVEH DS    CL8                                                              
ADDLOVE  DS    CL2      5   62    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
ADDNAMEH DS    CL8                                                              
ADDNAME  DS    CL33     7    2   33  A  P N             T        Y              
ADDREPH  DS    CL8                                                              
ADDREP   DS    CL10     9    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     9   27   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     9   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   27   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   27   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   27   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   27   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   27   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   27   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   27   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   39    6  A  U N             T        Y              
ADDREPLH DS    CL8                                                              
ADDREPL  DS    CL10    16   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   78    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 928  BYTES                            
