*          DATA SET CTSFMBFD   AT LEVEL 013 AS OF 10/24/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ABFD      DATE 10/24/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      5    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
UPRSYSTH DS    CL8                                                              
UPRSYST  DS    CL1      6   10    1  A   U    H         T    I   Y              
UPRSYSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   20    5  A   P    H         T        Y              
UPRMDIAH DS    CL8                                                              
UPRMDIA  DS    CL1      6   28    1  A   U    H         T        Y              
UPRMDIAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   38    6  A   P    H         T        Y              
UPRCLNTH DS    CL8                                                              
UPRCLNT  DS    CL3      6   46    3  A   U    H         T        Y              
UPRCLNTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      7    2    9  A   P    N         T        Y              
UPRFRPGH DS    CL8                                                              
UPRFRPG  DS    CL3      8    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   70    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   74    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   14    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   18    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   26    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   30    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   38    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   50    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   54    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   58    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   66    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   70    3  A   P    N         T        Y              
UPRLSPGH DS    CL8                                                              
UPRLSPG  DS    CL3     21   74    3  A   P    N         T        Y              
UPRTAGH  DS    CL8                                                              
UPRTAG   DS    CL1     21   78    1  A   P    N         T        Y              
UPRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
UPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 3064 BYTES                            
