*          DATA SET CTSFMCDD   AT LEVEL 001 AS OF 05/02/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ACDD      DATE 05/02/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
LSTNUMH  DS    XL8                                                              
LSTNUM   DS    CL3      6   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
LSTSELHH DS    XL8                                                              
LSTSELH  DS    CL3      8    2    3  A  P N             T        Y              
LSTDATHH DS    XL8                                                              
LSTDATH  DS    CL60     8    7   60  A  P N             T        Y              
LSTSEL1H DS    XL8                                                              
LSTSEL1  DS    CL3      9    2    3  A  U N             T        Y              
LSTDAT1H DS    XL8                                                              
LSTDAT1  DS    CL60     9    7   60  A  P N             T        Y              
LSTSEL2H DS    XL8                                                              
LSTSEL2  DS    CL3     10    2    3  A  U N             T        Y              
LSTDAT2H DS    XL8                                                              
LSTDAT2  DS    CL60    10    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    11    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    12    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    13    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    14    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    15    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    16    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    17    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    18    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    19    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    20    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    21    7   60  A  P N             T        Y              
LSTSELXH DS    XL8                                                              
LSTSELX  DS    CL3     22    2    3  A  U N             T        Y              
LSTDATXH DS    XL8                                                              
LSTDATX  DS    CL60    22    7   60  A  P N             T        Y              
LSTTAGH  DS    XL8                                                              
LSTTAG   DS    CL1     23    2    1  A  P N             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1232 BYTES                            
