*          DATA SET CTSFMCCD   AT LEVEL 001 AS OF 05/02/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ACCD      DATE 05/02/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL13     6    2   13  A  P H             T        Y              
OFFNUMH  DS    XL8                                                              
OFFNUM   DS    CL3      6   16    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y              
OFFCODEH DS    XL8                                                              
OFFCODE  DS    CL2      8   16    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P H             T        Y              
OFFNAMEH DS    XL8                                                              
OFFNAME  DS    CL20    10   16   20  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1     10   78    1  A  P N             T        Y              
OFFLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
OFFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 136  BYTES                            
