*          DATA SET CTSFM9ED   AT LEVEL 011 AS OF 11/30/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0A9ED      DATE 11/30/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SDLFPKH  DS    XL8                                                              
SDLFPK   DS    CL3      5   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
SDLSYSH  DS    XL8                                                              
SDLSYS   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
SDLPRGH  DS    XL8                                                              
SDLPRG   DS    CL10     5   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42     7    2   42  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25     7   46   25  A  P H             T        Y              
SDLSL1H  DS    XL8                                                              
SDLSL1   DS    CL3      8    2    3  A  U N             T        Y              
SDLLN1H  DS    XL8                                                              
SDLLN1   DS    CL73     8    6   73  A  P N             T        Y              
SDLSL2H  DS    XL8                                                              
SDLSL2   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73     9    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    10    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    11    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    12    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    13    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    14    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    15    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    16    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    17    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    18    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    19    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    20    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    21    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    22    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    23    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    24    6   73  A  P N             T        Y              
SDLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SDLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
