*          DATA SET CTSFMB5D   AT LEVEL 001 AS OF 04/01/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AB5D      DATE 04/01/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
DEMFILEH DS    XL8                                                              
DEMFILE  DS    CL1      5    7    1  A  U N             T    I   Y    0         
DEMFILEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   11    7  A  P H             T        Y              
DEMSUBFH DS    XL8                                                              
DEMSUBF  DS    CL1      5   19    1  A  U N             T        Y    0         
DEMSUBFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   23    6  A  P H             T        Y              
DEMSRCH  DS    XL8                                                              
DEMSRC   DS    CL1      5   30    1  A  U N             T        Y    0         
DEMSRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   34   10  A  P N             T        Y              
DEMSTRTH DS    XL8                                                              
DEMSTRT  DS    CL7      5   45    7  A  U N             T        Y    0         
DEMSTRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   55    4  A  P H             T        Y              
DEMDEMOH DS    XL8                                                              
DEMDEMO  DS    CL8      5   60    8  A  U N             T        Y    0         
DEMDEMOX DS    XL8                                                              
DEMDINTH DS    XL8                                                              
DEMDINT  DS    CL5      5   69    5  A  P N             T        Y              
DEMLCODH DS    XL8                                                              
DEMLCOD  DS    CL4      5   76    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DEMDESCH DS    XL8                                                              
DEMDESC  DS    CL60     7   15   60  A  U N             T        Y    0         
DEMDESCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
DEMPRECH DS    XL8                                                              
DEMPREC  DS    CL10     9   15   10  A  U H             T        Y    0         
DEMPRECX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
DEMDIRH  DS    XL8                                                              
DEMDIR   DS    CL3     10   15    3  A  U H             T        Y    0         
DEMDIRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
DEMNDXH  DS    XL8                                                              
DEMNDX   DS    CL3     11   15    3  A  U H             T        Y    0         
DEMNDXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
DEMOPTH  DS    XL8                                                              
DEMOPT   DS    CL60    12   15   60  A  U H             T        Y    0         
DEMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
DEMFORMH DS    XL8                                                              
DEMFORM  DS    CL60    14   15   60  A  U H             T        Y    0         
DEMFORMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    15   15   60  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    16   15   60  A  U H             T        Y    0         
         DS    XL8                                                              
DEMFRMXH DS    XL8                                                              
DEMFRMX  DS    CL60    17   15   60  A  U H             T        Y    0         
DEMFRMXX DS    XL8                                                              
DEMFRA1H DS    XL8                                                              
DEMFRA1  DS    CL54    18   26   54  A  P N             T        Y              
DEMFRA2H DS    XL8                                                              
DEMFRA2  DS    CL54    19   26   54  A  P N             T        Y              
DEMFRA3H DS    XL8                                                              
DEMFRA3  DS    CL54    20   26   54  A  P N             T        Y              
DEMFRA4H DS    XL8                                                              
DEMFRA4  DS    CL54    21   26   54  A  P N             T        Y              
DEMFRA5H DS    XL8                                                              
DEMFRA5  DS    CL54    22   26   54  A  P N             T        Y              
DEMFRA6H DS    XL8                                                              
DEMFRA6  DS    CL54    23   26   54  A  P N             T        Y              
DEMTABH  DS    XL8                                                              
DEMTAB   DS    CL1     24   78    1  A  U N             T        Y    0         
DEMTABX  DS    XL8                                                              
DEMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1224 BYTES                            
