*          DATA SET CTSFMF7D   AT LEVEL 001 AS OF 03/10/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AF7D      DATE 03/10/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      5    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    H         T        Y              
PRNLINEH DS    CL8                                                              
PRNLINE  DS    CL4      7   10    4  A   U    H         T        Y              
PRNLINEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9    2    4  A   P    H         T        Y              
PRNPOLLH DS    CL8                                                              
PRNPOLL  DS    CL2      9   10    2  A   U    H         T        Y              
PRNPOLLX DS    CL8                                                              
PRNLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 80   BYTES                            
