*          DATA SET CTSFMBBD   AT LEVEL 001 AS OF 01/21/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ABBD      DATE 01/21/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SFLMEDAH DS    XL8                                                              
SFLMEDA  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL12     5   20   12  A  P N             T        Y              
SFLAGRTH DS    XL8                                                              
SFLAGRT  DS    CL5      5   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   45    6  A  P N             T        Y              
SFLFILTH DS    XL8                                                              
SFLFILT  DS    CL24     5   53   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19     6   20   19  A  P N             T        Y              
SFLREPOH DS    XL8                                                              
SFLREPO  DS    CL10     6   45   10  A  P N             T        Y              
SFLSELH  DS    XL8                                                              
SFLSEL   DS    CL3      7    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     7    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     8    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
SFLTAGH  DS    XL8                                                              
SFLTAG   DS    CL1     22    2    1  A  P N             T        Y              
SFLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SFLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1592 BYTES                            
