*          DATA SET CTSFMC5D   AT LEVEL 015 AS OF 02/27/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AC5D      DATE 02/27/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MQLAPPH  DS    XL8                                                              
MQLAPP   DS    CL8      5   10    8  A  U N             T    I   N              
         DS    XL8                                                              
         DS    CL9      5   20    9  A  P H             T        Y              
MQLTYPH  DS    XL8                                                              
MQLTYP   DS    CL1      5   31    1  A  U N             T        Y              
MQLTYPNH DS    XL8                                                              
MQLTYPN  DS    CL20     5   34   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
MQLOVNH  DS    XL8                                                              
MQLOVN   DS    CL1      6   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      6   20    9  A  P H             T        Y              
MQLTSTH  DS    XL8                                                              
MQLTST   DS    CL1      6   31    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   45    2  A  P H             T        Y              
MQLBCH   DS    XL8                                                              
MQLBC    DS    CL1      6   50    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   77    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28     7   16   28  A  P H             T        Y              
MQLFLDH  DS    XL8                                                              
MQLFLD   DS    CL36     8    2   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   39    4  A  P H             T        Y              
MQLSELH  DS    XL8                                                              
MQLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
MQLENDH  DS    XL8                                                              
MQLEND   DS    CL74    24    7   74  A  P N             T        Y              
MQLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MQLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
