*          DATA SET CTSFMDBD   AT LEVEL 003 AS OF 09/08/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0ADBD      DATE 09/08/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
SFRLANGH DS    CL8                                                              
SFRLANG  DS    CL3      5   10    3  A  U N             T    I   Y   10         
SFRLANGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     5   20   18  A  P N             T        Y              
SFRCOREH DS    CL8                                                              
SFRCORE  DS    CL1      5   40    1  A  U N             T        Y    0         
SFRCOREX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     5   56   14  A  P N             T        Y              
SFRWEEKH DS    CL8                                                              
SFRWEEK  DS    CL1      5   72    1  A  U N             T        Y    0         
SFRWEEKX DS    CL8                                                              
SFRTAGH  DS    CL8                                                              
SFRTAG   DS    CL1      6    2    1  A  P N             T        Y              
SFRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 128  BYTES                            
