*          DATA SET CTSFM99D   AT LEVEL 001 AS OF 05/29/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0A99D      DATE 05/29/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     5    2   12  A  P H             T        Y              
SCRFTR#H DS    XL8                                                              
SCRFTR#  DS    CL4      5   15    4  A  U N             T        Y   10         
SCRFTR#X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
SCRFTRNH DS    XL8                                                              
SCRFTRN  DS    CL25     7   15   25  A  U N             T        Y   20         
SCRFTRNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20     9    2   20  A  P N             T        Y              
SCRDSC1H DS    XL8                                                              
SCRDSC1  DS    CL60    10    2   60  A  U N             T        Y   60         
SCRDSC1X DS    XL8                                                              
SCRDSC2H DS    XL8                                                              
SCRDSC2  DS    CL60    11    2   60  A  U N             T        Y   60         
SCRDSC2X DS    XL8                                                              
SCRDSC3H DS    XL8                                                              
SCRDSC3  DS    CL60    12    2   60  A  U N             T        Y   60         
SCRDSC3X DS    XL8                                                              
SCRDSC4H DS    XL8                                                              
SCRDSC4  DS    CL60    13    2   60  A  U N             T        Y   60         
SCRDSC4X DS    XL8                                                              
SCRDSC5H DS    XL8                                                              
SCRDSC5  DS    CL60    14    2   60  A  U N             T        Y   60         
SCRDSC5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    16    2   20  A  P N             T        Y              
SCRTXT1H DS    XL8                                                              
SCRTXT1  DS    CL7     17    2    7  A  U N             T        Y   61         
SCRTXT1X DS    XL8                                                              
SCRCTX1H DS    XL8                                                              
SCRCTX1  DS    CL7     17   12    7  A  U N             T        Y   61         
SCRCTX1X DS    XL8                                                              
SCRTXT2H DS    XL8                                                              
SCRTXT2  DS    CL7     18    2    7  A  U N             T        Y   61         
SCRTXT2X DS    XL8                                                              
SCRCTX2H DS    XL8                                                              
SCRCTX2  DS    CL7     18   12    7  A  U N             T        Y   61         
SCRCTX2X DS    XL8                                                              
SCRTXT3H DS    XL8                                                              
SCRTXT3  DS    CL7     19    2    7  A  U N             T        Y   61         
SCRTXT3X DS    XL8                                                              
SCRCTX3H DS    XL8                                                              
SCRCTX3  DS    CL7     19   12    7  A  U N             T        Y   61         
SCRCTX3X DS    XL8                                                              
SCRTXT4H DS    XL8                                                              
SCRTXT4  DS    CL7     20    2    7  A  U N             T        Y   61         
SCRTXT4X DS    XL8                                                              
SCRCTX4H DS    XL8                                                              
SCRCTX4  DS    CL7     20   12    7  A  U N             T        Y   61         
SCRCTX4X DS    XL8                                                              
SCRTXT5H DS    XL8                                                              
SCRTXT5  DS    CL7     21    2    7  A  U N             T        Y   61         
SCRTXT5X DS    XL8                                                              
SCRCTX5H DS    XL8                                                              
SCRCTX5  DS    CL7     21   12    7  A  U N             T        Y   61         
SCRCTX5X DS    XL8                                                              
SCRTXTLH DS    XL8                                                              
SCRTXTL  DS    CL7     22    2    7  A  U N             T        Y   61         
SCRTXTLX DS    XL8                                                              
SCRCTXLH DS    XL8                                                              
SCRCTXL  DS    CL7     22   12    7  A  U N             T        Y   61         
SCRCTXLX DS    XL8                                                              
SCRENDH  DS    XL8                                                              
SCREND   DS    CL1     23   78    1  A  U N             T        Y              
SCRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 840  BYTES                            
