*          DATA SET CTSFMA5D   AT LEVEL 019 AS OF 09/26/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AA5D      DATE 09/26/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SFMSBFH  DS    XL8                                                              
SFMSBF   DS    CL7      5   10    7  A  U H             T    I   Y    0         
SFMSBFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SFMSRCH  DS    XL8                                                              
SFMSRC   DS    CL3      5   28    3  A  U H             T        Y    0         
SFMSRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SFMSTATH DS    XL8                                                              
SFMSTAT  DS    CL5      5   46    5  A  U H             T        Y    0         
SFMSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P H             T        Y              
SFMLSBKH DS    XL8                                                              
SFMLSBK  DS    CL8      5   64    8  A  U H             T        Y    0         
SFMLSBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL29     7    2   29  A  P H             T        Y              
SFMALTSH DS    XL8                                                              
SFMALTS  DS    CL5      8    2    5  A  U N             T        Y    0         
SFMALTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55     8   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55     9   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     10   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    10   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    11   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    12   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    13   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    14   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    15   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    16   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    17   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     18   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    18   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     19   12    6  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    19   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     20   12    6  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    20   24   55  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
SFMCOM1H DS    XL8                                                              
SFMCOM1  DS    CL64    21   11   64  A  U N             T        Y    0         
SFMCOM1X DS    XL8                                                              
SFMCOM2H DS    XL8                                                              
SFMCOM2  DS    CL64    22   11   64  A  U N             T        Y    0         
SFMCOM2X DS    XL8                                                              
SFMCOM3H DS    XL8                                                              
SFMCOM3  DS    CL64    23   11   64  A  U N             T        Y    0         
SFMCOM3X DS    XL8                                                              
SFMTAGH  DS    XL8                                                              
SFMTAG   DS    CL1     24    2    1  A  P N             T        Y              
SFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1944 BYTES                            
