*          DATA SET CTSFM8ED   AT LEVEL 015 AS OF 06/06/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0A8ED      DATE 06/06/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL10     5    2   10  A  P H             T        Y              
SFMLICCH DS    XL8                                                              
SFMLICC  DS    CL32     5   14   32  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10     6    2   10  A  P H             T        Y              
SFMOXDCH DS    XL8                                                              
SFMOXDC  DS    CL8      6   14    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   74    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
SFMCNUMH DS    XL8                                                              
SFMCNUM  DS    CL6      8   14    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
SFMCNA1H DS    XL8                                                              
SFMCNA1  DS    CL40     9   14   40  A  P H             T        Y              
SFMCNA2H DS    XL8                                                              
SFMCNA2  DS    CL40    10   14   40  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
SFMLOCH  DS    XL8                                                              
SFMLOC   DS    CL3     11    9    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     11   18    8  A  P N             T        Y              
SFMNATH  DS    XL8                                                              
SFMNAT   DS    CL3     11   27    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25    14    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   30    4  A  P N             T        Y              
SFMDSKH  DS    XL8                                                              
SFMDSK   DS    CL8     14   35    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   46    5  A  P N             T        Y              
SFMKEYLH DS    XL8                                                              
SFMKEYL  DS    CL10    14   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   63    1  A  P N             T        Y              
SFMKEYSH DS    XL8                                                              
SFMKEYS  DS    CL6     14   65    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    15    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   30    4  A  P N             T        Y              
SFMDSK2H DS    XL8                                                              
SFMDSK2  DS    CL8     15   35    8  A  P N             T        Y              
SFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
