*          DATA SET CTSFMC9D   AT LEVEL 019 AS OF 02/07/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AC9D      DATE 02/07/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
PRPTSYSH DS    CL8                                                              
PRPTSYS  DS    CL7      6   28    7  A   U    N         T        Y              
PRPTSYSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20     7    2   20  A   P    N         T        Y              
PRPTYPH  DS    CL8                                                              
PRPTYP   DS    CL1      7   28    1  A   U    N         T        Y              
PRPTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     8    2   20  A   P    N         T        Y              
PRPTRMKH DS    CL8                                                              
PRPTRMK  DS    CL1      8   28    1  A   U    N         T        Y              
PRPTRMKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    10    2   20  A   P    N         T        Y              
PRPTSTFH DS    CL8                                                              
PRPTSTF  DS    CL8     10   28    8  A   U    N         T        Y              
PRPTSTFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    11    2   20  A   P    N         T        Y              
PRPTPRGH DS    CL8                                                              
PRPTPRG  DS    CL1     11   28    1  A   U    N         T        Y              
PRPTPRGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    12    2   20  A   P    N         T        Y              
PRPTDOCH DS    CL8                                                              
PRPTDOC  DS    CL1     12   28    1  A   U    N         T        Y              
PRPTDOCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    13    2   20  A   P    N         T        Y              
PRPTCSVH DS    CL8                                                              
PRPTCSV  DS    CL1     13   28    1  A   U    N         T        Y              
PRPTCSVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    14    2   20  A   P    N         T        Y              
PRPTCSPH DS    CL8                                                              
PRPTCSP  DS    CL1     14   28    1  A   U    N         T        Y              
PRPTCSPX DS    CL8                                                              
PRPTAGH  DS    CL8                                                              
PRPTAG   DS    CL1     15    2    1  A   P    N         T        Y              
PRPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 384  BYTES                            
