*          DATA SET CTSFME3D   AT LEVEL 008 AS OF 06/25/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AE3D      DATE 06/25/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
ENLDICTH DS    CL8                                                              
ENLDICT  DS    CL8      5   10    8  A   U    H         T    I   Y   12         
ENLDICTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
ENLENTH  DS    CL8                                                              
ENLENT   DS    CL8      5   28    8  A   U    N         T        Y  123         
ENLENTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   38    4  A   P    N         T        Y              
ENLLANGH DS    CL8                                                              
ENLLANG  DS    CL3      5   46    3  A   U    N         T        Y  122         
ENLLANGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      7    7    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7   16    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7   21   11  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      7   42    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7   62    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A   P    N         T        Y              
ENLSELH  DS    CL8                                                              
ENLSEL   DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     8    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A   P    N         T        Y              
ENLTAGH  DS    CL8                                                              
ENLTAG   DS    CL1     24   78    1  A   P    N         T        Y              
ENLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ENLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
