*          DATA SET CTSFME9D   AT LEVEL 012 AS OF 09/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AE9D      DATE 09/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SFLTYPEH DS    CL8                                                              
SFLTYPE  DS    CL1      5    7    1  A  U H             T    I   Y   10         
SFLTYPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5    9    3  A  P N             T        Y              
SFLMSGNH DS    CL8                                                              
SFLMSGN  DS    CL5      5   13    5  A  U H             T        Y   15         
SFLMSGNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
SFLNAMEH DS    CL8                                                              
SFLNAME  DS    CL8      5   28    8  A  U H             T        Y   20         
SFLNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
SFLAPPLH DS    CL8                                                              
SFLAPPL  DS    CL4      5   46    4  A  U H             T        Y   25         
SFLAPPLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   51    6  A  P N             T        Y              
SFLSYSH  DS    CL8                                                              
SFLSYS   DS    CL7      5   58    7  A  U H             T        Y   30         
SFLSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   66    7  A  P N             T        Y              
SFLPROGH DS    CL8                                                              
SFLPROG  DS    CL7      5   74    7  A  U H             T        Y   35         
SFLPROGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
SFLDATEH DS    CL8                                                              
SFLDATE  DS    CL17     6   10   17  A  U H             T        Y   40         
SFLDATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   28    5  A  P N             T        Y              
SFLTIMEH DS    CL8                                                              
SFLTIME  DS    CL11     6   34   11  A  U H             T        Y   45         
SFLTIMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   46    4  A  P N             T        Y              
SFLDAYSH DS    CL8                                                              
SFLDAYS  DS    CL7      6   51    7  A  U H             T        Y   47         
SFLDAYSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   62    4  A  P N             T        Y              
SFLLUIDH DS    CL8                                                              
SFLLUID  DS    CL10     6   68   10  A  U H             T        Y   50         
SFLLUIDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
SFLCTRYH DS    CL8                                                              
SFLCTRY  DS    CL3      7   10    3  A  U H             T        Y   60         
SFLCTRYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   74    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   13    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   22    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   27    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   35    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   39    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19     8   43   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   73    4  A  P N             T        Y              
SFLSELH  DS    CL8                                                              
SFLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
SFLTAGH  DS    CL8                                                              
SFLTAG   DS    CL1     24    2    1  A  P N             T        Y              
SFLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
