*          DATA SET CTSFM9CD   AT LEVEL 007 AS OF 05/02/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0A9CD      DATE 05/02/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
OFFSYSH  DS    XL8                                                              
OFFSYS   DS    CL7      6   10    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P H             T        Y              
OFFLICDH DS    XL8                                                              
OFFLICD  DS    CL3      6   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
OFFOH01H DS    XL8                                                              
OFFOH01  DS    CL6      8    2    6  A  P N             T        Y              
OFFOC01H DS    XL8                                                              
OFFOC01  DS    CL2      8   10    2  A  U H             T        Y              
OFFON01H DS    XL8                                                              
OFFON01  DS    CL26     8   14   26  A  P N             T        Y              
OFFOH02H DS    XL8                                                              
OFFOH02  DS    CL6      8   42    6  A  P N             T        Y              
OFFOC02H DS    XL8                                                              
OFFOC02  DS    CL2      8   50    2  A  U H             T        Y              
OFFON02H DS    XL8                                                              
OFFON02  DS    CL26     8   54   26  A  P N             T        Y              
OFFOH03H DS    XL8                                                              
OFFOH03  DS    CL6      9    2    6  A  P N             T        Y              
OFFOC03H DS    XL8                                                              
OFFOC03  DS    CL2      9   10    2  A  U H             T        Y              
OFFON03H DS    XL8                                                              
OFFON03  DS    CL26     9   14   26  A  P N             T        Y              
OFFOH04H DS    XL8                                                              
OFFOH04  DS    CL6      9   42    6  A  P N             T        Y              
OFFOC04H DS    XL8                                                              
OFFOC04  DS    CL2      9   50    2  A  U H             T        Y              
OFFON04H DS    XL8                                                              
OFFON04  DS    CL26     9   54   26  A  P N             T        Y              
OFFOH05H DS    XL8                                                              
OFFOH05  DS    CL6     10    2    6  A  P N             T        Y              
OFFOC05H DS    XL8                                                              
OFFOC05  DS    CL2     10   10    2  A  U H             T        Y              
OFFON05H DS    XL8                                                              
OFFON05  DS    CL26    10   14   26  A  P N             T        Y              
OFFOH06H DS    XL8                                                              
OFFOH06  DS    CL6     10   42    6  A  P N             T        Y              
OFFOC06H DS    XL8                                                              
OFFOC06  DS    CL2     10   50    2  A  U H             T        Y              
OFFON06H DS    XL8                                                              
OFFON06  DS    CL26    10   54   26  A  P N             T        Y              
OFFOH07H DS    XL8                                                              
OFFOH07  DS    CL6     11    2    6  A  P N             T        Y              
OFFOC07H DS    XL8                                                              
OFFOC07  DS    CL2     11   10    2  A  U H             T        Y              
OFFON07H DS    XL8                                                              
OFFON07  DS    CL26    11   14   26  A  P N             T        Y              
OFFOH08H DS    XL8                                                              
OFFOH08  DS    CL6     11   42    6  A  P N             T        Y              
OFFOC08H DS    XL8                                                              
OFFOC08  DS    CL2     11   50    2  A  U H             T        Y              
OFFON08H DS    XL8                                                              
OFFON08  DS    CL26    11   54   26  A  P N             T        Y              
OFFOH09H DS    XL8                                                              
OFFOH09  DS    CL6     12    2    6  A  P N             T        Y              
OFFOC09H DS    XL8                                                              
OFFOC09  DS    CL2     12   10    2  A  U H             T        Y              
OFFON09H DS    XL8                                                              
OFFON09  DS    CL26    12   14   26  A  P N             T        Y              
OFFOH10H DS    XL8                                                              
OFFOH10  DS    CL6     12   42    6  A  P N             T        Y              
OFFOC10H DS    XL8                                                              
OFFOC10  DS    CL2     12   50    2  A  U H             T        Y              
OFFON10H DS    XL8                                                              
OFFON10  DS    CL26    12   54   26  A  P N             T        Y              
OFFOH11H DS    XL8                                                              
OFFOH11  DS    CL6     13    2    6  A  P N             T        Y              
OFFOC11H DS    XL8                                                              
OFFOC11  DS    CL2     13   10    2  A  U H             T        Y              
OFFON11H DS    XL8                                                              
OFFON11  DS    CL26    13   14   26  A  P N             T        Y              
OFFOH12H DS    XL8                                                              
OFFOH12  DS    CL6     13   42    6  A  P N             T        Y              
OFFOC12H DS    XL8                                                              
OFFOC12  DS    CL2     13   50    2  A  U H             T        Y              
OFFON12H DS    XL8                                                              
OFFON12  DS    CL26    13   54   26  A  P N             T        Y              
OFFOH13H DS    XL8                                                              
OFFOH13  DS    CL6     14    2    6  A  P N             T        Y              
OFFOC13H DS    XL8                                                              
OFFOC13  DS    CL2     14   10    2  A  U H             T        Y              
OFFON13H DS    XL8                                                              
OFFON13  DS    CL26    14   14   26  A  P N             T        Y              
OFFOH14H DS    XL8                                                              
OFFOH14  DS    CL6     14   42    6  A  P N             T        Y              
OFFOC14H DS    XL8                                                              
OFFOC14  DS    CL2     14   50    2  A  U H             T        Y              
OFFON14H DS    XL8                                                              
OFFON14  DS    CL26    14   54   26  A  P N             T        Y              
OFFOH15H DS    XL8                                                              
OFFOH15  DS    CL6     15    2    6  A  P N             T        Y              
OFFOC15H DS    XL8                                                              
OFFOC15  DS    CL2     15   10    2  A  U H             T        Y              
OFFON15H DS    XL8                                                              
OFFON15  DS    CL26    15   14   26  A  P N             T        Y              
OFFOH16H DS    XL8                                                              
OFFOH16  DS    CL6     15   42    6  A  P N             T        Y              
OFFOC16H DS    XL8                                                              
OFFOC16  DS    CL2     15   50    2  A  U H             T        Y              
OFFON16H DS    XL8                                                              
OFFON16  DS    CL26    15   54   26  A  P N             T        Y              
OFFOH17H DS    XL8                                                              
OFFOH17  DS    CL6     16    2    6  A  P H             T        Y              
OFFOC17H DS    XL8                                                              
OFFOC17  DS    CL2     16   10    2  A  U H             T        Y              
OFFON17H DS    XL8                                                              
OFFON17  DS    CL26    16   14   26  A  P N             T        Y              
OFFOH18H DS    XL8                                                              
OFFOH18  DS    CL6     16   42    6  A  P N             T        Y              
OFFOC18H DS    XL8                                                              
OFFOC18  DS    CL2     16   50    2  A  U H             T        Y              
OFFON18H DS    XL8                                                              
OFFON18  DS    CL26    16   54   26  A  P N             T        Y              
OFFOH19H DS    XL8                                                              
OFFOH19  DS    CL6     17    2    6  A  P N             T        Y              
OFFOC19H DS    XL8                                                              
OFFOC19  DS    CL2     17   10    2  A  U H             T        Y              
OFFON19H DS    XL8                                                              
OFFON19  DS    CL26    17   14   26  A  P N             T        Y              
OFFOH20H DS    XL8                                                              
OFFOH20  DS    CL6     17   42    6  A  P N             T        Y              
OFFOC20H DS    XL8                                                              
OFFOC20  DS    CL2     17   50    2  A  U H             T        Y              
OFFON20H DS    XL8                                                              
OFFON20  DS    CL26    17   54   26  A  P N             T        Y              
OFFOH21H DS    XL8                                                              
OFFOH21  DS    CL6     18    2    6  A  P N             T        Y              
OFFOC21H DS    XL8                                                              
OFFOC21  DS    CL2     18   10    2  A  U H             T        Y              
OFFON21H DS    XL8                                                              
OFFON21  DS    CL26    18   14   26  A  P N             T        Y              
OFFOH22H DS    XL8                                                              
OFFOH22  DS    CL6     18   42    6  A  P N             T        Y              
OFFOC22H DS    XL8                                                              
OFFOC22  DS    CL2     18   50    2  A  U H             T        Y              
OFFON22H DS    XL8                                                              
OFFON22  DS    CL26    18   54   26  A  P N             T        Y              
OFFOH23H DS    XL8                                                              
OFFOH23  DS    CL6     19    2    6  A  P N             T        Y              
OFFOC23H DS    XL8                                                              
OFFOC23  DS    CL2     19   10    2  A  U H             T        Y              
OFFON23H DS    XL8                                                              
OFFON23  DS    CL26    19   14   26  A  P N             T        Y              
OFFOH24H DS    XL8                                                              
OFFOH24  DS    CL6     19   42    6  A  P N             T        Y              
OFFOC24H DS    XL8                                                              
OFFOC24  DS    CL2     19   50    2  A  U H             T        Y              
OFFON24H DS    XL8                                                              
OFFON24  DS    CL26    19   54   26  A  P N             T        Y              
OFFOH25H DS    XL8                                                              
OFFOH25  DS    CL6     20    2    6  A  P N             T        Y              
OFFOC25H DS    XL8                                                              
OFFOC25  DS    CL2     20   10    2  A  U H             T        Y              
OFFON25H DS    XL8                                                              
OFFON25  DS    CL26    20   14   26  A  P N             T        Y              
OFFOH26H DS    XL8                                                              
OFFOH26  DS    CL6     20   42    6  A  P N             T        Y              
OFFOC26H DS    XL8                                                              
OFFOC26  DS    CL2     20   50    2  A  U H             T        Y              
OFFON26H DS    XL8                                                              
OFFON26  DS    CL26    20   54   26  A  P N             T        Y              
OFFOH27H DS    XL8                                                              
OFFOH27  DS    CL6     21    2    6  A  P N             T        Y              
OFFOC27H DS    XL8                                                              
OFFOC27  DS    CL2     21   10    2  A  U H             T        Y              
OFFON27H DS    XL8                                                              
OFFON27  DS    CL26    21   14   26  A  P N             T        Y              
OFFOH28H DS    XL8                                                              
OFFOH28  DS    CL6     21   42    6  A  P N             T        Y              
OFFOC28H DS    XL8                                                              
OFFOC28  DS    CL2     21   50    2  A  U H             T        Y              
OFFON28H DS    XL8                                                              
OFFON28  DS    CL26    21   54   26  A  P N             T        Y              
OFFOH29H DS    XL8                                                              
OFFOH29  DS    CL6     22    2    6  A  P N             T        Y              
OFFOC29H DS    XL8                                                              
OFFOC29  DS    CL2     22   10    2  A  U H             T        Y              
OFFON29H DS    XL8                                                              
OFFON29  DS    CL26    22   14   26  A  P N             T        Y              
OFFOH30H DS    XL8                                                              
OFFOH30  DS    CL6     22   42    6  A  P N             T        Y              
OFFOC30H DS    XL8                                                              
OFFOC30  DS    CL2     22   50    2  A  U H             T        Y              
OFFON30H DS    XL8                                                              
OFFON30  DS    CL26    22   54   26  A  P N             T        Y              
OFFOH31H DS    XL8                                                              
OFFOH31  DS    CL6     23    2    6  A  P N             T        Y              
OFFOC31H DS    XL8                                                              
OFFOC31  DS    CL2     23   10    2  A  U H             T        Y              
OFFON31H DS    XL8                                                              
OFFON31  DS    CL26    23   14   26  A  P N             T        Y              
OFFOH32H DS    XL8                                                              
OFFOH32  DS    CL6     23   42    6  A  P N             T        Y              
OFFOC32H DS    XL8                                                              
OFFOC32  DS    CL2     23   50    2  A  U H             T        Y              
OFFON32H DS    XL8                                                              
OFFON32  DS    CL26    23   54   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  P N             T        Y              
OFFLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
OFFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
