*          DATA SET CTSFME2D   AT LEVEL 030 AS OF 05/09/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AE2D      DATE 05/09/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SFMLANGH DS    CL8                                                              
SFMLANG  DS    CL3      5   10    3  A  U N             T        Y   10         
SFMLANGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SFMSYSH  DS    CL8                                                              
SFMSYS   DS    CL7      5   28    7  A  U N             T    I   Y   20         
SFMSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
SFMPROGH DS    CL8                                                              
SFMPROG  DS    CL7      5   46    7  A  U N             T        Y   30         
SFMPROGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   56    6  A  P N             T        Y              
SFMSCRNH DS    CL8                                                              
SFMSCRN  DS    CL3      5   64    3  A  U N             T        Y   40         
SFMSCRNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
SFMFLDH  DS    CL8                                                              
SFMFLD   DS    CL3      6   10    3  A  U N             T        Y   50         
SFMFLDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   20    4  A  P N             T        Y              
SFMPAGEH DS    CL8                                                              
SFMPAGE  DS    CL3      6   28    3  A  U N             T        Y   60         
SFMPAGEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    7    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   13    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   19    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      8   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   28    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   56    4  A  P N             T        Y              
SFMSELH  DS    CL8                                                              
SFMSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
SFMTAGH  DS    CL8                                                              
SFMTAG   DS    CL1     24    2    1  A  P N             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1704 BYTES                            
