*          DATA SET CTSFMADD   AT LEVEL 007 AS OF 09/22/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0AADD      DATE 09/22/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
ZENSYSH  DS    CL8                                                              
ZENSYS   DS    CL1      5   10    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      5   15    3  A  P H             T        Y              
ZENMEDH  DS    CL8                                                              
ZENMED   DS    CL1      5   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      5   25    3  A  P H             T        Y              
ZENREPH  DS    CL8                                                              
ZENREP   DS    CL4      5   30    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
ZENRNAMH DS    CL8                                                              
ZENRNAM  DS    CL22     7   10   22  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
ZENSTRTH DS    CL8                                                              
ZENSTRT  DS    CL24     8   10   24  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A  P H             T        Y              
ZENCITYH DS    CL8                                                              
ZENCITY  DS    CL24     9   10   24  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P H             T        Y              
ZENSTATH DS    CL8                                                              
ZENSTAT  DS    CL3     10   10    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P H             T        Y              
ZENZIPH  DS    CL8                                                              
ZENZIP   DS    CL5     11   10    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     11   78    1  A  P N             T        Y              
ZENLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ZENWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 272  BYTES                            
