*          DATA SET CXAPMD     AT LEVEL 013 AS OF 12/19/94                      
***********************************************************************         
*CONTROL SYSTEM PRESTO EXTRACT - TIME SHEET APPROVER GROUP MANAGER REC*         
***********************************************************************         
         SPACE 1                                                                
CXAPMD   DSECT                     APPROVER GROUP MANAGER RECORD                
CXAPMLEN DS    CL4                 APPROVER GROUP MANAGER RECORD LENGTH         
CXAPMTYP DS    CL5     R CHAR      APPROVER GROUP MANAGER RECORD TYPE           
         DS    C                                                                
CXAPMACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXAPMDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXAPMTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXAPMAGY DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXAPMAGC DS    CL8     K CHAR      APPROVER GROUP CODE                          
         DS    C                                                                
CXAPMMON DS    CL6     K INT       MANAGER ORDER NUMBER                         
         DS    C                                                                
CXAPMPER DS    CL6     K INT       PERSON NUMBER                                
*                                                                               
CXAPMDX  DS    CL2                 RECORD END                                   
CXAPMDL  EQU   *-CXAPMD            RECORD LENGTH                                
