*          DATA SET CXOLED     AT LEVEL 006 AS OF 12/19/94                      
***********************************************************************         
*CONTROL SYSTEM PRESTO EXTRACT - ACCOUNT SYSTEM OFFICE LIST ENTRY REC.*         
***********************************************************************         
         SPACE 1                                                                
CXOLED   DSECT                     OFFICE LIST ENTRY RECORD                     
CXOLELEN DS    CL4                 OFFICE LIST ENTRY RECORD LENGTH              
CXOLETYP DS    CL5     R CHAR      OFFICE LIST ENTRY RECORD TYPE                
         DS    C                                                                
CXOLEACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXOLEDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXOLETIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXOLEAGY DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXOLECOD DS    CL1     K CHAR      OFFICE LIST CODE                             
         DS    C                                                                
CXOLESUB DS    CL1     K CHAR      OFFICE LIST SUB CODE                         
         DS    C                                                                
CXOLEOFF DS    CL1     K CHAR      OFFICE CODE                                  
*                                                                               
CXOLEDX  DS    CL2                 RECORD END                                   
CXOLEDL  EQU   *-CXOLED            RECORD LENGTH                                
