*          DATA SET CXOLSD     AT LEVEL 007 AS OF 12/19/94                      
***********************************************************************         
*CONTROL SYSTEM PRESTO EXTRACT - ACCOUNT SYSTEM OFFICE LIST RECORD    *         
***********************************************************************         
         SPACE 1                                                                
CXOLSD   DSECT                     OFFICE LIST RECORD                           
CXOLSLEN DS    CL4                 OFFICE LIST RECORD LENGTH                    
CXOLSTYP DS    CL5     R CHAR      OFFICE LIST RECORD TYPE                      
         DS    C                                                                
CXOLSACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXOLSDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXOLSTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXOLSAGY DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXOLSCOD DS    CL1     K CHAR      OFFICE LIST CODE                             
         DS    C                                                                
CXOLSSUB DS    CL1     K CHAR      OFFICE LIST SUB CODE                         
*                                                                               
         DS    C                                                                
CXOLSNAM DS    CL36    R CHAR      OFFICE LIST NAME                             
*                                                                               
CXOLSDX  DS    CL2                 RECORD END                                   
CXOLSDL  EQU   *-CXOLSD            RECORD LENGTH                                
