*          DATA SET CXPAMD     AT LEVEL 006 AS OF 12/19/94                      
***********************************************************************         
*CONTROL SYSTEM ACCOUNT EXTRACT - PERSON APPROVER GROUP RECORD        *         
***********************************************************************         
         SPACE 1                                                                
CXPAMD   DSECT                     PERSON APPROVER GROUP RECORD                 
CXPAMLEN DS    CL4                 PERSON APPROVER GROUP RECORD LENGTH          
CXPAMTYP DS    CL5     R CHAR      PERSON APPROVER GROUP RECORD TYPE            
         DS    C                                                                
CXPAMACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXPAMDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXPAMTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXPAMAGY DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXPAMPER DS    CL6     K INT       PERSON NUMBER                                
         DS    C                                                                
CXPAMEFD DS    CL8     K CHAR      EFFECTIVE DATE                               
*                                                                               
         DS    C                                                                
CXPAMAGR DS    CL8     R CHAR      TIME SHEET APPROVER GROUP CODE               
         DS    C                                                                
CXPAMEID DS    CL8     R CHAR      EMAIL ID                                     
*                                                                               
CXPAMDX  DS    CL2                 RECORD END                                   
CXPAMDL  EQU   *-CXPAMD            RECORD LENGTH                                
