*          DATA SET CXRECID    AT LEVEL 013 AS OF 12/01/94                      
***********************************************************************         
* CONTRROL SYSTEM GENERAL EXTRACT RECORD TYPES                        *         
***********************************************************************         
          SPACE 2                                                               
CXOLSDQ   DC   CL5'05500'          ACCOUNT SYSTEM OFFICE LIST                   
CXOLEDQ   DC   CL5'05501'          ACCOUNT SYSTEM OFFICE LIST ENTRY             
CXAPNDQ   DC   CL5'05502'          TIME SHEET APPROVER GROUP NAME               
CXAPMDQ   DC   CL5'05503'          TIME SHEET APPROVER GROUP MANAGER            
CXPAMDQ   DC   CL5'05504'          PERSON TIME SHEET APPROVER GROUP             
