*          DATA SET CXSALD     AT LEVEL 003 AS OF 07/06/94                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - ACCESS AUTHORISATION LEVELS RECORD *         
***********************************************************************         
         SPACE 1                                                                
CXSALD   DSECT                     AUTHORISATION LEVELS RECORD                  
CXSALLEN DS    CL4                 AUTHORISATION LEVELS RECORD LENGTH           
CXSALTYP DS    CL5     R CHAR      AUTHORISATION LEVELS RECORD TYPE             
         DS    C                                                                
CXSALACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSALDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSALTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSALAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSALAGC DS    CL8     K CHAR      ACCESS GROUP CODE                            
         DS    C                                                                
CXSALSYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSALPGM DS    CL2     K CHAR      PROGRAM CODE                                 
         DS    C                                                                
CXSALREC DS    CL2     K CHAR      RECORD CODE                                  
         DS    C                                                                
CXSALACN DS    CL2     K CHAR      ACTION CODE                                  
         DS    C                                                                
CXSALACV DS    CL1     R CHAR      ACCESS VALUE (Y/N)                           
*                                                                               
CXSALDX  DS    CL2                 RECORD END                                   
CXSALDL  EQU   *-CXSALD            RECORD LENGTH                                
