*          DATA SET CXSABD     AT LEVEL 005 AS OF 05/18/98                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - ACCESS USERID/GROUP LEVEL RECORDS  *         
***********************************************************************         
         SPACE 1                                                                
CXSABD   DSECT                     ACCESS USERID/GROUP LEVELS RECORD            
CXSABLEN DS    CL4                 ACCESS USERID/GROUP LEVELS REC. LEN.         
CXSABTYP DS    CL5     R CHAR      ACCESS USERID/GROUP LEVELS REC. TYPE         
         DS    C                                                                
CXSABACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSABDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSABTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSABAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSABUIN DS    CL6     K INT       USER ID NUMBER                               
         DS    C                                                                
CXSABAGC DS    CL8     K CHAR      ACCESS GROUP CODE                            
         DS    C                                                                
CXSABSYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSABPGM DS    CL2     K CHAR      PROGRAM CODE                                 
         DS    C                                                                
CXSABREC DS    CL2     K CHAR      RECORD CODE                                  
         DS    C                                                                
CXSABACN DS    CL2     K CHAR      ACTION CODE                                  
         DS    C                                                                
CXSABACV DS    CL1     R CHAR      ACCESS VALUE (Y/N)                           
*                                                                               
CXSABDX  DS    CL2                 RECORD END                                   
CXSABDL  EQU   *-CXSABD            RECORD LENGTH                                
