*          DATA SET CXSAGD     AT LEVEL 006 AS OF 01/16/04                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - AGENCY RECORD                      *         
***********************************************************************         
         SPACE 1                                                                
CXSAGD   DSECT                     AGENCY RECORD                                
CXSAGLEN DS    CL4                 AGENCY RECORD LENGTH                         
CXSAGTYP DS    CL5     R CHAR      AGENCY RECORD TYPE                           
         DS    C                                                                
CXSAGACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSAGDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSAGTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSAGAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
*                                                                               
         DS    C                                                                
CXSAGSEC DS    CL2     R CHAR      SECURITY AGENCY ALPHA ID                     
*                                                                               
         DS    C                                                                
CXSAGIPP DS    CL1     R CHAR      IS PPS (Y/N)                                 
*                                                                               
         DS    C                                                                
CXSAGPWE DS    CL3     R SMALLINT  PASSWORD EXPIRATION (N'DAYS)                 
*                                                                               
         DS    C                                                                
CXSAGPWW DS    CL3     R SMALLINT  PASSWORD WARNING (N'DAYS)                    
*                                                                               
         DS    C                                                                
CXSAGPWR DS    CL3     R SMALLINT  PASSWORD REUSE (N'TIMES)                     
*                                                                               
         DS    C                                                                
CXSAGPWM DS    CL3     R SMALLINT  PASSWORD MINIMUM LENGTH                      
*                                                                               
CXSAGDX  DS    CL2                 RECORD END                                   
CXSAGDL  EQU   *-CXSAGD            RECORD LENGTH                                
