*          DATA SET CXSAUD     AT LEVEL 004 AS OF 05/18/98                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - ACCESS USERID LEVELS RECORD        *         
***********************************************************************         
         SPACE 1                                                                
CXSAUD   DSECT                     ACCESS USERID LEVELS RECORD                  
CXSAULEN DS    CL4                 ACCESS USERID LEVELS RECORD LENGTH           
CXSAUTYP DS    CL5     R CHAR      ACCESS USERID LEVELS RECORD TYPE             
         DS    C                                                                
CXSAUACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSAUDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSAUTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSAUAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSAUUIN DS    CL6     K INT       USER ID NUMBER                               
         DS    C                                                                
CXSAUSYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSAUPGM DS    CL2     K CHAR      PROGRAM CODE                                 
         DS    C                                                                
CXSAUREC DS    CL2     K CHAR      RECORD CODE                                  
         DS    C                                                                
CXSAUACN DS    CL2     K CHAR      ACTION CODE                                  
         DS    C                                                                
CXSAUACV DS    CL1     R CHAR      ACCESS VALUE (Y/N)                           
*                                                                               
CXSAUDX  DS    CL2                 RECORD END                                   
CXSAUDL  EQU   *-CXSAUD            RECORD LENGTH                                
