*          DATA SET CXSAAD     AT LEVEL 003 AS OF 07/06/94                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - ACCESS AGENCY AUTH. LEVELS RECORD  *         
***********************************************************************         
         SPACE 1                                                                
CXSAAD   DSECT                     AUTHORISATION LEVELS RECORD                  
CXSAALEN DS    CL4                 AUTHORISATION LEVELS RECORD LENGTH           
CXSAATYP DS    CL5     R CHAR      AUTHORISATION LEVELS RECORD TYPE             
         DS    C                                                                
CXSAAACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSAADAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSAATIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSAAAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSAASYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSAAPGM DS    CL2     K CHAR      PROGRAM CODE                                 
         DS    C                                                                
CXSAAREC DS    CL2     K CHAR      RECORD CODE                                  
         DS    C                                                                
CXSAAACN DS    CL2     K CHAR      ACTION CODE                                  
         DS    C                                                                
CXSAAACV DS    CL1     R CHAR      ACCESS VALUE (Y/N)                           
*                                                                               
CXSAADX  DS    CL2                 RECORD END                                   
CXSAADL  EQU   *-CXSAAD            RECORD LENGTH                                
