*          DATA SET CXSEFD     AT LEVEL 005 AS OF 01/21/04                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - PERSON PASSWORD EFFECTIVE DATE     *         
***********************************************************************         
         SPACE 1                                                                
CXSEFD   DSECT                     PERSON PASSWORD EFFECTIVE DATE REC           
CXSEFLEN DS    CL4                 PERS PW EFF DATE LENGTH                      
CXSEFTYP DS    CL5     R CHAR      PERSON PW EFFECTIVE DATE REC TYPE            
         DS    C                                                                
CXSEFACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSEFDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSEFTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSEFAID DS    CL2     R CHAR      AGENCY ALPHA ID                              
*                                                                               
         DS    C                                                                
CXSEFNUM DS    CL6     R INT       PERSON NUMBER                                
*                                                                               
         DS    C                                                                
CXSEFEFF DS    CL8     O CHAR      EFFECTIVE DATE (FROM DATE)                   
*                                                                               
CXSEFDX  DS    CL2                 RECORD END                                   
CXSEFDL  EQU   *-CXSEFD            RECORD LENGTH                                
