*          DATA SET CXSFUD     AT LEVEL 008 AS OF 05/18/98                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - FCONTROL USERID LEVEL RECORD       *         
***********************************************************************         
         SPACE 1                                                                
CXSFUD   DSECT                     FCONTROL USERID LEVELS RECORD                
CXSFULEN DS    CL4                 FCONTROL USERID LEVELS RECORD LENGTH         
CXSFUTYP DS    CL5     R CHAR      FCONTROL USERID LEVELS RECORD TYPE           
         DS    C                                                                
CXSFUACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSFUDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSFUTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSFUAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSFUUIN DS    CL6     K INT       USER ID NUMBER                               
         DS    C                                                                
CXSFUSYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSFUPGM DS    CL2     K CHAR      PROGRAM CODE                                 
         DS    C                                                                
CXSFUFLD DS    CL2     K CHAR      FIELD CODE                                   
         DS    C                                                                
CXSFUCOD DS    CL1     R CHAR      CONTROL CODE (N/R/W)                         
*                                                                               
CXSFUDX  DS    CL2                 RECORD END                                   
CXSFUDL  EQU   *-CXSFUD            RECORD LENGTH                                
