*          DATA SET CXSOBD     AT LEVEL 010 AS OF 05/18/98                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - OCONTROL USERID/GROUP LEVEL RECORD *         
***********************************************************************         
         SPACE 1                                                                
CXSOBD   DSECT                     OCONTROL USERID/GROUP LEVELS RECORD          
CXSOBLEN DS    CL4                 OCONTROL USERID/GROUP LEVELS RECLEN          
CXSOBTYP DS    CL5     R CHAR      OCONTROL USERID/GROUP LEVELS RECTYP          
         DS    C                                                                
CXSOBACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSOBDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSOBTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSOBAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSOBUIN DS    CL6     K INT       USER ID NUMBER                               
         DS    C                                                                
CXSOBAGC DS    CL8     K CHAR      ACCESS GROUP CODE                            
         DS    C                                                                
CXSOBSYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSOBPGM DS    CL2     K CHAR      PROGRAM CODE                                 
         DS    C                                                                
CXSOBOPT DS    CL2     K CHAR      OPTION CODE                                  
         DS    C                                                                
CXSOBCOD DS    CL1     R CHAR      CONTROL CODE (Y/N)                           
*                                                                               
CXSOBDX  DS    CL2                 RECORD END                                   
CXSOBDL  EQU   *-CXSOBD            RECORD LENGTH                                
