*          DATA SET CXSOUD     AT LEVEL 011 AS OF 05/18/98                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - OCONTROL USERID LEVEL RECORD       *         
***********************************************************************         
         SPACE 1                                                                
CXSOUD   DSECT                     OCONTROL USERID LEVELS RECORD                
CXSOULEN DS    CL4                 OCONTROL USERID LEVELS RECORD LENGTH         
CXSOUTYP DS    CL5     R CHAR      OCONTROL USERID LEVELS RECORD TYPE           
         DS    C                                                                
CXSOUACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSOUDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSOUTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSOUAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSOUUIN DS    CL6     K INT       USER ID NUMBER                               
         DS    C                                                                
CXSOUSYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSOUPGM DS    CL2     K CHAR      PROGRAM CODE                                 
         DS    C                                                                
CXSOUOPT DS    CL2     K CHAR      OPTION CODE                                  
         DS    C                                                                
CXSOUCOD DS    CL1     R CHAR      CONTROL CODE (Y/N)                           
*                                                                               
CXSOUDX  DS    CL2                 RECORD END                                   
CXSOUDL  EQU   *-CXSOUD            RECORD LENGTH                                
