*          DATA SET CXSOGD     AT LEVEL 009 AS OF 07/06/94                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - OCONTROL ACCESS GROUP LEVEL RECORD *         
***********************************************************************         
         SPACE 1                                                                
CXSOGD   DSECT                     AUTHORISATION LEVELS RECORD                  
CXSOGLEN DS    CL4                 AUTHORISATION LEVELS RECORD LENGTH           
CXSOGTYP DS    CL5     R CHAR      AUTHORISATION LEVELS RECORD TYPE             
         DS    C                                                                
CXSOGACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSOGDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSOGTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSOGAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSOGAGC DS    CL8     K CHAR      ACCESS GROUP CODE                            
         DS    C                                                                
CXSOGSYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSOGPGM DS    CL2     K CHAR      PROGRAM CODE                                 
         DS    C                                                                
CXSOGOPT DS    CL2     K CHAR      OPTION CODE                                  
         DS    C                                                                
CXSOGCOD DS    CL1     R CHAR      CONTROL CODE (Y/N)                           
*                                                                               
CXSOGDX  DS    CL2                 RECORD END                                   
CXSOGDL  EQU   *-CXSOGD            RECORD LENGTH                                
