*          DATA SET CXSPUD     AT LEVEL 004 AS OF 08/17/95                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - PERSON USER ID XREF RECORD         *         
***********************************************************************         
         SPACE 1                                                                
CXSPUD   DSECT                     PERSON USER ID XREF RECORD                   
CXSPULEN DS    CL4                 PERSON USER ID XREF RECORD LENGTH            
CXSPUTYP DS    CL5     R CHAR      PERSON USER ID XREF RECORD TYPE              
         DS    C                                                                
CXSPUACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSPUDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSPUTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSPUAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSPUPEN DS    CL6     K INT       PERSON NUMBER                                
         DS    C                                                                
CXSPUUIN DS    CL6     K INT       USER ID NUMBER                               
         DS    C                                                                
CXSPUACV DS    CL1     K INT       ACCESS VALUE (Y/N)                           
*                                                                               
CXSPUDX  DS    CL2                 RECORD END                                   
CXSPUDL  EQU   *-CXSPUD            RECORD LENGTH                                
