*          DATA SET CXSPED     AT LEVEL 003 AS OF 07/06/94                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - PERSON PASSWORD RECORD             *         
***********************************************************************         
         SPACE 1                                                                
CXSPED   DSECT                     PERSON PASSWORD RECORD                       
CXSPELEN DS    CL4                 PERSON PASSWORD RECORD LENGTH                
CXSPETYP DS    CL5     R CHAR      PERSON PASSWORD RECORD TYPE                  
         DS    C                                                                
CXSPEACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSPEDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSPETIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSPEAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSPEPWD DS    CL10    K CHAR      PASSWORD CODE                                
*                                                                               
         DS    C                                                                
CXSPENUM DS    CL6     R INT       PERSON NUMBER                                
         DS    C                                                                
CXSPEPID DS    CL8     R CHAR      PERSON PUBLIC-ID                             
         DS    C                                                                
CXSPEAGC DS    CL8     R CHAR      ACCESS GROUP CODE                            
         DS    C                                                                
CXSPE1RL DS    CL8     R CHAR      1R LEDGER GROUP CODE                         
         DS    C                                                                
CXSPEFNA DS    CL20    R CHAR      PERSON FIRST NAME                            
         DS    C                                                                
CXSPEMNA DS    CL20    O CHAR      PERSON MIDDLE NAME                           
         DS    C                                                                
CXSPELNA DS    CL20    R CHAR      PERSON LAST NAME                             
         DS    C                                                                
CXSPEOFF DS    CL2     R CHAR      PERSON OFFICE CODE                           
         DS    C                                                                
CXSPEDEP DS    CL3     R CHAR      PERSON DEPARTMENT CODE                       
*                                                                               
CXSPEDX  DS    CL2                 RECORD END                                   
CXSPEDL  EQU   *-CXSPED            RECORD LENGTH                                
