*          DATA SET CXSPPD     AT LEVEL 005 AS OF 01/19/96                      
***********************************************************************         
*CONTROL SYSTEM SECURITY EXTRACT - PERSON PROGRAM RECORD              *         
***********************************************************************         
         SPACE 1                                                                
CXSPPD   DSECT                     PERSON PROGRAM RECORD                        
CXSPPLEN DS    CL4                 PERSON PROGRAM RECORD LENGTH                 
CXSPPTYP DS    CL5     R CHAR      PERSON PROGRAM RECORD TYPE                   
         DS    C                                                                
CXSPPACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
CXSPPDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
CXSPPTIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
*                                                                               
         DS    C                                                                
CXSPPAID DS    CL2     K CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
CXSPPNUM DS    CL6     K INT       PERSON NUMBER                                
         DS    C                                                                
CXSPPSYS DS    CL2     K CHAR      SYSTEM CODE                                  
         DS    C                                                                
CXSPPPGM DS    CL2     K CHAR      PROGRAM CODE                                 
*                                                                               
         DS    C                                                                
CXSPPLAC DS    CL16    R CHAR      LIMIT ACCESS CODE                            
         DS    C                                                                
CXSPPAUT DS    CL4     R CHAR      AUTHORISATION CODE                           
         DS    C                                                                
* ??                                                                            
CXSPPACV DS    CL1     R CHAR      ACCESS VALUE (Y/N)                           
* ??                                                                            
*                                                                               
CXSPPDX  DS    CL2                 RECORD END                                   
CXSPPDL  EQU   *-CXSPPD            RECORD LENGTH                                
