*          DATA SET CXSRECIDX  AT LEVEL 007 AS OF 07/06/94                      
***********************************************************************         
* SECURITY EXTRACT RECORD TYPES                                       *         
***********************************************************************         
          SPACE 2                                                               
CXSAGDQ   DC   CL5'00100'                                                       
CXSPEDQ   DC   CL5'00200'                                                       
CXSUIDQ   DC   CL5'00300'                                                       
CXSPPDQ   DC   CL5'00400'                                                       
CXSPUDQ   DC   CL5'00500'                                                       
CXSUPDQ   DC   CL5'00600'                                                       
CXSAADQ   DC   CL5'00700'                                                       
CXSALDQ   DC   CL5'00800'                                                       
CXSFADQ   DC   CL5'00900'                                                       
CXSFGDQ   DC   CL5'00910'                                                       
CXSOADQ   DC   CL5'00920'                                                       
CXSOGDQ   DC   CL5'00930'                                                       
