*          DATA SET DBUPARMSD  AT LEVEL 002 AS OF 12/04/08                      
DBUPARMD DSECT                     PARAMETERS FOR ROUTINE DEBKUPDT              
DBUACOMS DS    AL4                 A(COMFACS)                                   
DBURTYP  DS    X                   TYPE OF CONTROL RECORD TO CREATE             
DBURNETQ EQU   1                   -RECORD FOR NET SQL EXTRACT                  
DBURGENQ EQU   2                   -GENERALIZED CONTROL RECORD                  
DBUEMAIQ EQU   3                   -EMAIL LINE                                  
DBUBOOK  DS    XL2                 BOOK                                         
DBUBKFLG DS    X                   BOOK FLAG                                    
DBUBKMQ  EQU   1                   -MONTHLY BOOK                                
DBUBKWQ  EQU   2                   -WEEKLY BOOK                                 
DBUPSTYP DS    C                   POSTING TYPE                                 
DBUPNETQ EQU   C'N'                -NETWORK (BROADCAST)                         
DBUPSYNQ EQU   C'S'                -SYNDICATION                                 
DBUPCBLQ EQU   C'C'                -CABLE                                       
DBUPHSPQ EQU   C'H'                -HISPANIC                                    
DBUPARML EQU   *-DBUPARMD                                                       
*                                                                               
* MODE EQUATES                                                                  
INITQ    EQU   1                   INITIALIZE                                   
ADDQ     EQU   2                   ADD BOOK ENTRY TO SAVED LIST                 
RELQ     EQU   3                   RELEASE CONTROL RECORDS                      
