*          DATA SET DDACTIVD   AT LEVEL 002 AS OF 12/14/92                      
*              DSECT TO COVER ACTIVITY ELEMENT                                  
         SPACE 1                                                                
ACTVD    DSECT                                                                  
ACTVEL   DS    CL1                 ELEMENT CODE X'F1'                           
ACTVLEN  DS    CL1                 ELEMENT LENGTH (20)                          
ACTVADDT DS    CL3                 DATE ADDED(BINARY)                           
ACTVADID DS    CL2                 ID THAT ADDED RECORD                         
ACTVADFL DS    CL1                 FLAGS FOR ADD X'80'=PASSWORD PROT.           
ACTVCHDT DS    CL3                 DATE LAST CHANGE (BINARY)                    
ACTVCHID DS    CL2                 ID THAT MADE LAST CHANGE                     
ACTVCHFL DS    CL1                 FLAGS FOR LAST CHANGE                        
ACTVCHNM DS    CL1                 NUMBER OF LAST CHANGE                        
ACTVCHRE DS    CL2                 REASON CODE                                  
ACTVSPAR DS    CL3                 SPARE                                        
ACTVSCID DS    CL8                 NEW SECURITY PERSONAL ID                     
ACTVLENQ EQU   *-ACTVD             NEW LENGTH                                   
