*          DATA SET DDAPOSTW   AT LEVEL 011 AS OF 03/12/82                      
*                                  DDAPOST WORK AREA                            
DDAPOSTW DS    0CL314                                                           
MAPFILE  DS    A                                                                
MAPWRKR  DS    A                                                                
MAPRECUP DS    A                                                                
MAPID    DS    CL16                                                             
MAPPROF  DS    XL16                                                             
MAPMED   DS    CL1                                                              
MAPCLT   DS    CL3                                                              
MAPPRD   DS    CL3                                                              
MAPEST   DS    CL3                                                              
MAPDATE  DS    CL6                                                              
MAPRECNT DS    PL6                                                              
MAPCASH  DS    PL6                                                              
*                                                                               
MAPAGRS  DS    PL6                 AGY BILLINGS GROSS                           
MAPDGRS  DS    PL6                 DDS BILLINGS GROSS                           
*                                                                               
MAPINV   DS    CL6                                                              
MAPMOS   DS    CL4                                                              
MAPOFF   DS    CL1                                                              
MAPRTAIL DS    X                   RETAIL TYPE - 0=NO,1=CORP,2=DIST             
MAPBPER  DS    CL6                                                              
*                                                                               
RCVACC   DS    CL15                RECEIVABLE ACCT                              
RCVACCN  DS    CL36                                                             
RCVCNTR  DS    CL15                RECEIVABLE CONTRA                            
RCVCNTRN DS    CL36                                                             
*                                                                               
INCACC   DS    CL15                INCOME ACCT                                  
INCACCN  DS    CL36                                                             
INCCNTR  DS    CL15                INCOME CONTRA                                
INCCNTRN DS    CL36                                                             
*                                                                               
