*          DATA SET DDBOXEQU   AT LEVEL 001 AS OF 06/25/79                      
*              EQUATES FOR USING SPECIAL 3800 BOX CHARACTERS                    
         SPACE 3                                                                
TLC      EQU   X'01'               TOP LEFT CORNER                              
TRC      EQU   X'04'               TOP RIGHT CORNER                             
BLC      EQU   X'07'               BOTTOM LEFT CORNER                           
BRC      EQU   X'0A'               BOTTOM RIGHT CORNER                          
LJ       EQU   X'0D'               LEFT JUNCTION                                
RJ       EQU   X'10'               RIGHT JUNCTION                               
TJ       EQU   C'13'               TOP JUNCTION                                 
BT       EQU   C'16'               BOTTOM JUNCTION                              
ISECT    EQU   X'19'               INTERSECTION                                 
HLINE    EQU   X'1C'               HORIZONTAL LINE                              
VLINE    EQU   X'1F'               VERTICAL LINE                                
VBROKEN  EQU   X'22'               VERTICAL BROKEN LINE                         
         SPACE 2                                                                
*                                  ALL ABOVE ARE WEIGHT 1                       
*                                  WEIGHTS 2 AND 3 HAVE VALUES +1 +2            
         SPACE 3                                                                
DDSLOGO1 DC    X'021D25'                                                        
         DC    X'021D25'                                                        
         DC    X'261D27'                                                        
DDSLOG02 DC    X'200020'                                                        
         DC    X'200020'                                                        
         DC    X'280028'                                                        
DDSLOG03 DC    X'200020'                                                        
         DC    X'200020'                                                        
         DC    X'2C002C'                                                        
DDSLOG04 DC    X'081D0B'                                                        
         DC    X'081D0B'                                                        
         DC    X'2A1D2B'                                                        
