*          DATA SET DDCHAIND   AT LEVEL 010 AS OF 12/19/02                      
CHAIND   DSECT                                                                  
CHTRAP   DS    X                   TRAP REQUIRED (Y/N)                          
CHINIT   DS    X                   TRAP INITIALISED (Y/N/F)                     
CHHIT    DS    X                   TRAP SPRUNG (Y/N)                            
         DS    X                                                                
CHAWRK   DS    F                   A(WORK AREA)                                 
CHLWRK   DS    F                   L'WORK AREA                                  
CHCWRK   DS    F                                                                
CHATIA   DS    F                   A(TIA)                                       
CHLTIA   DS    F                   L'TIA                                        
CHCTIA   DS    F                                                                
CHATWA   DS    F                   A(TWA)                                       
CHLTWA   DS    F                   L'TWA                                        
CHCTWA   DS    F                                                                
CHAMAP   DS    F                   A(MAP)                                       
CHLMAP   DS    F                   L'MAP                                        
CHCMAP   DS    F                                                                
CHAPGM   DS    F                   A(PGMS AREA)                                 
CHLPGM   DS    F                   L'PGMS AREA                                  
CHCPGM   DS    F                                                                
CHAUTL   DS    F                   A(UTL)                                       
CHLUTL   DS    F                   L'UTL                                        
CHCUTL   DS    F                                                                
CHDSPMX  DS    F                                                                
CHAINL   EQU   *-CHAIND                                                         
