*          DATA SET DDCNTRL    AT LEVEL 004 AS OF 05/12/93                      
*              DSECT TO COVER CONTROL FILE TABLE                                
         SPACE 1                                                                
CND      DSECT                                                                  
CNLEN    DS    0CL14                                                            
CNAGY    DS    CL2       C         AGENCY ALPHA CODE                            
CNID     DS    CL2       B         ID NUMBER                                    
CNSSE    DS    CL1       B         SPOT SE NUMBER                               
CNSCD    DS    CL1       B         SPOT AGENCY CODE                             
CNPSE    DS    CL1       B         PRINT SE NUMBER                              
CNPCD    DS    CL1       B         PRINT AGENCY CODE                            
         ORG   CNPSE                                                            
CNMSE    DS    CL1       B         MEDLINE SE NUMBER                            
CNMCD    DS    CL1       B         MEDLINE AGENCY CODE                          
CNASE    DS    CL1       B         ACCOUNT SE NUMBER                            
CNACD    DS    CL1       B         ACCOUNT AGENCY CODE                          
CNRSE    DS    CL1       B         REP SE NUMBER                                
CNRCD    DS    CL1       B         REP AGENCY CODE                              
         ORG   CNRSE                                                            
CNESE    DS    CL1       B         PERSON SE NUMBER                             
CNECD    DS    CL1       B         PERSON AGENCY CODE                           
         ORG   CNRSE                                                            
CNLSE    DS    CL1       B         PLANNING SE NUMBER                           
CNLCD    DS    CL1       B         PLANNING AGENCY CODE                         
CNNSE    DS    CL1       B         NETPAK SE NUMBER                             
CNNCD    DS    CL1       B         NETPAK AGENCY CODE                           
