*          DATA SET DDCOMC     AT LEVEL 001 AS OF 09/24/76                      
         TITLE 'PRESET VALUES FOR MICROFICHE CSECT'                             
COMC     CSECT                                                                  
         DC    X'01'               START                                        
         DC    X'02'               PRINT ONLY                                   
         DC    C'B'                BEFORE LOGIC                                 
         DC    X'05'               MAX 5 HEADLINES                              
         DC    5F'0'                                                            
