*          DATA SET DDCOMD     AT LEVEL 001 AS OF 09/24/76                      
*              DSECT TO COVER MICROFICHE CSECT                                  
         SPACE 3                                                                
COMD     DSECT                                                                  
COMSTART DS    CL1       B         1=START 2=END 0=IN PROGRESS                  
COMIO    DS    CL1       B         1=COM 2=PRINT 3=BOTH                         
COMBA    DS    CL1       C         B=BEFORE A=AFTER LOGIC                       
COMNL    DS    CL1       B         N'HEADLINES MIN=1 MAX=5                      
COMDATE  DS    CL4       A         LOCATION OF DATE                             
COMTITLE DS    CL4       A         LOCATION OF TITLE                            
COMDEX   DS    CL4       A         LOCATION OF COLUMN INDEX FIELD               
COMCOL   DS    CL4       A         LOCATION OF COLUMN BREAK FIELD               
COMHED   DS    CL4       A         LOCATION OF FICHE BREAK FIELD                
         EJECT                                                                  
