*          DATA SET DDCPUD     AT LEVEL 001 AS OF 09/18/13                      
         TITLE 'DSECT FOR DDCPUINFO AND CALLER'                                 
CPUD     DSECT                                                                  
CPULANG  DS    AL1                 LANGUAGE USED FOR SMTP                       
CPUID    DS    CL4                 SMCA ID                                      
CPUDSPAC DS    CL1                 DSPACE FOR TST, QA, CSC, ADV, REP            
CPUMQMGR DS    CL8                 DEFAULT MQ MANAGER                           
CPUSMTP  DS    CL8                 DEFAULT SMTP BASED ON LANGUAGE               
CPULNQ   EQU   *-CPUD                                                           
