*          DATA SET DDCPRINT2  AT LEVEL 002 AS OF 11/01/93                      
         SPACE 1                                                                
CPRINT2  CSECT                                                                  
         DC    132C' '                                                          
         DC    CL34'DATE               TIME      '                              
         DC    CL60' '                                                          
         DC    CL19'     PAGE'                                                  
         DC    CL19' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    C'BL01'                                                          
         DC    PL2'75'                                                          
         DC    PL2'60'                                                          
         DC    PL4'1'                                                           
         DC    C'JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC'                          
         DC    CL12' '                                                          
