*          DATA SET DDCPRINTL  AT LEVEL 001 AS OF 02/19/88                      
CPRINT   CSECT                                                                  
         DC    198C' '             PRINT LINE P                                 
*                                                                               
         DC    CL14'DATE '                                                      
         DC    CL05' '                                                          
         DC    CL10'TIME '         HEAD+19                                      
         DC    CL05' '                                                          
         DC    CL60' '             HEAD+34                                      
         DC    CL05' '                                                          
         DC    CL09'PAGE '         HEAD+99                                      
         DC    CL05' '                                                          
         DC    CL19' '             HEAD+113                                     
         DC    CL66' '                                                          
*                                                                               
         DC    198C' '             MID HEADING LINES                            
         DC    198C' '                                                          
         DC    198C' '                                                          
         DC    198C' '                                                          
*                                                                               
         DC    198C' '             SUB HEADING LINES                            
         DC    198C' '                                                          
         DC    198C' '                                                          
*                                                                               
         DC    198C' '             SPACES                                       
*                                                                               
         DC    CL4'BL01'           SPACING                                      
         DC    PL2'75'             LINE COUNT                                   
         DC    PL2'60'             MAX LINES PER PAGE                           
         DC    PL4'1'              PAGE NUMBER                                  
         DC    C'Y'                FIRST TIME FLAG                              
         DC    C' '                BOX LINE REQUIRED                            
*                                                                               
         DC    C'JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC'                          
*                                                                               
         DC    AL1(165)            MAXIMUM NUMBER OF COLS                       
         DC    AL1(002)            COL NUM FOR DATE                             
         DC    AL1(021)            COL NUM FOR TIME                             
         DC    AL1(052)            COL NUM FOR TITLE                            
         DC    AL1(155)            COL NUM FOR PAGE                             
*                                                                               
         DC    CL12' '             RESERVED FOR DATE=YYMMDD OVERRIDE            
         DC    X'60'               CHR FOR UNDERLINE                            
         DC    XL4'00'             DATA DICTIONARY CONTROL                      
         DC    CL7' '              N/D                                          
