*          DATA SET DDCPRINT   AT LEVEL 003 AS OF 04/25/01                      
         SPACE 1                                                                
CPRINT   CSECT                                                                  
         DC    132C' '                                                          
         DC    CL34'DATE               TIME      '                              
         DC    CL60' '                                                          
         DC    CL19'     PAGE'                                                  
         DC    CL19' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    132C' '                                                          
         DC    C'BL01'                                                          
         DC    PL2'75'                                                          
*&&US*&& DC    PL2'58'                                                          
*&&UK*&& DC    PL2'60'                                                          
         DC    PL4'1'                                                           
         DC    C'JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC'                          
         DC    CL12' '                                                          
