*          DATA SET DDCROSSD   AT LEVEL 003 AS OF 02/24/15                      
***********************************************************************         
* DSECT TO COVER CROSSFILE TRACKING INFORMATION                                 
***********************************************************************         
CROSD    DSECT                                                                  
CROSLN   DS    H                   RECORD LENGTH                                
CROSTYP  DS    CL1                 RECORD TYPE                                  
CROSTYPQ EQU   C'X'                . CROSSFILE POSTING INFORMATION              
CROSSUB  DS    CL1                 SUB TYPE (NULL)                              
CROSSUB1 EQU   C'1'                . TYPE 1                                     
         DS    XL4                 SPARE                                        
CROSDSP  DS    CL1                 DATA SPACE                                   
         DS    XL3                 SPARE                                        
CROSYSN  DS    XL1                 SYSTEM                                       
CROSYSA  DS    CL1                 SYSTEM ALPHA                                 
CROSPGM  DS    CL2                 PROGRAM                                      
CROSUID  DS    XL2                 COMPANY USER ID                              
CROSSAGY DS    CL2                 SECURITY AGENCY                              
CROSPID  DS    XL2                 PERSON IDENTIFICATION CODE                   
CROSAAGY DS    CL2                 ACCOUNTING AGENCY                            
CROSMAGY DS    CL2                 MEDIA AGENCY                                 
CROSASE  DS    XL1                 ACCOUNTING SE NUMBER                         
CROSMSE  DS    XL1                 MEDIA SE NUMBER                              
         DS    XL16                SPARE                                        
CROSOFF  DS    CL2                 OFFICE                                       
CROSMED  DS    CL1                 MEDIA CODE                                   
CROSCLI  DS    CL5                 CLIENT CODE                                  
CROSPRD  DS    CL5                 PRODUCT CODE                                 
CROSDATE DS    CL8                 TRANSACTION DATE                             
         DS    XL1                 SPARE                                        
         DS    XL30                SPARE                                        
CROSLNQ EQU    *-CROSD             RECORD LENGTH                                
