*          DATA SET DDCVERPRNT AT LEVEL 002 AS OF 03/28/79                      
CPRINT   CSECT                                                                  
         DC    H'2'                                                             
         DS    CL2                                                              
         DC    CL132' '                                                         
         DC    CL132' '                                                         
         DC    CL80' '                                                          
         DC    CL60' '                                                          
         DC    CL10' '                                                          
         DC    C'BL01'                                                          
         DC    PL2'1'                                                           
         DC    PL2'60'                                                          
         DC    PL2'0'                                                           
         DC    C' '                                                             
         DC    C'N'                                                             
         DC    X'00'                                                            
         SPACE 1                                                                
