*          DATA SET DDDPOOLLN  AT LEVEL 001 AS OF 03/26/79                      
POOLFORM DSECT      TITLPOOL LINE FORMAT                                        
CAPTEXT  DS    CL58      FIGURE CAPTION TEXT                                    
CAPNUM   DS    CL2       FIGURE NO., PACKED                                     
         ORG   CAPTEXT                                                          
PLTEXT   DS    CL60      HEAD, INDEX, SUPER OR TITLE TEXT                       
PLTYPE   DS    CL1      HEX                                                     
*                      00-09 = HEAD FOR CONTENTS                                
*                        10  = SUPER                                            
*                        20  = TITLE                                            
*                        40  = FIGURE                                           
*                        80  = INDEX ONLY (W/HEADS GR CONTLIM)                  
SRTTXT   DS    CL32      ALL-CAPS TEXT FOR SORTING                              
PLCHPT   DS    CL1       SECTNUM - 1-9, A-H, OR BLANK                           
PLPGNO   DS    CL2       PAGE NO., PACKED                                       
         SPACE 1                                                                
