*          DATA SET DDDPUTXER  AT LEVEL 003 AS OF 10/18/79                      
DPRINT   DSECT                                                                  
P        DS    CL132     USER PRINT LINE - BLANKS AFTER ISSUANCE                
         DS    CL2                                                              
SPACES   DS    CL132     PRESET TO SPACES                                       
LINE     DS    CL2       PAGE LINE COUNT - PRESET TO P'0'                       
MAXLINE  DS    CL2       PRESET TO GIVE 54 TEXT LINES PER 'PAGE'                
DISKEND  DS    CL1       PRESET TO X'00' - SET TO X'FF' WHEN TRACKNO            
*                             REACHES TRACKLIM                                  
BOOKNAME DS    CL10                                                             
