*          DATA SET DDEDIPDFRR AT LEVEL 021 AS OF 10/30/15                      
*                                                                               
*  PDF   ERROR MESSAGE CODES, AND THEIR MEANINGS                                
*  CL6:  CODE                                                                   
*  CL24: MEANING                                                                
*                                                                               
PDFMSTAB DS    0D                                                               
*                           123456789012345678901234                            
         DC    C'7001',CL24'INVALID DATA            '                           
         DC    C'7002',CL24'INVALID XML             '                           
         DC    C'CANC',CL24'PDF CANCELED            '                           
         DC    C'REJC',CL24'PDF REJECTED            '                           
         DC    X'FF'                                                            
