*          DATA SET DDEDITSTID AT LEVEL 035 AS OF 07/15/08                      
*                                                                               
* TEST DDS USERIDS                                                              
*  CL10: ALPHA USERID                                                           
*  CL11: FAX NUMBER                                                             
*                                                                               
TSTIDTAB DS    0D                                                               
         DC    CL10'SJRDEIS   ',CL11'12126335418'                               
         DC    CL10'TMNY      ',CL11'16466887035'                               
         DC    CL10'SJRCH     ',CL11'16466886828'                               
         DC    CL10'SJR       ',CL11'16466886828'                               
******** DC    CL10'SJB       ',CL11'12126335015'                               
         DC    CL10'TRC       ',CL11'12126335015'                               
         DC    CL10'TRC1      ',CL11'12126335015'                               
         DC    CL10'DDSB      ',CL11'12126335015'                               
         DC    CL10'EJOR      ',CL11'12126335015'                               
         DC    CL10'REP       ',CL11'12126335015'                               
         DC    CL10'REPDEMO   ',CL11'12126335015'                               
         DC    CL10'RADNY     ',CL11'12126335015'                               
         DC    CL10'KAMNYT    ',CL11'12126335015'                               
         DC    CL10'KCONYT    ',CL11'12126335015'                               
         DC    CL10'KTVNYT    ',CL11'12126335015'                               
         DC    CL10'XYZ       ',CL11'12126335015'                               
         DC    CL10'DDSLA     ',CL11'13105710581'                               
         DC    CL10'DDSSF     ',CL11'14153998844'                               
         DC    CL10'HDTO      ',CL11'14169290779'                               
         DC    CL10'HDSU      ',CL11'14169290779'                               
         DC    CL10'DDSUCAN   ',CL11'14169290779'                               
*4/4/05, ADDED, YYUN, EDITED 12/22/05                                           
         DC    CL10'AFNY      ',CL11'16466886834'                               
         DC    CL10'PHNY      ',CL11'16466886834'                               
*9/22/05, ADDED FOR ITG USERIDS, YYUN                                           
         DC    CL10'DEITSEC   ',CL11'12126335015'                               
         DC    CL10'DEIT      ',CL11'12126335015'                               
         DC    CL10'SPOTM     ',CL11'12126335015'                               
         DC    CL10'NETM      ',CL11'12126335015'                               
         DC    CL10'PRINTM    ',CL11'12126335015'                               
         DC    CL10'SPOTCA    ',CL11'12126335015'                               
         DC    CL10'NETCA     ',CL11'12126335015'                               
         DC    CL10'PRINTCA   ',CL11'12126335015'                               
         DC    CL10'CORPA     ',CL11'12126335015'                               
         DC    CL10'PODIT     ',CL11'12126335015'                               
         DC    CL10'BLUE      ',CL11'12126335015'                               
         DC    CL10'RED       ',CL11'12126335015'                               
         DC    CL10'GOLD      ',CL11'12126335015'                               
         DC    CL10'BLACK     ',CL11'12126335015'                               
         DC    CL10'ITGNY     ',CL11'12126335015'                               
         DC    CL10'FAXESYS   ',CL11'16463284916'                               
         DC    CL10'FAXESYN   ',CL11'16463284913'                               
         DC    CL10'FAXESYT   ',CL11'16463284915'                               
         DC    CL10'FAXESYA   ',CL11'16463284918'                               
         DC    CL10'FAXESYPT  ',CL11'16463284914'                               
         DC    CL10'FAXESYPD  ',CL11'16463284917'                               
         DC    CL10'FAXESYCA  ',CL11'16463284982'                               
         DC    CL10'FAXESYR   ',CL11'16463284985'                               
         DC    CL10'SJRTRA    ',CL11'16463283377'                               
         DC    X'FF'                                                            
*                                                                               
* TEST DDS USERIDS                                                              
*  CL10: ALPHA AGENCY (ONLY FIRST 2 CHARS IS USED)                              
*  CL11: FAX NUMBER                                                             
*                                                                               
TSTAGTAB DS    0D                                                               
         DC    CL10'SJ        ',CL11'16466886828'                               
         DC    CL10'DE        ',CL11'12126335542'                               
         DC    CL10'GB        ',CL11'12126335542'                               
         DC    CL10'SG        ',CL11'12126335542'                               
         DC    CL10'SF        ',CL11'12126335542'                               
         DC    CL10'GV        ',CL11'12126335542'                               
         DC    CL10'SY        ',CL11'12126335542'                               
         DC    CL10'NR        ',CL11'12126335542'                               
         DC    CL10'NM        ',CL11'12126335542'                               
         DC    CL10'SV        ',CL11'12126335542'                               
         DC    CL10'PD        ',CL11'12126335542'                               
         DC    CL10'MP        ',CL11'12126335542'                               
         DC    CL10'PM        ',CL11'12126335542'                               
         DC    CL10'GR        ',CL11'12126335542'                               
         DC    CL10'SD        ',CL11'12126335542'                               
         DC    CL10'SM        ',CL11'12126335542'                               
         DC    X'FF'                                                            
