*          DATA SET DDEIOSQLD  AT LEVEL 020 AS OF 08/20/96                      
EIOSQLD  DSECT                     ESS MESSAGE DATA EXTRACT BLOCK               
*                                    FOR SQL EXTRACT SUB SYSTEM                 
EIOSMID  DS    CL4                                                              
EIOSCON  DS    CL6                                                              
EIOSMAID DS    CL2                                                              
EIOSMSYS DS    XL1                                                              
EIOSSYSC DS    CL1                                                              
EIOSMSUB DS    XL1                                                              
EIOSSUBC DS    CL1                                                              
EIOSMFNM DS    XL2                                                              
EIOSLOAD DS    CL1                                                              
EIOSFLG1 DS    XL1                                                              
EIOSMDSN DS    CL44                                                             
EIOSMVER DS    CL1                                                              
EIOSMLEV DS    CL1                                                              
EIOSCHKP DS    PL8                                                              
EIOSMRNM DS    PL8                                                              
EIOSMBNM DS    PL8                                                              
EIOSMMTO DS    PL8                                                              
EIOSMSKY DS    CL8                                                              
EIOSMSER DS    CL16                                                             
EIOSMDBS DS    CL16                                                             
EIOSMGNM DS    XL2                                                              
EIOSMLOG DS    AL4                                                              
EIOSMLOX DS    AL4                                                              
*                                                                               
EIOSQLDL EQU   *-EIOSQLD           LENGTH OF DSECT                              
