*          DATA SET DDESSFACSC AT LEVEL 038 AS OF 12/22/99                      
*                                                                               
*                                  **** ESSIO FACILITIES CSECT ****             
*                                                                               
VDATAMGR DC    V(DATAMGR)                                                       
VCPRINT  DC    V(CPRINT)                                                        
VPRINT   DC    V(PRINT)                                                         
VPRINTER DC    V(PRINTER)                                                       
VDATCON  DC    V(DATCON)                                                        
VDATTIM  DC    V(DATTIM)                                                        
VHEXOUT  DC    V(HEXOUT)                                                        
VHEXIN   DC    V(HEXIN)                                                         
VNUMVAL  DC    V(NUMVAL)                                                        
VEXSERV  DC    V(EXSERV)                                                        
VDMOD000 DC    V(DMOD000)                                                       
VDADDS   DC    V(DADDS)                                                         
VLOGIO   DC    V(LOGIO)                                                         
VBINSRCH DC    V(BINSRCH)                                                       
VHELLO   DC    V(HELLO)                                                         
VCARDS   DC    V(CARDS)                                                         
VTIMBER  DC    V(TIMBER)                                                        
VDATVAL  DC    V(DATVAL)                                                        
VPERVAL  DC    V(PERVAL)                                                        
VDYNALOC DC    V(DYNALLOC)                                                      
VXSORT   DC    V(XSORT)                                                         
*                                                                               
VEIOSQL  DC    V(EIOSQL)                                                        
VEIOPQR  DC    V(EIOPQR)                                                        
*                                                                               
VMAJORNM DC    A(0)                                                             
*                                                                               
VPRNTER  DC    V(PRNTER)                                                        
VPRNTBL  DC    V(PRNTBL)                                                        
VESSLOG  DC    V(ESSLOG)                                                        
VGETDAY  DC    V(GETDAY)                                                        
VGETRET  DC    V(GETRET)                                                        
VCMLOG   DC    V(CMLOG)                                                         
VCMAPPC  DC    V(CMAPPC)                                                        
VCMINIT  DC    V(CMINIT)                                                        
VCMACCP  DC    V(CMACCP)                                                        
VCMALLC  DC    V(CMALLC)                                                        
VCMRCV   DC    V(CMRCV)                                                         
VCMSEND  DC    V(CMSEND)                                                        
VCMSNF   DC    V(CMSNF)                                                         
VCMSNC   DC    V(CMSNC)                                                         
VCMSNR   DC    V(CMSNR)                                                         
VCMDEAL  DC    V(CMDEAL)                                                        
VCMCFMD  DC    V(CMCFMD)                                                        
VCMCLOS  DC    V(CMCLOS)                                                        
*                                                                               
VESSRQS  DC    V(ESSRQS)                                                        
VVSAMIO  DC    V(VSAMIO)                                                        
VCOMPRES DC    V(COMPRES)                                                       
VCRYPT   DC    V(CRYPT)                                                         
VESSWTO  DC    V(ESSWTO)                                                        
VESSAPPC DC    V(ESSAPPC)                                                       
