*          DATA SET DDFAPARMD  AT LEVEL 001 AS OF 07/28/83                      
* DSECT TO COVER APPLICATION PROGRAM PARAMETER LIST                             
*                                                                               
FAPARMD  DSECT                                                                  
FAPAGYB  DS    0XL1                AGENCY NUMBER/COMPANY CODE                   
FAPINPL  DS    A                   A(INPUT TRANSLATOR INFO)                     
*                                  0-1=TWA DISP OF FIRST FIELD INPUT            
*                                  2-3=TWA DISP OF LAST FIELD INPUT             
*                                  4-5=NUMBER OF FIELDS INPUT                   
FAPATWA  DS    A                   A(TWA)                                       
FAPAFAC  DS    A                   A(SYSTEM FACILITIES LIST)                    
FAPATIA  DS    A                   A(TIA)                                       
FAPACOM  DS    A                   A(COMMON FACILITIES LIST)                    
FAPARML  EQU   *-FAPARMD                                                        
