*          DATA SET DDGLVSPTRF AT LEVEL 004 AS OF 01/07/16                      
GLVTRFD  DSECT                     THID IS FOR SPOT/LINK INTFC ELE              
TRFACT   DS    CL3                 BLD/SUB                                      
TRFROUT  DS    CL3                 3-CHAR RETURN TO ROUTINE                     
TRFSHIP  DS    CL1                                                              
TRFFAX   DS    CL1                                                              
TRFDOALL DS    CL1                                                              
TRFSVKEY DS    CL8                 SEQ/DATE/A-M/CLT FOR 0A7E/0A7F REC           
TRFWHO   DS    CL3                 REQUESTOR INITIALS                           
