*          DATA SET DDGORPKTAB AT LEVEL 015 AS OF 01/29/10                      
*                                                                               
*  LIST OF NON-DDS AGENCIES ON DARE CURRENTLY SENDING TO MO                     
*  THIS TABLE WILL ROUTE ORDERS BACK TO REPPAK BASED ON ROUTING CODE,           
*  THE REP AND CUTOVER DARE ORDER NUMBER                                        
*                                                                               
*  CL5 ROUTING CODE                                                             
*  AL1 L'(REP USERID PREFIX)                                                    
*  CL3 REP USERID PREFIX                                                        
*  CL8 LAST ORDER NUMBER THAT MADE IT TO MEDIAOCEAN                             
*      NOTE: ROUTING CODES NOT IN THIS TABLE WILL BE ROUTED BACK TO             
*            REPPAK FROM LOGIC THAT WILL LOOK AT NODDSTAB AFTER THIS            
*            TABLE                                                              
*                                                                               
GORPKTAB DS    0CL17                                                            
         DC    C'DMVNY',AL1(3),C'ETV',C'00155776'                               
         DC    C'TCMNY',AL1(3),C'ETV',C'00000235'                               
*        DC    C'SJ NY',AL1(3),C'MOU',C'93030000'                               
         DC    C'DMVNY',AL1(3),C'FSS',C'00180582'                               
         DC    C'DSPCH',AL1(3),C'FSS',C'00179164'                               
         DC    C'CE MN',AL1(3),C'FSS',C'93510028'                               
         DC    C'TCMNY',AL1(3),C'FSS',C'00000309'                               
         DC    C'WWOAT',AL1(3),C'FSS',C'00005051'                               
         DC    C'DSTLA',AL1(3),C'FSS',C'00180415'                               
         DC    C'CEALA',AL1(3),C'FSS',C'00000800'                               
         DC    C'MWIMN',AL1(3),C'FSS',C'00002673'                               
         DC    C'HMEMN',AL1(3),C'FSS',C'00091103'                               
         DC    C'DSTCH',AL1(3),C'FSS',C'00180526'                               
         DC    C'TRGDA',AL1(3),C'FSS',C'00083693'                               
         DC    C'CAMDA',AL1(3),C'FSS',C'00010825'                               
         DC    C'TCKCH',AL1(3),C'FSS',C'00000327'                               
         DC    C'CAEMN',AL1(3),C'FSS',C'00002539'                               
         DC    X'FF'                                                            
