*          DATA SET DDGOUNTAB  AT LEVEL 034 AS OF 03/05/13                      
*                                                                               
*  FOR NATIONAL AND LOCAL UNI ORDERS:                                           
*  LIST OF NON-DDS AGENCIES ON DARE CURRENTLY SENDING TO MO                     
*  THIS TABLE WILL ROUTE ORDERS TO REPPAK BASED ON ROUTING CODE,                
*  AND CUTOVER DARE ORDER NUMBER                                                
*                                                                               
*  CL5 ROUTING CODE                                                             
*  CL8 LAST ORDER NUMBER THAT MADE IT TO MEDIAOCEAN                             
*                                                                               
GOUNTAB  DS    0CL13                                                            
         DC    C'SJ AT',C'10260001'                                             
         DC    C'DMVNY',C'00222526'                                             
         DC    C'CAMDA',C'00010001'                                             
         DC    C'TRGDA',C'00232242'                                             
         DC    C'DGPCH',C'00254737'                                             
         DC    C'DSTCH',C'00206148'                                             
         DC    C'CAEMN',C'00006408'                                             
         DC    C'CE MN',C'93500001'                                             
         DC    C'HMEMN',C'00163871'                                             
         DC    C'CEALA',C'00001228'                                             
         DC    C'DSTLA',C'00222833'                                             
*                                     ADDED JUN21/11                            
         DC    C'DINAT',C'00000000'  MEDIABANK INITIATIVE NEVER SENT            
         DC    C'DINCH',C'00000000'     TO MEDIAOCEAN                           
         DC    C'DINLA',C'00000000'                                             
         DC    C'DINNY',C'00000000'                                             
         DC    C'DINPH',C'00000000'                                             
         DC    C'DINSD',C'00000000'                                             
*                                     ADDED JUN21/11                            
         DC    C'DUMAT',C'00000000'  MEDIABANK UNIV MCCANN NEVER SENT           
         DC    C'DUMCH',C'00000000'     TO MEDIAOCEAN                           
         DC    C'DUMDA',C'00000000'                                             
         DC    C'DUMDE',C'00000000'                                             
         DC    C'DUMLA',C'00000000'                                             
         DC    C'DUMNY',C'00000000'                                             
         DC    C'DUMSF',C'00000000'                                             
*                                     ADDED DEC06/12                            
         DC    C'MZGNY',C'00000000'  MEDIABANK ZENITH NEVER SENT                
         DC    C'MZDNY',C'00000000'     TO MEDIAOCEAN                           
         DC    C'MZMAT',C'00000000'                                             
         DC    C'MZMCH',C'00000000'                                             
         DC    C'MZMDN',C'00000000'                                             
         DC    C'MZMLA',C'00000000'                                             
         DC    C'MZMNY',C'00000000'                                             
         DC    C'MZMPO',C'00000000'                                             
         DC    C'MOPNY',C'00000000'  MEDIABANK OPTIMEDIA                        
         DC    C'MOPSE',C'00000000'                                             
*                                     ADDED MAR05/13                            
         DC    C'MBPDA',C'00000000'  MEDIABANK BRAND PROGRAMMING NTWK           
         DC    C'MBPDE',C'00000000'                                             
         DC    C'MBPNY',C'00000000'                                             
         DC    C'MBPSF',C'00000000'                                             
         DC    X'FF'                                                            
*                                                                               
* LIST OF UV LOCAL MARKET RECEIVER IDS                                          
*                                                                               
UNILCTAB DS    0CL11                                                            
         DC    C'YYCF      ',AL1(4)                                             
         DC    C'KSTR      ',AL1(4)                                             
         DC    C'KUVN      ',AL1(4)                                             
         DC    X'FF'                                                            
