*          DATA SET DDGOWOTAB  AT LEVEL 029 AS OF 06/21/11                      
*                                                                               
*  FOR NATIONAL AND LOCAL NBC ORDERS:                                           
*  LIST OF NON-DDS AGENCIES ON DARE CURRENTLY SENDING TO MO                     
*  THIS TABLE WILL ROUTE ORDERS TO WIDE ORBIT BASED ON ROUTING CODE,            
*  AND CUTOVER DARE ORDER NUMBER                                                
*                                                                               
*  CL5 ROUTING CODE                                                             
*  CL8 LAST ORDER NUMBER THAT MADE IT TO MEDIAOCEAN                             
*                                                                               
GOWOTAB  DS    0CL13                                                            
         DC    C'MMNNY',C'00028592'                                             
         DC    C'DMVNY',C'00186947'                                             
         DC    C'DSPCH',C'00183992'                                             
         DC    C'CE MN',C'93520003'                                             
         DC    C'TCMNY',C'00000275'                                             
         DC    C'WWOAT',C'00006319'                                             
         DC    C'DSTLA',C'00185892'                                             
         DC    C'CEALA',C'00000837'                                             
         DC    C'MWIMN',C'00002663'                                             
         DC    C'HMEMN',C'00097903'                                             
         DC    C'DSTCH',C'00186859'                                             
         DC    C'TRGDA',C'00098095'                                             
         DC    C'CAMDA',C'00011804'                                             
         DC    C'TCKCH',C'00000472'                                             
         DC    C'CAEMN',C'00003694'                                             
*                                     ADDED JUN21/11                            
         DC    C'DINAT',C'00000000'  MEDIABANK INITIATIVE NEVER SENT            
         DC    C'DINCH',C'00000000'     TO MEDIAOCEAN                           
         DC    C'DINLA',C'00000000'                                             
         DC    C'DINNY',C'00000000'                                             
         DC    C'DINPH',C'00000000'                                             
         DC    C'DINSD',C'00000000'                                             
*                                     ADDED JUN21/11                            
         DC    C'DUMAT',C'00000000'  MEDIABANK UNIV MCCANN NEVER SENT           
         DC    C'DUMCH',C'00000000'     TO MEDIAOCEAN                           
         DC    C'DUMDA',C'00000000'                                             
         DC    C'DUMDE',C'00000000'                                             
         DC    C'DUMLA',C'00000000'                                             
         DC    C'DUMNY',C'00000000'                                             
         DC    C'DUMSF',C'00000000'                                             
         DC    X'FF'                                                            
*                                                                               
* LIST OF NBC LOCAL MARKET RECEIVER IDS                                         
*                                                                               
NBCLCTAB DS    0CL11                                                            
         DC    C'ECAU      ',AL1(4)                                             
         DC    C'EMAQ      ',AL1(4)                                             
         DC    C'ENBC      ',AL1(4)                                             
         DC    C'ERC       ',AL1(3)                                             
         DC    C'ETVJ      ',AL1(4)                                             
         DC    C'EVIT      ',AL1(4)                                             
         DC    C'HNBC      ',AL1(4)                                             
         DC    C'KNBC      ',AL1(4)                                             
         DC    C'KNSD      ',AL1(4)                                             
         DC    C'KNTV      ',AL1(4)                                             
         DC    C'KXAS      ',AL1(4)                                             
         DC    C'NNBC      ',AL1(4)                                             
         DC    C'NNSD      ',AL1(4)                                             
         DC    C'NNTV      ',AL1(4)                                             
         DC    C'NXAS      ',AL1(4)                                             
         DC    C'QNBC      ',AL1(4)                                             
         DC    C'WCAU      ',AL1(4)                                             
         DC    C'WMAQ      ',AL1(4)                                             
         DC    C'WNBC      ',AL1(4)                                             
         DC    C'WRC       ',AL1(3)                                             
         DC    C'WTVJ      ',AL1(4)                                             
         DC    C'WVIT      ',AL1(4)                                             
         DC    X'FF'                                                            
