*          DATA SET DDHEXIND   AT LEVEL 001 AS OF 10/12/73                      
*                        PARAMETER LIST FOR CSECT HEXIN                         
HEXIND   DSECT                                                                  
HIAS     DS    F         A(SOURCE)                                              
HIAD     DS    F         A(DESTN)                                               
HILS     DS    F         L'SOURCE                                               
HILD     DS    F         L'DESTN                                                
