*          DATA SET DDINDEXD   AT LEVEL 001 AS OF 09/21/84                      
*              DSECT TO COVER INDEX ELEMENT                                     
         SPACE 1                                                                
INDXD    DSECT                                                                  
INDXEL   DS    CL1                 ELEMENT CODE X'F5'                           
INDXLEN  DS    CL1                 ELEMENT LENGTH (255)                         
         DS    CL2                 SPARE                                        
INDXLIST DS    CL251               LIST OF LINE NUMBERS                         
*                                  ACTIVE NUMBERS DELIMITED BY X'00'            
*                                  THEN LIST OF UNUSED NUMBERS                  
