*          DATA SET DDMOREPTAB AT LEVEL 118 AS OF 08/22/11                      
*  MEDIA OCEAN REP/STATION CUTOFF SUPPORT TABLE                                 
*                                                                               
*                                                                               
*** IF YOU CHANGE MOREPTAB MUST RELINK!!!!                                      
* - SPOMS09                                                                     
* - SRDAR00                                                                     
* - SRDAR01                                                                     
* - SPBUY31                                                                     
*                                                                               
*** IF YOU CHANGE MOSTATAB MUST RELINK!!!!                                      
* - SPOMS09                                                                     
*                                                                               
MOREPTAB DS    0C                  MEDIA OCEAN REP SUPPORT CUTOFF TABLE         
*                                                                               
* THIS REP IS FOR TESTING PURPOSES ONLY!!                                       
*                                                                               
MONREP   DC    AL1(MONREPX-*+1,MONREPA-*-1),C'MON'                              
MONREPA  DC    C'NY',X'104303'  OCT30/04                                        
MONREPX  DC    X'00'                                                            
*                                                                               
* THESE REPS ARE REAL!!                                                         
*                                                                               
NBCREP   DC    AL1(NBCREPX-*+1,NBCREPA-*-1),C'NBC'                              
NBCREPA  DC    0C                                                               
         DC    C'DE',X'103086'  MAR27/03                                        
         DC    C'BO',X'103154'  JUN03/03                                        
         DC    C'AT',X'103157'  JUN06/03                                        
         DC    C'PH',X'103164'  JUN13/03                                        
         DC    C'SF',X'103170'  JUN19/03                                        
         DC    C'DA',X'103183'  JUL02/03                                        
         DC    C'CH',X'103192'  JUL11/03                                        
         DC    C'MN',X'103204'  JUL23/03                                        
         DC    C'LA',X'103212'  JUL31/03                                        
         DC    C'NY',X'103217'  AUG05/03                                        
         DC    C'WA',X'105136'  MAY16/05                                        
*&&DO                                                                           
         DC    C'MI',X'104326'  NOV22/04                                        
*&&                                                                             
NBCREPX  DC    X'00'                                                            
*                                                                               
MOREPX   DC    X'FF'                                                            
*                                                                               
* THESE STATIONS DO NOT SUPPORT OOW ROTATOR ESTIMATE!!                          
*                                                                               
MOSTATAB DS    0CL6                                                             
* NBC REP'D STATIONS                                                            
         DC    AL1(5),C'KNBC '      KNBCT                                       
         DC    AL1(5),C'KNSD '      KNSDT                                       
         DC    AL1(5),C'KNTV '      KNTVT                                       
         DC    AL1(5),C'KXAS '      KXAST                                       
         DC    AL1(5),C'WCAU '      WCAUT                                       
*        DC    AL1(5),C'WCMH '      WCMHT - TAKEN OVER BY MMT 6/26              
*        DC    AL1(5),C'WJAR '      WJART - TAKEN OVER BY HRP 6/26              
         DC    AL1(5),C'WMAQ '      WMAQT                                       
         DC    AL1(5),C'WNBC '      WNBCT                                       
*        DC    AL1(5),C'WNCN '      WNCNT - TAKEN OVER BY MMT 6/26              
         DC    AL1(5),C'WRC  '      WRC T                                       
         DC    AL1(5),C'WTVJ '      WTVJT                                       
         DC    AL1(5),C'WVIT '      WVITT                                       
*        DC    AL1(5),C'WVTM '      WVTMT - TAKEN OVER BY HRP 6/26              
         DC    AL1(5),C'QATT '      QATTT - DDS TEST STATION                    
*                                                                               
* ABC REP'D STATIONS                                                            
         DC    AL1(5),C'KABC '      KABCT                                       
         DC    AL1(5),C'KFSN '      KFSNT                                       
         DC    AL1(5),C'KGO  '      KGO T                                       
         DC    AL1(5),C'KTRK '      KTRKT                                       
         DC    AL1(5),C'WABC '      WABCT                                       
         DC    AL1(5),C'WJRT '      WJRTT                                       
         DC    AL1(5),C'WLS  '      WLS T                                       
         DC    AL1(5),C'WPVI '      WPVIT                                       
         DC    AL1(5),C'WTVD '      WTVDT                                       
         DC    AL1(5),C'WTVG '      WTVGT                                       
         DC    AL1(5),C'WTVG '      WTVGT                                       
         DC    AL1(5),C'SWNB '      SWNBT - DDS TEST STATION                    
*                                                                               
* UNIVISION STATIONS                                                            
         DC    AL1(5),C'KUVN '      KUVNT                                       
         DC    AL1(5),C'KSTR '      KSTRT                                       
         DC    X'FF'                                                            
***********************************************************************         
* REPPAK BY REP-OFFICE/DATE                                                     
***********************************************************************         
MORODTAB DS    0C                                                               
ROBCH    DC    X'111026',AL1(ROBCHA-*-1),C'ROBCH'  FOR JAN26/11                 
ROBCHA   DS    0X                                                               
*                                                                               
UNNY     DC    X'111031',AL1(UNNYA-*-1),C'UNNY'    FOR JAN31/11                 
UNNYA    DS    0X                                                               
*                                                                               
UNDA     DC    X'111039',AL1(UNDAA-*-1),C'UNDA'    FOR FEB08/11                 
UNDAA    DS    0X                                                               
*                                                                               
UNAT     DC    X'111039',AL1(UNATA-*-1),C'UNAT'        FEB08/11                 
UNATA    DS    0X                                                               
*                                                                               
UNMI     DC    X'111045',AL1(UNMIA-*-1),C'UNMI'    FOR FEB14/11                 
UNMIA    DS    0X                                                               
*                                                                               
UNSA     DC    X'111045',AL1(UNSAA-*-1),C'UNSA'        FEB14/11                 
UNSAA    DS    0X                                                               
*                                                                               
UNSF     DC    X'111059',AL1(UNSFA-*-1),C'UNSF'    FOR FEB28/11                 
UNSFA    DS    0X                                                               
*                                                                               
UNCH     DC    X'111066',AL1(UNCHA-*-1),C'UNCH'    FOR MAR07/11                 
UNCHA    DS    0X                                                               
*                                                                               
UNDE     DC    X'111066',AL1(UNDEA-*-1),C'UNDE'    FOR MAR07/11                 
UNDEA    DS    0X                                                               
*                                                                               
UNLA     DC    X'111073',AL1(UNLAA-*-1),C'UNLA'    FOR MAR14/11                 
UNLAA    DS    0X                                                               
*                                                                               
UNTT     DC    X'111234',AL1(UNTTA-*-1),C'UNTT'    FOR AUG22/11                 
UNTTA    DS    0X                                                               
*                                                                               
         DC    X'FF'               E-O-T  FOR MORODTAB                          
***************                                                                 
* LOCAL STATIONS FOR UNIVISION ROLLBACK                                         
***************                                                                 
MOUNLTAB DS    0C                                                               
* LIST OF LOCAL STATIONS                                                        
YYCFALL  DC    X'111026',AL1(YYCFALLA-*-1),C'YYCF ' FOR JAN26/11                
YYCFALLA DS    0X                                                               
*                                                                               
         DC    X'FF'               E-O-T  FOR MOUNLTAB                          
***********************************************************************         
* WIDEORBIT BY REP/DATE                                                         
***********************************************************************         
WORPDTAB DS    0C                                                               
MONALL   DC    X'110068',AL1(MONALLA-*-1),C'MON' FOR MAR09/10                   
MONALLA  DS    0X                                                               
* LIST OF LOCAL STATIONS                                                        
YYALALL  DC    X'110068',AL1(YYALALLA-*-1),C'YYAL ' FOR MAR09/10                
YYALALLA DS    0X                                                               
************                                                                    
NBCALL   DC    X'110072',AL1(NBCALLA-*-1),C'NBC' FOR MAR13/10                   
NBCALLA  DS    0X                                                               
* LIST OF LOCAL STATIONS                                                        
ECAUALL  DC    X'110072',AL1(ECAUALLA-*-1),C'ECAU ' FOR MAR13/10                
ECAUALLA DS    0X                                                               
EMAQALL  DC    X'110072',AL1(EMAQALLA-*-1),C'EMAQ ' FOR MAR13/10                
EMAQALLA DS    0X                                                               
ENBCALL  DC    X'110072',AL1(ENBCALLA-*-1),C'ENBC ' FOR MAR13/10                
ENBCALLA DS    0X                                                               
ETVJALL  DC    X'110072',AL1(ETVJALLA-*-1),C'ETVJ ' FOR MAR13/10                
ETVJALLA DS    0X                                                               
EVITALL  DC    X'110072',AL1(EVITALLA-*-1),C'EVIT ' FOR MAR13/10                
EVITALLA DS    0X                                                               
HNBCALL  DC    X'110072',AL1(HNBCALLA-*-1),C'HNBC ' FOR MAR13/10                
HNBCALLA DS    0X                                                               
KNBCALL  DC    X'110072',AL1(KNBCALLA-*-1),C'KNBC ' FOR MAR13/10                
KNBCALLA DS    0X                                                               
KNSDALL  DC    X'110072',AL1(KNSDALLA-*-1),C'KNSD ' FOR MAR13/10                
KNSDALLA DS    0X                                                               
KNTVALL  DC    X'110072',AL1(KNTVALLA-*-1),C'KNTV ' FOR MAR13/10                
KNTVALLA DS    0X                                                               
KXASALL  DC    X'110072',AL1(KXASALLA-*-1),C'KXAS ' FOR MAR13/10                
KXASALLA DS    0X                                                               
NNBCALL  DC    X'110072',AL1(NNBCALLA-*-1),C'NNBC ' FOR MAR13/10                
NNBCALLA DS    0X                                                               
NNSDALL  DC    X'110072',AL1(NNSDALLA-*-1),C'NNSD ' FOR MAR13/10                
NNSDALLA DS    0X                                                               
NNTVALL  DC    X'110072',AL1(NNTVALLA-*-1),C'NNTV ' FOR MAR13/10                
NNTVALLA DS    0X                                                               
NXASALL  DC    X'110072',AL1(NXASALLA-*-1),C'NXAS ' FOR MAR13/10                
NXASALLA DS    0X                                                               
QNBCALL  DC    X'110072',AL1(QNBCALLA-*-1),C'QNBC ' FOR MAR13/10                
QNBCALLA DS    0X                                                               
WCAUALL  DC    X'110072',AL1(WCAUALLA-*-1),C'WCAU ' FOR MAR13/10                
WCAUALLA DS    0X                                                               
WMAQALL  DC    X'110072',AL1(WMAQALLA-*-1),C'WMAQ ' FOR MAR13/10                
WMAQALLA DS    0X                                                               
WNBCALL  DC    X'110072',AL1(WNBCALLA-*-1),C'WNBC ' FOR MAR13/10                
WNBCALLA DS    0X                                                               
WTVJALL  DC    X'110072',AL1(WTVJALLA-*-1),C'WTVJ ' FOR MAR13/10                
WTVJALLA DS    0X                                                               
WVITALL  DC    X'110072',AL1(WVITALLA-*-1),C'WVIT ' FOR MAR13/10                
WVITALLA DS    0X                                                               
ERCALL   DC    X'110072',AL1(ERCALLA-*-1),C'ERC ' FOR MAR13/10                  
ERCALLA  DS    0X                                                               
WRCALL   DC    X'110072',AL1(WRCALLA-*-1),C'WRC ' FOR MAR13/10                  
WRCALLA  DS    0X                                                               
************                                                                    
         DC    X'FF'               E-O-T  FOR WORPDTAB                          
**********************************************************************          
* TABLE FOR REP-OFFICE/STATION AND DATES (DATES ARE IN PWOS)                    
***                                                                             
* USES HEX VALUE (CHAR) TO COMPARE AGAINST ORDER # (DDS AGY ORDERS)             
***                                                                             
* IF THE HEX VALUE IS NULLS THEN STATION IS CONSIDERED CONVERTED AND            
*     ALL ORDERS WILL GO TO THE -MO ID                                          
***                                                                             
* FINALLY REMOVE THE ENTRY OF THE REP IF THE ENTIRE REP IS MO SO WE DO          
*     NOT NEED THE -MO ID ANY LONGER                                            
*****                                                                           
* NEEDS TO BE RELINKED IF TABLE CHANGES:                                        
*    SPLNK16,SPBUY31,DDDARERAP,DDDARERMQ,SRDAR00,SRDAR01                        
*****                                                                           
* 1ST DATE - WHEN REP-OFFICE/STATION GETS THE -MO                               
*  -  IF X'000000' THEN STATION CONSIDERED CONVERTED & ALL ORDERS               
*       WILL GO TO THE -MO ID (SHOULD HAVE A NULL 2ND DATE)                     
* 2ND DATE - WHEN REP-OFFICE/STATION WANT OUT OF -MO                            
*  -  IF X'000000' THEN THERE IS NO END DATE                                    
* 3RD DATE - WHEN REP-OFFICE/STATION WANTS TO BE BACK ON -MO                    
*  -  IF X'FFFFFF' THEN THERE IS NO PLANS TO PUT THEM BACK ON                   
**********************************************************************          
MOOFSTTB DS    0C                                                               
*&&DO                                                                           
ROBCH    DC    AL2(ROBCHX-*+1),AL1(ROBCHA-*-1),C'ROBCH'                         
ROBCHA   DC    C'QAXNT',X'106298',X'107337',X'FFFFFF'                           
         DC    C'QAYNT',X'106307',X'000000',X'FFFFFF'                           
         DC    C'YYADT',X'106298',X'107337',X'FFFFFF'                           
*******  DC    C'QAZNT',X'106307'      **** ROLLBACK TEST ****                  
ROBCHX   DC    X'00'                                                            
*&&                                                                             
KZSDA    DC    AL2(KZSDAX-*+1),AL1(KZSDAA-*-1),C'KZSDA'                         
KZSDAA   DC    C'PJLAT',X'000000',X'000000',X'FFFFFF'                           
         DC    C'PMURT',X'000000',X'000000',X'FFFFFF'                           
KZSDAX   DC    X'00'                                                            
*                                                                               
KZSNY    DC    AL2(KZSNYX-*+1),AL1(KZSNYA-*-1),C'KZSNY'                         
KZSNYA   DC    C'PJLAT',X'000000',X'000000',X'FFFFFF'                           
         DC    C'PMURT',X'000000',X'000000',X'FFFFFF'                           
KZSNYX   DC    X'00'                                                            
*&&DO                                                                           
ETVNY    DC    AL2(ETVNYX-*+1),AL1(ETVNYA-*-1),C'ETVNY'                         
ETVNYA   DC    C'WPTZT',X'107225',X'109262',X'FFFFFF'                           
         DC    C'WREGT',X'107225',X'109262',X'FFFFFF'                           
*  07225 = AUG13/07                                                             
         DC    C'WGALT',X'107225',X'109255',X'FFFFFF'                           
*  07234 = AUG22/07                                                             
         DC    C'NCTAT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'LCNNT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'KMBCT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'MMBCT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'RMBCT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'SMBCT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'DJLAT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'IJLAT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'JJLAT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'LNCHT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'WJLAT',X'107234',X'107347',X'FFFFFF'                           
         DC    C'DLWTT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'ELWTT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'ILWTT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'JLWTT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'WLWTT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'DPBFT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'IPBFT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'JPBFT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'WPBFT',X'107234',X'109255',X'FFFFFF'                           
********                                                                        
* THIS BLOCK WAS CHANGED TO AUG22/07 FROM  AUG27/07                             
********                                                                        
         DC    C'DISNT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'DISNT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'IISNT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'JISNT',X'107234',X'109255',X'FFFFFF'                           
         DC    C'WISNT',X'107234',X'109255',X'FFFFFF'                           
********                                                                        
* THIS BLOCK WAS CHANGED TO AUG22/07 FROM  AUG27/07                             
********                                                                        
*                                                                               
*  07253 = SEP10/07                                                             
         DC    C'KOATT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MOATT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'ROATT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SOATT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WBALT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DBALT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IBALT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JBALT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WCVBT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DCVBT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'ICVBT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JCVBT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WCCBT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'ICCBT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JCCBT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WEWST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IEWST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JEWST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KCCIT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MCCIT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'NCCIT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RCCIT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SCCIT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WXYZT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DXYZT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IXYZT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JXYZT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KHBST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MHBST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RHBST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SHBST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KHOGT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RHOGT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SHOGT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WYFFT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DYFFT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IYFFT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JYFFT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KITVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MITVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RITVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SITVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WAPTT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DAPTT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IAPTT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JAPTT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WLKYT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DLKYT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'ILKYT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JLKYT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WMURT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IMURT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JMURT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WTVFT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DTVFT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'ITVFT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JTVFT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'NTNCT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WDSUT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DDSUT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IDSUT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JDSUT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WTKRT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DTKRT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'ITKRT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JTKRT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KOCOT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MOCOT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'ROCOT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SOCOT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KETVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'METVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RETVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SETVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WESHT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DESHT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IESHT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JESHT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KNXVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MNXVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RNXVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SNXVT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WTAET',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DTAET',X'107253',X'109255',X'FFFFFF'                           
         DC    C'ITAET',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JTAET',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WMTWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DMTWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IMTWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JMTWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KCRAT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MCRAT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RCRAT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SCRAT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KQCAT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MQCAT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RQCAT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SQCAT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KSBWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MSBWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'NSBWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RSBWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SSBWT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WFTST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DFTST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IFTST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JFTST',X'107253',X'109255',X'FFFFFF'                           
         DC    C'KJRHT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'MJRHT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'RJRHT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'SJRHT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'WXIIT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'DXIIT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'IXIIT',X'107253',X'109255',X'FFFFFF'                           
         DC    C'JXIIT',X'107253',X'109255',X'FFFFFF'                           
*  7267 = SEP24/07                                                              
         DC    C'DPTZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IPTZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JPTZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DREGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IREGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JREGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DGALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'EGALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IGALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JGALT',X'107267',X'109255',X'FFFFFF'                           
*  8123 = MAY02/08                                                              
         DC    C'NHBST',X'108123',X'109255',X'FFFFFF'                           
         DC    C'NHOGT',X'108123',X'109255',X'FFFFFF'                           
ETVNYX   DC    X'00'                                                            
***********************************************                                 
* ALL OF ETVAT'S ENTRIES WERE ADDED OF SEP24/07                                 
***********************************************                                 
ETVAT    DC    AL2(ETVATX-*+1),AL1(ETVATA-*-1),C'ETVAT'                         
ETVATA   DC    C'WPTZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DPTZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IPTZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JPTZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WREGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'NCTAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DREGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IREGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JREGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WGALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DGALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'EGALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IGALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JGALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'LCNNT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KMBCT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MMBCT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RMBCT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SMBCT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DJLAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IJLAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JJLAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'LNCHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WJLAT',X'107267',X'107347',X'FFFFFF'                           
         DC    C'DLWTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ELWTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ILWTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JLWTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WLWTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DPBFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IPBFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JPBFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WPBFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DISNT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IISNT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JISNT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WISNT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KOATT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MOATT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ROATT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SOATT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WBALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DBALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IBALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JBALT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WCVBT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DCVBT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ICVBT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JCVBT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WCCBT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ICCBT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JCCBT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WEWST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IEWST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JEWST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KCCIT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MCCIT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'NCCIT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RCCIT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SCCIT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WXYZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DXYZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IXYZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JXYZT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KHBST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MHBST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RHBST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SHBST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KHOGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RHOGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SHOGT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WYFFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DYFFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IYFFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JYFFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KITVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MITVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RITVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SITVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WAPTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DAPTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IAPTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JAPTT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WLKYT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DLKYT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ILKYT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JLKYT',X'107267',X'109255',X'FFFFFF'                           
*                                                                               
         DC    C'WMURT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IMURT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JMURT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WTVFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DTVFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ITVFT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JTVFT',X'107267',X'109255',X'FFFFFF'                           
*                                                                               
         DC    C'NTNCT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WDSUT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DDSUT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IDSUT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JDSUT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WTKRT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DTKRT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ITKRT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JTKRT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KOCOT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MOCOT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ROCOT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SOCOT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KETVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'METVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RETVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SETVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WESHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DESHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IESHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JESHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KNXVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MNXVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RNXVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SNXVT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WTAET',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DTAET',X'107267',X'109255',X'FFFFFF'                           
         DC    C'ITAET',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JTAET',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WMTWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DMTWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IMTWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JMTWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KCRAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MCRAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RCRAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SCRAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KQCAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MQCAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RQCAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SQCAT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KSBWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MSBWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'NSBWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RSBWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SSBWT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WFTST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DFTST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IFTST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JFTST',X'107267',X'109255',X'FFFFFF'                           
         DC    C'KJRHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'MJRHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'RJRHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'SJRHT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'WXIIT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'DXIIT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'IXIIT',X'107267',X'109255',X'FFFFFF'                           
         DC    C'JXIIT',X'107267',X'109255',X'FFFFFF'                           
*  8123 = MAY02/08                                                              
         DC    C'NHBST',X'108123',X'109255',X'FFFFFF'                           
         DC    C'NHOGT',X'108123',X'109255',X'FFFFFF'                           
ETVATX   DC    X'00'                                                            
*&&                                                                             
***************                                                                 
* FOX STATION SALES  CHARLOTTE AND MIAMI          MAY06/09                      
***************                                                                 
FSSCL    DC    AL2(FSSCLX-*+1),AL1(FSSCLA-*-1),C'FSSCL'                         
FSSCLA   DC    C'WAGAT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109126',X'110032',X'FFFFFF'                           
*                                                                               
*                                                 JUN08/09                      
         DC    C'WFXTT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109159',X'110032',X'FFFFFF'                           
FSSCLX   DC    X'00'                                                            
*                                                 MAY06/09                      
FSSMI    DC    AL2(FSSMIX-*+1),AL1(FSSMIA-*-1),C'FSSMI'                         
FSSMIA   DC    C'WAGAT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109126',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109126',X'110032',X'FFFFFF'                           
*                                                                               
*                                                 JUN08/09                      
         DC    C'WFXTT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109159',X'110032',X'FFFFFF'                           
FSSMIX   DC    X'00'                                                            
*                                                                               
***************                                                                 
* FOX STATION SALES PHILADELPHIA AND MINNEAPOLIS  MAY20/09                      
***************                                                                 
FSSPH    DC    AL2(FSSPHX-*+1),AL1(FSSPHA-*-1),C'FSSPH'                         
FSSPHA   DC    C'WAGAT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109140',X'110032',X'FFFFFF'                           
*                                                                               
*                                                 JUN08/09                      
         DC    C'WFXTT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109159',X'110032',X'FFFFFF'                           
FSSPHX   DC    X'00'                                                            
*                                                 MAY20/09                      
FSSMN    DC    AL2(FSSMNX-*+1),AL1(FSSMNA-*-1),C'FSSMN'                         
FSSMNA   DC    C'WAGAT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109140',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109140',X'110032',X'FFFFFF'                           
*                                                                               
*                                                 JUN08/09                      
         DC    C'WFXTT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109159',X'110032',X'FFFFFF'                           
FSSMNX   DC    X'00'                                                            
*                                                                               
***************                                                                 
* FOX STATION SALES  SEATTLE AND DETROIT          JUN03/09                      
***************                                                                 
FSSSE    DC    AL2(FSSSEX-*+1),AL1(FSSSEA-*-1),C'FSSSE'                         
FSSSEA   DC    C'WAGAT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109154',X'110032',X'FFFFFF'                           
*                                                                               
*                                                 JUN08/09                      
         DC    C'WFXTT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109159',X'110032',X'FFFFFF'                           
FSSSEX   DC    X'00'                                                            
*                                                 JUN03/09                      
FSSDE    DC    AL2(FSSDEX-*+1),AL1(FSSDEA-*-1),C'FSSDE'                         
FSSDEA   DC    C'WAGAT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109154',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109154',X'110032',X'FFFFFF'                           
*                                                                               
*                                                 JUN08/09                      
         DC    C'WFXTT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109159',X'110032',X'FFFFFF'                           
FSSDEX   DC    X'00'                                                            
*                                                                               
***************                                                                 
* FOX STATION SALES NEW YORK                      JUN08/09                      
***************                                                                 
FSSNY    DC    AL2(FSSNYX-*+1),AL1(FSSNYA-*-1),C'FSSNY'                         
FSSNYA   DC    C'WAGAT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFXTT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109159',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109159',X'110032',X'FFFFFF'                           
FSSNYX   DC    X'00'                                                            
*                                                                               
***************                                                                 
* FOX STATION SALES BOSTON                        JUN11/09                      
***************                                                                 
FSSBO    DC    AL2(FSSBOX-*+1),AL1(FSSBOA-*-1),C'FSSBO'                         
FSSBOA   DC    C'WAGAT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WFXTT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109162',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109162',X'110032',X'FFFFFF'                           
FSSBOX   DC    X'00'                                                            
*                                                                               
***************                                                                 
* FOX STATION SALES DALLAS                        JUN18/09                      
***************                                                                 
FSSDA    DC    AL2(FSSDAX-*+1),AL1(FSSDAA-*-1),C'FSSDA'                         
FSSDAA   DC    C'WAGAT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WFXTT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109169',X'110032',X'FFFFFF'                           
FSSDAX   DC    X'00'                                                            
*                                                                               
***************                                                                 
* FOX STATION SALES ATLANTA                       JUN18/09                      
***************                                                                 
FSSAT    DC    AL2(FSSATX-*+1),AL1(FSSATA-*-1),C'FSSAT'                         
FSSATA   DC    C'WAGAT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WFXTT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109169',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109169',X'110032',X'FFFFFF'                           
FSSATX   DC    X'00'                                                            
***************                                                                 
* FOX STATION SALES CHICAGO                       JUN25/09                      
***************                                                                 
FSSCH    DC    AL2(FSSCHX-*+1),AL1(FSSCHA-*-1),C'FSSCH'                         
FSSCHA   DC    C'WAGAT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFXTT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109176',X'110032',X'FFFFFF'                           
FSSCHX   DC    X'00'                                                            
***************                                                                 
* FOX STATION SALES LOS ANGELES                   JUN25/09                      
***************                                                                 
FSSLA    DC    AL2(FSSLAX-*+1),AL1(FSSLAA-*-1),C'FSSLA'                         
FSSLAA   DC    C'WAGAT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFXTT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109176',X'110032',X'FFFFFF'                           
FSSLAX   DC    X'00'                                                            
***************                                                                 
* FOX STATION SALES SAN FRAN                      JUN25/09                      
***************                                                                 
FSSSF    DC    AL2(FSSSFX-*+1),AL1(FSSSFA-*-1),C'FSSSF'                         
FSSSFA   DC    C'WAGAT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTVTT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTBCT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WOFLT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WRBWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WOGXT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFXTT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KSAZT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KUTPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WUTBT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WNYWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WWORT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTTVT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KCOPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTTGT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WDCAT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFLDT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WPWRT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WHBQT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WJBKT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KRIVT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KTXHT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KDFWT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KDFIT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WTXFT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'KMSPT',X'109176',X'110032',X'FFFFFF'                           
         DC    C'WFTCT',X'109176',X'110032',X'FFFFFF'                           
FSSSFX   DC    X'00'                                                            
*                                                                               
***************                                                                 
* NON-DARE REPS                                                                 
***************                                                                 
WHOAT    DC    AL2(WHOATX-*+1),AL1(WHOATA-*-1),C'WHOAT'                         
* 107240 = AUG28/07                                                             
WHOATA   DC    C'YYM T',X'107240',X'000000',X'FFFFFF'                           
         DC    C'YYMUT',X'107240',X'000000',X'FFFFFF'                           
WHOATX   DC    X'00'                                                            
*                                                                               
         DC    X'FF'               E-O-T  FOR MOOFSTTB                          
**********************************************************************          
* TABLE FOR REP-OFFICE/STATION AND DATES (DATES ARE IN PWOS)                    
***                                                                             
* USES HEX VALUE (CHAR) TO COMPARE AGAINST ORDER # (DDS AGY ORDERS)             
***                                                                             
* IF THE HEX VALUE IS NULLS THEN STATION IS CONSIDERED CONVERTED AND            
*     ALL ORDERS WILL GO TO THE -WO ID                                          
***                                                                             
* FINALLY REMOVE THE ENTRY OF THE REP IF THE ENTIRE REP IS MO SO WE DO          
*     NOT NEED THE -WO ID ANY LONGER                                            
*****                                                                           
* NEEDS TO BE RELINKED IF TABLE CHANGES:                                        
*    SPLNK16,SPBUY31,DDDARERAP,DDDARERMQ,SRDAR00,SRDAR01                        
*****                                                                           
* 1ST DATE - WHEN REP-OFFICE/STATION GETS THE -WO                               
*  -  IF X'000000' THEN STATION CONSIDERED CONVERTED & ALL ORDERS               
*       WILL GO TO THE -MO ID (SHOULD HAVE A NULL 2ND DATE)                     
* 2ND DATE - WHEN REP-OFFICE/STATION WANT OUT OF -WO                            
*  -  IF X'000000' THEN THERE IS NO END DATE                                    
* 3RD DATE - WHEN REP-OFFICE/STATION WANTS TO BE BACK ON -WO                    
*  -  IF X'FFFFFF' THEN THERE IS NO PLANS TO PUT THEM BACK ON                   
**********************************************************************          
WOOFSTTB DS    0C                                                               
*                                                                               
ETVNYWO  DC    AL2(ETVNYWOX-*+1),AL1(ETVNYWOA-*-1),C'ETVNY'                     
ETVNYWOA DC    C'WBALT',X'110340',X'111068',X'FFFFFF'                           
         DC    C'EBALT',X'110347',X'111068',X'FFFFFF'                           
ETVNYWOX DC    X'00'                                                            
*                                                                               
         DC    X'FF'               E-O-T  FOR WOOFSTTB                          
