*          DATA SET DDMQBMC    AT LEVEL 001 AS OF 10/14/05                      
***********************************************************************         
* DDS MESSAGE QUEUE BROKER                                            *         
* INTERFACE MESSAGE CONSTANTS                                         *         
* MQB MESSAGE HEADER CONSTANTS                                        *         
***********************************************************************         
                                                                                
DDMQBHC_MQB_MID         DC    CL8'*DDSMQB*'   DDS MQB MESSAGE ID                
DDMQBHC_STRUC_ID_1      DC    CL5'00001'      STRUCTURE ID 00001                
DDMQBHC_VERSION_1       DC    CL3'001'        STRUCTURE VERSION 001             
DDMQBHC_PROCESS_DARE    DC    CL8'DARE    '   DARE PROCESS                      
DDMQBHC_PROCESS_SCRWK   DC    CL8'SCRWK   '   SCRIPT WORKER FILE                
DDMQBHC_PROCESS_TRANS   DC    CL8'TRANSACT'   FACPAK TRANSACTION                
DDMQBHC_PROCESS_PQRUP   DC    CL8'PQRUP   '   PQ REPORT UPLOAD                  
DDMQBHC_PROCESS_EXREP   DC    CL8'EXREP   '   EXTERNAL REPORT REQUEST           
                                                                                
***********************************************************************         
* MQB DARE MESSAGE CONSTANTS                                          *         
***********************************************************************         
                                                                                
DDMQBDARE_MSG_CODE_1    DC    CL5'00001'      DARE MESSAGE CODE 00001           
