*          DATA SET DDMQCALLD  AT LEVEL 002 AS OF 02/23/98                      
*                                                                               
* MQ SERIES CALL PARAMETERS                                                     
*                                                                               
MQCALLD                        DSECT                                            
*                                                                               
MQACTION                       DS    CL8                                        
QMGRNAME                       DS    CL48                                       
HCONN                          DS    F                                          
HOBJ                           DS    F                                          
OBJDESC                        CMQODA  LIST=YES                                 
MQOPTIONS                      DS    F                                          
MSGDESC                        CMQMDA  LIST=YES                                 
GETMSGOPTS                     CMQGMOA LIST=YES                                 
PUTMSGOPTS                     CMQPMOA LIST=YES                                 
MQGETECB                       DS    A                                          
MQCOMPCODE                     DS    F                                          
MQREASON                       DS    F                                          
*                                                                               
MQDATALEN                      DS    F                                          
MQBUFFERLEN                    DS    F                                          
AMQBUFFER                      DS    A                                          
*                                                                               
MQCALL_STRUCTURE               DS    CL200                                      
*                                                                               
MQCLQ                          EQU   *-MQCALLD                                  
         EJECT                                                                  
