*          DATA SET DDNODDSTAB AT LEVEL 013 AS OF 03/11/14                      
*                                                                               
*  LIST OF NON-DDS AGENCIES ON DARE                                             
*  WE HAVE SIDENOTES OF AGENCIES THAT NEVER SENT TO MEDIAOCEAN COMMERCE         
* LIST OF ALL ROUTING CODES USING DARE ARE FOUND:                               
*   HTTP://WWW.MEDIAOCEAN.COM/EBUSINESS/                                        
*     ADVERTISING-AGENCIES-THAT-USE-DARE-TO-SEND-ELECTRONIC-ORDERS/             
*                                                                               
NODDSTAB DS    0CL5                                                             
         DC    C'CAEMN'                                                         
         DC    C'DMVNY'                                                         
         DC    C'DSTCH'                                                         
         DC    C'DSPCH'                                                         
         DC    C'DSTLA'                                                         
         DC    C'CE MN'                                                         
         DC    C'HMEMN'                                                         
         DC    C'TCMNY'                                                         
         DC    C'TRGDA'                                                         
         DC    C'MMNNY'                                                         
         DC    C'MWIMN'                                                         
         DC    C'CAMDA'                                                         
         DC    C'TCKCH'              THE CRAMER-KRASSELT COMPANY                
         DC    C'CEALA'              CAMPBELL - EWALD                           
         DC    C'WWOAT'              WESTWOOD ONE                               
         DC    C'HCLMN'              CARMICHAEL LYNCH                           
         DC    C'DGPCH'              STARCOM                                    
*                                      ADDED JUN21/11                           
         DC    C'DINAT'              MEDIABANK INITIATIVE NEVER SENT            
         DC    C'DINCH'                 TO MEDIAOCEAN                           
         DC    C'DINLA'                                                         
         DC    C'DINNY'                                                         
         DC    C'DINPH'                                                         
         DC    C'DINSD'                                                         
*                                     ADDED JUN21/11                            
         DC    C'DUMAT'              MEDIABANK UNIV MCCANN NEVER SENT           
         DC    C'DUMCH'                 TO MEDIAOCEAN                           
         DC    C'DUMDA'                                                         
         DC    C'DUMDE'                                                         
         DC    C'DUMLA'                                                         
         DC    C'DUMNY'                                                         
         DC    C'DUMSF'                                                         
*                                     ADDED DEC26/13                            
         DC    C'MOPNY'              MEDIABANK OPTIMEDIA NEVER SENT             
         DC    C'MOPSE'                 TO MEDIAOCEAN                           
*                                     ADDED DEC26/13                            
         DC    C'DOPIN'                                                         
*                                     ADDED DEC26/13                            
         DC    C'OXGNY'              O|X PGM STAGING                            
*                                     ADDED DEC26/13                            
         DC    C'MZMAT'              MEDIABANK ZENITH MEDIA SVCS NEVER          
         DC    C'MZMCH'                 SENT TO MEDIAOCEAN                      
         DC    C'MZMDN'                                                         
         DC    C'MZMLA'                                                         
         DC    C'MZMNY'                                                         
         DC    C'MZMPO'                                                         
*                                     ADDED MAR11/14                            
         DC    C'MEMCI'              MEDIABANK EMPOWER MEDIA MRKTING            
*                                       NEVER SENT TO MEDIAOCEAN                
         DC    X'FF'                                                            
