*          DATA SET DDPQPROFD  AT LEVEL 001 AS OF 10/15/18                      
PQPROFD  DSECT                                                                  
PQPROFBK DS    CL80                                                             
         ORG   PQPROFBK                                                         
PQPSYS   DS    XL1                 SYSTEM  1 CHARACTER DEFINITION               
PQPPROG  DS    XL2                 PROGRAM 2 CHARACTER DEFINITION               
PQPUSER  DS    XL2                 ORIGIN USER ID NUMBER                        
*                                                                               
PQPRETCL DS    CL1                 PQ RETAIN CLASS                              
PQPFRMCO DS    CL2                 PQ FORM CODE                                 
PQPDESC  DS    CL11                PQ SHORT DESCRIPTION                         
PQPSQLCO DS    CL5                 PQ SQL TRANFORM CODE                         
PQPRPTTY DS    XL1                 PQ REPORT TYPE FLAG                          
PQPRTYCO DS    CL1                 PQ REPORT TYPE                               
PQPARCCO DS    CL1                 PQ ARCHIVE REPORT CLASS                      
PQPARST1 DS    CL1                 PQ ARCHIVE STATUS BYTE#1                     
PQPADTCO DS    XL4                 PQ ARCHIVE DOCUMENT TYPE                     
PQP@DDS  DS    CL1                 PRINT@DDS CODE                               
PQP@BST  DS    CL1                 PQ OUTPUT IS BURSTABLE                       
PQPOUTY  DS    CL6                 NEW OUTPUT TYPE FOR PRINT@DDS                
PQPD@DDS DS    PL3                 DATE@DDS VALUE PACKED                        
*                                                                               
PQPOTYPC DS    CL10                OUTPUT TYPE CODE                             
PQPOPOWC DS    CL4                 OUTPUT POWER CODE                            
PQPOTCPY DS    CL1                 OUTPUT COPIES                                
PQPOTCLS DS    CL1                 OUTPUT CLASS                                 
PQPOTTYP DS    CL1                 OUTPUT TYPE B=BOTH,P=PRINT,Q=DIRECT          
PQPOTFMN DS    X                   NUMBER OF FORMDEFS                           
PQPOTFMD DS    CL6                 FORMDEF= VALUE                               
PQPOTPGN DS    X                   NUMBER OF PAGEDEFS                           
PQPOTPGD DS    CL6                 PAGEDEF= VALUE                               
         ORG                                                                    
