*          DATA SET DDREQHDR   AT LEVEL 002 AS OF 02/23/77                      
*                                  *** REQUEST RECORD HEADER ***                
REQOFFC  DS    CL4       +0        OFFICE CODE                                  
REQOUT   DS    CL6       +4        OUTPUT TYPE                                  
REQNUMB  DS    CL1       +10       REQUEST NUMBER (BINARY)                      
REQDEST  DS    CL2       +11       DESTINATION ID NUMBER                        
REQORIG  DS    CL2       +13       ORIGIN ID NUMBER                             
REQFLAG  DS    CL1       +15       FLAG (X'01'=PROG GEN)                        
REQLINK  DS    CL4       +16       DISK ADDR OF NEXT REQUEST                    
REQDATE  DS    CL6       +20       DATE (C'YYMMDD')                             
