*          DATA SET DDSCRAMTAS AT LEVEL 015 AS OF 04/24/97                      
ASMTAB   DS    0H                                                               
         DC    CL6'PF01  ',AL1(3),CL2'01',AL1(0,0,0) PF01 KEY                   
         DC    CL6'PF02  ',AL1(3),CL2'02',AL1(0,0,0) PF02 KEY                   
         DC    CL6'PF03  ',AL1(3),CL2'03',AL1(0,0,0) PF03 KEY                   
         DC    CL6'PF04  ',AL1(3),CL2'04',AL1(0,0,0) PF04 KEY                   
         DC    CL6'PF05  ',AL1(3),CL2'05',AL1(0,0,0) PF05 KEY                   
         DC    CL6'PF06  ',AL1(3),CL2'06',AL1(0,0,0) PF06 KEY                   
         DC    CL6'PF07  ',AL1(3),CL2'07',AL1(0,0,0) PF07 KEY                   
         DC    CL6'PF08  ',AL1(3),CL2'08',AL1(0,0,0) PF08 KEY                   
         DC    CL6'PF09  ',AL1(3),CL2'09',AL1(0,0,0) PF09 KEY                   
         DC    CL6'PF10  ',AL1(3),CL2'10',AL1(0,0,0) PF10 KEY                   
         DC    CL6'PF11  ',AL1(3),CL2'11',AL1(0,0,0) PF11 KEY                   
         DC    CL6'PF12  ',AL1(3),CL2'12',AL1(0,0,0) PF12 KEY                   
         DC    CL6'PF13  ',AL1(3),CL2'13',AL1(0,0,0) PF13 KEY                   
         DC    CL6'PF14  ',AL1(3),CL2'14',AL1(0,0,0) PF14 KEY                   
         DC    CL6'PF15  ',AL1(3),CL2'15',AL1(0,0,0) PF15 KEY                   
         DC    CL6'PF16  ',AL1(3),CL2'16',AL1(0,0,0) PF16 KEY                   
         DC    CL6'PF17  ',AL1(3),CL2'17',AL1(0,0,0) PF17 KEY                   
         DC    CL6'PF18  ',AL1(3),CL2'18',AL1(0,0,0) PF18 KEY                   
         DC    CL6'PF19  ',AL1(3),CL2'19',AL1(0,0,0) PF19 KEY                   
         DC    CL6'PF20  ',AL1(3),CL2'20',AL1(0,0,0) PF20 KEY                   
         DC    CL6'PF21  ',AL1(3),CL2'21',AL1(0,0,0) PF21 KEY                   
         DC    CL6'PF22  ',AL1(3),CL2'22',AL1(0,0,0) PF22 KEY                   
         DC    CL6'PF24  ',AL1(3),CL2'24',AL1(0,0,0) PF24 KEY                   
         DC    CL6'PF23  ',AL1(3),CL2'23',AL1(0,0,0) PF23 KEY                   
*                                                                               
         DC    CL6'USRS  ',AL1(3),CL2'US',AL1(1),CL1'E',AL1(8)                  
         DC    CL6'SYSS  ',AL1(3),CL2'SS',AL1(1),CL1'E',AL1(7)                  
         DC    CL6'PRGS  ',AL1(3),CL2'PS',AL1(1),CL1'E',AL1(20)                 
         DC    CL6'PWDS  ',AL1(3),CL2'WS',AL1(1),CL1'E',AL1(10)                 
         DC    CL6'USRI  ',AL1(3),CL2'UI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'SYSI  ',AL1(3),CL2'SI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'PRGI  ',AL1(3),CL2'PI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'PWDI  ',AL1(3),CL2'WI',AL1(1),CL1'F',AL1(2)                  
*                                                                               
         DC    CL6'SRV   ',AL1(2),CL2'SR',AL1(1),CL1'X',AL1(2)                  
         DC    CL6'$CTT  ',AL1(3),CL2'C1',AL1(0,0,0)                            
         DC    CL6'CTT  ',AL1(3),CL2'C1',AL1(0,0,0)                            
         DC    CL6'=CTT  ',AL1(3),CL2'C1',AL1(0,0,0)                            
         DC    CL6'$CT   ',AL1(2),CL2'CT',AL1(0,0,0)                            
         DC    CL6'CT   ',AL1(2),CL2'CT',AL1(0,0,0)                            
         DC    CL6'=CT   ',AL1(2),CL2'CT',AL1(0,0,0)                            
         DC    CL6'LBLS  ',AL1(3),CL2'DS',X'81',CL1'L',AL1(2)                   
         DC    CL6'.     ',AL1(0),CL2'DS',X'81',CL1'L',AL1(2)                   
         DC    CL6'LBLT  ',AL1(3),CL2'DF',AL1(1),CL1'L',AL1(2)                  
         DC    CL6'ATBT  ',AL1(3),CL2'DA',AL1(1),CL1'L',AL1(1)                  
         DC    CL6'LBLW  ',AL1(3),CL2'DW',AL1(1),CL1'L',AL1(2)                  
*                                                                               
         DC    CL6'READ  ',AL1(3),CL2'BI',AL1(0,0,0)                            
         DC    CL6'WRITE ',AL1(4),CL2'BO',AL1(0,0,0)                            
         DC    CL6'BACKUP',AL1(5),CL2'BU',AL1(0,0,0)                            
         DC    CL6'TRON  ',AL1(3),CL2'T+',AL1(0,0,0)                            
         DC    CL6'TROFF ',AL1(4),CL2'T-',AL1(0,0,0)                            
         DC    CL6'SCTON ',AL1(4),CL2'+S',AL1(0,0,0)                            
         DC    CL6'SCTOFF',AL1(5),CL2'-S',AL1(0,0,0)                            
*                                                                               
         DC    CL6'FIRST ',AL1(4),CL2'FF',AL1(0,0,0)                            
         DC    CL6'FSTPRO',AL1(5),CL2'FP',AL1(0,0,0)                            
         DC    CL6'FSTUNP',AL1(5),CL2'FU',AL1(0,0,0)                            
         DC    CL6'FST   ',AL1(2),CL2'FF',AL1(0,0,0)                            
         DC    CL6'HOME  ',AL1(3),CL2'FU',AL1(0,0,0)                            
         DC    CL6'NEXT  ',AL1(3),CL2'NF',AL1(0,0,0)                            
         DC    CL6'NXTUNP',AL1(5),CL2'NU',AL1(0,0,0)                            
         DC    CL6'NXTPRO',AL1(5),CL2'NP',AL1(0,0,0)                            
         DC    CL6'NXTIF ',AL1(4),CL2'NI',AL1(0,0,0)                            
         DC    CL6'NXTFF ',AL1(4),CL2'FN',AL1(0,0,0)                            
         DC    CL6'NXT   ',AL1(2),CL2'NF',AL1(0,0,0)                            
         DC    CL6'TAB   ',AL1(2),CL2'NU',AL1(0,0,0)                            
         DC    CL6'NTHPRO',AL1(5),CL2'LP',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'NTHUNP',AL1(5),CL2'LU',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'NTH   ',AL1(2),CL2'LF',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'FLDOFF',AL1(5),CL2'FO',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'TSTLIN',AL1(5),CL2'TL',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'TSTERN',AL1(5),CL2'TN',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'LOCNUM',AL1(5),CL2'LN',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'LOCTXT',AL1(5),CL2'LT',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'LOCDIC',AL1(5),CL2'LD',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'LOCLBL',AL1(5),CL2'LL',AL1(1),CL1'L',AL1(2)                  
         DC    CL6'LOCATB',AL1(5),CL2'LA',AL1(1),CL1'L',AL1(1)                  
         DC    CL6'LOCWRK',AL1(5),CL2'LW',AL1(1),CL1'L',AL1(2)                  
*                                                                               
         DC    CL6'INPIF ',AL1(4),CL2'EF',AL1(0,0,0)                            
         DC    CL6'INPI  ',AL1(3),CL2'EI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'INPS  ',AL1(3),CL2'ES',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'MVSO  ',AL1(3),CL2'OS',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'MVSI  ',AL1(3),CL2'IM',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'MVSW  ',AL1(3),CL2'VW',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'INPW  ',AL1(3),CL2'EW',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'ERASE ',AL1(4),CL2'EE',AL1(0,0,0)                            
*                                                                               
         DC    CL6'OUTOF ',AL1(4),CL2'MF',AL1(0,0,0)                            
         DC    CL6'OUTO  ',AL1(3),CL2'MO',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'OUTS  ',AL1(3),CL2'MS',AL1(1),CL1'P',AL1(2)                  
         DC    CL6'OUTI  ',AL1(3),CL2'MI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'OUTW  ',AL1(3),CL2'MW',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'OUTFW ',AL1(4),CL2'FW',AL1(1),CL1'F',AL1(2)                  
*                                                                               
         DC    CL6'CUROF ',AL1(4),CL2'CF',AL1(0,0,0)                            
         DC    CL6'CURO  ',AL1(3),CL2'CO',AL1(0,0,0)                            
         DC    CL6'CURS  ',AL1(3),CL2'CS',AL1(0,0,0)                            
         DC    CL6'CURI  ',AL1(3),CL2'CI',AL1(0,0,0)                            
         DC    CL6'RESOF ',AL1(4),CL2'RF',AL1(0,0,0)                            
         DC    CL6'RESO  ',AL1(3),CL2'RO',AL1(0,0,0)                            
         DC    CL6'RESS  ',AL1(3),CL2'RS',AL1(0,0,0)                            
         DC    CL6'RESI  ',AL1(3),CL2'RI',AL1(0,0,0)                            
*                                                                               
         DC    CL6'TSTIF ',AL1(4),CL2'TF',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'TSTI  ',AL1(3),CL2'TI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'TSTS  ',AL1(3),CL2'TS',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'TSTERR',AL1(5),CL2'TE',AL1(0,0,0)                            
         DC    CL6'TSTOK ',AL1(4),CL2'TO',AL1(0,0,0)                            
         DC    CL6'TSTHEX',AL1(5),CL2'TH',AL1(1),CL1'X',AL1(2)                  
         DC    CL6'TSTFX ',AL1(4),CL2'FX',AL1(1),CL1'X',AL1(2)                  
         DC    CL6'TSTBIT',AL1(5),CL2'TB',AL1(1),CL1'X',AL1(2)                  
         DC    CL6'TSTCUR',AL1(5),CL2'TC',AL1(0,0,0)                            
         DC    CL6'TSTOFF',AL1(5),CL2'FT',AL1(1),CL1'F',AL1(2)                  
*                                                                               
         DC    CL6'SAVERR',AL1(5),CL2'SE',AL1(0,0,0)                            
         DC    CL6'LOCCUR',AL1(5),CL2'LC',AL1(0,0,0)                            
         DC    CL6'LOCOFF',AL1(5),CL2'LO',AL1(1),CL1'N',AL1(5)                  
*                                                                               
         DC    CL6'EXITEQ',AL1(5),CL2'XE',AL1(0,0,0)                            
         DC    CL6'EXITNE',AL1(5),CL2'XN',AL1(0,0,0)                            
         DC    CL6'EXIT  ',AL1(3),CL2'XX',AL1(0,0,0)                            
         DC    CL6'BR    ',AL1(1),CL2'BR',X'41',CL1'L',AL1(2)                   
         DC    CL6'BE    ',AL1(1),CL2'BE',X'41',CL1'L',AL1(2)                   
         DC    CL6'BNE   ',AL1(2),CL2'BN',X'41',CL1'L',AL1(2)                   
         DC    CL6'BH    ',AL1(1),CL2'BH',X'41',CL1'L',AL1(2)                   
         DC    CL6'BL    ',AL1(1),CL2'BL',X'41',CL1'L',AL1(2)                   
         DC    CL6'BNH   ',AL1(2),CL2'NH',X'41',CL1'L',AL1(2)                   
         DC    CL6'BNL   ',AL1(2),CL2'NL',X'41',CL1'L',AL1(2)                   
         DC    CL6'NOP   ',AL1(2),CL2'NO',AL1(0,0,0)                            
         DC    CL6'ABEND ',AL1(4),CL2'AB',AL1(0,0,0)                            
         DC    CL6'COMMIT',AL1(5),CL2'OK',AL1(0,0,0)                            
*                                                                               
         DC    CL6'SETC  ',AL1(3),CL2'SC',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'INC   ',AL1(2),CL2'IC',AL1(0,0,0)                            
         DC    CL6'DEC   ',AL1(2),CL2'DC',AL1(0,0,0)                            
*                                                                               
         DC    CL6'SAVFP ',AL1(4),CL2'FS',AL1(0,0,0)                            
         DC    CL6'RESFP ',AL1(4),CL2'FR',AL1(0,0,0)                            
*                                                                               
         DC    CL6'FILLO ',AL1(4),CL2'OF',AL1(1),CL1'X',AL1(2)                  
*                                                                               
         DC    CL6'SEP   ',AL1(2),CL2'ST',AL1(1),CL1'X',AL1(2)                  
*                                                                               
         DC    CL6'SETIP ',AL1(4),CL2'SP',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'ADDIP ',AL1(4),CL2'AP',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SUBIP ',AL1(4),CL2'UP',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SETOP ',AL1(4),CL2'SO',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'ADDOP ',AL1(4),CL2'AO',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SUBOP ',AL1(4),CL2'UO',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'ADDTWA',AL1(5),CL2'AD',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SUBTWA',AL1(5),CL2'SU',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SETWP ',AL1(4),CL2'SW',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'ADDWP ',AL1(4),CL2'AW',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SETIRP',AL1(5),CL2'IR',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SETORP',AL1(5),CL2'OR',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SETORL',AL1(5),CL2'OL',AL1(1),CL1'N',AL1(5)                  
*                                                                               
         DC    CL6'MVIO  ',AL1(3),CL2'IO',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'MVWO  ',AL1(3),CL2'WO',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'MVIW  ',AL1(3),CL2'IW',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'CMTIF ',AL1(4),CL2'TF',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'CMTI  ',AL1(3),CL2'TI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'CMTS  ',AL1(3),CL2'TS',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'CMIFF ',AL1(4),CL2'FC',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'CMIF  ',AL1(3),CL2'IF',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'CMIS  ',AL1(3),CL2'IS',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'CMWS  ',AL1(3),CL2'CW',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'CMIP  ',AL1(3),CL2'IP',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'CMWF  ',AL1(3),CL2'WF',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'CMIW  ',AL1(3),CL2'WN',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'ECHO  ',AL1(3),CL2'EC',AL1(1),CL1'N',AL1(5)                  
*                                                                               
         DC    CL6'IAMI  ',AL1(3),CL2'II',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'IAMS  ',AL1(3),CL2'IA',AL1(1),CL1'E',AL1(10)                 
*                                                                               
         DC    CL6'ENTWA ',AL1(4),CL2'ET',AL1(0,0,0)                            
         DC    CL6'ENTER ',AL1(4),CL2'00',AL1(0,0,0)                            
         DC    CL6'END   ',AL1(2),CL2'**',AL1(0,0,0) END OF SCRIPT              
*                                                                               
         DC    CL6'US    ',AL1(1),CL2'US',AL1(1),CL1'E',AL1(8)                  
         DC    CL6'SS    ',AL1(1),CL2'SS',AL1(1),CL1'E',AL1(7)                  
         DC    CL6'PS    ',AL1(1),CL2'PS',AL1(1),CL1'E',AL1(20)                 
         DC    CL6'WS    ',AL1(1),CL2'WS',AL1(1),CL1'E',AL1(10)                 
         DC    CL6'UI    ',AL1(1),CL2'UI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'SI    ',AL1(1),CL2'SI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'PI    ',AL1(1),CL2'PI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'WI    ',AL1(1),CL2'WI',AL1(1),CL1'F',AL1(5)                  
*                                                                               
         DC    CL6'SR    ',AL1(1),CL2'SR',AL1(1),CL1'X',AL1(2)                  
         DC    CL6'CTT   ',AL1(2),CL2'C1',AL1(0,0,0)                            
         DC    CL6'CT    ',AL1(1),CL2'CT',AL1(0,0,0)                            
         DC    CL6'DS    ',AL1(1),CL2'DS',X'81',CL1'L',AL1(2)                   
         DC    CL6'DF    ',AL1(1),CL2'DF',AL1(1),CL1'L',AL1(2)                  
         DC    CL6'DA    ',AL1(1),CL2'DA',AL1(1),CL1'L',AL1(1)                  
         DC    CL6'DW    ',AL1(1),CL2'DW',AL1(1),CL1'L',AL1(2)                  
*                                                                               
         DC    CL6'BI    ',AL1(1),CL2'BI',AL1(0,0,0)                            
         DC    CL6'BO    ',AL1(1),CL2'BO',AL1(0,0,0)                            
*                                                                               
         DC    CL6'FF    ',AL1(1),CL2'FF',AL1(0,0,0)                            
         DC    CL6'FP    ',AL1(1),CL2'FP',AL1(0,0,0)                            
         DC    CL6'FU    ',AL1(1),CL2'FU',AL1(0,0,0)                            
*                                                                               
         DC    CL6'NF    ',AL1(1),CL2'NF',AL1(0,0,0)                            
         DC    CL6'NU    ',AL1(1),CL2'NU',AL1(0,0,0)                            
         DC    CL6'NP    ',AL1(1),CL2'NP',AL1(0,0,0)                            
         DC    CL6'LF    ',AL1(1),CL2'LF',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'FO    ',AL1(1),CL2'FO',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'TL    ',AL1(1),CL2'TL',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'LP    ',AL1(1),CL2'LP',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'LU    ',AL1(1),CL2'LU',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'LN    ',AL1(1),CL2'LN',AL1(1),CL1'N',AL1(3)                  
         DC    CL6'LT    ',AL1(1),CL2'LT',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'LD    ',AL1(1),CL2'LD',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'LL    ',AL1(1),CL2'LL',AL1(1),CL1'L',AL1(2)                  
         DC    CL6'LA    ',AL1(1),CL2'LA',AL1(1),CL1'L',AL1(1)                  
         DC    CL6'LW    ',AL1(1),CL2'LW',AL1(1),CL1'L',AL1(2)                  
         DC    CL6'FN    ',AL1(1),CL2'FN',AL1(0,0,0)                            
*                                                                               
         DC    CL6'EI    ',AL1(1),CL2'EI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'EF    ',AL1(1),CL2'EF',AL1(0,0,0)                            
         DC    CL6'ES    ',AL1(1),CL2'ES',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'OS    ',AL1(1),CL2'OS',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'EE    ',AL1(1),CL2'EE',AL1(0,0,0)                            
         DC    CL6'EW    ',AL1(1),CL2'EW',AL1(1),CL1'F',AL1(2)                  
*                                                                               
         DC    CL6'MO    ',AL1(1),CL2'MO',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'MF    ',AL1(1),CL2'MF',AL1(0,0,0)                            
         DC    CL6'MS    ',AL1(1),CL2'MS',AL1(1),CL1'P',AL1(2)                  
         DC    CL6'MI    ',AL1(1),CL2'MI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'MW    ',AL1(1),CL2'MW',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'FW    ',AL1(1),CL2'FW',AL1(1),CL1'F',AL1(2)                  
*                                                                               
         DC    CL6'CO    ',AL1(3),CL2'CO',AL1(0,0,0)                            
         DC    CL6'CF    ',AL1(3),CL2'CF',AL1(0,0,0)                            
         DC    CL6'CS    ',AL1(3),CL2'CS',AL1(0,0,0)                            
         DC    CL6'CI    ',AL1(3),CL2'CI',AL1(0,0,0)                            
         DC    CL6'RO    ',AL1(3),CL2'RO',AL1(0,0,0)                            
         DC    CL6'RF    ',AL1(3),CL2'RF',AL1(0,0,0)                            
         DC    CL6'RS    ',AL1(3),CL2'RS',AL1(0,0,0)                            
         DC    CL6'RI    ',AL1(3),CL2'RI',AL1(0,0,0)                            
*                                                                               
         DC    CL6'XX    ',AL1(1),CL2'XX',AL1(0,0,0)                            
         DC    CL6'XE    ',AL1(1),CL2'XE',AL1(0,0,0)                            
         DC    CL6'XN    ',AL1(1),CL2'XN',AL1(0,0,0)                            
         DC    CL6'BR    ',AL1(1),CL2'BR',X'41',CL1'L',AL1(2)                   
         DC    CL6'BE    ',AL1(1),CL2'BE',X'41',CL1'L',AL1(2)                   
         DC    CL6'BN    ',AL1(1),CL2'BN',X'41',CL1'L',AL1(2)                   
         DC    CL6'NO    ',AL1(1),CL2'NO',AL1(0,0,0)                            
         DC    CL6'AB    ',AL1(1),CL2'AB',AL1(0,0,0)                            
         DC    CL6'OK    ',AL1(1),CL2'OK',AL1(0,0,0)                            
*                                                                               
         DC    CL6'CO    ',AL1(1),CL2'CO',AL1(0,0,0)                            
         DC    CL6'CF    ',AL1(1),CL2'CF',AL1(0,0,0)                            
         DC    CL6'CS    ',AL1(1),CL2'CS',AL1(0,0,0)                            
         DC    CL6'CI    ',AL1(1),CL2'CI',AL1(0,0,0)                            
         DC    CL6'RO    ',AL1(1),CL2'RO',AL1(0,0,0)                            
         DC    CL6'RF    ',AL1(1),CL2'RF',AL1(0,0,0)                            
         DC    CL6'RS    ',AL1(1),CL2'RS',AL1(0,0,0)                            
         DC    CL6'RI    ',AL1(1),CL2'RI',AL1(0,0,0)                            
*                                                                               
         DC    CL6'TI    ',AL1(1),CL2'TI',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'TF    ',AL1(1),CL2'TF',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'TS    ',AL1(1),CL2'TS',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'TE    ',AL1(1),CL2'TE',AL1(0,0,0)                            
         DC    CL6'TC    ',AL1(1),CL2'TC',AL1(0,0,0)                            
         DC    CL6'TO    ',AL1(1),CL2'TO',AL1(0,0,0)                            
         DC    CL6'TH    ',AL1(1),CL2'TH',AL1(1),CL1'X',AL1(2)                  
         DC    CL6'FX    ',AL1(1),CL2'FX',AL1(1),CL1'X',AL1(2)                  
         DC    CL6'TB    ',AL1(1),CL2'TB',AL1(1),CL1'X',AL1(2)                  
         DC    CL6'FT    ',AL1(1),CL2'FT',AL1(1),CL1'F',AL1(2)                  
*                                                                               
         DC    CL6'SE    ',AL1(1),CL2'SE',AL1(0,0,0)                            
         DC    CL6'LC    ',AL1(1),CL2'LC',AL1(0,0,0)                            
         DC    CL6'LO    ',AL1(1),CL2'LO',AL1(1),CL1'N',AL1(5)                  
*                                                                               
         DC    CL6'SC    ',AL1(1),CL2'SC',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'IC    ',AL1(1),CL2'IC',AL1(0,0,0)                            
         DC    CL6'DC    ',AL1(1),CL2'DC',AL1(0,0,0)                            
*                                                                               
         DC    CL6'FS    ',AL1(1),CL2'FS',AL1(0,0,0)                            
         DC    CL6'FR    ',AL1(1),CL2'FR',AL1(0,0,0)                            
*                                                                               
         DC    CL6'OF    ',AL1(1),CL2'OF',AL1(1),CL1'X',AL1(2)                  
*                                                                               
         DC    CL6'ST    ',AL1(1),CL2'ST',AL1(1),CL1'X',AL1(2)                  
*                                                                               
         DC    CL6'AD    ',AL1(1),CL2'AD',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SU    ',AL1(1),CL2'SU',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SO    ',AL1(1),CL2'SO',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'AO    ',AL1(1),CL2'AO',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'SW    ',AL1(1),CL2'SW',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'AW    ',AL1(1),CL2'AW',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'IR    ',AL1(1),CL2'IR',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'OR    ',AL1(1),CL2'OR',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'OL    ',AL1(1),CL2'OL',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'IO    ',AL1(1),CL2'IO',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'WO    ',AL1(1),CL2'WO',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'IW    ',AL1(1),CL2'IW',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'IS    ',AL1(1),CL2'IS',AL1(1),CL1'E',AL1(99)                 
         DC    CL6'EC    ',AL1(1),CL2'EC',AL1(1),CL1'N',AL1(5)                  
         DC    CL6'WF    ',AL1(1),CL2'WF',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'FC    ',AL1(1),CL2'FC',AL1(1),CL1'F',AL1(2)                  
         DC    CL6'WN    ',AL1(1),CL2'WN',AL1(1),CL1'N',AL1(5)                  
*                                                                               
         DC    CL6'T+    ',AL1(1),CL2'T+',AL1(0,0,0)                            
         DC    CL6'T-    ',AL1(1),CL2'T-',AL1(0,0,0)                            
         DC    CL6'+S    ',AL1(1),CL2'+S',AL1(0,0,0)                            
         DC    CL6'-S    ',AL1(1),CL2'-S',AL1(0,0,0)                            
*                                                                               
         DC    CL6'00    ',AL1(1),CL2'00',AL1(0,0,0)                            
         DC    CL6'01    ',AL1(1),CL2'01',AL1(0,0,0)                            
         DC    CL6'02    ',AL1(1),CL2'02',AL1(0,0,0)                            
         DC    CL6'03    ',AL1(1),CL2'03',AL1(0,0,0)                            
         DC    CL6'04    ',AL1(1),CL2'04',AL1(0,0,0)                            
         DC    CL6'05    ',AL1(1),CL2'05',AL1(0,0,0)                            
         DC    CL6'06    ',AL1(1),CL2'06',AL1(0,0,0)                            
         DC    CL6'07    ',AL1(1),CL2'07',AL1(0,0,0)                            
         DC    CL6'08    ',AL1(1),CL2'08',AL1(0,0,0)                            
         DC    CL6'09    ',AL1(1),CL2'09',AL1(0,0,0)                            
         DC    CL6'10    ',AL1(1),CL2'10',AL1(0,0,0)                            
         DC    CL6'11    ',AL1(1),CL2'11',AL1(0,0,0)                            
         DC    CL6'12    ',AL1(1),CL2'12',AL1(0,0,0)                            
         DC    CL6'13    ',AL1(1),CL2'13',AL1(0,0,0)                            
         DC    CL6'14    ',AL1(1),CL2'14',AL1(0,0,0)                            
         DC    CL6'15    ',AL1(1),CL2'15',AL1(0,0,0)                            
         DC    CL6'16    ',AL1(1),CL2'16',AL1(0,0,0)                            
         DC    CL6'17    ',AL1(1),CL2'17',AL1(0,0,0)                            
         DC    CL6'18    ',AL1(1),CL2'18',AL1(0,0,0)                            
         DC    CL6'19    ',AL1(1),CL2'19',AL1(0,0,0)                            
         DC    CL6'20    ',AL1(1),CL2'20',AL1(0,0,0)                            
         DC    CL6'21    ',AL1(1),CL2'21',AL1(0,0,0)                            
         DC    CL6'22    ',AL1(1),CL2'22',AL1(0,0,0)                            
         DC    CL6'23    ',AL1(1),CL2'23',AL1(0,0,0)                            
         DC    CL6'24    ',AL1(1),CL2'24',AL1(0,0,0)                            
         DC    CL6'**    ',AL1(1),CL2'**',AL1(0,0,0)                            
ASMTABX  DC    XL1'00'                                                          
*                                                                               
