*          DATA SET DDSLRD     AT LEVEL 011 AS OF 01/07/92                      
SLRD     DSECT                                                                  
SLRTOT   DS    PL6                 TOTAL FOR PERIOD                             
SLRBKLN  EQU   *-SLRTOT                                                         
SLRSAL   DS    PL(SLRBKLN)         SALARY FOR PERIOD                            
SLRSALST DS    XL1                 SALARY STATUS BYTE                           
SLR2DP   EQU   X'20'               X'20'PERCENT 2DP                             
SLR5DP   EQU   X'10'               X'10'PERCENT 5DP                             
SLROVT   DS    PL(SLRBKLN)         OVERTIME FOR PERIOD                          
SLROVTST DS    XL1                 STATUS                                       
SLRTMP   DS    PL(SLRBKLN)         TEMP. FOR PERIOD                             
SLRTMPST DS    XL1                 STATUS                                       
SLRBON   DS    PL(SLRBKLN)         BONUS                                        
SLRBONST DS    XL1                 STATUS                                       
SLRBEN   DS    PL(SLRBKLN)         BENEFIT                                      
SLRBENST DS    XL1                 STATUS                                       
SLRADM   DS    PL(SLRBKLN)         ADMINISTRATION                               
SLRADMST DS    XL1                 STATUS                                       
SLRBUD   DS    PL(SLRBKLN)         BUDGETED SALARY                              
SLRBUDST DS    XL1                 STATUS                                       
SLRRTE   DS    PL(SLRBKLN)         HOURLY RATE                                  
SLRRTEST DS    XL1                 STATUS                                       
SLRPEN   DS    PL(SLRBKLN)         PENSION                                      
SLRPENST DS    XL1                 STATUS                                       
SLRLEN   EQU   *-SLRD                                                           
