*          DATA SET DDSMFXCR   AT LEVEL 001 AS OF 05/15/19                      
SMFXCRD  DSECT                     EXTRACT CREATION RECORD                      
*                                                                               
SMFXCLEN DS    XL2                 LENGTH OF DATA FIELDS                        
SMFXCAGY DS    CL2                 AGENCY ALPHA                                 
SMFXCSYS DS    X                   SE NUMBER                                    
SMFXCESS DS    CL8                 ESS SERVER ID                                
SMFXCMOD DS    CL8                 EXTRACT MODE                                 
SMFXCTYP DS    CL4                 EXTRACT TYPE                                 
SMFXCST  DS    XL8                 EXTRACT START TIME                           
SMFXCET  DS    XL8                 EXTRACT END TIME                             
SMFXCCPU DS    XL8                 CPU TIME                                     
SMFXCIOC DS    XL8                 IO COUNT                                     
SMFXCDSN DS    CL44                EXTRACT DSN                                  
SMFXCSIZ DS    XL8                 EXTRICT FILE SIZE                            
SMFXCRC  DS    X                   RETURN CODE                                  
*                                                                               
SMFXCRDLQ EQU *-SMFXCRD                                                         
