*          DATA SET DDSVCAPARM AT LEVEL 001 AS OF 03/08/00                      
PARMLIST DSECT                                                                  
ACTION   DS    CL4                                                              
DDSID    DS    CL4                                                              
DSPNAME  DS    CL8        JOB/ADDRESS SPACE IDENTIFIER FOR D A COMMAND          
DSPBLCKS DS    F          NO OF BLOCKS DESIRED                                  
DSORIGIN DS    A          RETURNED, ORIGIN                                      
DSALET   DS    A          RETURNED, ALET FOR ACCESS TO DATASPACE                
DSTOKEN  DS    CL8        RETURNED, 8-BYTE TOKEN                                
