*          DATA SET DDSYSELD   AT LEVEL 001 AS OF 01/05/85                      
* DSECT TO COVER CONTROL FILE SYSTEM ELEMENT                                    
*                                                                               
SYSELD   DSECT                                                                  
SYSEL    DS    XL1                 ELEMENT CODE                                 
SYSELQ   EQU   X'A4'                                                            
SYSLEN   DS    XL1                 ELEMENT LENGTH                               
         DS    XL1                 N/D                                          
SYSNAME  DS    CL7                 LOGICAL SYSTEM NAME                          
SYSSYS   DS    XL1                 BASE SYSTEM SE NUMBER                        
SYSSEN   DS    XL1                 SYSTEM SE NUMBER                             
SYSNUM   DS    XL1                 LOGICAL SYSTEM NUMBER                        
SYSLENQ  EQU   *-SYSELD                                                         
