*          DATA SET DDTABOFFD  AT LEVEL 002 AS OF 09/23/09                      
***********************************************************************         
* DSECT TO COVER ADDRESS LIST IN DDTABOFF (FATABOFF PHASE)            *         
***********************************************************************         
         SPACE 1                                                                
TABOFFD  DSECT                                                                  
TBACTRYT DS    A                   V(CTRYTAB)                                   
TBALANGT DS    A                   V(LANGTAB)                                   
TBASELIS DS    A                   V(SELIST)                                    
