*          DATA SET DDTRAND    AT LEVEL 001 AS OF 03/25/16                      
DDTRAND  DSECT                                                                  
*                                                                               
DDTRLEN  DS    XL4                 LENGTH OF STRING TO TRANSLATE                
DDTRAIN  DS    XL4                 A(INPUT BUFFER)                              
DDTRAOUT DS    XL4                 A(OUTPUT BUFFER)                             
DDTRCTRY DS    X                   COUNTRY CODE (USE FACTRYEQUS)                
*                                                                               
DDTROPT  DS    X                   OPTIONS                                      
DDTRO_CRLFQ EQU X'01'              ADD CARRIAGE RETURN AND LINE FEED            
*                                                                               
DDTRANDLQ EQU  *-DDTRAND                                                        
