*          DATA SET DDTSTIDTAB AT LEVEL 003 AS OF 09/26/07                      
* DDS TEST ID TABLE                                                             
**** IF YOU CHANGE YOU MUST RELINK!!!                                           
* SPLNK16                                                                       
* SPOMS09                                                                       
**** IF YOU CHANGE YOU MUST RELINK!!!                                           
*                                                                               
TESTIDS  DC    0CL2                                                             
         DC    C'SJ'   SJ ON SPOTT AND SPOT1                                    
         DC    C'D6'   DDSU ID                                                  
*****    DC    C'TM'   TMNY ID     COMMENTED OUT FOR BC RELEASE                 
*                                                                               
         DC    C'DE'   ITG ON SPOT*IT                                           
         DC    C'GB'   ITG ON SPOT*IT                                           
         DC    C'GR'   ITG ON SPOT*IT                                           
         DC    C'GV'   ITG ON SPOT*IT                                           
         DC    C'MP'   ITG ON SPOT*IT                                           
         DC    C'NM'   ITG ON SPOT*IT                                           
         DC    C'NR'   ITG ON SPOT*IT                                           
         DC    C'PD'   ITG ON SPOT*IT                                           
         DC    C'PM'   ITG ON SPOT*IT                                           
         DC    C'SD'   ITG ON SPOT*IT                                           
         DC    C'SF'   ITG ON SPOT*IT                                           
         DC    C'SG'   ITG ON SPOT*IT                                           
         DC    C'SM'   ITG ON SPOT*IT                                           
         DC    C'SV'   ITG ON SPOT*IT                                           
         DC    C'SY'   ITG ON SPOT*IT                                           
*                                                                               
         DC    X'FF'                                                            
