*          DATA SET DDVSREPTAB AT LEVEL 030 AS OF 11/12/07                      
*  MEDIAVEST VSG STATION MESSUP                                                 
*** IF YOU CHANGE MUST RELINK!!!!                                               
* - SPLNK12                                                                     
* - SPOMS00                                                                     
* - SPOMS09                                                                     
*** IF YOU CHANGE MUST RELINK!!!!                                               
*                                                                               
VSSTATAB DS    0CL4                                                             
         DC    C'WUPA'    VUPAT                                                 
         DC    C'KSTW'    VSTWT                                                 
         DC    C'KMAX'    VMAXT                                                 
*****    DC    C'WNDY'    VNDYT    THESE TWO STATIONS WERE SOLD BY CBS          
*****    DC    C'WWHO'    VWHOT      AND NOW REP BY SOMEONE ELSE                
**HW**   DC    C'WTVX'    VTVXT    REMOVED JUN25/07                             
         DC    C'WGNT'    VGNTT                                                 
*****    DC    C'KAUT'    VAUTT    REMOVED FROM LIST NOV08/05                   
**HW**   DC    C'WLWC'    VLWCT    REMOVED JUN25/07                             
*WHOA*   DC    C'KBHK'    VBHKT    REMOVED NOV12/07                             
         DC    C'WKBD'    VKBDT                                                 
         DC    C'WTOG'    VTOGT                                                 
         DC    C'WBFS'    VBFST                                                 
*****    DC    C'WFRV'    VFRVT    REMOVED FROM LIST 2007APR25                  
         DC    C'WCBS'    VCBST                                                 
**HW**   DC    C'WTCN'    ADDED SEP19/05 , REMOVED JUN25/07                     
*****    DC    C'KOVR'             REMOVED  JAN05/07, SEE 0107956N              
         DC    C'KBCW'    ADDED OCT02/06                                        
***WHOA                                                                         
***  THE COMMENTED SECTION BELOW HAS BE REMOVED BECAUSE MEDIAVEST               
***   CONFUSED THE ISSUE ABOUT CBS AND VSG                                      
*&&DO                                                                           
         DC    C'KCAL'    ADDED NOV01/07 TICKET 0149338N                        
         DC    C'KCBS'    ADDED NOV01/07                                        
         DC    C'KCNC'    ADDED NOV01/07                                        
         DC    C'KDKA'    ADDED NOV01/07                                        
         DC    C'KOVR'    ADDED NOV01/07, REMOVED PREVIOUSLY JAN05/07           
         DC    C'KPIX'    ADDED NOV01/07                                        
         DC    C'KTVT'    ADDED NOV01/07                                        
         DC    C'KTXA'    ADDED NOV01/07                                        
         DC    C'KYW '    ADDED NOV01/07                                        
         DC    C'WBBM'    ADDED NOV01/07                                        
         DC    C'WBZ '    ADDED NOV01/07                                        
         DC    C'WCCO'    ADDED NOV01/07                                        
         DC    C'WFOR'    ADDED NOV01/07                                        
         DC    C'WJZ '    ADDED NOV01/07                                        
         DC    C'WPCW'    ADDED NOV01/07                                        
         DC    C'WPSG'    ADDED NOV01/07                                        
         DC    C'WSBK'    ADDED NOV01/07                                        
         DC    C'WWJ '    ADDED NOV01/07                                        
*&&                                                                             
         DC    C'DCBS'    FOR TESTING PURPOSES                                  
         DC    X'FF'                                                            
*                                                                               
VSCNETAB DS    0CL6                                                             
         DC    C'PG1',C'179'                                                    
         DC    C'PG1',C'180'                                                    
         DC    C'PG1',C'181'                                                    
         DC    C'PG1',C'182'                                                    
         DC    C'PG1',C'183'                                                    
         DC    C'PG1',C'197'                                                    
         DC    C'PG1',C'005'    ADDED SEP19/05                                  
         DC    C'PG1',C'018'    ADDED OCT28/05                                  
         DC    C'PG1',C'008'    ADDED NOV10/05                                  
         DC    C'PG1',C'013'    ADDED FEB28/06                                  
         DC    C'PG1',C'014'    ADDED MAY04/06                                  
         DC    C'PG1',C'123'    ADDED SEP13/06                                  
         DC    C'PG1',C'124'    ADDED NOV30/06                                  
         DC    C'PG1',C'125'    ADDED NOV30/06                                  
         DC    C'PG1',C'228'    ADDED APR10/07                                  
         DC    C'PG1',C'126'    ADDED MAY16/07                                  
         DC    C'PG1',C'238'    ADDED MAY16/07                                  
         DC    C'PG6',C'001'    ADDED MAY16/07                                  
         DC    C'PG6',C'007'    ADDED MAY16/07                                  
         DC    C'PG6',C'021'    ADDED SEP13/07                                  
         DC    C'PG6',C'023'    ADDED SEP13/07                                  
         DC    C'PG6',C'027'    ADDED NOV01/07                                  
         DC    C'PG6',C'028'    ADDED NOV01/07                                  
         DC    C'PG6',C'029'    ADDED NOV12/07                                  
*                                                                               
         DC    C'WMT',C'011'    ADDED SEP13/07                                  
         DC    C'WMT',C'014'    ADDED SEP28/07                                  
         DC    C'WMT',C'020'    ADDED NOV01/07                                  
*                                                                               
         DC    C'WH ',C'100'    FOR TESTING PURPOSES                            
         DC    X'FF'                                                            
                                                                                
