*          DATA SET DDWIDED    AT LEVEL 004 AS OF 03/02/87                      
*              DSECT TO COVER WIDE PRINT AREAS                                  
         SPACE 3                                                                
WIDED    DSECT                                                                  
         DS    CL8                                                              
XHEAD1   DS    CL198               HEADLINES                                    
XHEAD2   DS    CL198                                                            
XHEAD3   DS    CL198                                                            
XHEAD4   DS    CL198                                                            
XHEAD5   DS    CL198                                                            
XHEAD6   DS    CL198                                                            
XHEAD7   DS    CL198                                                            
XHEAD8   DS    CL198                                                            
XHEAD9   DS    CL198                                                            
XHEAD10  DS    CL198                                                            
XHEAD11  DS    CL198                                                            
XHEAD12  DS    CL198                                                            
XHEAD13  DS    CL198                                                            
XHEAD14  DS    CL198                                                            
         DS    CL8                                                              
XMID1    DS    CL198               MID LINES                                    
XMID2    DS    CL198                                                            
         DS    CL8                                                              
XP       DS    0CL198              PRINT LINES                                  
XP1      DS    CL198                                                            
XP2      DS    CL198                                                            
XP3      DS    CL198                                                            
XP4      DS    CL198                                                            
XSPACES  DS    CL198               ALWAYS SPACES                                
