*          DATA SET DDWOHSTTAB AT LEVEL 007 AS OF 12/13/10                      
*                                                                               
*  HEARST STATION TO EAGLE GOING TO WIDE ORBIT                                  
*                                                                               
WOHSTTAB DS    0CL5                                                             
* ETV REP'D STATIONS                                                            
         DC    C'EBALT'                                                         
         DC    C'WBALT'                                                         
         DC    C'YYCNT'                                                         
         DC    X'FF'                                                            
