*          DATA SET DEALPHAMKD AT LEVEL 012 AS OF 10/30/90                      
*          DATA SET DEALPHAMKD AT LEVEL 001 AS OF 10/30/90                      
DEALFMKD DSECT                                                                  
DEALFMED DS    C                   MEDIA TYPE                                   
DEALFBTY DS    C                   MARKET  TYPE                                 
*                                     00-REGULAR                                
*                                      B-BLACK                                  
*                                      H-HISPANIC                               
DEALFSRC DS    6CL1                LIST OF SOURCE                               
DEALFELN DS    X                   LENGTH OF EACH MARKET RECORD                 
DEALFNXT DS    XL2                 NEXT MARKET LIST                             
DEALFTAB EQU   *                                                                
         ORG   DEALFMKD                                                         
DEALFMKA DS    CL3                 MARKET CITY CODE                             
DEALFMKN DS    CL2                 ARBITRON MARKET NUMBER                       
         DS    CL2                 NIELSON MARKET NUMBER                        
DEALFNXN EQU   *                   DISP FOR NEXT MARKET NUMBER                  
