*          DATA SET DEARBCMKTS AT LEVEL 014 AS OF 12/03/09                      
*  THESE MARKETS HAVE CONDENSED MARKET REPORTS                                  
*  WE ARE CONTRACTUALLY OBLIGATED TO SUPPRESS SOME DEMOGRAPHICS                 
*  IN THESE MARKETS FOR ARB. DEMOUT LOOKS AT THIS TABLE FOR THE                 
*  AND DEMOS TO WHICH THIS APPLIES.                                             
*                                                                               
         DS    0H                                                               
ACRDEMS  DS    0C                                                               
*        DC    AL1(VO12)                                                        
*        DC    AL1(V1834)                                                       
*        DC    AL1(MO18)                                                        
*        DC    AL1(WO18)                                                        
*        DC    AL1(VO18)                                                        
*        DC    AL1(V1849)                                                       
*        DC    AL1(V2554)                                                       
*        DC    AL1(VO35)                                                        
*        DC    AL1(0)                                                           
*                                                                               
*CRDEMS2 DC    AL1(VO12)           EFFECTIVE SPRING/87                          
*        DC    AL1(WO12)             EFFECTIVELY DELETE THIS                    
*        DC    AL1(MO12)                                                        
*        DC    AL1(V1234)                                                       
*        DC    AL1(W1234)                                                       
*        DC    AL1(M1234)                                                       
*        DC    AL1(V1244)                                                       
*        DC    AL1(W1244)                                                       
*        DC    AL1(M1244)                                                       
*        DC    AL1(V1249)                                                       
*        DC    AL1(W1249)                                                       
*        DC    AL1(M1249)                                                       
*        DC    AL1(V1254)                                                       
*        DC    AL1(W1254)                                                       
*        DC    AL1(M1254)                                                       
*        DC    AL1(V1264)                                                       
*        DC    AL1(W1264)                                                       
*        DC    AL1(M1264)                                                       
*        DC    AL1(V1834)                                                       
*        DC    AL1(W1834)                                                       
*        DC    AL1(M1834)                                                       
*        DC    AL1(V1844)                                                       
*        DC    AL1(W1844)                                                       
*        DC    AL1(M1844)                                                       
*        DC    AL1(V1849)                                                       
*        DC    AL1(W1849)                                                       
*        DC    AL1(M1849)                                                       
*        DC    AL1(V1854)                                                       
*        DC    AL1(W1854)                                                       
*        DC    AL1(M1854)                                                       
*        DC    AL1(V1864)                                                       
*        DC    AL1(W1864)                                                       
*        DC    AL1(M1864)                                                       
*        DC    AL1(MO18)                                                        
*        DC    AL1(WO18)                                                        
*        DC    AL1(VO18)                                                        
*        DC    AL1(V2549)                                                       
*        DC    AL1(W2549)                                                       
*        DC    AL1(M2549)                                                       
*        DC    AL1(V2554)                                                       
*        DC    AL1(W2554)                                                       
*        DC    AL1(M2554)                                                       
*        DC    AL1(V2564)                                                       
*        DC    AL1(W2564)                                                       
*        DC    AL1(M2564)                                                       
*        DC    AL1(VO25)                                                        
*        DC    AL1(WO25)                                                        
*        DC    AL1(MO25)                                                        
*        DC    AL1(V3564)                                                       
*        DC    AL1(W3564)                                                       
*        DC    AL1(M3564)                                                       
*        DC    AL1(VO35)                                                        
*        DC    AL1(WO35)                                                        
*        DC    AL1(MO35)                                                        
*        DC    AL1(VO45)                                                        
*        DC    AL1(WO45)                                                        
*        DC    AL1(MO45)                                                        
*        DC    AL1(VO50)                                                        
*        DC    AL1(WO50)                                                        
*        DC    AL1(MO50)                                                        
*        DC    AL1(VO55)                                                        
*        DC    AL1(WO55)                                                        
*        DC    AL1(MO55)                                                        
*        DC    AL1(0)                                                           
*                                                                               
         DS    0H                                                               
ACRDEMS2 DS    0C                  RETAIN DELETED LABEL                         
ACRDEMS3 DC    AL1(VO12)           EFFECTIVE SPRING/88                          
         DC    AL1(WO12)                                                        
         DC    AL1(MO12)                                                        
         DC    AL1(V1234)                                                       
         DC    AL1(W1234)                                                       
         DC    AL1(M1234)                                                       
         DC    AL1(V1244)                                                       
         DC    AL1(W1244)                                                       
         DC    AL1(M1244)                                                       
         DC    AL1(V1249)                                                       
         DC    AL1(W1249)                                                       
         DC    AL1(M1249)                                                       
         DC    AL1(V1254)                                                       
         DC    AL1(W1254)                                                       
         DC    AL1(M1254)                                                       
         DC    AL1(V1264)                                                       
         DC    AL1(W1264)                                                       
         DC    AL1(M1264)                                                       
         DC    AL1(V1834)                                                       
         DC    AL1(W1834)                                                       
         DC    AL1(M1834)                                                       
         DC    AL1(V1844)                                                       
         DC    AL1(W1844)                                                       
         DC    AL1(M1844)                                                       
         DC    AL1(V1849)                                                       
         DC    AL1(W1849)                                                       
         DC    AL1(M1849)                                                       
         DC    AL1(V1854)                                                       
         DC    AL1(W1854)                                                       
         DC    AL1(M1854)                                                       
         DC    AL1(V1864)                                                       
         DC    AL1(W1864)                                                       
         DC    AL1(M1864)                                                       
         DC    AL1(MO18)                                                        
         DC    AL1(WO18)                                                        
         DC    AL1(VO18)                                                        
         DC    AL1(V2149)                                                       
         DC    AL1(W2149)                                                       
         DC    AL1(M2149)                                                       
         DC    AL1(V2154)                                                       
         DC    AL1(W2154)                                                       
         DC    AL1(M2154)                                                       
         DC    AL1(V2164)                                                       
         DC    AL1(W2164)                                                       
         DC    AL1(M2164)                                                       
         DC    AL1(MO21)                                                        
         DC    AL1(WO21)                                                        
         DC    AL1(VO21)                                                        
         DC    AL1(V2544)                                                       
         DC    AL1(W2544)                                                       
         DC    AL1(M2544)                                                       
         DC    AL1(V2549)                                                       
         DC    AL1(W2549)                                                       
         DC    AL1(M2549)                                                       
         DC    AL1(V2554)                                                       
         DC    AL1(W2554)                                                       
         DC    AL1(M2554)                                                       
         DC    AL1(V2564)                                                       
         DC    AL1(W2564)                                                       
         DC    AL1(M2564)                                                       
         DC    AL1(VO25)                                                        
         DC    AL1(WO25)                                                        
         DC    AL1(MO25)                                                        
         DC    AL1(V3554)                                                       
         DC    AL1(W3554)                                                       
         DC    AL1(M3554)                                                       
         DC    AL1(V3564)                                                       
         DC    AL1(W3564)                                                       
         DC    AL1(M3564)                                                       
         DC    AL1(VO35)                                                        
         DC    AL1(WO35)                                                        
         DC    AL1(MO35)                                                        
         DC    AL1(V4564)                                                       
         DC    AL1(W4564)                                                       
         DC    AL1(M4564)                                                       
         DC    AL1(VO45)                                                        
         DC    AL1(WO45)                                                        
         DC    AL1(MO45)                                                        
         DC    AL1(VO50)                                                        
         DC    AL1(WO50)                                                        
         DC    AL1(MO50)                                                        
         DC    AL1(VO55)                                                        
         DC    AL1(WO55)                                                        
         DC    AL1(MO55)                                                        
         DC    AL1(0)                                                           
*                                                                               
         DS    0H                                                               
ARBRMKT  DS    0C                                                               
*        DC    C'AR',AL3(ARBRMKTX+2)                                            
*        DC    AL2(0209)         WICHITA FALLS, TX                              
*        DC    AL2(0243)         GREAT FALLS, MT                                
*        DC    AL2(0273)         READING PA.                                    
*        DC    AL2(0325)         YAKIMA                                         
*        DC    AL2(0339)         MEDFORD-ASHLAND, OR                            
*        DC    AL2(0365)         NEW BDFRD-FALL RVR, MA                         
*        DC    AL2(0371)         TRI-CITIES                                     
*        DC    AL2(0501)         DOTHAN, AL                                     
*        DC    AL2(0502)         TYLER, TX                                      
*        DC    AL2(0503)         FAYETTVL-SPRNGDALE, AR                         
*        DC    AL2(0504)         DANVILLE                                       
*        DC    AL2(0505)         BURLINGTON, VT                                 
*        DC    AL2(0506)         LONGVIEW-MARSHALL,TX                           
*        DC    AL2(0508)         CHICO, CA                                      
*        DC    AL2(0509)         REDDING, CA                                    
*        DC    AL2(0510)         BIG SPRING, TX                                 
*        DC    AL2(0511)         GRAND JUNCTION, CO                             
*        DC    AL2(0512)         TEXARKANA, TX                                  
*        DC    AL2(0513)         MUSKEGON, MI                                   
*        DC    AL2(0514)         WATERBURY, CT                                  
*        DC    AL2(0515)         FT. MYERS-CAPE CORAL, FL                       
*        DC    AL2(0516)         MONMOUTH-OCEAN, NJ                             
*        DC    AL2(0517)         FT. PIERCE, FL                                 
*        DC    AL2(0518)         POUGHKEEPSIE, NY                               
*        DC    AL2(0519)         ABERDEEN, WA                                   
*        DC    AL2(0520)         NAPLES-MARCO ISL, FL                           
*        DC    AL2(0521)         SPRINGFIELD, IL                                
*        DC    AL2(0522)         LAUREL-HATTIESBURG, MS                         
*        DC    AL2(0523)         SIOUX CITY, IA                                 
*        DC    AL2(0524)         HAGRSTWN-CHMBRSBURG-WANSEBORO                  
*        DC    AL2(0525)         OWENSBORO, KY                                  
*        DC    AL2(0526)         BANGOR, ME                                     
*        DC    AL2(0527)         AUGUSTA-WATERVILLE, ME                         
*        DC    AL2(0528)         FREDERICK, MD                                  
*        DC    AL2(0529)         PASCAGOULA-MOSS PT, MS                         
*        DC    AL2(0530)         CAPE COD, MA                                   
*        DC    AL2(0531)         BATTLE CREEK, MI                               
*        DC    AL2(0532)         ROCHESTER, MN                                  
*        DC    AL2(0533)         BILOXI-GULFPORT, MS                            
*        DC    AL2(0534)         JOPLIN, MO                                     
*        DC    AL2(0535)         NW MICHIGAN                                    
*        DC    AL2(0536)         BOZEMAN, MT                                    
*        DC    AL2(0537)         TRENTON, NJ                                    
*        DC    AL2(0538)         SANTA FE, NM                                   
*        DC    AL2(0539)         PARKERSBURG-MARIETTA WV/OH                     
*        DC    AL2(0540)         MINOT, ND                                      
*        DC    AL2(0545)         RAPID CITY, SD                                 
*        DC    AL2(0546)         ABILENE, TX                                    
*        DC    AL2(0547)         STAMFORD-NORWALK, CT                           
*        DC    AL2(0548)         SAN ANGELO, TX                                 
*        DC    AL2(0550)         GAINESVILLE, FL                                
*        DC    AL2(0551)         VICTORIA, TX                                   
*        DC    AL2(0553)         CHARLOTTESVILLE, VA                            
*        DC    AL2(0555)         STAUNTON-WAYNESBORO, VA                        
*        DC    AL2(0558)         BECKLEY, WV                                    
*        DC    AL2(0559)         LA CROSSE, WI                                  
*        DC    AL2(0560)         CHEYENNE, WY                                   
*        DC    AL2(0561)         ODESSA-MIDLAND, TX                             
*        DC    AL2(0562)         KILLEN-TEMPLE, TX                              
*        DC    AL2(0564)         COLUMBIA, MO                                   
*        DC    AL2(0565)         MORRISTOWN, NJ                                 
*        DC    AL2(0566)         LUFKIN-NACOGDOCHES, TX                         
*        DC    AL2(0567)         BOULDER, CO                                    
*        DC    AL2(0570)         DUBUQUE, IA                                    
*        DC    AL2(0571)         FT. WALTON BCH, FL                             
*        DC    AL2(0572)         GRAND FORKS ND-MN                              
*        DC    AL2(0573)         PANAMA CITY, FL                                
*        DC    AL2(0574)         SANTA ROSA, CA                                 
*        DC    AL2(0575)         ST. CLOUD, MN                                  
*        DC    AL2(0577)         WATERTOWN, NY                                  
*        DC    AL2(0578)         WILLIAMSPORT, PA                               
*        DC    AL2(0580)         ALBANY, GA                                     
*        DC    AL2(0582)         BISMARK, ND                                    
*        DC    AL2(0583)         ITHACA, NY                                     
*        DC    AL2(0584)         LAKE CHARLES, LA                               
*        DC    AL2(0585)         MONROE, LA                                     
*        DC    AL2(0586)         EAU CLAIRE, WI                                 
*        DC    AL2(0587)         ALEXANDRIA, LA                                 
*        DC    AL2(0588)         MERIDIAN, MS                                   
*        DC    AL2(0589)         FT. SMITH, AR                                  
*        DC    AL2(0590)         ALBANY-CRVLLIS-LEBANON, OR                     
*        DC    AL2(0591)         SANTA BARBARA, CA                              
*        DC    AL2(0592)         PALM SPRINGS, CA                               
*        DC    AL2(0593)         DANBURY, CT                                    
*        DC    AL2(0595)         LAFAYETTE, IN                                  
*        DC    AL2(0596)         TUSCALOOSA, AL                                 
*        DC    AL2(0598)         CAPE MAY, NJ                                   
*        DC    AL2(0599)         LAWTON,OK                                      
*RBRMKTX DC    AL2(0)                                                           
*                                                                               
         DS    0H                                                               
ARBRMK2  DC    C'AR',AL3(ARBRMK2X+2)      EFFECTIVE SPRING/88                   
         DC    AL2(0209)         WICHITA FALLS, TX                              
*        DC    AL2(0243)         GREAT FALLS, MT                                
*        DC    AL2(0273)         READING PA.                                    
*        DC    AL2(0325)         YAKIMA                                         
*        DC    AL2(0339)         MEDFORD-ASHLAND, OR                            
*        DC    AL2(0365)         NEW BDFRD-FALL RVR, MA                         
*        DC    AL2(0371)         TRI-CITIES                                     
*        DC    AL2(0501)         DOTHAN, AL                                     
*        DC    AL2(0502)         TYLER, TX                                      
*        DC    AL2(0503)         FAYETTVL-SPRNGDALE, AR                         
*        DC    AL2(0504)         DANVILLE                                       
*        DC    AL2(0505)         BURLINGTON, VT                                 
*        DC    AL2(0506)         LONGVIEW-MARSHALL,TX                           
*        DC    AL2(0508)         CHICO, CA                                      
*        DC    AL2(0509)         REDDING, CA                                    
*        DC    AL2(0510)   DEL   BIG SPRING, TX                                 
*        DC    AL2(0511)         GRAND JUNCTION, CO                             
*        DC    AL2(0512)         TEXARKANA, TX                                  
*        DC    AL2(0513)         MUSKEGON, MI                                   
*        DC    AL2(0514)         WATERBURY, CT                                  
*        DC    AL2(0515)         FT. MYERS-CAPE CORAL, FL                       
*        DC    AL2(0516)         MONMOUTH-OCEAN, NJ                             
*        DC    AL2(0517)         FT. PIERCE, FL                                 
*        DC    AL2(0518)         POUGHKEEPSIE, NY                               
*        DC    AL2(0519)         ABERDEEN, WA                                   
*        DC    AL2(0520)         NAPLES-MARCO ISL, FL                           
*        DC    AL2(0521)         SPRINGFIELD, IL                                
*        DC    AL2(0522)         LAUREL-HATTIESBURG, MS                         
*        DC    AL2(0523)         SIOUX CITY, IA                                 
*        DC    AL2(0524)         HAGRSTWN-CHMBRSBURG-WANSEBORO                  
*        DC    AL2(0525)         OWENSBORO, KY                                  
*        DC    AL2(0526)         BANGOR, ME                                     
*        DC    AL2(0527)         AUGUSTA-WATERVILLE, ME                         
*        DC    AL2(0528)         FREDERICK, MD                                  
*        DC    AL2(0529)         PASCAGOULA-MOSS PT, MS                         
*        DC    AL2(0530)         CAPE COD, MA                                   
*        DC    AL2(0531)         BATTLE CREEK, MI                               
*        DC    AL2(0532)         ROCHESTER, MN                                  
*        DC    AL2(0533)         BILOXI-GULFPORT, MS                            
*        DC    AL2(0534)         JOPLIN, MO                                     
*        DC    AL2(0535)         NW MICHIGAN                                    
*        DC    AL2(0536)         BOZEMAN, MT                                    
*        DC    AL2(0537)         TRENTON, NJ                                    
*        DC    AL2(0538)         SANTA FE, NM                                   
*        DC    AL2(0539)         PARKERSBURG-MARIETTA WV/OH                     
*        DC    AL2(0540)         MINOT, ND                                      
*        DC    AL2(0545)         RAPID CITY, SD                                 
*        DC    AL2(0546)         ABILENE, TX                                    
*        DC    AL2(0547)         STAMFORD-NORWALK, CT                           
*        DC    AL2(0548)         SAN ANGELO, TX                                 
*        DC    AL2(0549)   NEW   BRYAN-COLLEGE STATION, TX.                     
*        DC    AL2(0550)         GAINESVILLE, FL                                
*        DC    AL2(0551)         VICTORIA, TX                                   
*        DC    AL2(0553)         CHARLOTTESVILLE, VA                            
*        DC    AL2(0554)   NEW   FLORENCE, SC                                   
*        DC    AL2(0555)         STAUNTON-WAYNESBORO, VA                        
*        DC    AL2(0558)         BECKLEY, WV                                    
*        DC    AL2(0559)         LA CROSSE, WI                                  
*        DC    AL2(0560)         CHEYENNE, WY                                   
*        DC    AL2(0561)         ODESSA-MIDLAND, TX                             
*        DC    AL2(0562)         KILLEN-TEMPLE, TX                              
*        DC    AL2(0563)   NEW   NEW LONDON, CT.                                
*        DC    AL2(0564)         COLUMBIA, MO                                   
*        DC    AL2(0565)         MORRISTOWN, NJ                                 
*        DC    AL2(0566)         LUFKIN-NACOGDOCHES, TX                         
*        DC    AL2(0567)         BOULDER, CO                                    
*        DC    AL2(0570)         DUBUQUE, IA                                    
*        DC    AL2(0571)         FT. WALTON BCH, FL                             
*        DC    AL2(0572)         GRAND FORKS ND-MN                              
*        DC    AL2(0573)         PANAMA CITY, FL                                
*        DC    AL2(0574)         SANTA ROSA, CA                                 
*        DC    AL2(0575)         ST. CLOUD, MN                                  
*        DC    AL2(0577)         WATERTOWN, NY                                  
*        DC    AL2(0578)         WILLIAMSPORT, PA                               
*        DC    AL2(0580)         ALBANY, GA                                     
*        DC    AL2(0582)         BISMARK, ND                                    
*        DC    AL2(0583)         ITHACA, NY                                     
*        DC    AL2(0584)         LAKE CHARLES, LA                               
*        DC    AL2(0585)         MONROE, LA                                     
*        DC    AL2(0586)         EAU CLAIRE, WI                                 
*        DC    AL2(0587)         ALEXANDRIA, LA                                 
*        DC    AL2(0588)         MERIDIAN, MS                                   
*        DC    AL2(0589)         FT. SMITH, AR                                  
*        DC    AL2(0590)         ALBANY-CRVLLIS-LEBANON, OR                     
*        DC    AL2(0591)         SANTA BARBARA, CA                              
*        DC    AL2(0592)         PALM SPRINGS, CA                               
*        DC    AL2(0593)         DANBURY, CT                                    
*        DC    AL2(0595)         LAFAYETTE, IN                                  
*        DC    AL2(0596)         TUSCALOOSA, AL                                 
*        DC    AL2(0598)         CAPE MAY, NJ                                   
*        DC    AL2(0599)         LAWTON,OK                                      
ARBRMK2X DC    AL2(0)                                                           
*                                                                               
*                                                                               
         DS    0H                                                               
ARBRMK3  DC    C'AR',AL3(ARBRMK3X+2)      EFFECTIVE SPRING/91                   
         DC    AL2(0209)         WICHITA FALLS, TX                              
         DC    AL2(0225)   NEW   BILLINGS, MT                                   
         DC    AL2(0243)         GREAT FALLS, MT                                
         DC    AL2(0273)         READING PA.                                    
         DC    AL2(0325)         YAKIMA                                         
         DC    AL2(0339)         MEDFORD-ASHLAND, OR                            
         DC    AL2(0365)         NEW BDFRD-FALL RVR, MA                         
         DC    AL2(0371)         TRI-CITIES                                     
         DC    AL2(0501)         DOTHAN, AL                                     
         DC    AL2(0502)         TYLER, TX                                      
         DC    AL2(0503)         FAYETTVL-SPRNGDALE, AR                         
         DC    AL2(0504)         DANVILLE                                       
         DC    AL2(0505)         BURLINGTON, VT                                 
         DC    AL2(0506)         LONGVIEW-MARSHALL,TX                           
         DC    AL2(0508)         CHICO, CA                                      
         DC    AL2(0509)         REDDING, CA                                    
         DC    AL2(0511)         GRAND JUNCTION, CO                             
         DC    AL2(0512)         TEXARKANA, TX                                  
         DC    AL2(0513)         MUSKEGON, MI                                   
         DC    AL2(0514)         WATERBURY, CT                                  
         DC    AL2(0515)         FT. MYERS-CAPE CORAL, FL                       
         DC    AL2(0516)         MONMOUTH-OCEAN, NJ                             
         DC    AL2(0518)         POUGHKEEPSIE, NY                               
         DC    AL2(0519)         ABERDEEN, WA                                   
         DC    AL2(0520)         NAPLES-MARCO ISL, FL                           
         DC    AL2(0521)         SPRINGFIELD, IL                                
         DC    AL2(0522)         LAUREL-HATTIESBURG, MS                         
         DC    AL2(0523)         SIOUX CITY, IA                                 
         DC    AL2(0524)         HAGRSTWN-CHMBRSBURG-WANSEBORO                  
         DC    AL2(0525)         OWENSBORO, KY                                  
         DC    AL2(0526)         BANGOR, ME                                     
         DC    AL2(0528)         FREDERICK, MD                                  
         DC    AL2(0529)         PASCAGOULA-MOSS PT, MS                         
         DC    AL2(0530)         CAPE COD, MA                                   
         DC    AL2(0531)         BATTLE CREEK, MI                               
         DC    AL2(0532)         ROCHESTER, MN                                  
         DC    AL2(0533)         BILOXI-GULFPORT, MS                            
         DC    AL2(0534)         JOPLIN, MO                                     
         DC    AL2(0535)         NW MICHIGAN                                    
         DC    AL2(0536)         BOZEMAN, MT                                    
         DC    AL2(0537)         TRENTON, NJ                                    
         DC    AL2(0538)         SANTA FE, NM                                   
         DC    AL2(0539)         PARKERSBURG-MARIETTA WV/OH                     
         DC    AL2(0540)         MINOT, ND                                      
         DC    AL2(0545)         RAPID CITY, SD                                 
         DC    AL2(0546)         ABILENE, TX                                    
         DC    AL2(0547)         STAMFORD-NORWALK, CT                           
         DC    AL2(0548)         SAN ANGELO, TX                                 
         DC    AL2(0549)         BRYAN-COLLEGE STATION, TX.                     
         DC    AL2(0550)         GAINESVILLE, FL                                
         DC    AL2(0551)         VICTORIA, TX                                   
         DC    AL2(0553)         CHARLOTTESVILLE, VA                            
         DC    AL2(0554)         FLORENCE, SC                                   
         DC    AL2(0555)         STAUNTON-WAYNESBORO, VA                        
         DC    AL2(0558)         BECKLEY, WV                                    
         DC    AL2(0559)         LA CROSSE, WI                                  
         DC    AL2(0560)         CHEYENNE, WY                                   
         DC    AL2(0561)         ODESSA-MIDLAND, TX                             
         DC    AL2(0562)         KILLEN-TEMPLE, TX                              
         DC    AL2(0563)         NEW LONDON, CT.                                
         DC    AL2(0564)         COLUMBIA, MO                                   
         DC    AL2(0565)         MORRISTOWN, NJ                                 
         DC    AL2(0566)         LUFKIN-NACOGDOCHES, TX                         
         DC    AL2(0567)         BOULDER, CO                                    
         DC    AL2(0570)         DUBUQUE, IA                                    
         DC    AL2(0571)         FT. WALTON BCH, FL                             
         DC    AL2(0572)         GRAND FORKS ND-MN                              
         DC    AL2(0573)         PANAMA CITY, FL                                
         DC    AL2(0574)         SANTA ROSA, CA                                 
         DC    AL2(0575)         ST. CLOUD, MN                                  
         DC    AL2(0577)         WATERTOWN, NY                                  
         DC    AL2(0578)         WILLIAMSPORT, PA                               
         DC    AL2(0580)         ALBANY, GA                                     
         DC    AL2(0582)         BISMARK, ND                                    
         DC    AL2(0583)         ITHACA, NY                                     
         DC    AL2(0584)         LAKE CHARLES, LA                               
         DC    AL2(0585)         MONROE, LA                                     
         DC    AL2(0586)         EAU CLAIRE, WI                                 
         DC    AL2(0587)         ALEXANDRIA, LA                                 
         DC    AL2(0588)         MERIDIAN, MS                                   
         DC    AL2(0589)         FT. SMITH, AR                                  
         DC    AL2(0590)         ALBANY-CRVLLIS-LEBANON, OR                     
         DC    AL2(0591)         SANTA BARBARA, CA                              
         DC    AL2(0592)         PALM SPRINGS, CA                               
         DC    AL2(0593)         DANBURY, CT                                    
         DC    AL2(0595)         LAFAYETTE, IN                                  
         DC    AL2(0596)         TUSCALOOSA, AL                                 
         DC    AL2(0598)         CAPE MAY, NJ                                   
         DC    AL2(0599)         LAWTON,OK                                      
ARBRMK3X DC    AL2(0)                                                           
*                                                                               
       ++INCLUDE DEEQUDEMNO                                                     
