*          DATA SET DEBIRCMKTS AT LEVEL 015 AS OF 11/28/90                      
*  THESE MARKETS HAVE CONDENSED MARKET REPORTS                                  
*  WE ARE CONTRACTUALLY OBLIGATED TO SUPPRESS SOME DEMOGRAPHICS                 
*  IN THESE MARKETS FOR BIRCH. DEMOUT LOOKS AT THIS TABLE FOR THE               
*  AND DEMOS TO WHICH THIS APPLIES.                                             
*                                                                               
BCRDEMS  DC    AL1(VO12)           TYPE 1 DAYPART DEMOS                         
         DC    AL1(WO12)                                                        
         DC    AL1(MO12)                                                        
         DC    AL1(V1217)                                                       
         DC    AL1(V1224)                                                       
         DC    AL1(M1224)                                                       
         DC    AL1(W1234)                                                       
         DC    AL1(W1234)                                                       
         DC    AL1(M1234)                                                       
         DC    AL1(V1244)                                                       
         DC    AL1(W1244)                                                       
         DC    AL1(M1244)                                                       
         DC    AL1(V1249)                                                       
         DC    AL1(W1249)                                                       
         DC    AL1(M1249)                                                       
         DC    AL1(V1254)                                                       
         DC    AL1(W1254)                                                       
         DC    AL1(M1254)                                                       
         DC    AL1(V1264)                                                       
         DC    AL1(W1264)                                                       
         DC    AL1(M1264)                                                       
         DC    AL1(V1834)                                                       
         DC    AL1(W1834)                                                       
         DC    AL1(M1834)                                                       
         DC    AL1(V1844)                                                       
         DC    AL1(W1844)                                                       
         DC    AL1(M1844)                                                       
         DC    AL1(V1849)                                                       
         DC    AL1(W1849)                                                       
         DC    AL1(M1849)                                                       
         DC    AL1(V1854)                                                       
         DC    AL1(W1854)                                                       
         DC    AL1(M1854)                                                       
         DC    AL1(V1864)                                                       
         DC    AL1(W1864)                                                       
         DC    AL1(M1864)                                                       
         DC    AL1(MO18)                                                        
         DC    AL1(WO18)                                                        
         DC    AL1(VO18)                                                        
         DC    AL1(V2549)                                                       
         DC    AL1(W2549)                                                       
         DC    AL1(M2549)                                                       
         DC    AL1(V2554)                                                       
         DC    AL1(W2554)                                                       
         DC    AL1(M2554)                                                       
         DC    AL1(V2564)                                                       
         DC    AL1(W2564)                                                       
         DC    AL1(M2564)                                                       
         DC    AL1(VO25)                                                        
         DC    AL1(WO25)                                                        
         DC    AL1(MO25)                                                        
         DC    AL1(V3564)                                                       
         DC    AL1(W3564)                                                       
         DC    AL1(M3564)                                                       
         DC    AL1(VO35)                                                        
         DC    AL1(WO35)                                                        
         DC    AL1(MO35)                                                        
         DC    AL1(VO45)                                                        
         DC    AL1(WO45)                                                        
         DC    AL1(MO45)                                                        
         DC    AL1(VO50)                                                        
         DC    AL1(WO50)                                                        
         DC    AL1(MO50)                                                        
         DC    AL1(VO55)                                                        
         DC    AL1(WO55)                                                        
         DC    AL1(MO55)                                                        
         DC    AL1(0)                                                           
*                                                                               
BIRRMK   DC    C'BR',AL3(BIRRMKX+2)                                             
         DC    AL2(0089),X'02'   FRESNO, CA TSA                                 
         DC    AL2(0113),X'02'   WORCESTER, MA                                  
         DC    AL2(0137),X'01'   PEORIA, IL                                     
         DC    AL2(0143),X'02'   BAKERSFIELD, CA                                
         DC    AL2(0147),X'01'   AMARILLO, TX                                   
         DC    AL2(0151),X'01'   CEDAR RAPIDS, IA                               
         DC    AL2(0153),X'02'   CHARLESTON, WV                                 
         DC    AL2(0155),X'01'   CORPUS CHRISTI, TX                             
         DC    AL2(0159),X'02'   DULUTH/SUPERIOR, MN-WI                         
         DC    AL2(0169),X'01'   JACKSON, MS                                    
         DC    AL2(0177),X'02'   SPOKANE, WA-ID                                 
         DC    AL2(0179),X'02'   WHEELING, WV-OH                                
         DC    AL2(0185),X'02'   EVANSVILLE, IN-KY                              
         DC    AL2(0187),X'02'   FARGO, ND                                      
         DC    AL2(0193),X'03'   HUNTINGTON/ASHLAND, WV-KY-OH                   
         DC    AL2(0203),X'02'   SPRINGFIELD, MO                                
         DC    AL2(0225),X'02'   BILLINGS, MT                                   
         DC    AL2(0227),X'02'   BINGHAMTON, NY                                 
         DC    AL2(0229),X'02'   BOISE, ID                                      
         DC    AL2(0235),X'02'   COLUMBUS, GA                                   
         DC    AL2(0239),X'02'   ERIE, PA                                       
         DC    AL2(0241),X'01'   EUGENE/SPRINGFIELD, OR                         
         DC    AL2(0245),X'01'   GREEN BAY, WI                                  
         DC    AL2(0247),X'02'   PORSTMOUTH/DOVE, NH-ME                         
         DC    AL2(0251),X'01'   KALAMAZOO,MI                                   
         DC    AL2(0253),X'02'   LAFAYETTE, LA                                  
         DC    AL2(0255),X'01'   LANCASTER, PA                                  
         DC    AL2(0263),X'01'   LUBBOCK, TX                                    
         DC    AL2(0267),X'02'   MANCHESTER, NH                                 
         DC    AL2(0273),X'01'   READING, PA                                    
         DC    AL2(0277),X'02'   ROANOKE, VA                                    
         DC    AL2(0279),X'02'   ROCKFORD, IL                                   
         DC    AL2(0285),X'02'   SAVANNAH, GA                                   
         DC    AL2(0287),X'01'   SOUTH BEND, IN                                 
         DC    AL2(0297),X'01'   WATERLOO/CEDAR FALLS                           
         DC    AL2(0301),X'01'   YORK, PA                                       
         DC    AL2(0307),X'02'   TERRE HAUTE, IN                                
         DC    AL2(0315),X'01'   ANCHORAGE, AK                                  
         DC    AL2(0317),X'02'   PENSACOLA, FL                                  
         DC    AL2(0321),X'02'   E. LONG ISLAND, NY                             
         DC    AL2(0327),X'02'   HUNTSVILLE, AL                                 
         DC    AL2(0333),X'01'   TALLAHASSEE, FL                                
         DC    AL2(0337),X'01'   BRIDGEPORT/MILFORD, CT                         
         DC    AL2(0339),X'02'   MEDFORD, OR                                    
         DC    AL2(0353),X'02'   PUEBLO, CO                                     
         DC    AL2(0357),X'02'   BURLINGTON, VT                                 
         DC    AL2(0363),X'02'   LYNCHBURG, VA                                  
         DC    AL2(0365),X'02'   NEW BEDFORD/FALL RIVER,MA                      
         DC    AL2(0371),X'02'   RICHLAND, WA                                   
         DC    AL2(0502),X'02'   TYLER, TX                                      
         DC    AL2(0506),X'02'   LONGVIEW/MARSHALL, TX                          
         DC    AL2(0508),X'02'   CHICO, CA                                      
         DC    AL2(0517),X'01'   FT. PIERCE, FL.                                
         DC    AL2(0524),X'01'   HAGERSTOWN, MD-PA                              
         DC    AL2(0528),X'02'   FREDERICK COUNTY, MD                           
         DC    AL2(0530),X'02'   CAPE COD, MA                                   
         DC    AL2(0532),X'02'   ROCHESTER, MN                                  
         DC    AL2(0550),X'01'   GAINESVILLE, FL                                
         DC    AL2(0551),X'02'   VICTORIA, TX                                   
         DC    AL2(0561),X'01'   ODESSA/MIDLAND, TX                             
         DC    AL2(0562),X'02'   KILLEEN/TEMPLE TX                              
         DC    AL2(0571),X'02'   FT. WALTON BEACH, FL                           
         DC    AL2(0573),X'02'   PANAMA CITY, FL                                
         DC    AL2(0574),X'01'   SANTA ROSA, CA AND 02                          
         DC    AL2(0578),X'02'   WILLIAMSPORT, PA                               
         DC    AL2(0587),X'01'   ALEXANDRIA, LA (WI90-ON) 2 FOR F89             
         DC    AL2(0591),X'01'   SANTA BARBARA, CA                              
         DC    AL2(0592),X'01'   PALM SPRINS, CA                                
         DC    AL2(0594),X'01'   OXNARD/VENTURA, CA                             
         DC    AL2(0599),X'02'   WINNEBAGO COUNTY, WI                           
         DC    AL2(0604),X'02'   CENTRAL UPPER MI                               
         DC    AL2(0609),X'02'   NORTHERN MI                                    
         DC    AL2(0611),X'02'   MONMOUTH/OCEAN, NJ                             
         DC    AL2(0617),X'02'   TRAVERSE CITY/CADILLAC, MI                     
         DC    AL2(0618),X'02'   PADUCAH, KY-IL                                 
         DC    AL2(0623),X'02'   FLORENCE, AL                                   
         DC    AL2(0625),X'02'   MYRTLE BEACH, SC                               
         DC    AL2(0626),X'02'   SAN LUIS OBISPO                                
         DC    AL2(0627),X'02'   BANGOR, ME                                     
         DC    AL2(0628),X'02'   ELKHART/GOSHEN, IN                             
         DC    AL2(0630),X'02'   FLORENCE, SC                                   
         DC    AL2(0639),X'02'   CORNING/ELMIRA, NY                             
         DC    AL2(0643),X'02'   SANTA MARIA/LOMPOC                             
         DC    AL2(0650),X'02'   JEFFERSON CITY, MO                             
         DC    AL2(0662),X'02'   BLUEFIELD, WV-VA                               
         DC    AL2(0666),X'02'   BENTON HARBOR, MI                              
         DC    AL2(0668),X'02'   SPRINGFIELD, MO TSA                            
         DC    AL2(0674),X'02'   MORGANTOWN, WV-PA                              
         DC    AL2(0681),X'01'   FAYETTEVILLE, NC                               
         DC    AL2(0683),X'02'   SALISBURY/OCEAN CITY MD-DE                     
         DC    AL2(0685),X'02'   OCALA, FL                                      
         DC    AL2(0692),X'01'   FT. COLLINS, CO                                
         DC    AL2(0693),X'01'   BRIDGEPORT, CT                                 
         DC    AL2(0694),X'02'   FAIRBANKS, AK                                  
         DC    AL2(0703),X'01'   WAUSAU/RHINELANDER, WI                         
         DC    AL2(0713),X'02'   LAREDO, TX                                     
         DC    AL2(0714),X'02'   BANNOCK COUNTY, ID                             
         DC    AL2(0715),X'02'   DOTHAN, AL                                     
         DC    AL2(0716),X'02'   BRECKENRIDGE/VAIL CO                           
         DC    AL2(0717),X'02'   NORTHEASTERN MI                                
         DC    AL2(0720),X'02'   GLENS FALLS, NY                                
         DC    AL2(0722),X'02'   AKRON, OH TSA                                  
         DC    AL2(0729),X'02'   NEW LONDON, CT                                 
         DC    AL2(0734),X'02'   JOPLIN, MO                                     
         DC    AL2(0745),X'02'   MIDDLETOWN, NY                                 
         DC    AL2(0755),X'02'   ORANGE COUNTY, CA                              
         DC    AL2(0776),X'01'   TOPEKA, KS                                     
         DC    AL2(0858),X'02'   LINCOLN, NE                                    
         DC    AL2(0990),X'02'   GRAND JUCTION, CO                              
         DC    AL2(0000),X'02'   BILOXI,/GULFPORT, MS                           
         DC    AL2(0000),X'02'   CHAMPAIGN, IL                                  
         DC    AL2(0000),X'02'   FT. SMITH, AK                                  
         DC    AL2(0000),X'02'   LAKE CHARLES, LA                               
         DC    AL2(0000),X'02'   LIMA, OH                                       
         DC    AL2(0000),X'02'   MARQUETTE, MI                                  
         DC    AL2(0000),X'02'   NEWTON, NJ                                     
         DC    AL2(0000),X'02'   PORTLAND, ME                                   
         DC    AL2(0000),X'02'   SAN ANGELO, TX                                 
BIRRMKX  DC    AL2(0)                                                           
*                                                                               
