*          DATA SET DECALPUTD  AT LEVEL 002 AS OF 11/10/88                      
         TITLE 'DECALPUT INTERFACE BLOCK'                                       
CALPUTD  DSECT                                                                  
PUTDATE  DS    XL3                 START DATE                                   
PUTDPT   DS    CL2                 NTI DAYPART                                  
PUTPCOD  DS    CL2                 NTI PROGRAM CODE                             
PUTSPCL  DS    CL1                 NTI SPECIAL INDICATOR                        
UNIVBASE DS    A        (000)      START OF UNIVS (4 BYTE VALUES)               
*                                   IN DEMDISP ORDER                            
RAWBASE  DS    A        (UNITS)    START OF RAW PUTS (4 BYTE VALUES)            
*                                   IN DEMDISP ORDER                            
PUTBASE  DS    A        (XX.0)     START OF OUTPUT PUTS                         
*                                   4 BYTE VALUES IN DEMDISP ORDER              
