*          DATA SET DECAND3    AT LEVEL 036 AS OF 06/04/02                      
*           NIELSEN CANADIAN TIME PERIOD FILE                                   
*                                                                               
TPDD     DSECT                                                                  
TPDFILE  DS    CL3       1-3       FILE TYPE = C'TPD'                           
TPDYEAR  DS    CL4       4-7       YEAR                                         
TPDWEEK  DS    CL4       8-11      START DATE OF WEEK: MM-DD                    
TPDREPT  DS    CL2       12-13     REPORT NUMBER                                
TPDSEAS  DS    CL5       14-18     SEASON XX/YY                                 
TPDMKT   DS    CL3       19-21     MARKET CODE                                  
TPDSTIM  DS    CL4       22-25     START TIME                                   
TPDNOTE  DS    CL1       26        PROGRAM NOTE: # = T.P HAS PRGS+              
TPDDAY   DS    CL17      27-43     DAY PROGRAM AIRED                            
TPDPNAME DS    CL20      44-63     PROGRAM NAME                                 
TPDSTN   DS    CL4       64-67     STATION CALL LETTERS                         
TPDPPI   DS    CL1       68        PARENT PLUS INDICATOR (+)                    
TPDDUR   DS    CL4       69-72     DURATION                                     
*                                                                               
MAHR     DS    CL4       73-76     METROA(TOR) HHLD RATING                      
MAHS     DS    CL2       77-78     METROA(TOR) HHLD SHARE                       
MBHR     DS    CL4       79-82     METROB(HAM) HHLD RATING                      
MBHS     DS    CL2       83-84     METROB(HAM) HHLD SHARE                       
DHHR     DS    CL4       85-88     DMA HHLD RATING                              
*                                                                               
DHIL35R  DS    CL4       89-92     DMA HHLD INCOME <  35 RATING                 
DHI3575R DS    CL4       93-96     DMA HHLD INCOME 35-75 RATING                 
DHI75R   DS    CL4       97-100    DMA HHLD INCOME >  75 RATING                 
*                                                                               
DV2PS    DS    CL3      101-103    DMA V2+ SHARE                                
DV1849S  DS    CL3      104-106    DMA V1849 SHARE                              
DV2554S  DS    CL3      107-109    DMA V2554 SHARE                              
DCBLHS   DS    CL3      110-112    DMA CABLE HHLD SHARE                         
*                                                                               
DV2PR    DS    CL4      113-116    DMA VIEWERS  2+ RATING                       
DV18PR   DS    CL4      117-120    DMA VIEWERS 18+ RATING                       
DV1834R  DS    CL4      121-124    DMA VIEWERS 18-34 RATING                     
DV1849R  DS    CL4      125-128    DMA VIEWERS 18-49 RATING                     
DV2554R  DS    CL4      129-132    DMA VIEWERS 25-54 RATING                     
DV55PR   DS    CL4      133-136    DMA VIEWERS 55+ RATING                       
DOMPR    DS    CL4      137-140    DMA OMP RATING                               
DW18PR   DS    CL4      141-144    DMA TOTAL WOMEN RATING (W18+)                
DW1834R  DS    CL4      145-148    DMA W18-34 RATING                            
DW1849R  DS    CL4      149-152    DMA W18-49 RATING                            
DW2554R  DS    CL4      153-156    DMA W25-54 RATING                            
DM18PR   DS    CL4      157-160    DMA TOTAL MEN RATING (M18+)                  
DM1834R  DS    CL4      161-164    DMA M18-34 RATING                            
DM1849R  DS    CL4      165-168    DMA M18-49 RATING                            
DM2554R  DS    CL4      169-172    DMA M25-54 RATING                            
DTEENR   DS    CL4      173-176    DMA TEENS 12-17 RATING                       
DCH211R  DS    CL4      177-180    DMA CHILD 2-11 RATING                        
* THE FOLLOWING D..... ADDED IN APR/02                                          
DV2549R  DS    CL4      181-184    DMA VIEWERS 25-49 RATING                     
DV1224R  DS    CL4      185-188    DMA VIEWERS 12-24 RATING                     
DV1234R  DS    CL4      189-192    DMA VIEWERS 12-34 RATING                     
DV1249R  DS    CL4      193-196    DMA VIEWERS 12-49 RATING                     
DV25OR   DS    CL4      197-200    DMA VIEWERS 25+ RATING                       
DV35OR   DS    CL4      201-204    DMA VIEWERS 35+ RATING                       
DV1824R  DS    CL4      205-208    DMA VIEWERS 18-24 RATING                     
DV3554R  DS    CL4      209-212    DMA VIEWERS 35-54 RATING                     
DW2534R  DS    CL4      213-216    DMA WOMEN 25-34 RATING                       
DW3549R  DS    CL4      217-220    DMA WOMEN 35-49 RATING                       
DW3554R  DS    CL4      221-224    DMA WOMEN 35-54 RATING                       
DM3554R  DS    CL4      225-228    DMA MEN 35-54 RATING                         
*                                                                               
STHHJ    DS    CL5      229-233    S.T. HHLD PROJ                               
SHIL35J  DS    CL5      234-238    S.T. HHLD INCOME < 35 PROJ                   
SHI3575J DS    CL5      239-243    S.T. HHLD INCOME 35-75 PROJ                  
SHIG75J  DS    CL5      244-248    S.T. HHLD INCOME 35-75 PROJ                  
SV2PJ    DS    CL5      249-253    S.T. VIEWERS  2+   PROJ                      
SV18PJ   DS    CL5      254-258    S.T. VIEWERS 18+   PROJ                      
SV1834J  DS    CL5      259-263    S.T. VIEWERS 18-34 PROJ                      
SV1849J  DS    CL5      264-268    S.T. VIEWERS 18-34 PROJ                      
SV2554J  DS    CL5      269-273    S.T. VIEWERS 25-54 PROJ                      
SV55PJ   DS    CL5      274-278    S.T. VIEWERS 55+   PROJ                      
SOMPJ    DS    CL5      279-283    S.T. OMP PROJ                                
SW18PJ   DS    CL5      284-288    S.T. TOTAL WOMEN (W18+) PROJ                 
SW1834J  DS    CL5      289-293    S.T. W18-34 PROJ                             
SW1849J  DS    CL5      294-298    S.T. W18-49 PROJ                             
SW2554J  DS    CL5      299-303    S.T. W25-54 PROJ                             
SM18PJ   DS    CL5      304-308    S.T. TOTAL MEN PROJ (M18+)                   
SM1834J  DS    CL5      309-131    S.T. M18-34 PROJ                             
SM1849J  DS    CL5      314-318    S.T. M18-49 PROJ                             
SM2554J  DS    CL5      319-323    S.T. M25-54 PROJ                             
STEENJ   DS    CL5      324-328    S.T. TEENS 12-17 PROJ                        
SCH211J  DS    CL5      329-333    S.T. CHILD  2-11 PROJ                        
*                                                                               
* THE FOLLOWING S..... ADDED IN APR/02                                          
SV2549R  DS    CL5      334-338    S.T. VIEWERS 25-49 RATING                    
SV1224R  DS    CL5      339-343    S.T. VIEWERS 12-24 RATING                    
SV1234R  DS    CL5      344-348    S.T. VIEWERS 12-34 RATING                    
SV1249R  DS    CL5      349-353    S.T. VIEWERS 12-49 RATING                    
SV25OR   DS    CL5      354-358    S.T. VIEWERS 25+ RATING                      
SV35OR   DS    CL5      359-363    S.T. VIEWERS 35+ RATING                      
SV1824R  DS    CL5      364-368    S.T. VIEWERS 18-24 RATING                    
SV3554R  DS    CL5      369-373    S.T. VIEWERS 35-54 RATING                    
SW2534R  DS    CL5      374-378    S.T. WOMEN 25-34 RATING                      
SW3549R  DS    CL5      379-383    S.T. WOMEN 35-49 RATING                      
SW3554R  DS    CL5      384-388    S.T. WOMEN 35-54 RATING                      
SM3554R  DS    CL5      389-393    S.T. MEN 35-54 RATING                        
