*          DATA SET DECAND2    AT LEVEL 034 AS OF 06/05/98                      
*           NIELSEN CANADIAN TIME PERIOD FILE                                   
*                                                                               
TPDD     DSECT                                                                  
TPDFILE  DS    CL3       1-3       FILE TYPE = C'TPD'                           
TPDYEAR  DS    CL4       4-7       YEAR                                         
TPDWEEK  DS    CL4       8-11      START DATE OF WEEK: MM-DD                    
TPDREPT  DS    CL2       12-13     REPORT NUMBER                                
TPDSEAS  DS    CL5       14-18     SEASON XX/YY                                 
TPDMKT   DS    CL3       19-21     MARKET CODE                                  
TPDSTIM  DS    CL4       22-25     START TIME                                   
TPDNOTE  DS    CL1       26        PROGRAM NOTE: # = T.P HAS PRGS+              
TPDDAY   DS    CL17      27-43     DAY PROGRAM AIRED                            
TPDPNAME DS    CL20      44-63     PROGRAM NAME                                 
TPDSTN   DS    CL4       64-67     STATION CALL LETTERS                         
TPDPPI   DS    CL1       68        PARENT PLUS INDICATOR (+)                    
TPDDUR   DS    CL4       69-72     DURATION                                     
*                                                                               
MAHR     DS    CL4       73-76     METROA(TOR) HHLD RATING                      
MAHS     DS    CL2       77-78     METROA(TOR) HHLD SHARE                       
MBHR     DS    CL4       79-82     METROB(HAM) HHLD RATING                      
MBHS     DS    CL2       83-84     METROB(HAM) HHLD SHARE                       
DHHR     DS    CL4       85-88     DMA HHLD RATING                              
*                                                                               
DHIL35R  DS    CL4       89-92     DMA HHLD INCOME <  35 RATING                 
DHI3575R DS    CL4       93-96     DMA HHLD INCOME 35-75 RATING                 
DHI75R   DS    CL4       97-100    DMA HHLD INCOME >  75 RATING                 
*                                                                               
DV2PS    DS    CL3      101-103    DMA V2+ SHARE                                
DV1849S  DS    CL3      104-106    DMA V1849 SHARE                              
DV2554S  DS    CL3      107-109    DMA V2554 SHARE                              
DCBLHS   DS    CL3      110-112    DMA CABLE HHLD SHARE                         
*                                                                               
DV2PR    DS    CL4      113-116    DMA VIEWERS  2+ RATING                       
DV18PR   DS    CL4      117-120    DMA VIEWERS 18+ RATING                       
DV1834R  DS    CL4      121-124    DMA VIEWERS 18-34 RATING                     
DV1849R  DS    CL4      125-128    DMA VIEWERS 18-49 RATING                     
DV2554R  DS    CL4      129-132    DMA VIEWERS 25-54 RATING                     
DV55PR   DS    CL4      133-136    DMA VIEWERS 55+ RATING                       
DOMPR    DS    CL4      137-140    DMA OMP RATING                               
DW18PR   DS    CL4      141-144    DMA TOTAL WOMEN RATING (W18+)                
DW1834R  DS    CL4      145-148    DMA W18-34 RATING                            
DW1849R  DS    CL4      149-152    DMA W18-49 RATING                            
DW2554R  DS    CL4      153-156    DMA W25-54 RATING                            
DM18PR   DS    CL4      157-160    DMA TOTAL MEN RATING (M18+)                  
DM1834R  DS    CL4      161-164    DMA M18-34 RATING                            
DM1849R  DS    CL4      165-168    DMA M18-49 RATING                            
DM2554R  DS    CL4      169-172    DMA M25-54 RATING                            
DTEENR   DS    CL4      173-176    DMA TEENS 12-17 RATING                       
DCH211R  DS    CL4      177-180    DMA CHILD 2-11 RATING                        
*                                                                               
STHHJ    DS    CL5      181-185    S.T. HHLD PROJ                               
SHIL35J  DS    CL5      186-190    S.T. HHLD INCOME < 35 PROJ                   
SHI3575J DS    CL5      191-195    S.T. HHLD INCOME 35-75 PROJ                  
SHIG75J  DS    CL5      196-200    S.T. HHLD INCOME 35-75 PROJ                  
SV2PJ    DS    CL5      201-205    S.T. VIEWERS  2+   PROJ                      
SV18PJ   DS    CL5      206-210    S.T. VIEWERS 18+   PROJ                      
SV1834J  DS    CL5      211-215    S.T. VIEWERS 18-34 PROJ                      
SV1849J  DS    CL5      216-220    S.T. VIEWERS 18-34 PROJ                      
SV2554J  DS    CL5      221-225    S.T. VIEWERS 25-54 PROJ                      
SV55PJ   DS    CL5      226-230    S.T. VIEWERS 55+   PROJ                      
SOMPJ    DS    CL5      231-235    S.T. OMP PROJ                                
SW18PJ   DS    CL5      236-240    S.T. TOTAL WOMEN (W18+) PROJ                 
SW1834J  DS    CL5      241-245    S.T. W18-34 PROJ                             
SW1849J  DS    CL5      246-250    S.T. W18-49 PROJ                             
SW2554J  DS    CL5      251-255    S.T. W25-54 PROJ                             
SM18PJ   DS    CL5      256-260    S.T. TOTAL MEN PROJ (M18+)                   
SM1834J  DS    CL5      261-265    S.T. M18-34 PROJ                             
SM1849J  DS    CL5      266-270    S.T. M18-49 PROJ                             
SM2554J  DS    CL5      271-275    S.T. M25-54 PROJ                             
STEENJ   DS    CL5      276-280    S.T. TEENS 12-17 PROJ                        
SW1217J  DS    CL5      281-285    S.T. W1217 PROJ                              
SCH211J  DS    CL5      286-290    S.T. CHILD  2-11 PROJ                        
*                                                                               
