*          DATA SET DECABSEQUS AT LEVEL 020 AS OF 11/19/99                      
*                                                                               
*  ALWAYS COPY THIS TABLE FROM DECABLEQU IF YOU WANT TO CHANGE IT.              
*  THEN ZAP THE CABLE STATION NAMES. THIS IS TEMPORARY SOLUTION                 
*  BECAUSE DEGET HAS GOTTEN TO BE TO BIG.                                       
*                                                                               
*                                                                               
*  EACH TABLE ENTRY CONSISTS OF                                                 
*        DS    CL4       4-CHAR CALL LETTERS                                    
*        DS    AL2       2-BYTE STATION CODE                                    
*                                                                               
CBLEQU   DS    0CL(CBLEQUX-CBLEQUW)                                             
*                                                                               
** DDS EQUATES TO SUPPORT OLD CABLE CALL LETTERS                                
*                                                                               
         DC    CL4'WTBS',AL2(5830)                                              
         DC    CL4'TBS ',AL2(5830)                                              
         DC    CL4'USA ',AL2(6217)                                              
         DC    CL4'CMD ',AL2(7133)                                              
         DC    CL4'CMT ',AL2(6647)                                              
         DC    CL4'DSC ',AL2(6530)                                              
         DC    CL4'CART',AL2(7241)                                              
** NON-PAY                                                                      
         DC    CL4'AEN ',AL2(6218)                                              
         DC    CL4'ATVP',AL2(6558)                                              
         DC    CL4'AMC ',AL2(6593)                                              
         DC    CL4'APL ',AL2(6605)                                              
         DC    CL4'ASN ',AL2(6493)                                              
         DC    CL4'BET ',AL2(6200)                                              
         DC    CL4'BRVO',AL2(6526)                                              
         DC    CL4'CSPN',AL2(6203)                                              
         DC    CL4'SPAN',AL2(6220)                                              
         DC    CL4'CNN ',AL2(6202)                                              
         DC    CL4'CTN ',AL2(6529)                                              
         DC    CL4'CALS',AL2(7247)                                              
         DC    CL4'CBC ',AL2(6533)                                              
         DC    CL4'CANA',AL2(6524)                                              
         DC    CL4'CHLA',AL2(7224)                                              
         DC    CL4'CLTV',AL2(7255)                                              
         DC    CL4'CNBC',AL2(6521)                                              
         DC    CL4'CMDY',AL2(7133)                                              
         DC    CL4'CMAC',AL2(6645)                                              
         DC    CL4'CMTV',AL2(6647)                                              
         DC    CL4'CRT ',AL2(7183)                                              
         DC    CL4'CV  ',AL2(7130)                                              
         DC    CL4'DISC',AL2(6530)                                              
         DC    CL4'ENT ',AL2(6384)                                              
         DC    CL4'EDAC',AL2(6659)                                              
         DC    CL4'EPJR',AL2(6538)                                              
         DC    CL4'EPG ',AL2(6660)                                              
         DC    CL4'EMP ',AL2(6900)                                              
         DC    CL4'ENC ',AL2(7167)                                              
         DC    CL4'ESPN',AL2(6204)                                              
         DC    CL4'ESPB',AL2(6537)                                              
         DC    CL4'ESP2',AL2(7287)                                              
         DC    CL4'EWN ',AL2(6655)                                              
         DC    CL4'TFN ',AL2(6622)                                              
         DC    CL4'FLIX',AL2(7248)                                              
         DC    CL4'FOOD',AL2(7304)                                              
         DC    CL4'FX  ',AL2(7328)                                              
         DC    CL4'FXNC',AL2(7401)                                              
         DC    CL4'GALA',AL2(6517)                                              
         DC    CL4'GAME',AL2(7099)                                              
         DC    CL4'GENS',AL2(6566)                                              
         DC    CL4'GVAC',AL2(6665)                                              
         DC    CL4'GARD',AL2(6664)                                              
         DC    CL4'HGTV',AL2(8920)                                              
         DC    CL4'HITS',AL2(6667)                                              
         DC    CL4'HITV',AL2(6494)                                              
         DC    CL4'HLN ',AL2(6199)                                              
         DC    CL4'HLTH',AL2(6666)                                              
         DC    CL4'HMTM',AL2(6572)                                              
         DC    CL4'HSE ',AL2(6592)                                              
         DC    CL4'HSN1',AL2(6534)                                              
         DC    CL4'HSN2',AL2(6695)                                              
         DC    CL4'ICN ',AL2(6549)                                              
         DC    CL4'INTL',AL2(7165)                                              
         DC    CL4'ITN ',AL2(6197)                                              
         DC    CL4'KBLN',AL2(6211)                                              
         DC    CL4'KBL ',AL2(7163)                                              
         DC    CL4'KCBL',AL2(7098)                                              
         DC    CL4'KFB ',AL2(7271)                                              
         DC    CL4'LSAC',AL2(6672)                                              
         DC    CL4'LIF ',AL2(6196)                                              
         DC    CL4'LMT ',AL2(6381)                                              
         DC    CL4'LOC ',AL2(6589)                                              
         DC    CL4'LOV ',AL2(6590)                                              
         DC    CL4'SWSH',AL2(6612)                                              
         DC    CL4'MSG ',AL2(6207)                                              
         DC    CL4'MNPR',AL2(6618)                                              
         DC    CL4'RCNG',AL2(6634)                                              
         DC    CL4'MTRO',AL2(6674)                                              
         DC    CL4'MSC ',AL2(6213)                                              
         DC    CL4'MLAC',AL2(6617)                                              
         DC    CL4'MEU ',AL2(6479)                                              
         DC    CL4'MSG2',AL2(7187)                                              
         DC    CL4'MSNB',AL2(7801)                                              
         DC    CL4'FM  ',AL2(6662)                                              
         DC    CL4'MTV ',AL2(6198)                                              
         DC    CL4'NJT ',AL2(6623)                                              
         DC    CL4'NETW',AL2(6569)                                              
         DC    CL4'NECN',AL2(7220)                                              
         DC    CL4'NESN',AL2(6574)                                              
         DC    CL4'INSP',AL2(6632)                                              
         DC    CL4'NWS ',AL2(6625)                                              
         DC    CL4'RAI ',AL2(6480)                                              
         DC    CL4'NLI ',AL2(6377)                                              
         DC    CL4'NCH ',AL2(7197)                                              
         DC    CL4'NICK',AL2(6212)                                              
         DC    CL4'NTN ',AL2(6532)                                              
         DC    CL4'ENA ',AL2(7182)                                              
         DC    CL4'NY1 ',AL2(7238)                                              
         DC    CL4'ODSY',AL2(6485)                                              
         DC    CL4'OTB ',AL2(6628)                                              
         DC    CL4'PENN',AL2(6573)                                              
         DC    CL4'PPR ',AL2(6547)                                              
         DC    CL4'PREV',AL2(6477)                                              
         DC    CL4'PSNW',AL2(6575)                                              
         DC    CL4'PSU ',AL2(6901)                                              
         DC    CL4'PSMW',AL2(7052)                                              
         DC    CL4'PSRM',AL2(7050)                                              
         DC    CL4'PSUM',AL2(7051)                                              
         DC    CL4'PMTK',AL2(6527)                                              
         DC    CL4'PRSM',AL2(6515)                                              
         DC    CL4'PASS',AL2(6675)                                              
         DC    CL4'PGGD',AL2(6630)                                              
         DC    CL4'PMCH',AL2(6657)                                              
         DC    CL4'PBAC',AL2(6629)                                              
         DC    CL4'QVC ',AL2(6951)                                              
         DC    CL4'QVCF',AL2(7196)                                              
         DC    CL4'RLES',AL2(6602)                                              
         DC    CL4'RELG',AL2(6599)                                              
         DC    CL4'RI2 ',AL2(6690)                                              
         DC    CL4'RI1 ',AL2(6689)                                              
         DC    CL4'SLA ',AL2(6597)                                              
         DC    CL4'SPC ',AL2(6698)                                              
         DC    CL4'SCIF',AL2(7235)                                              
         DC    CL4'SRCN',AL2(6610)                                              
         DC    CL4'SCGO',AL2(6637)                                              
         DC    CL4'SKPV',AL2(7225)                                              
         DC    CL4'SCO ',AL2(6661)                                              
         DC    CL4'SCP ',AL2(6389)                                              
         DC    CL4'SCB ',AL2(7033)                                              
         DC    CL4'SCC ',AL2(6609)                                              
         DC    CL4'SCA ',AL2(6488)                                              
         DC    CL4'SPH ',AL2(7034)                                              
         DC    CL4'SPTR',AL2(6587)                                              
         DC    CL4'SPSN',AL2(7067)                                              
         DC    CL4'SPTS',AL2(6608)                                              
         DC    CL4'SCPC',AL2(7222)                                              
         DC    CL4'SCCI',AL2(7036)                                              
         DC    CL4'SCNE',AL2(6668)                                              
         DC    CL4'SCF ',AL2(6535)                                              
         DC    CL4'SCNY',AL2(6607)                                              
         DC    CL4'SUN ',AL2(6651)                                              
         DC    CL4'SYS ',AL2(6564)                                              
         DC    CL4'TPCH',AL2(6613)                                              
         DC    CL4'TBSC',AL2(7237)                                              
         DC    CL4'TELB',AL2(6615)                                              
         DC    CL4'TMND',AL2(6536)                                              
         DC    CL4'TEST',AL2(6616)                                              
         DC    CL4'TOON',AL2(7241)                                              
         DC    CL4'FAM ',AL2(6201)                                              
         DC    CL4'TLC ',AL2(6635)                                              
         DC    CL4'TNN ',AL2(6221)                                              
         DC    CL4'SLNT',AL2(6565)                                              
         DC    CL4'TRVL',AL2(6678)                                              
         DC    CL4'TWC ',AL2(6523)                                              
         DC    CL4'TM  ',AL2(6649)                                              
         DC    CL4'TMSP',AL2(6641)                                              
         DC    CL4'TVV ',AL2(7068)                                              
         DC    CL4'TBN ',AL2(6614)                                              
         DC    CL4'TNT ',AL2(6390)                                              
         DC    CL4'TVL ',AL2(7838)    TV LAND                                   
         DC    CL4'UNIV',AL2(6209)                                              
         DC    CL4'USAB',AL2(6650)                                              
         DC    CL4'USAN',AL2(6217)                                              
         DC    CL4'VH1 ',AL2(6546)                                              
         DC    CL4'JUKE',AL2(6091)                                              
***      DC    CL4'VISN',AL2(6485)        6485 IS NOW ODSY 4/99                 
         DC    CL4'WCWX',AL2(6214)                                              
         DC    CL4'WX  ',AL2(6654)                                              
         DC    CL4'WGRC',AL2(5599)                                              
         DC    CL4'XPRE',AL2(6267)                                              
         DC    CL4'XHIS',AL2(8908)                                              
         DC    CL4'WGNC',AL2(6788)                                              
*                                                                               
** PAY                                                                          
*                                                                               
         DC    CL4'CMAX',AL2(6513)                                              
         DC    CL4'HBO ',AL2(6510)                                              
         DC    CL4'ITV ',AL2(6387)                                              
         DC    CL4'JADE',AL2(6594)                                              
         DC    CL4'NGN ',AL2(6582)                                              
         DC    CL4'PLBY',AL2(6525)                                              
         DC    CL4'RPT ',AL2(6047)                                              
         DC    CL4'SHOW',AL2(6511)                                              
         DC    CL4'SPCE',AL2(7058)                                              
         DC    CL4'DSNY',AL2(6522)                                              
         DC    CL4'TMC ',AL2(6514)                                              
*                                                                               
** PAY PER VIEW                                                                 
*                                                                               
         DC    CL4'CVS ',AL2(7065)                                              
         DC    CL4'VCH3',AL2(7256)                                              
         DC    CL4'VCH2',AL2(6570)                                              
         DC    CL4'PPV ',AL2(6598)                                              
         DC    CL4'REQ1',AL2(6604)                                              
         DC    CL4'REQ2',AL2(6518)                                              
CBLEQUW  DC    CL4'VCH1',AL2(6595)                                              
         SPACE 1                                                                
CBLEQUX  DC    X'FF'                                                            
