*          DATA SET DECANSEQU  AT LEVEL 003 AS OF 10/01/03                      
* DDS CALL LETTERS    = CURRENT CALL LETTERS PASSED TO DEMO SYSTEM              
* DDS ALPHA MARKET    = ALPHA THAT STATION BELONGS TO                           
* BBM CALL LETTERS    = BBM CALL LETTERS ON DEMO FILE                           
* BBM MARKET NUMBER   = BBM MARKET NUMBER ON DEMO FILE                          
* CSI CALL LETTERS    = CSI CALL LETTERS ON DEMO FILE                           
* CSI MARKET NUMBER   = CSI MARKET ON DEMO FILE                                 
         DC    C'ACBR',C'CBR',C'ASN ',AL2(0041),C'ASN ',AL2(9999)  ASN          
         DC    C'ACHA',C'CHA',C'ASN ',AL2(1021),C'ASN ',AL2(0434)  ASN          
         DC    C'AGRF',C'GRF',C'ASN ',AL2(0060),C'ASN ',AL2(9999)  ASN          
         DC    C'AHAL',C'HAL',C'ASN ',AL2(2080),C'ASN ',AL2(0430)  ASN          
         DC    C'ASJM',C'SJM',C'ASN ',AL2(3011),C'ASN ',AL2(0431)  ASN          
         DC    C'ASJN',C'SJN',C'ASN ',AL2(0009),C'ASN ',AL2(0433)  ASN          
         DC    C'ASN ',C'   ',C'ASN ',AL2(0000),C'ASN ',AL2(0477)  ASN          
         DC    C'ASYD',C'SYD',C'ASN ',AL2(2010),C'ASN ',AL2(0432)  ASN          
         DC    C'ATCH',C'CHA',C'CJCH',AL2(1021),C'    ',AL2(0000)  DDS          
         DC    C'BBLT',C'BAR',C'CBLT',AL2(0000),C'    ',AL2(0000)  DDS          
         DC    C'BFTO',C'BAR',C'CFTO',AL2(5243),C'    ',AL2(0000)  DDS          
         DC    C'BRAV',C'VAN',C'BVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'CBC ',C'TOR',C'    ',AL2(0000),C'CBC ',AL2(0000)  TORO         
         DC    C'CBLT',C'TOR',C'    ',AL2(0000),C'CBLT',AL2(0000)  TORO         
         DC    C'CBNW',C'VAN',C'NVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'CBRT',C'CAL',C'    ',AL2(0000),C'CBRT',AL2(0000)  CALG         
         DC    C'CBUT',C'VAN',C'    ',AL2(0000),C'CBUT',AL2(0000)  VACO         
         DC    C'CFCN',C'CAL',C'    ',AL2(0000),C'CFCN',AL2(0000)  CALG         
         DC    C'CFMT',C'TOR',C'    ',AL2(0000),C'CFMT',AL2(0000)  TORO         
         DC    C'CFTO',C'TOR',C'    ',AL2(0000),C'CFTO',AL2(0000)  TORO         
         DC    C'CHCH',C'TOR',C'    ',AL2(0000),C'CHCH',AL2(0000)  TORO         
         DC    C'CHEK',C'VAN',C'    ',AL2(0000),C'CHEK',AL2(0000)  VACO         
         DC    C'CIHM',C'SJM',C'CIHF',AL2(3011),C'    ',AL2(0000)  DDS          
         DC    C'CITY',C'TOR',C'    ',AL2(0000),C'CITY',AL2(0000)  TORO         
         DC    C'CIVI',C'VAN',C'    ',AL2(0000),C'CIVI',AL2(0000)  VACO         
         DC    C'CIVT',C'VAN',C'    ',AL2(0000),C'CIVT',AL2(0000)  VACO         
         DC    C'CKAL',C'CAL',C'    ',AL2(0000),C'CKAL',AL2(0000)  CALG         
         DC    C'CKCO',C'TOR',C'    ',AL2(0000),C'CKCO',AL2(0000)  TORO         
         DC    C'CKNO',C'VAN',C'    ',AL2(0000),C'CKNO',AL2(0000)  VACO         
         DC    C'CKVR',C'TOR',C'    ',AL2(0000),C'CKVR',AL2(0000)  TORO         
         DC    C'CMT ',C'VAN',C'YXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'COME',C'VAN',C'CXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'CP24',C'TOR',C'    ',AL2(0000),C'CP24',AL2(0000)  TORO         
         DC    C'CSN ',C'VAN',C'JXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'CTS ',C'TOR',C'    ',AL2(0000),C'CTS ',AL2(0000)  TORO         
         DC    C'CTV ',C'TOR',C'    ',AL2(0000),C'CTV ',AL2(0000)  TORO         
         DC    C'DISC',C'TOR',C'    ',AL2(0000),C'DISC',AL2(0000)  TORO         
         DC    C'DSCY',C'VAN',C'DVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'DXBA',C'BAR',C'CKVR',AL2(0000),C'    ',AL2(0000)  DDS          
         DC    C'DXKI',C'KIN',C'CHRO',AL2(5109),C'    ',AL2(0000)  DDS          
         DC    C'DXKL',C'KTL',C'CFPL',AL2(5336),C'    ',AL2(0000)  DDS          
         DC    C'DXKT',C'KIT',C'CFPL',AL2(5339),C'    ',AL2(0000)  DDS          
         DC    C'DXLO',C'LON',C'CFPL',AL2(0000),C'    ',AL2(0000)  DDS          
         DC    C'DXOE',C'OTA',C'CHRO',AL2(5071),C'    ',AL2(0000)  DDS          
         DC    C'DXPE',C'PET',C'CKVR',AL2(5159),C'    ',AL2(0000)  DDS          
         DC    C'DXTO',C'TOR',C'CKVR',AL2(5199),C'    ',AL2(0000)  DDS          
         DC    C'DXWI',C'WND',C'CFPL',AL2(5409),C'    ',AL2(0000)  DDS          
         DC    C'ECAL',C'CAL',C'ACCE',AL2(8069),C'    ',AL2(0000)  DDS          
         DC    C'EEDM',C'EDM',C'ACCE',AL2(0000),C'    ',AL2(0000)  DDS          
         DC    C'ERED',C'RED',C'ACCE',AL2(8078),C'    ',AL2(0000)  DDS          
         DC    C'FAIR',C'VAN',C'KVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'FXBA',C'BAR',C'CFMT',AL2(5243),C'CFMT',AL2(0000)  CFMT         
         DC    C'FXKI',C'KIN',C'CFMT',AL2(5109),C'CFMT',AL2(0000)  CFMT         
         DC    C'FXKL',C'KTL',C'CFMT',AL2(5339),C'CFMT',AL2(0000)  CFMT         
         DC    C'FXKT',C'KIT',C'CFMT',AL2(5336),C'CFMT',AL2(0000)  CFMT         
         DC    C'FXLO',C'LON',C'CFMT',AL2(5369),C'CFMT',AL2(0000)  CFMT         
         DC    C'FXOE',C'OTA',C'CFMT',AL2(5071),C'CFMT',AL2(0000)  CFMT         
         DC    C'FXPE',C'PET',C'CFMT',AL2(5159),C'CFMT',AL2(0000)  CFMT         
         DC    C'FXTO',C'TOR',C'CFMT',AL2(5199),C'CFMT',AL2(0000)  CFMT         
         DC    C'FXVA',C'VAN',C'FOO ',AL2(9109),C'FOO ',AL2(0490)  FOOD         
         DC    C'GBAR',C'BAR',C'CIII',AL2(5243),C'CIII',AL2(0457)  GLOB         
         DC    C'GBRA',C'BRA',C'CIII',AL2(6061),C'CIII',AL2(9999)  GLOB         
         DC    C'GHAM',C'HAM',C'CIII',AL2(5269),C'CIII',AL2(9999)  GLOB         
         DC    C'GKIN',C'KIN',C'CIII',AL2(5109),C'CIII',AL2(0454)  GLOB         
         DC    C'GKIT',C'KIT',C'CIII',AL2(5339),C'CIII',AL2(0447)  GLOB         
         DC    C'GKTL',C'KTL',C'CIII',AL2(5336),C'CIII',AL2(0000)  GLOB         
         DC    C'GLON',C'LON',C'CIII',AL2(5369),C'CIII',AL2(0445)  GLOB         
         DC    C'GOTT',C'OTT',C'CIII',AL2(5069),C'CIII',AL2(0444)  GLOB         
         DC    C'GPET',C'PET',C'CIII',AL2(5159),C'CIII',AL2(0456)  GLOB         
         DC    C'GPTK',C'PTK',C'CIII',AL2(9341),C'CIII',AL2(9999)  GLOB         
         DC    C'GSSM',C'SSM',C'CIII',AL2(5531),C'CIII',AL2(0495)  GLOB         
         DC    C'GSTN',C'STN',C'CIII',AL2(5479),C'CIII',AL2(0446)  GLOB         
         DC    C'GSUD',C'SUD',C'CIII',AL2(5479),C'CIII',AL2(0446)  GLOB         
         DC    C'GTIM',C'TIM',C'CIII',AL2(9999),C'CIII',AL2(0446)  GLOB         
         DC    C'GTOR',C'TOR',C'CIII',AL2(5199),C'CIII',AL2(0440)  GLOB         
         DC    C'GVIC',C'VIC',C'CIII',AL2(9119),C'CIII',AL2(9999)  GLOB         
         DC    C'GWIN',C'WIN',C'CIII',AL2(5441),C'CIII',AL2(0458)  GLOB         
         DC    C'GWND',C'WND',C'CIII',AL2(5409),C'CIII',AL2(0459)  GLOB         
         DC    C'HIST',C'VAN',C'HXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'HSN ',C'VAN',C'JVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'ICHA',C'CHA',C'CIHF',AL2(1021),C'CIHF',AL2(0434)  CIHF         
         DC    C'IHAL',C'HAL',C'CIHF',AL2(2080),C'CIHF',AL2(0430)  CIHF         
         DC    C'IMAR',C'MAR',C'CIHF',AL2(9999),C'CIHF',AL2(0477)  CIHF         
         DC    C'ISJM',C'SJM',C'CIHF',AL2(3011),C'CIHF',AL2(0431)  CIHF         
         DC    C'ISYD',C'SYD',C'CIHF',AL2(2010),C'CIHF',AL2(9999)  CIHF         
         DC    C'IXBA',C'BAR',C'CITY',AL2(5243),C'CITY',AL2(0457)  CITY         
         DC    C'IXHM',C'HAM',C'CITY',AL2(5269),C'CITY',AL2(0000)  CITY         
         DC    C'IXKI',C'KIN',C'CITY',AL2(5109),C'CITY',AL2(0000)  CITY         
         DC    C'IXKL',C'KTL',C'CITY',AL2(5336),C'CITY',AL2(0000)  CITY         
         DC    C'IXKT',C'KIT',C'CITY',AL2(5339),C'CITY',AL2(0447)  CITY         
         DC    C'IXLO',C'LON',C'CITY',AL2(5369),C'CITY',AL2(0445)  CITY         
         DC    C'IXOE',C'OTA',C'CITY',AL2(5071),C'CITY',AL2(0000)  CITY         
         DC    C'IXOT',C'OTF',C'CITY',AL2(5069),C'CITY',AL2(0444)  CITY         
         DC    C'IXPE',C'PET',C'CITY',AL2(5159),C'CITY',AL2(0000)  CITY         
         DC    C'IXSN',C'SUD',C'CITY',AL2(5511),C'CITY',AL2(0000)  CITY         
         DC    C'IXTO',C'TOR',C'CITY',AL2(5199),C'CITY',AL2(0000)  CITY         
         DC    C'IXWI',C'WND',C'CITY',AL2(5144),C'CITY',AL2(0440)  CITY         
         DC    C'KAYU',C'CAL',C'    ',AL2(0000),C'KAYU',AL2(0000)  CALG         
         DC    C'KBLN',C'KIT',C'CBLN',AL2(5339),C'    ',AL2(0000)  DDS          
         DC    C'KCPQ',C'VAN',C'    ',AL2(0000),C'KCPQ',AL2(0000)  VACO         
         DC    C'KCTS',C'VAN',C'    ',AL2(0000),C'KCTS',AL2(0000)  VACO         
         DC    C'KHQ ',C'CAL',C'    ',AL2(0000),C'KHQ ',AL2(0000)  CALG         
         DC    C'KING',C'VAN',C'    ',AL2(0000),C'KING',AL2(0000)  VACO         
         DC    C'KIRO',C'VAN',C'    ',AL2(0000),C'KIRO',AL2(0000)  VACO         
         DC    C'KJOH',C'KIN',C'CJOH',AL2(5109),C'    ',AL2(0000)  DDS          
         DC    C'KKCO',C'KIT',C'CKCO',AL2(0000),C'    ',AL2(0000)  DDS          
         DC    C'KLCO',C'KTL',C'CKCO',AL2(5336),C'    ',AL2(0000)  DDS          
         DC    C'KLLN',C'KTL',C'CBLN',AL2(5336),C'    ',AL2(0000)  DDS          
         DC    C'KOMO',C'VAN',C'    ',AL2(0000),C'KOMO',AL2(0000)  VACO         
         DC    C'KREM',C'CAL',C'    ',AL2(0000),C'KREM',AL2(0000)  CALG         
         DC    C'KSPS',C'CAL',C'    ',AL2(0000),C'KSPS',AL2(0000)  CALG         
         DC    C'KSTW',C'VAN',C'    ',AL2(0000),C'KSTW',AL2(0000)  VACO         
         DC    C'KVOS',C'VAN',C'    ',AL2(0000),C'KVOS',AL2(0000)  VACO         
         DC    C'KXLY',C'CAL',C'    ',AL2(0000),C'KXLY',AL2(0000)  CALG         
         DC    C'LBLN',C'LON',C'CBLN',AL2(0000),C'    ',AL2(0000)  DDS          
         DC    C'LFCN',C'   ',C'CFCN',AL2(0000),C'    ',AL2(0000)  DDS          
         DC    C'LIFE',C'VAN',C'LVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'LKCO',C'LON',C'CKCO',AL2(5369),C'    ',AL2(0000)  DDS          
         DC    C'LXVA',C'VAN',C'TLC ',AL2(9109),C'TLC ',AL2(0490)  TLC          
         DC    C'MMM ',C'VAN',C'QXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'MUCH',C'VAN',C'MVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'NWS ',C'VAN',C'NXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'OCHN',C'OKA',C'CHAN',AL2(9071),C'    ',AL2(0000)  DDS          
         DC    C'OIVT',C'OKA',C'CIVT',AL2(9071),C'    ',AL2(0000)  DDS          
         DC    C'OJOH',C'OTA',C'CJOH',AL2(5071),C'    ',AL2(0000)  DDS          
         DC    C'OLN ',C'VAN',C'UXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'OXBA',C'BAR',C'CHCH',AL2(5243),C'CHCH',AL2(0457)  CHCH         
         DC    C'OXHM',C'HAM',C'CHCH',AL2(5269),C'CHCH',AL2(0000)  CHCH         
         DC    C'OXKL',C'KTL',C'CHCH',AL2(5336),C'CHCH',AL2(0000)  CHCH         
         DC    C'OXKT',C'KIT',C'CHCH',AL2(5339),C'CHCH',AL2(0447)  CHCH         
         DC    C'OXLO',C'LON',C'CHCH',AL2(5369),C'CHCH',AL2(0445)  CHCH         
         DC    C'OXOT',C'OTT',C'CHCH',AL2(5069),C'CHCH',AL2(0444)  CHCH         
         DC    C'OXPE',C'PET',C'CHCH',AL2(5159),C'CHCH',AL2(0000)  CHCH         
         DC    C'OXSN',C'SUD',C'CHCH',AL2(5479),C'CHCH',AL2(0000)  CHCH         
         DC    C'OXST',C'SSM',C'CHCH',AL2(5511),C'CHCH',AL2(0000)  CHCH         
         DC    C'OXSU',C'SUD',C'CHCH',AL2(5479),C'CHCH',AL2(0000)  CHCH         
         DC    C'OXTO',C'TOR',C'CHCH',AL2(5199),C'CHCH',AL2(0440)  CHCH         
         DC    C'PFTO',C'PET',C'CFTO',AL2(5159),C'    ',AL2(0000)  DDS          
         DC    C'PRME',C'VAN',C'PXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'RITV',C'RED',C'CITV',AL2(8078),C'    ',AL2(0000)  DDS          
         DC    C'SCAL',C'CAL',C'TSN ',AL2(9999),C'TSN ',AL2(0484)  TSN          
         DC    C'SCHA',C'CHA',C'TSN ',AL2(9999),C'TSN ',AL2(0434)  TSN          
         DC    C'SEDM',C'EDM',C'TSN ',AL2(9999),C'TSN ',AL2(0482)  TSN          
         DC    C'SHAL',C'HAL',C'TSN ',AL2(9999),C'TSN ',AL2(0430)  TSN          
         DC    C'SHOW',C'VAN',C'HVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'SKEN',C'KEN',C'TSN ',AL2(9999),C'TSN ',AL2(0435)  TSN          
         DC    C'SKIL',C'KIL',C'TSN ',AL2(9999),C'TSN ',AL2(0491)  TSN          
         DC    C'SKIT',C'KIT',C'TSN ',AL2(9999),C'TSN ',AL2(0447)  TSN          
         DC    C'SLON',C'LON',C'TSN ',AL2(9999),C'TSN ',AL2(0445)  TSN          
         DC    C'SLTH',C'LTH',C'TSN ',AL2(9999),C'TSN ',AL2(0480)  TSN          
         DC    C'SMAR',C'MAR',C'TSN ',AL2(9999),C'TSN ',AL2(0477)  TSN          
         DC    C'SOTT',C'OTT',C'TSN ',AL2(9999),C'TSN ',AL2(0444)  TSN          
         DC    C'SPAC',C'VAN',C'SXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'SPNO',C'TOR',C'    ',AL2(0000),C'SPNO',AL2(0000)  TORO         
         DC    C'SPNP',C'VAN',C'    ',AL2(0000),C'SPNP',AL2(0000)  VACO         
         DC    C'SRCL',C'CAR',C'CBAF',AL2(3111),C'    ',AL2(0000)  DDS          
         DC    C'SREG',C'REG',C'TSN ',AL2(9999),C'TSN ',AL2(0471)  TSN          
         DC    C'SSAS',C'SAS',C'TSN ',AL2(9999),C'TSN ',AL2(0474)  TSN          
         DC    C'SSJN',C'SJN',C'TSN ',AL2(9999),C'TSN ',AL2(0433)  TSN          
         DC    C'SSSM',C'SSM',C'TSN ',AL2(9999),C'TSN ',AL2(0460)  TSN          
         DC    C'SSUD',C'SUD',C'TSN ',AL2(9999),C'TSN ',AL2(0495)  TSN          
         DC    C'SSYD',C'SYD',C'TSN ',AL2(9999),C'TSN ',AL2(0432)  TSN          
         DC    C'STHB',C'THB',C'TSN ',AL2(9999),C'TSN ',AL2(0461)  TSN          
         DC    C'STOR',C'TOR',C'TSN ',AL2(5199),C'TSN ',AL2(0440)  TSN          
         DC    C'SVAN',C'VAN',C'TSN ',AL2(9999),C'TSN ',AL2(0490)  TSN          
         DC    C'SWPG',C'WPG',C'TSN ',AL2(9999),C'TSN ',AL2(0470)  TSN          
         DC    C'SYOR',C'YOR',C'TSN ',AL2(9999),C'TSN ',AL2(0472)  TSN          
         DC    C'TBLT',C'TOR',C'CBLT',AL2(5199),C'    ',AL2(0000)  DDS          
         DC    C'TFTO',C'TOR',C'CFTO',AL2(5199),C'    ',AL2(0000)  DDS          
         DC    C'TKVR',C'TOR',C'CKVR',AL2(5199),C'    ',AL2(0000)  DDS          
         DC    C'TOON',C'VAN',C'LXVA',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'TQCL',C'CAR',C'CFJP',AL2(3111),C'    ',AL2(0000)  DDS          
         DC    C'TSN ',C'VAN',C'SVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'TVO ',C'TOR',C'    ',AL2(0000),C'TVO ',AL2(0000)  TORO         
         DC    C'TYCJ',C'CHI',C'CIVM',AL2(4120),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYCL',C'   ',C'CIVM',AL2(3111),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYMF',C'MOF',C'CIVM',AL2(4481),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYOF',C'OTF',C'CIVM',AL2(5072),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYQU',C'   ',C'CIVM',AL2(4199),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYRI',C'RIM',C'CIVM',AL2(4061),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYRN',C'ROU',C'CIVM',AL2(4723),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYRO',C'RIV',C'CIVM',AL2(4101),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYSH',C'SHR',C'CIVM',AL2(4351),C'CIVM',AL2(0000)  CIVM         
         DC    C'TYTR',C'TRV',C'CIVM',AL2(4661),C'CIVM',AL2(0000)  CIVM         
         DC    C'VTV ',C'VAN',C'VVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'WGRZ',C'TOR',C'    ',AL2(0000),C'WGRZ',AL2(0000)  TORO         
         DC    C'WIVB',C'TOR',C'    ',AL2(0000),C'WIVB',AL2(0000)  TORO         
         DC    C'WKBW',C'TOR',C'    ',AL2(0000),C'WKBW',AL2(0000)  TORO         
         DC    C'WKCO',C'WND',C'CKCO',AL2(5409),C'    ',AL2(0000)  DDS          
         DC    C'WNED',C'TOR',C'    ',AL2(0000),C'WNED',AL2(0000)  TORO         
         DC    C'WNW ',C'VAN',C'WVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'WTN ',C'VAN',C'OVAN',AL2(0000),C'    ',AL2(0000)  BBM          
         DC    C'WUTV',C'TOR',C'    ',AL2(0000),C'WUTV',AL2(0000)  TOR          
         DC    C'WZKL',C'KTL',C'WUTV',AL2(5336),C'    ',AL2(0000)  DDS          
         DC    C'WZKT',C'KIT',C'WUTV',AL2(5339),C'    ',AL2(0000)  DDS          
         DC    C'WZLO',C'LON',C'WUTV',AL2(5369),C'    ',AL2(0000)  DDS          
         DC    C'WZOE',C'OTA',C'WUTV',AL2(5071),C'    ',AL2(0000)  DDS          
         DC    C'WZTO',C'TOR',C'WUTV',AL2(5199),C'    ',AL2(0000)  DDS          
         DC    C'XXCA',C'CAL',C'KAYU',AL2(8069),C'    ',AL2(0000)  DDS          
         DC    C'XXED',C'EDM',C'KAYU',AL2(8119),C'    ',AL2(0000)  DDS          
         DC    C'XXOK',C'OKA',C'KAYU',AL2(9071),C'    ',AL2(0000)  DDS          
         DC    C'YTOR',C'TOR',C'YTV ',AL2(5199),C'YTV ',AL2(0440)  YTV          
         DC    C'YTV ',C'VAN',C'YVAN',AL2(0000),C'    ',AL2(0000)  BBM          
