*          DATA SET DEDEMMAPT  AT LEVEL 048 AS OF 08/15/16                      
                                                                                
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES'                        
***********************************************************************         
*============================= UPDATE LOG ============================*         
*   DATE   LVL USER   DESCRIPTION                                     *         
* -------- --- ----   ------------------------------------------------*         
* Oct17/00 019 BPOO - Support MMU Upgrade code                        *         
* Jun21/00 018 GLEE - Support ability to pass Day Code as text        *         
*                                                                     *         
* Jun02/99 015 GLEE - Support PC Application version stamping         *         
*                                                                     *         
* Jul02/98 001 GLEE - New PAN book of FALINK map code equates         *         
*                                                                     *         
***********************************************************************         
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (RECEIVE: REQUE+        
               ST)'                                                             
*========================= HEADER FOR REQUEST ========================*         
                                                                                
FRHRQST      DS  0C                                                             
             DC  AL1(FRHRQSTUX-FRHRQST),AL2(FMHRQST)                            
             DC  AL2(FRHRQSTX-FRHRQST)                                          
FRHRQSTU     DS  0C                                                             
FRHRQSTUX    EQU *                                                              
*                                                                               
FRDRQST      DS  0C                                                             
FRDRQST01    DC  AL1(FRDRQST01X-FRDRQST01),AL2(FMDRQSTACTN)                     
             DC  C'ACTN ',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST01X   EQU *                                                              
FRDRQST02    DC  AL1(FRDRQST02X-FRDRQST02),AL2(FMDRQSTFILE)                     
             DC  C'FILE ',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST02X   EQU *                                                              
FRDRQST03    DC  AL1(FRDRQST03X-FRDRQST03),AL2(FMDRQSTSRCE)                     
             DC  C'SRCE ',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST03X   EQU *                                                              
FRDRQST04    DC  AL1(FRDRQST04X-FRDRQST04),AL2(FMDRQSTSTTN)                     
             DC  C'STTN ',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST04X   EQU *                                                              
FRDRQST05    DC  AL1(FRDRQST05X-FRDRQST05),AL2(FMDRQSTBOOK)                     
             DC  C'BOOK ',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST05X   EQU *                                                              
FRDRQST06    DC  AL1(FRDRQST06X-FRDRQST06),AL2(FMDRQSTDYTM)                     
             DC  C'DAYTM',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST06X   EQU *                                                              
FRDRQST07    DC  AL1(FRDRQST07X-FRDRQST07),AL2(FMDRQSTDEMO)                     
             DC  C'DEMO ',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST07X   EQU *                                                              
FRDRQST08    DC  AL1(FRDRQST08X-FRDRQST08),AL2(FMDRQSTOPTN)                     
             DC  C'OPTN ',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST08X   EQU *                                                              
FRDRQST09    DC  AL1(FRDRQST09X-FRDRQST09),AL2(FMDRQSTMRKT)                     
             DC  C'MRKT ',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST09X   EQU *                                                              
FRDRQST10    DC  AL1(FRDRQST10X-FRDRQST10),AL2(FMDRQSTPNUM)                     
             DC  C'PGNUM',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST10X   EQU *                                                              
FRDRQST11    DC  AL1(FRDRQST11X-FRDRQST11),AL2(FMDRQSTPURE)                     
             DC  C'PURE#',AL1(MDTCHQ),AL1(MDLENV)                               
FRDRQST11X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FRHRQSTX     EQU *                                                              
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (SEND: PROGRAM +        
               DEMO INFO)'                                                      
*========== HEADER FOR TIME PERIOD PROGRAM DEMO INFORMATION ==========*         
                                                                                
FSHTPDP      DS  0C                                                             
             DC  AL1(FSHTPDPUX-FSHTPDP),AL2(FMHTPDP)                            
             DC  AL2(FSHTPDPX-FSHTPDP)                                          
FSHTPDPU     DS  0C                                                             
FSHTPDPUX    EQU *                                                              
*                                                                               
FSDTPDP      DS  0C                                                             
FSDTPDP01    DC  AL1(FSDTPDP01X-FSDTPDP01),AL2(FMDTPDPRTYP)                     
             DC  C'RTYP ',AL1(MDTCHQ),AL1(1)                                    
FSDTPDP01X   EQU *                                                              
FSDTPDP02    DC  AL1(FSDTPDP02X-FSDTPDP02),AL2(FMDTPDPSTNN)                     
             DC  C'STTN#',AL1(MDTBIQ),AL1(1)                                    
FSDTPDP02X   EQU *                                                              
FSDTPDP03    DC  AL1(FSDTPDP03X-FSDTPDP03),AL2(FMDTPDPBKN)                      
             DC  C'BOOK#',AL1(MDTBIQ),AL1(1)                                    
FSDTPDP03X   EQU *                                                              
FSDTPDP04    DC  AL1(FSDTPDP04X-FSDTPDP04),AL2(FMDTPDPSBKN)                     
             DC  C'SBK# ',AL1(MDTBIQ),AL1(1)                                    
FSDTPDP04X   EQU *                                                              
FSDTPDP05    DC  AL1(FSDTPDP05X-FSDTPDP05),AL2(FMDTPDPDTN)                      
             DC  C'DYTM#',AL1(MDTBIQ),AL1(1)                                    
FSDTPDP05X   EQU *                                                              
FSDTPDP06    DC  AL1(FSDTPDP06X-FSDTPDP06),AL2(FMDTPDPCMPN)                     
             DC  C'COMP#',AL1(MDTBIQ),AL1(1)                                    
FSDTPDP06X   EQU *                                                              
FSDTPDP07    DC  AL1(FSDTPDP07X-FSDTPDP07),AL2(FMDTPDPNMKT)                     
             DC  C'NMKT ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDTPDP07X   EQU *                                                              
FSDTPDP08    DC  AL1(FSDTPDP08X-FSDTPDP08),AL2(FMDTPDPAMKT)                     
             DC  C'AMKT ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP08X   EQU *                                                              
FSDTPDP09    DC  AL1(FSDTPDP09X-FSDTPDP09),AL2(FMDTPDPSTTN)                     
             DC  C'STTN ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP09X   EQU *                                                              
FSDTPDP10    DC  AL1(FSDTPDP10X-FSDTPDP10),AL2(FMDTPDPBOOK)                     
             DC  C'BOOK ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP10X   EQU *                                                              
FSDTPDP11    DC  AL1(FSDTPDP11X-FSDTPDP11),AL2(FMDTPDPSUBK)                     
             DC  C'SUBK ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP11X   EQU *                                                              
FSDTPDP12    DC  AL1(FSDTPDP12X-FSDTPDP12),AL2(FMDTPDPIDAY)                     
             DC  C'IDAY ',AL1(MDTBIQ),AL1(1)                                    
FSDTPDP12X   EQU *                                                              
FSDTPDP13    DC  AL1(FSDTPDP13X-FSDTPDP13),AL2(FMDTPDPSTIM)                     
             DC  C'STIME',AL1(MDTBIQ),AL1(2)                                    
FSDTPDP13X   EQU *                                                              
FSDTPDP14    DC  AL1(FSDTPDP14X-FSDTPDP14),AL2(FMDTPDPETIM)                     
             DC  C'ETIME',AL1(MDTBIQ),AL1(2)                                    
FSDTPDP14X   EQU *                                                              
FSDTPDP15    DC  AL1(FSDTPDP15X-FSDTPDP15),AL2(FMDTPDPWKS)                      
             DC  C'WEEKS',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP15X   EQU *                                                              
FSDTPDP16    DC  AL1(FSDTPDP16X-FSDTPDP16),AL2(FMDTPDPPNAM)                     
             DC  C'PGNAM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP16X   EQU *                                                              
FSDTPDP17    DC  AL1(FSDTPDP17X-FSDTPDP17),AL2(FMDTPDPDMVL)                     
             DC  C'DMVAL',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP17X   EQU *                                                              
FSDTPDP18    DC  AL1(FSDTPDP18X-FSDTPDP18),AL2(FMDTPDPDUMV)                     
             DC  C'DUMDV',AL1(MDTMDQ),AL1(MDLENV)                               
FSDTPDP18X   EQU *                                                              
FSDTPDP19    DC  AL1(FSDTPDP19X-FSDTPDP19),AL2(FMDTPDPPREC)                     
             DC  C'PREC ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDTPDP19X   EQU *                                                              
FSDTPDP20    DC  AL1(FSDTPDP20X-FSDTPDP20),AL2(FMDTPDPPTYP)                     
             DC  C'PTYPE',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP20X   EQU *                                                              
FSDTPDP21    DC  AL1(FSDTPDP21X-FSDTPDP21),AL2(FMDTPDPDTSI)                     
             DC  C'DTSIX',AL1(MDTBIQ),AL1(2)                                    
FSDTPDP21X   EQU *                                                              
FSDTPDP22    DC  AL1(FSDTPDP22X-FSDTPDP22),AL2(FMDTPDPTDAY)                     
             DC  C'TXTDY',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP22X   EQU *                                                              
FSDTPDP23    DC  AL1(FSDTPDP23X-FSDTPDP23),AL2(FMDTPDPAFFL)                     
             DC  C'AFFL ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP23X   EQU *                                                              
FSDTPDP24    DC  AL1(FSDTPDP24X-FSDTPDP24),AL2(FMDTPDPMNAM)                     
             DC  C'MKNAM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTPDP24X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHTPDPX     EQU *                                                              
         EJECT                                                                  
*========== HEADER FOR PROGRAM AVG PROGRAM DEMO INFORMATION ==========*         
                                                                                
FSHPVDP      DS  0C                                                             
             DC  AL1(FSHPVDPUX-FSHPVDP),AL2(FMHPVDP)                            
             DC  AL2(FSHPVDPX-FSHPVDP)                                          
FSHPVDPU     DS  0C                                                             
FSHPVDPUX    EQU *                                                              
*                                                                               
FSDPVDP      DS  0C                                                             
FSDPVDP01    DC  AL1(FSDPVDP01X-FSDPVDP01),AL2(FMDPVDPRTYP)                     
             DC  C'RTYP ',AL1(MDTCHQ),AL1(1)                                    
FSDPVDP01X   EQU *                                                              
FSDPVDP02    DC  AL1(FSDTPDP02X-FSDTPDP02),AL2(FMDPVDPSTNN)                     
             DC  C'STTN#',AL1(MDTBIQ),AL1(1)                                    
FSDPVDP02X   EQU *                                                              
FSDPVDP03    DC  AL1(FSDTPDP03X-FSDTPDP03),AL2(FMDPVDPBKN)                      
             DC  C'BOOK#',AL1(MDTBIQ),AL1(1)                                    
FSDPVDP03X   EQU *                                                              
FSDPVDP04    DC  AL1(FSDTPDP04X-FSDTPDP04),AL2(FMDPVDPSBKN)                     
             DC  C'SBK# ',AL1(MDTBIQ),AL1(1)                                    
FSDPVDP04X   EQU *                                                              
FSDPVDP05    DC  AL1(FSDTPDP05X-FSDTPDP05),AL2(FMDPVDPDTN)                      
             DC  C'DYTM#',AL1(MDTBIQ),AL1(1)                                    
FSDPVDP05X   EQU *                                                              
FSDPVDP06    DC  AL1(FSDTPDP06X-FSDTPDP06),AL2(FMDPVDPCMPN)                     
             DC  C'COMP#',AL1(MDTBIQ),AL1(1)                                    
FSDPVDP06X   EQU *                                                              
FSDPVDP07    DC  AL1(FSDPVDP07X-FSDPVDP07),AL2(FMDPVDPNMKT)                     
             DC  C'NMKT ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDPVDP07X   EQU *                                                              
FSDPVDP08    DC  AL1(FSDPVDP08X-FSDPVDP08),AL2(FMDPVDPAMKT)                     
             DC  C'AMKT ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP08X   EQU *                                                              
FSDPVDP09    DC  AL1(FSDPVDP09X-FSDPVDP09),AL2(FMDPVDPSTTN)                     
             DC  C'STTN ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP09X   EQU *                                                              
FSDPVDP10    DC  AL1(FSDPVDP10X-FSDPVDP10),AL2(FMDPVDPBOOK)                     
             DC  C'BOOK ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP10X   EQU *                                                              
FSDPVDP11    DC  AL1(FSDPVDP11X-FSDPVDP11),AL2(FMDPVDPSUBK)                     
             DC  C'SUBK ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP11X   EQU *                                                              
FSDPVDP12    DC  AL1(FSDPVDP12X-FSDPVDP12),AL2(FMDPVDPIDAY)                     
             DC  C'IDAY ',AL1(MDTBIQ),AL1(1)                                    
FSDPVDP12X   EQU *                                                              
FSDPVDP13    DC  AL1(FSDPVDP13X-FSDPVDP13),AL2(FMDPVDPSTIM)                     
             DC  C'STIME',AL1(MDTBIQ),AL1(2)                                    
FSDPVDP13X   EQU *                                                              
FSDPVDP14    DC  AL1(FSDPVDP14X-FSDPVDP14),AL2(FMDPVDPETIM)                     
             DC  C'ETIME',AL1(MDTBIQ),AL1(2)                                    
FSDPVDP14X   EQU *                                                              
FSDPVDP15    DC  AL1(FSDPVDP15X-FSDPVDP15),AL2(FMDPVDPWKS)                      
             DC  C'WEEKS',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP15X   EQU *                                                              
FSDPVDP16    DC  AL1(FSDPVDP16X-FSDPVDP16),AL2(FMDPVDPPNAM)                     
             DC  C'PGNAM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP16X   EQU *                                                              
FSDPVDP17    DC  AL1(FSDPVDP17X-FSDPVDP17),AL2(FMDPVDPDMVL)                     
             DC  C'DMVAL',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP17X   EQU *                                                              
FSDPVDP18    DC  AL1(FSDPVDP18X-FSDPVDP18),AL2(FMDPVDPDUMV)                     
             DC  C'DUMDV',AL1(MDTMDQ),AL1(MDLENV)                               
FSDPVDP18X   EQU *                                                              
FSDPVDP19    DC  AL1(FSDPVDP19X-FSDPVDP19),AL2(FMDPVDPPREC)                     
             DC  C'PREC ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDPVDP19X   EQU *                                                              
FSDPVDP20    DC  AL1(FSDPVDP20X-FSDPVDP20),AL2(FMDPVDPPURE)                     
             DC  C'PURE#',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP20X   EQU *                                                              
FSDPVDP21    DC  AL1(FSDPVDP21X-FSDPVDP21),AL2(FMDPVDPNOR)                      
             DC  C'NOR? ',AL1(MDTCHQ),AL1(1)                                    
FSDPVDP21X   EQU *                                                              
FSDPVDP22    DC  AL1(FSDPVDP22X-FSDPVDP22),AL2(FMDPVDPPTYP)                     
             DC  C'PTYPE',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP22X   EQU *                                                              
FSDPVDP23    DC  AL1(FSDPVDP23X-FSDPVDP23),AL2(FMDPVDPTDAY)                     
             DC  C'TXTDY',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPVDP23X   EQU *                                                              
FSDPVDP24    DC  AL1(FSDPVDP24X-FSDPVDP24),AL2(FMDPVDPGDUR)                     
             DC  C'PGDUR',AL1(MDTBIQ),AL1(MDLENV)                               
FSDPVDP24X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHPVDPX     EQU *                                                              
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (SEND: DEMO LIS+        
               T <PRINTABLE>)'                                                  
*======================== HEADER FOR DEMO LIST =======================*         
                                                                                
FSHDMLS      DS  0C                                                             
             DC  AL1(FSHDMLSUX-FSHDMLS),AL2(FMHDMLS)                            
             DC  AL2(FSHDMLSX-FSHDMLS)                                          
FSHDMLSU     DS  0C                                                             
FSHDMLSUX    EQU *                                                              
*                                                                               
FSDDMLS      DS  0C                                                             
FSDDMLS01    DC  AL1(FSDDMLS01X-FSDDMLS01),AL2(FMDDMLSRCAT)                     
             DC  C'RCAT ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDMLS01X   EQU *                                                              
FSDDMLS02    DC  AL1(FSDDMLS02X-FSDDMLS02),AL2(FMDDMLSNCAT)                     
             DC  C'NCAT ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDMLS02X   EQU *                                                              
FSDDMLS03    DC  AL1(FSDDMLS03X-FSDDMLS03),AL2(FMDDMLSMDFR)                     
             DC  C'MODFR',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDMLS03X   EQU *                                                              
FSDDMLS04    DC  AL1(FSDDMLS04X-FSDDMLS04),AL2(FMDDMLSCODE)                     
             DC  C'DMCOD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDMLS04X   EQU *                                                              
FSDDMLS05    DC  AL1(FSDDMLS05X-FSDDMLS05),AL2(FMDDMLSPREC)                     
             DC  C'PREC ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDDMLS05X   EQU *                                                              
FSDDMLS06    DC  AL1(FSDDMLS06X-FSDDMLS06),AL2(FMDDMLSFDNM)                     
             DC  C'DMNAM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDMLS06X   EQU *                                                              
FSDDMLS07    DC  AL1(FSDDMLS07X-FSDDMLS07),AL2(FMDDMLSCPP)                      
             DC  C'CPPOK',AL1(MDTCHQ),AL1(1)                                    
FSDDMLS07X   EQU *                                                              
FSDDMLS08    DC  AL1(FSDDMLS08X-FSDDMLS08),AL2(FMDDMLSCPLB)                     
             DC  C'CPLBL',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDMLS08X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHDMLSX     EQU *                                                              
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (SEND: INITIAL +        
               DOWNLOAD)'                                                       
*==================== HEADER FOR INITIAL DOWNLOAD ====================*         
                                                                                
FSHINIT      DS  0C                                                             
             DC  AL1(FSHINITUX-FSHINIT),AL2(FMHINIT)                            
             DC  AL2(FSHINITX-FSHINIT)                                          
FSHINITU     DS  0C                                                             
FSHINITUX    EQU *                                                              
*                                                                               
FSDINIT      DS  0C                                                             
FSDINIT01    DC  AL1(FSDINIT01X-FSDINIT01),AL2(FMDINITDMA)                      
             DC  C'METH ',AL1(MDTCHQ),AL1(1)                                    
FSDINIT01X   EQU *                                                              
FSDINIT02    DC  AL1(FSDINIT02X-FSDINIT02),AL2(FMDINITSRCC)                     
             DC  C'SRCC ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDINIT02X   EQU *                                                              
FSDINIT03    DC  AL1(FSDINIT03X-FSDINIT03),AL2(FMDINITSRCD)                     
             DC  C'SRCD ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDINIT03X   EQU *                                                              
FSDINIT04    DC  AL1(FSDINIT04X-FSDINIT04),AL2(FMDINITFILC)                     
             DC  C'FILC ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDINIT04X   EQU *                                                              
FSDINIT05    DC  AL1(FSDINIT05X-FSDINIT05),AL2(FMDINITFILD)                     
             DC  C'FILD ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDINIT05X   EQU *                                                              
FSDINIT06    DC  AL1(FSDINIT06X-FSDINIT06),AL2(FMDINITBKTC)                     
             DC  C'BKTC ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDINIT06X   EQU *                                                              
FSDINIT07    DC  AL1(FSDINIT07X-FSDINIT07),AL2(FMDINITBKTD)                     
             DC  C'BKTD ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDINIT07X   EQU *                                                              
FSDINIT08    DC  AL1(FSDINIT08X-FSDINIT08),AL2(FMDINITLREV)                     
             DC  C'LREV ',AL1(MDTCDQ),AL1(2)                                    
FSDINIT08X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHINITX     EQU *                                                              
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (SEND: BOOKS FO+        
               R MARKETS)'                                                      
*================ HEADER FOR BOOKS FOR MARKET DOWNLOAD ===============*         
                                                                                
FSHBKMK      DS  0C                                                             
             DC  AL1(FSHBKMKUX-FSHBKMK),AL2(FMHBKMK)                            
             DC  AL2(FSHBKMKX-FSHBKMK)                                          
FSHBKMKU     DS  0C                                                             
FSHBKMKUX    EQU *                                                              
*                                                                               
FSDBKMK      DS  0C                                                             
FSDBKMK01    DC  AL1(FSDBKMK01X-FSDBKMK01),AL2(FMDBKMKAMKT)                     
             DC  C'AMRKT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKMK01X   EQU *                                                              
FSDBKMK02    DC  AL1(FSDBKMK02X-FSDBKMK02),AL2(FMDBKMKNMKT)                     
             DC  C'NMRKT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKMK02X   EQU *                                                              
FSDBKMK03    DC  AL1(FSDBKMK03X-FSDBKMK03),AL2(FMDBKMKMNAM)                     
             DC  C'MKNAM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKMK03X   EQU *                                                              
FSDBKMK04    DC  AL1(FSDBKMK04X-FSDBKMK04),AL2(FMDBKMKBOOK)                     
             DC  C'BOOK ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKMK04X   EQU *                                                              
FSDBKMK05    DC  AL1(FSDBKMK05X-FSDBKMK05),AL2(FMDBKMKBTYP)                     
             DC  C'BKTYP',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKMK05X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHBKMKX     EQU *                                                              
*================ HEADER FOR BOOKS FOR STATION DOWNLOAD ===============*        
                                                                                
FSHBKST      DS  0C                                                             
             DC  AL1(FSHBKSTUX-FSHBKST),AL2(FMHBKST)                            
             DC  AL2(FSHBKSTX-FSHBKST)                                          
FSHBKSTU     DS  0C                                                             
FSHBKSTUX    EQU *                                                              
*                                                                               
FSDBKST      DS  0C                                                             
FSDBKST01    DC  AL1(FSDBKST01X-FSDBKST01),AL2(FMDBKSTAMKT)                     
             DC  C'AMRKT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST01X   EQU *                                                              
FSDBKST02    DC  AL1(FSDBKST02X-FSDBKST02),AL2(FMDBKSTNMKT)                     
             DC  C'NMRKT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST02X   EQU *                                                              
FSDBKST03    DC  AL1(FSDBKST03X-FSDBKST03),AL2(FMDBKSTMNAM)                     
             DC  C'MKNAM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST03X   EQU *                                                              
FSDBKST04    DC  AL1(FSDBKST04X-FSDBKST04),AL2(FMDBKSTSTA)                      
             DC  C'STTN ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST04X   EQU *                                                              
FSDBKST05    DC  AL1(FSDBKST05X-FSDBKST05),AL2(FMDBKSTBOOK)                     
             DC  C'BOOK ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST05X   EQU *                                                              
FSDBKST06    DC  AL1(FSDBKST06X-FSDBKST06),AL2(FMDBKSTBTYP)                     
             DC  C'BTYPE',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST06X   EQU *                                                              
FSDBKST07    DC  AL1(FSDBKST07X-FSDBKST07),AL2(FMDBKSTSPLL)                     
             DC  C'SPILL',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST07X   EQU *                                                              
FSDBKST08    DC  AL1(FSDBKST08X-FSDBKST08),AL2(FMDBKSTAFF)                      
             DC  C'AFFI ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST08X   EQU *                                                              
FSDBKST09    DC  AL1(FSDBKST09X-FSDBKST09),AL2(FMDBKSTPUBL)                     
             DC  C'PUBL?',AL1(MDTCHQ),AL1(1)                                    
FSDBKST09X   EQU *                                                              
FSDBKST10    DC  AL1(FSDBKST10X-FSDBKST10),AL2(FMDBKSTCABL)                     
             DC  C'CABL?',AL1(MDTCHQ),AL1(1)                                    
FSDBKST10X   EQU *                                                              
FSDBKST11    DC  AL1(FSDBKST11X-FSDBKST11),AL2(FMDBKSTFLG1)                     
             DC  C'FLAG1',AL1(MDTBIQ),AL1(1)                                    
FSDBKST11X   EQU *                                                              
FSDBKST12    DC  AL1(FSDBKST12X-FSDBKST12),AL2(FMDBKSTGRP1)                     
             DC  C'GRP1 ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST12X   EQU *                                                              
FSDBKST13    DC  AL1(FSDBKST13X-FSDBKST13),AL2(FMDBKSTGRP2)                     
             DC  C'GRP2 ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST13X   EQU *                                                              
FSDBKST14    DC  AL1(FSDBKST14X-FSDBKST14),AL2(FMDBKSTDLMT)                     
             DC  C'DLMTR',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST14X   EQU *                                                              
FSDBKST15    DC  AL1(FSDBKST15X-FSDBKST15),AL2(FMDBKSTGP2A)                     
             DC  C'GRP2A',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBKST15X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHBKSTX     EQU *                                                              
*================ HEADER FOR markets for stations info  ===============*        
                                                                                
FSHMKST      DS  0C                                                             
             DC  AL1(FSHMKSTUX-FSHMKST),AL2(FMHMKST)                            
             DC  AL2(FSHMKSTX-FSHMKST)                                          
FSHMKSTU     DS  0C                                                             
FSHMKSTUX    EQU *                                                              
*                                                                               
FSDMKST      DS  0C                                                             
FSDMKST01    DC  AL1(FSDMKST01X-FSDMKST01),AL2(FMDMKSTSTA)                      
             DC  C'STTN ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDMKST01X   EQU *                                                              
FSDMKST02    DC  AL1(FSDMKST02X-FSDMKST02),AL2(FMDMKSTAMKT)                     
             DC  C'AMRKT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDMKST02X   EQU *                                                              
FSDMKST03    DC  AL1(FSDMKST03X-FSDMKST03),AL2(FMDMKSTNMKT)                     
             DC  C'NMRKT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDMKST03X   EQU *                                                              
FSDMKST04    DC  AL1(FSDMKST04X-FSDMKST04),AL2(FMDMKSTMNAM)                     
             DC  C'MKNAM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDMKST04X   EQU *                                                              
FSDMKST05    DC  AL1(FSDMKST05X-FSDMKST05),AL2(FMDMKSTMREL)                     
             DC  C'MKREL',AL1(MDTCHQ),AL1(MDLENV)                               
FSDMKST05X   EQU *                                                              
FSDMKST06    DC  AL1(FSDMKST06X-FSDMKST06),AL2(FMDMKSTBOOK)                     
             DC  C'BOOK ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDMKST06X   EQU *                                                              
FSDMKST07    DC  AL1(FSDBKST07X-FSDBKST07),AL2(FMDBKSTBTYP)                     
             DC  C'BTYPE',AL1(MDTCHQ),AL1(MDLENV)                               
FSDMKST07X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHMKSTX     EQU *                                                              
*================ HEADER FOR DEMO MODIFIER TABLE        ===============*        
                                                                                
FSHDMOD      DS  0C                                                             
             DC  AL1(FSHDMODUX-FSHDMOD),AL2(FMHDMOD)                            
             DC  AL2(FSHDMODX-FSHDMOD)                                          
FSHDMODU     DS  0C                                                             
FSHDMODUX    EQU *                                                              
*                                                                               
FSDDMOD      DS  0C                                                             
FSDDMOD01    DC  AL1(FSDDMOD01X-FSDDMOD01),AL2(FMDDMODCODE)                     
             DC  C'DMCOD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDMOD01X   EQU *                                                              
FSDDMOD02    DC  AL1(FSDDMOD02X-FSDDMOD02),AL2(FMDDMODNAME)                     
             DC  C'DMNAM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDMOD02X   EQU *                                                              
FSDDMOD03    DC  AL1(FSDDMOD03X-FSDDMOD03),AL2(FMDDMODPREC)                     
             DC  C'DMPRE',AL1(MDTBIQ),AL1(MDLENV)                               
FSDDMOD03X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHDMODX     EQU *                                                              
*                                                                               
*================ HEADER FOR PROGRAMS DOWNLOAD ===============*                 
                                                                                
FSHPRGS      DS  0C                                                             
             DC  AL1(FSHPRGSUX-FSHPRGS),AL2(FMHPRGS)                            
             DC  AL2(FSHPRGSX-FSHPRGS)                                          
FSHPRGSU     DS  0C                                                             
FSHPRGSUX    EQU *                                                              
*                                                                               
FSDPRGS      DS  0C                                                             
FSDPRGS01    DC  AL1(FSDPRGS01X-FSDPRGS01),AL2(FMDPRCD)                         
             DC  C'PRGCD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPRGS01X   EQU *                                                              
FSDPRGS02    DC  AL1(FSDPRGS02X-FSDPRGS02),AL2(FMDPRNM)                         
             DC  C'PRGNM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPRGS02X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHPRGSX     EQU *                                                              
*                                                                               
*====== HEADER FOR PROGRAMS ACROSS MARKETS DOWNLOAD ========*                   
                                                                                
FSHPGMK      DS  0C                                                             
             DC  AL1(FSHPGMKUX-FSHPGMK),AL2(FMHPGMK)                            
             DC  AL2(FSHPGMKX-FSHPGMK)                                          
FSHPGMKU     DS  0C                                                             
FSHPGMKUX    EQU *                                                              
*                                                                               
FSDPGMK      DS  0C                                                             
FSDPGMK01    DC  AL1(FSDPGMK01X-FSDPGMK01),AL2(FMDPGMK)                         
             DC  C'NMRKT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK01X   EQU *                                                              
FSDPGMK02    DC  AL1(FSDPGMK02X-FSDPGMK02),AL2(FMDPGAM)                         
             DC  C'AMRKT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK02X   EQU *                                                              
FSDPGMK03    DC  AL1(FSDPGMK03X-FSDPGMK03),AL2(FMDPGMN)                         
             DC  C'MKTNM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK03X   EQU *                                                              
FSDPGMK04    DC  AL1(FSDPGMK04X-FSDPGMK04),AL2(FMDPGST)                         
             DC  C'STAT ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK04X   EQU *                                                              
FSDPGMK05    DC  AL1(FSDPGMK05X-FSDPGMK05),AL2(FMDPGDY)                         
             DC  C'DAY  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDPGMK05X   EQU *                                                              
FSDPGMK06    DC  AL1(FSDPGMK06X-FSDPGMK06),AL2(FMDPGES)                         
             DC  C'ESTRT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK06X   EQU *                                                              
FSDPGMK07    DC  AL1(FSDPGMK07X-FSDPGMK07),AL2(FMDPGLS)                         
             DC  C'LSTRT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK07X   EQU *                                                              
FSDPGMK08    DC  AL1(FSDPGMK08X-FSDPGMK08),AL2(FMDPGLID)                        
             DC  C'LIDMV',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK08X   EQU *                                                              
FSDPGMK09    DC  AL1(FSDPGMK08X-FSDPGMK08),AL2(FMDPGPDM)                        
             DC  C'PRGDM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK09X   EQU *                                                              
FSDPGMK10    DC  AL1(FSDPGMK08X-FSDPGMK08),AL2(FMDPGLOD)                        
             DC  C'LODMV',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK10X   EQU *                                                              
FSDPGMK11    DC  AL1(FSDPGMK11X-FSDPGMK11),AL2(FMDPGDDM)                        
             DC  C'DUMDV',AL1(MDTMDQ),AL1(MDLENV)                               
FSDPGMK11X   EQU *                                                              
FSDPGMK12    DC  AL1(FSDPGMK12X-FSDPGMK12),AL2(FMDPGPNM)                        
             DC  C'PRG P',AL1(MDTBIQ),AL1(MDLENV)                               
FSDPGMK12X   EQU *                                                              
FSDPGMK13    DC  AL1(FSDPGMK13X-FSDPGMK13),AL2(FMDPGPNA)                        
             DC  C'PRGNA',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK13X   EQU *                                                              
FSDPGMK14    DC  AL1(FSDPGMK14X-FSDPGMK14),AL2(FMDPGAFF)                        
             DC  C'AFFIL',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPGMK14X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHPGMKX     EQU *                                                              
*                                                                               
*================ HEADER FOR BOOKS DOWNLOAD             ===============*        
                                                                                
FSHBOOK      DS  0C                                                             
             DC  AL1(FSHBOOKUX-FSHBOOK),AL2(FMHBOOK)                            
             DC  AL2(FSHBOOKX-FSHBOOK)                                          
FSHBOOKU     DS  0C                                                             
FSHBOOKUX    EQU *                                                              
*                                                                               
FSDBOOK      DS  0C                                                             
FSDBOOK01    DC  AL1(FSDBOOK01X-FSDBOOK01),AL2(FMDFMBK)                         
             DC  C'FMBK ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBOOK01X   EQU *                                                              
FSDBOOK02    DC  AL1(FSDBOOK02X-FSDBOOK02),AL2(FMDBKYR)                         
             DC  C'BKYR ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBOOK02X   EQU *                                                              
FSDBOOK03    DC  AL1(FSDBOOK03X-FSDBOOK03),AL2(FMDBKMN)                         
             DC  C'BKMTH',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBOOK03X   EQU *                                                              
FSDBOOK04    DC  AL1(FSDBOOK04X-FSDBOOK04),AL2(FMDBKDY)                         
             DC  C'BKDAY',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBOOK04X   EQU *                                                              
FSDBOOK05    DC  AL1(FSDBOOK05X-FSDBOOK05),AL2(FMDBKTC)                         
             DC  C'BKTCD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBOOK05X   EQU *                                                              
FSDBOOK06    DC  AL1(FSDBOOK06X-FSDBOOK06),AL2(FMDBOOKDLMT)                     
             DC  C'DLMTR',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBOOK06X   EQU *                                                              
FSDBOOK07    DC  AL1(FSDBOOK07X-FSDBOOK07),AL2(FMDBOOKGP2A)                     
             DC  C'GRP2A',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBOOK07X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHBOOKX     EQU *                                                              
FSHCTGD      DS  0C                                                             
             DC  AL1(FSHCTGDUX-FSHCTGD),AL2(FMHCTGRID)                          
             DC  AL2(FSHCTGDX-FSHCTGD)                                          
FSHCTGDU     DS  0C                                                             
FSHCTGDUX    EQU *                                                              
*                                                                               
FSDCTGD      DS  0C      SOURCE                                                 
FSDCTGD01    DC  AL1(FSDCTGD01X-FSDCTGD01),AL2(FMDOPT1)                         
             DC  C'OPT01',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD01X   EQU *       SOURCE DESCRIPTION                                     
FSDCTGD02    DC  AL1(FSDCTGD02X-FSDCTGD02),AL2(FMDOPT2)                         
             DC  C'OPT02',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD02X   EQU *       FILE                                                   
FSDCTGD03    DC  AL1(FSDCTGD03X-FSDCTGD03),AL2(FMDOPT3)                         
             DC  C'OPT03',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD03X   EQU *       FILE DESCRIPTION                                       
FSDCTGD04    DC  AL1(FSDCTGD04X-FSDCTGD04),AL2(FMDOPT4)                         
             DC  C'OPT04',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD04X   EQU *       DISPLAY OPTION                                         
FSDCTGD05    DC  AL1(FSDCTGD05X-FSDCTGD05),AL2(FMDOPT5)                         
             DC  C'OPT05',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD05X   EQU *       PERIOD OPTION                                          
FSDCTGD06    DC  AL1(FSDCTGD06X-FSDCTGD06),AL2(FMDOPT6)                         
             DC  C'OPT06',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD06X   EQU *       AVAIL OPTION                                           
FSDCTGD07    DC  AL1(FSDCTGD07X-FSDCTGD07),AL2(FMDOPT7)                         
             DC  C'OPT07',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD07X   EQU *       BOOK OPTION                                            
FSDCTGD08    DC  AL1(FSDCTGD08X-FSDCTGD08),AL2(FMDOPT8)                         
             DC  C'OPT08',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD08X   EQU *       STATION OPTION                                         
FSDCTGD09    DC  AL1(FSDCTGD09X-FSDCTGD09),AL2(FMDOPT9)                         
             DC  C'OPT09',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD09X   EQU *       SPILL OPTION                                           
FSDCTGD10    DC  AL1(FSDCTGD10X-FSDCTGD10),AL2(FMDOPT10)                        
             DC  C'OPT10',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD10X   EQU *       MARKET OPTION                                          
FSDCTGD11    DC  AL1(FSDCTGD11X-FSDCTGD11),AL2(FMDOPT11)                        
             DC  C'OPT11',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD11X   EQU *       PROGRAM NAME                                           
FSDCTGD12    DC  AL1(FSDCTGD12X-FSDCTGD12),AL2(FMDOPT12)                        
             DC  C'OPT12',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD12X   EQU *       PROGRAM MARKET                                         
FSDCTGD13    DC  AL1(FSDCTGD13X-FSDCTGD13),AL2(FMDOPT13)                        
             DC  C'OPT13',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD13X   EQU *       AFFID                                                  
FSDCTGD14    DC  AL1(FSDCTGD14X-FSDCTGD14),AL2(FMDOPT14)                        
             DC  C'OPT14',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD14X   EQU *       DEMO                                                   
FSDCTGD15    DC  AL1(FSDCTGD15X-FSDCTGD15),AL2(FMDOPT15)                        
             DC  C'OPT15',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD15X   EQU *       SHOW SUMMARY                                           
FSDCTGD16    DC  AL1(FSDCTGD16X-FSDCTGD16),AL2(FMDOPT16)                        
             DC  C'OPT16',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD16X   EQU *       SHOW DETAIL QTR HOUR                                   
FSDCTGD17    DC  AL1(FSDCTGD17X-FSDCTGD17),AL2(FMDOPT17)                        
             DC  C'OPT17',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD17X   EQU *       SHOW DETAIL HALF HOUR                                  
FSDCTGD18    DC  AL1(FSDCTGD18X-FSDCTGD18),AL2(FMDOPT18)                        
             DC  C'OPT18',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD18X   EQU *       SHOW DETAIL HOUR                                       
FSDCTGD19    DC  AL1(FSDCTGD19X-FSDCTGD19),AL2(FMDOPT19)                        
             DC  C'OPT19',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD19X   EQU *       SHOW MOST RUN PROGRAM                                  
FSDCTGD20    DC  AL1(FSDCTGD20X-FSDCTGD20),AL2(FMDOPT20)                        
             DC  C'OPT20',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD20X   EQU *       SHOW ALL PROGRAMS RAN 1 WEEK ONLY                      
FSDCTGD21    DC  AL1(FSDCTGD21X-FSDCTGD21),AL2(FMDOPT21)                        
             DC  C'OPT21',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD21X   EQU *       SHOW 1 WEEK OR MORE                                    
FSDCTGD22    DC  AL1(FSDCTGD22X-FSDCTGD22),AL2(FMDOPT22)                        
             DC  C'OPT22',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD22X   EQU *       SHOW 2 WEEKS ONLY                                      
FSDCTGD23    DC  AL1(FSDCTGD23X-FSDCTGD23),AL2(FMDOPT23)                        
             DC  C'OPT23',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD23X   EQU *       SHOW TWO WEEKS OR MORE                                 
FSDCTGD24    DC  AL1(FSDCTGD24X-FSDCTGD24),AL2(FMDOPT24)                        
             DC  C'OPT24',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD24X   EQU *       SHOW 3 WEEKS ONLY                                      
FSDCTGD25    DC  AL1(FSDCTGD25X-FSDCTGD25),AL2(FMDOPT25)                        
             DC  C'OPT25',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD25X   EQU *       SHOW THREE WEEKS OR MORE                               
FSDCTGD26    DC  AL1(FSDCTGD26X-FSDCTGD26),AL2(FMDOPT26)                        
             DC  C'OPT26',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD26X   EQU *       SHOW 4 WEEKS ONLY                                      
FSDCTGD27    DC  AL1(FSDCTGD27X-FSDCTGD27),AL2(FMDOPT27)                        
             DC  C'OPT27',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD27X   EQU *       SHOW 4 WEEKS OR MORE                                   
FSDCTGD28    DC  AL1(FSDCTGD28X-FSDCTGD28),AL2(FMDOPT28)                        
             DC  C'OPT28',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD28X   EQU *       SHOW 5 WEEKS ONLY                                      
FSDCTGD29    DC  AL1(FSDCTGD29X-FSDCTGD29),AL2(FMDOPT29)                        
             DC  C'OPT29',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD29X   EQU *       SHOW 5 WEEKS OR MORE                                   
FSDCTGD30    DC  AL1(FSDCTGD30X-FSDCTGD30),AL2(FMDOPT30)                        
             DC  C'OPT30',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD30X   EQU *       SHOW ALL PROGRAMS THAT RAN                             
FSDCTGD31    DC  AL1(FSDCTGD31X-FSDCTGD31),AL2(FMDOPT31)                        
             DC  C'OPT31',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD31X   EQU *       INCLUDE NORMAL PROGRAMMING                             
FSDCTGD32    DC  AL1(FSDCTGD32X-FSDCTGD32),AL2(FMDOPT32)                        
             DC  C'OPT32',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD32X   EQU *       SHOW PROGRAM NAME                                      
FSDCTGD33    DC  AL1(FSDCTGD33X-FSDCTGD33),AL2(FMDOPT33)                        
             DC  C'OPT33',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD33X   EQU *       SHOW DECIMAL VALUE                                     
FSDCTGD34    DC  AL1(FSDCTGD34X-FSDCTGD34),AL2(FMDOPT34)                        
             DC  C'OPT34',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD34X   EQU *       SHOW WHOLE NUMBERS                                     
FSDCTGD35    DC  AL1(FSDCTGD35X-FSDCTGD35),AL2(FMDOPT35)                        
             DC  C'OPT35',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD35X   EQU *       INCLUDE ALL PROGRAMS                                   
FSDCTGD36    DC  AL1(FSDCTGD36X-FSDCTGD36),AL2(FMDOPT36)                        
             DC  C'OPT36',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD36X   EQU *       INCLUDE PROGRAM TYPE                                   
FSDCTGD37    DC  AL1(FSDCTGD37X-FSDCTGD37),AL2(FMDOPT37)                        
             DC  C'OPT37',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD37X   EQU *       METHODOLGY                                             
FSDCTGD38    DC  AL1(FSDCTGD38X-FSDCTGD38),AL2(FMDOPT38)                        
             DC  C'OPT38',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD38X   EQU *       SVI                                                    
FSDCTGD39    DC  AL1(FSDCTGD39X-FSDCTGD39),AL2(FMDOPT39)                        
             DC  C'OPT39',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD39X   EQU *       STATION CAPTION BUTTON                                 
FSDCTGD40    DC  AL1(FSDCTGD40X-FSDCTGD40),AL2(FMDOPT40)                        
             DC  C'OPT40',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD40X   EQU *       SEARCH BY NETWORK AND SYNICATED                        
FSDCTGD41    DC  AL1(FSDCTGD41X-FSDCTGD41),AL2(FMDOPT41)                        
             DC  C'OPT41',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD41X   EQU *       AVAIL MRK TAB (INCLUDE SPILL STATIONS)                 
FSDCTGD42    DC  AL1(FSDCTGD42X-FSDCTGD42),AL2(FMDOPT42)                        
             DC  C'OPT42',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD42X   EQU *       AVAIL MRK TAB (INCLUDE PUBLIC STATIONS)                
FSDCTGD43    DC  AL1(FSDCTGD43X-FSDCTGD43),AL2(FMDOPT43)                        
             DC  C'OPT43',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD43X   EQU *       SPILL STATIONS TAB                                     
FSDCTGD44    DC  AL1(FSDCTGD44X-FSDCTGD44),AL2(FMDOPT44)                        
             DC  C'OPT44',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD44X   EQU *       BOOKS TAB MAJORITY PROGRAMMING                         
FSDCTGD45    DC  AL1(FSDCTGD45X-FSDCTGD45),AL2(FMDOPT45)                        
             DC  C'OPT45',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD45X   EQU *       BOOKS TAB ADD MULTIBOOK AVG BUTTON                     
FSDCTGD46    DC  AL1(FSDCTGD46X-FSDCTGD46),AL2(FMDOPT46)                        
             DC  C'OPT46',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD46X   EQU *       BOOKS TAB (LATEST LAT2 ...)                            
FSDCTGD47    DC  AL1(FSDCTGD47X-FSDCTGD47),AL2(FMDOPT47)                        
             DC  C'OPT47',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD47X   EQU *       BOOKS TAB SPECIFY AVAIL BOOK TYPES                     
FSDCTGD48    DC  AL1(FSDCTGD48X-FSDCTGD48),AL2(FMDOPT48)                        
             DC  C'OPT48',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD48X   EQU *       PROJECTIONS TAB SHARE PUT                              
FSDCTGD49    DC  AL1(FSDCTGD49X-FSDCTGD49),AL2(FMDOPT49)                        
             DC  C'OPT49',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD49X   EQU *       PROJECTIOSN TAB  YEAR AVG PUT                          
FSDCTGD50    DC  AL1(FSDCTGD50X-FSDCTGD50),AL2(FMDOPT50)                        
             DC  C'OPT50',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD50X   EQU *       PROJECTIONS TAB SHARE                                  
FSDCTGD51    DC  AL1(FSDCTGD51X-FSDCTGD51),AL2(FMDOPT51)                        
             DC  C'OPT51',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD51X   EQU *       PROJECTIONS TAB 2 YEAR AVG SHARE                       
FSDCTGD52    DC  AL1(FSDCTGD52X-FSDCTGD52),AL2(FMDOPT52)                        
             DC  C'OPT52',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD52X   EQU *       PROJECTIONS TAB ALTERN DAY TIM SHR                     
FSDCTGD53    DC  AL1(FSDCTGD53X-FSDCTGD53),AL2(FMDOPT53)                        
             DC  C'OPT53',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD53X   EQU *       PROJECTIONS TAB SELECTED WEEK SHARE                    
FSDCTGD54    DC  AL1(FSDCTGD54X-FSDCTGD54),AL2(FMDOPT54)                        
             DC  C'OPT54',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD54X   EQU *       PROJECTS TAB SUPPLIED PUT AND SHARE                    
FSDCTGD55    DC  AL1(FSDCTGD55X-FSDCTGD55),AL2(FMDOPT55)                        
             DC  C'OPT55',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD55X   EQU *       PROJECTIONS TAB HUT                                    
FSDCTGD56    DC  AL1(FSDCTGD56X-FSDCTGD56),AL2(FMDOPT56)                        
             DC  C'OPT56',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD56X   EQU *       PROJECTIONS TAB HPT                                    
FSDCTGD57    DC  AL1(FSDCTGD57X-FSDCTGD57),AL2(FMDOPT57)                        
             DC  C'OPT57',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD57X   EQU *       PROJECTIONS TAB INDEX                                  
FSDCTGD58    DC  AL1(FSDCTGD58X-FSDCTGD58),AL2(FMDOPT58)                        
             DC  C'OPT58',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD58X   EQU *       PROJECTIONS TAB RATING                                 
FSDCTGD59    DC  AL1(FSDCTGD59X-FSDCTGD59),AL2(FMDOPT59)                        
             DC  C'OPT59',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD59X   EQU *       PROJECTIONS TAB DEMO                                   
FSDCTGD60    DC  AL1(FSDCTGD60X-FSDCTGD60),AL2(FMDOPT60)                        
             DC  C'OPT60',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD60X   EQU *       PROJECTIONS TAB PUT AVG YEAR                           
FSDCTGD61    DC  AL1(FSDCTGD61X-FSDCTGD61),AL2(FMDOPT61)                        
             DC  C'OPT61',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD61X   EQU *       PROJECTIONS TAB SHARE AVG YEAR                         
FSDCTGD62    DC  AL1(FSDCTGD62X-FSDCTGD62),AL2(FMDOPT62)                        
             DC  C'OPT62',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD62X   EQU *       PROJECTIONS TAB PUT INDEX                              
FSDCTGD63    DC  AL1(FSDCTGD63X-FSDCTGD63),AL2(FMDOPT63)                        
             DC  C'OPT63',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD63X   EQU *       PROJECTIONS TAB SHARE INDEX                            
FSDCTGD64    DC  AL1(FSDCTGD64X-FSDCTGD64),AL2(FMDOPT64)                        
             DC  C'OPT64',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD64X   EQU *       PROJECTIONS TAB PUT INDEX MULTIP                       
FSDCTGD65    DC  AL1(FSDCTGD65X-FSDCTGD65),AL2(FMDOPT65)                        
             DC  C'OPT65',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD65X   EQU *       DAY\TIME SELECTED PERSONAL ROTATIONS                   
FSDCTGD66    DC  AL1(FSDCTGD66X-FSDCTGD66),AL2(FMDOPT66)                        
             DC  C'OPT66',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD66X   EQU *       DEMOS SELECTED WEEKLY HOUSEHOLD CHKB                   
FSDCTGD67    DC  AL1(FSDCTGD67X-FSDCTGD67),AL2(FMDOPT67)                        
             DC  C'OPT67',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD67X   EQU *       REPORTS FORMAT BOOK COMPARISIONS                       
FSDCTGD68    DC  AL1(FSDCTGD68X-FSDCTGD68),AL2(FMDOPT68)                        
             DC  C'OPT68',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD68X   EQU *       STATIONS COMPARISONS                                   
FSDCTGD69    DC  AL1(FSDCTGD69X-FSDCTGD69),AL2(FMDOPT69)                        
             DC  C'OPT69',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD69X   EQU *       DEMO COMPARISIONS                                      
FSDCTGD70    DC  AL1(FSDCTGD70X-FSDCTGD70),AL2(FMDOPT70)                        
             DC  C'OPT70',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD70X   EQU *       BOOK RANKERS                                           
FSDCTGD71    DC  AL1(FSDCTGD71X-FSDCTGD71),AL2(FMDOPT71)                        
             DC  C'OPT71',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD71X   EQU *       PROGRAM AVERAGE FORMATS                                
FSDCTGD72    DC  AL1(FSDCTGD72X-FSDCTGD72),AL2(FMDOPT72)                        
             DC  C'OPT72',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD72X   EQU *       PROGRAM BY MARKETS                                     
FSDCTGD73    DC  AL1(FSDCTGD73X-FSDCTGD73),AL2(FMDOPT73)                        
             DC  C'OPT73',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD73X   EQU *       WEEKLY HOUSEHOLD RATING FORMATS                        
FSDCTGD74    DC  AL1(FSDCTGD74X-FSDCTGD74),AL2(FMDOPT74)                        
             DC  C'OPT74',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD74X   EQU *       LILO FORMATS                                           
FSDCTGD75    DC  AL1(FSDCTGD75X-FSDCTGD75),AL2(FMDOPT75)                        
             DC  C'OPT75',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD75X   EQU *                                                              
FSDCTGD76    DC  AL1(FSDCTGD76X-FSDCTGD76),AL2(FMDDMMOD)                        
             DC  C'DEMMO',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD76X   EQU *                                                              
FSDCTGD77    DC  AL1(FSDCTGD77X-FSDCTGD77),AL2(FMDDMDIS)                        
             DC  C'DMDIS',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD77X   EQU *                                                              
FSDCTGD78    DC  AL1(FSDCTGD78X-FSDCTGD78),AL2(FMDBKTPC)                        
             DC  C'BKTPC',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD78X   EQU *                                                              
FSDCTGD79    DC  AL1(FSDCTGD79X-FSDCTGD79),AL2(FMDBKTPD)                        
             DC  C'BKTPD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD79X   EQU *                                                              
FSDCTGD80    DC  AL1(FSDCTGD80X-FSDCTGD80),AL2(FMDOPT80)                        
             DC  C'OPT80',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD80X   EQU *                                                              
FSDCTGD81    DC  AL1(FSDCTGD81X-FSDCTGD81),AL2(FMDDYTMC)                        
             DC  C'DYTMC',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD81X   EQU *                                                              
FSDCTGD82    DC  AL1(FSDCTGD82X-FSDCTGD82),AL2(FMDDYTMD)                        
             DC  C'DYTMD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD82X   EQU *                                                              
FSDCTGD83    DC  AL1(FSDCTGD83X-FSDCTGD83),AL2(FMDPRGTC)                        
             DC  C'PRGTC',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD83X   EQU *                                                              
FSDCTGD84    DC  AL1(FSDCTGD84X-FSDCTGD84),AL2(FMDPRGTD)                        
             DC  C'PRGTD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD84X   EQU *                                                              
FSDCTGD85    DC  AL1(FSDCTGD85X-FSDCTGD85),AL2(FMDPRGNM)                        
             DC  C'PRGNM',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD85X   EQU *                                                              
FSDCTGD87    DC  AL1(FSDCTGD87X-FSDCTGD87),AL2(FMDSRCDE)                        
             DC  C'S CDE',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD87X   EQU *                                                              
FSDCTGD88    DC  AL1(FSDCTGD88X-FSDCTGD88),AL2(FMDOPT88)                        
             DC  C'I CBL',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD88X   EQU *                                                              
FSDCTGD89    DC  AL1(FSDCTGD89X-FSDCTGD89),AL2(FMDOPT89)                        
             DC  C'DELIM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD89X   EQU *                                                              
FSDCTGD90    DC  AL1(FSDCTGD90X-FSDCTGD90),AL2(FMDOPT90)                        
             DC  C'OPT90',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD90X   EQU *                                                              
FSDCTGD92    DC  AL1(FSDCTGD92X-FSDCTGD92),AL2(FMDOPT92)                        
             DC  C'OPT92',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD92X   EQU *                                                              
FSDCTGD93    DC  AL1(FSDCTGD93X-FSDCTGD93),AL2(FMDSTIM)                         
             DC  C'STIME',AL1(MDTBIQ),AL1(2)                                    
FSDCTGD93X   EQU *                                                              
FSDCTGD94    DC  AL1(FSDCTGD94X-FSDCTGD94),AL2(FMDETIM)                         
             DC  C'ETIME',AL1(MDTBIQ),AL1(2)                                    
FSDCTGD94X   EQU *                                                              
FSDCTGD95    DC  AL1(FSDCTGD95X-FSDCTGD95),AL2(FMDTINC)                         
             DC  C'TMINC',AL1(MDTBIQ),AL1(1)                                    
FSDCTGD95X   EQU *                                                              
FSDCTGD96    DC  AL1(FSDCTGD96X-FSDCTGD96),AL2(FMDMMU)                          
             DC  C'MMU C',AL1(MDTBIQ),AL1(1)                                    
FSDCTGD96X   EQU *                                                              
FSDCTGD97    DC  AL1(FSDCTGD97X-FSDCTGD97),AL2(FMDAFFILC)                       
             DC  C'AFF C',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD97X   EQU *                                                              
FSDCTGD98    DC  AL1(FSDCTGD98X-FSDCTGD98),AL2(FMDAFFILN)                       
             DC  C'AFF N',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCTGD98X   EQU *                                                              
FSDCTGD99    DC  AL1(FSDCTGD99X-FSDCTGD99),AL2(FMDDEC0)                         
             DC  C'DEC 0',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD99X   EQU *                                                              
FSDCTGD100   DC  AL1(FSDCTGD100X-FSDCTGD100),AL2(FMDDEC1)                       
             DC  C'DEC 1',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD100X  EQU *                                                              
FSDCTGD101   DC  AL1(FSDCTGD101X-FSDCTGD101),AL2(FMDDEC2)                       
             DC  C'DEC 2',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD101X  EQU *                                                              
FSDCTGD102   DC  AL1(FSDCTGD102X-FSDCTGD102),AL2(FMDWMBK)                       
             DC  C'WKMBK',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD102X  EQU *                                                              
FSDCTGD103   DC  AL1(FSDCTGD103X-FSDCTGD103),AL2(FMDPAY)                        
             DC  C'PAY  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD103X  EQU *                                                              
FSDCTGD104   DC  AL1(FSDCTGD104X-FSDCTGD104),AL2(FMDSAY)                        
             DC  C'SAY  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD104X  EQU *                                                              
FSDCTGD105   DC  AL1(FSDCTGD105X-FSDCTGD105),AL2(FMDPAB)                        
             DC  C'PAB  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD105X  EQU *                                                              
FSDCTGD106   DC  AL1(FSDCTGD106X-FSDCTGD106),AL2(FMDSAB)                        
             DC  C'SAB  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD106X  EQU *                                                              
FSDCTGD107   DC  AL1(FSDCTGD107X-FSDCTGD107),AL2(FMDPAQ)                        
             DC  C'PAQ  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD107X  EQU *                                                              
FSDCTGD108   DC  AL1(FSDCTGD108X-FSDCTGD108),AL2(FMDSAQ)                        
             DC  C'SAQ  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD108X  EQU *                                                              
FSDCTGD109   DC  AL1(FSDCTGD109X-FSDCTGD109),AL2(FMDISS)                        
             DC  C'ISS  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD109X  EQU *                                                              
FSDCTGD110   DC  AL1(FSDCTGD110X-FSDCTGD110),AL2(FMDLPM)                        
             DC  C'LPM  ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD110X  EQU *                                                              
FSDCTGD111   DC  AL1(FSDCTGD111X-FSDCTGD111),AL2(FMDOTHR)                       
             DC  C'OTHER',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD111X  EQU *                                                              
FSDCTGD112   DC  AL1(FSDCTGD112X-FSDCTGD112),AL2(FMDMKNAM)                      
             DC  C'MKNAM',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD112X  EQU *                                                              
FSDCTGD113   DC  AL1(FSDCTGD113X-FSDCTGD113),AL2(FMDAFFIL)                      
             DC  C'AFFIL',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCTGD113X  EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHCTGDX     EQU *                                                              
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (SEND: DEMOS)'          
*=============================== DEMOS ===============================*         
                                                                                
*  DEMOS                                                                        
FSHDEMOS     DS  0C                                                             
             DC  AL1(FSHDEMOSUX-FSHDEMOS),AL2(FMHDEMOS)                         
             DC  AL2(FSHDEMOSX-FSHDEMOS)                                        
FSHDEMOSU    DS  0C                                                             
FSHDEMOSUX   EQU *                                                              
FSDDEMOS01   DC  AL1(FSDDEMOS01X-FSDDEMOS01),AL2(FMDDEMOS)                      
             DC  C'DEMOS',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDEMOS01X  EQU *                                                              
FSDDEMOS02   DC  AL1(FSDDEMOS02X-FSDDEMOS02),AL2(FMDDMSNM)                      
             DC  C'DMSNM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDEMOS02X  EQU *                                                              
FSDDEMOS03   DC  AL1(FSDDEMOS03X-FSDDEMOS03),AL2(FMDDMSTP)                      
             DC  C'DMSTP',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDEMOS03X  EQU *                                                              
FSDDEMOS04   DC  AL1(FSDDEMOS04X-FSDDEMOS04),AL2(FMDDMCAT)                      
             DC  C'DMCAT',AL1(MDTCHQ),AL1(MDLENV)                               
FSDDEMOS04X  EQU *                                                              
             DC  AL1(0)                                                         
FSHDEMOSX    EQU *                                                              
*                                                                               
*  PROPSER STUFF                                                                
FSHPROPS     DS  0C                                                             
             DC  AL1(FSHPROPSUX-FSHPROPS),AL2(FMHPROPS)                         
             DC  AL2(FSHPROPSX-FSHPROPS)                                        
FSHPROPSU    DS  0C                                                             
FSHPROPSUX   EQU *                                                              
FSDPROPS01   DC  AL1(FSDPROPS01X-FSDPROPS01),AL2(FMDDSSRC)                      
             DC  C'S SRC',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPROPS01X  EQU *                                                              
FSDPROPS02   DC  AL1(FSDPROPS02X-FSDPROPS02),AL2(FMDDSRC)                       
             DC  C'SRCCD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPROPS02X  EQU *                                                              
FSDPROPS03   DC  AL1(FSDPROPS03X-FSDPROPS03),AL2(FMDDSRCD)                      
             DC  C'SRC N',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPROPS03X  EQU *                                                              
FSDPROPS04   DC  AL1(FSDPROPS04X-FSDPROPS04),AL2(FMDDBKTY)                      
             DC  C'BK TP',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPROPS04X  EQU *                                                              
FSDPROPS05   DC  AL1(FSDPROPS05X-FSDPROPS05),AL2(FMDDBKTD)                      
             DC  C'BKTPD',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPROPS05X  EQU *                                                              
FSDPROPS06   DC  AL1(FSDPROPS06X-FSDPROPS06),AL2(FMDDEMON)                      
             DC  C'DEM C',AL1(MDTCHQ),AL1(MDLENV)                               
FSDPROPS06X  EQU *                                                              
             DC  AL1(0)                                                         
FSHPROPSX    EQU *                                                              
*                                                                               
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (SEND: DAY/TIME+        
                INDICES)'                                                       
*==================== HEADER FOR DAY/TIME INDICES ====================*         
                                                                                
FSHDTIX      DS  0C                                                             
             DC  AL1(FSHDTIXUX-FSHDTIX),AL2(FMHDTIX)                            
             DC  AL2(FSHDTIXX-FSHDTIX)                                          
FSHDTIXU     DS  0C                                                             
FSHDTIXUX    EQU *                                                              
*                                                                               
FSDDTIX      DS  0C                                                             
FSDDTIX01    DC  AL1(FSDDTIX01X-FSDDTIX01),AL2(FMDDTIXDTN)                      
             DC  C'DYTM#',AL1(MDTBIQ),AL1(1)                                    
FSDDTIX01X   EQU *                                                              
FSDDTIX02    DC  AL1(FSDDTIX02X-FSDDTIX02),AL2(FMDDTIXCMPN)                     
             DC  C'COMP#',AL1(MDTBIQ),AL1(1)                                    
FSDDTIX02X   EQU *                                                              
FSDDTIX03    DC  AL1(FSDDTIX03X-FSDDTIX03),AL2(FMDDTIXMXSI)                     
             DC  C'MAXSI',AL1(MDTBIQ),AL1(2)                                    
FSDDTIX03X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHDTIXX     EQU *                                                              
*                                                                               
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (SEND: FORMAT T+        
                YPES FOR BOOKS)'                                                
*======================= FORMAT TYPE FOR BOOKS =======================*         
                                                                                
FSHBFMT      DS  0C                                                             
             DC  AL1(FSHBFMTUX-FSHBFMT),AL2(FMHBFMT)                            
             DC  AL2(FSHBFMTX-FSHBFMT)                                          
FSHBFMTU     DS  0C                                                             
FSHBFMTUX    EQU *                                                              
*                                                                               
FSDBFMT      DS  0C                                                             
FSDBFMT01    DC  AL1(FSDBFMT01X-FSDBFMT01),AL2(FMDBFMT001)                      
             DC  C'BFMT1',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBFMT01X   EQU *                                                              
FSDBFMT02    DC  AL1(FSDBFMT02X-FSDBFMT02),AL2(FMDBFMT002)                      
             DC  C'BFMT2',AL1(MDTCHQ),AL1(MDLENV)                               
FSDBFMT02X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHBFMTX     EQU *                                                              
*======================= MSO SYSCODE DOWNLOADS =======================*         
                                                                                
FSHSYSC      DS  0C                                                             
             DC  AL1(FSHSYSCUX-FSHSYSC),AL2(FMHSYSCD)                           
             DC  AL2(FSHSYSCX-FSHSYSC)                                          
FSHSYSCU     DS  0C                                                             
FSHSYSCUX    EQU *                                                              
*                                                                               
FSDSYSC      DS  0C                                                             
FSDSYSC01    DC  AL1(FSDSYSC01X-FSDSYSC01),AL2(FMDDMSONAME)                     
             DC  C'MSONM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDSYSC01X   EQU *                                                              
FSDSYSC02    DC  AL1(FSDSYSC02X-FSDSYSC02),AL2(FMDDSYSCODE)                     
             DC  C'SYSCD',AL1(MDTBIQ),AL1(MDLENV)                               
FSDSYSC02X   EQU *                                                              
FSDSYSC03    DC  AL1(FSDSYSC03X-FSDSYSC03),AL2(FMDDSYSNAME)                     
             DC  C'SYSNM',AL1(MDTCHQ),AL1(MDLENV)                               
FSDSYSC03X   EQU *                                                              
FSDSYSC04    DC  AL1(FSDSYSC04X-FSDSYSC04),AL2(FMDDSYSAMKT)                     
             DC  C'AMKT ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDSYSC04X   EQU *                                                              
FSDSYSC05    DC  AL1(FSDSYSC05X-FSDSYSC05),AL2(FMDDSYSNMKT)                     
             DC  C'NMKT ',AL1(MDTBIQ),AL1(MDLENV)                               
FSDSYSC05X   EQU *                                                              
FSDSYSC06    DC  AL1(FSDSYSC06X-FSDSYSC06),AL2(FMDDSYSSBAS)                     
             DC  C'SBASE',AL1(MDTBIQ),AL1(MDLENV)                               
FSDSYSC06X   EQU *                                                              
FSDSYSC07    DC  AL1(FSDSYSC07X-FSDSYSC07),AL2(FMDDSYSUNIV)                     
             DC  C'SUNIV',AL1(MDTBIQ),AL1(MDLENV)                               
FSDSYSC07X   EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHSYSCX     EQU *                                                              
*======================= COMSCORE SWEEP DATES DOWNLOAD ===============*         
                                                                                
FSHCSSWP     DS  0C                                                             
             DC  AL1(FSHCSSWPUX-FSHCSSWP),AL2(FMCSSWP)                          
             DC  AL2(FSHCSSWPX-FSHCSSWP)                                        
FSHCSSWPU    DS  0C                                                             
FSHCSSWPUX   EQU *                                                              
*                                                                               
FSDCSSWP01   DC  AL1(FSDCSSWP01X-FSDCSSWP01),AL2(FMCSFILE)                      
             DC  C'CSFIL',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSSWP01X  EQU *                                                              
FSDCSSWP02   DC  AL1(FSDCSSWP02X-FSDCSSWP02),AL2(FMCSMEDIA)                     
             DC  C'CSMED',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSSWP02X  EQU *                                                              
FSDCSSWP03   DC  AL1(FSDCSSWP03X-FSDCSSWP03),AL2(FMCSSOURCE)                    
             DC  C'CSSRC',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSSWP03X  EQU *                                                              
FSDCSSWP04   DC  AL1(FSDCSSWP04X-FSDCSSWP04),AL2(FMCSYEAR)                      
             DC  C'CSYR ',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSSWP04X  EQU *                                                              
FSDCSSWP05   DC  AL1(FSDCSSWP05X-FSDCSSWP05),AL2(FMCSMONTH)                     
             DC  C'CSMON',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCSSWP05X  EQU *                                                              
FSDCSSWP06   DC  AL1(FSDCSSWP06X-FSDCSSWP06),AL2(FMCSSTART)                     
             DC  C'CSSTR',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSSWP06X  EQU *                                                              
FSDCSSWP07   DC  AL1(FSDCSSWP07X-FSDCSSWP07),AL2(FMCSEND)                       
             DC  C'CSEND',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSSWP07X  EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHCSSWPX    EQU *                                                              
*                                                                               
*======================= COMSCORE MARKET DOWNLOAD ====================*         
                                                                                
FSHCSMKT     DS  0C                                                             
             DC  AL1(FSHCSMKTUX-FSHCSMKT),AL2(FMCSMKT)                          
             DC  AL2(FSHCSMKTX-FSHCSMKT)                                        
FSHCSMKTU    DS  0C                                                             
FSHCSMKTUX   EQU *                                                              
*                                                                               
FSDCSMKT01   DC  AL1(FSDCSMKT01X-FSDCSMKT01),AL2(FMCSMMEDIA)                    
             DC  C'CSMED',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSMKT01X  EQU *                                                              
FSDCSMKT02   DC  AL1(FSDCSMKT02X-FSDCSMKT02),AL2(FMCSMSOURCE)                   
             DC  C'CSSRC',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSMKT02X  EQU *                                                              
FSDCSMKT03   DC  AL1(FSDCSMKT03X-FSDCSMKT03),AL2(FMCSMALPHA)                    
             DC  C'CSALP',AL1(MDTCHQ),AL1(MDLENV)                               
FSDCSMKT03X  EQU *                                                              
FSDCSMKT04   DC  AL1(FSDCSMKT04X-FSDCSMKT04),AL2(FMCSMMKTNUM)                   
             DC  C'CSMKT',AL1(MDTBIQ),AL1(MDLENV)                               
FSDCSMKT04X  EQU *                                                              
             DC  AL1(0)                                                         
*                                                                               
FSHCSMKTX    EQU *                                                              
*                                                                               
*======================= TOKEN RECORD DOWNLOAD  ======================*         
                                                                                
FSHTOK       DS  0C                                                             
             DC  AL1(FSHTOKUX-FSHTOK),AL2(FMTOK)                                
             DC  AL2(FSHTOKX-FSHTOK)                                            
FSHTOKU      DS  0C                                                             
FSHTOKUX     EQU *                                                              
*                                                                               
FSDTOK01     DC  AL1(FSDTOK01X-FSDTOK01),AL2(FMTOKEN)                           
             DC  C'TOKEN',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTOK01X    EQU *                                                              
FSDTOK02     DC  AL1(FSDTOK02X-FSDTOK02),AL2(FMTOKSDATA)                        
             DC  C'CDATA',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTOK02X    EQU *                                                              
FSDTOK03     DC  AL1(FSDTOK03X-FSDTOK03),AL2(FMTOKMENDP)                        
             DC  C'MENDP',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTOK03X    EQU *                                                              
FSDTOK04     DC  AL1(FSDTOK04X-FSDTOK04),AL2(FMTOKMASHK)                        
             DC  C'MASHK',AL1(MDTCHQ),AL1(MDLENV)                               
FSDTOK04X    EQU *                                                              
FSDTOK05     DC  AL1(FSDTOK05X-FSDTOK05),AL2(FMTOKNODAYS)                       
             DC  C'NODAY',AL1(MDTBIQ),AL1(MDLENV)                               
FSDTOK05X    EQU *                                                              
*                                                                               
FSHTOKX      EQU *                                                              
*                                                                               
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (RECEIVE: VERSI+        
               ON STAMPS)'                                                      
*==================== PC APPLICATION VERSION STAMP ===================*         
                                                                                
FRHVSNA      DS  0C                                                             
             DC  AL1(FRHVSNAUX-FRHVSNA),AL2(FMHVSNA)                            
             DC  AL2(FRHVSNAX-FRHVSNA)                                          
FRHVSNAU     DS  0C                                                             
FRHVSNAUX    EQU *                                                              
*                                                                               
FRDVSNA      DS  0C                                                             
FRDVSNA01    DC  AL1(FRDVSNA01X-FRDVSNA01),AL2(FMDVSNAVER)                      
             DC  C'VER# ',AL1(MDTHXQ),AL1(4)                                    
FRDVSNA01X   EQU *                                                              
*                                                                               
FRHVSNAX     EQU *                                                              
                                                                                
                                                                                
                                                                                
FRHVSN1      DS  0C                                                             
             DC  AL1(FRHVSN1UX-FRHVSN1),AL2(FMHVSN1)                            
             DC  AL2(FRHVSN1X-FRHVSN1)                                          
FRHVSN1U     DS  0C                                                             
FRHVSN1UX    EQU *                                                              
*                                                                               
FRDVSN1      DS  0C                                                             
FRDVSN101    DC  AL1(FRDVSN101X-FRDVSN101),AL2(FMDVSN1VER)                      
             DC  C'VER# ',AL1(MDTHXQ),AL1(4)                                    
FRDVSN101X   EQU *                                                              
*                                                                               
FRHVSN1X     EQU *                                                              
         TITLE 'DEDEMMAPT - $DEM FALINK MAP CODE TABLES (END OF TABLE)'         
*========================== END OF MAP TABLE =========================*         
                                                                                
             DC  AL1(0)                                                         
