*          DATA SET DEDEMLNETD AT LEVEL 017 AS OF 08/03/05                      
***********************************************************************         
* DSECTS FOR TABLES OF LONG NETWORK NAMES                             *         
***********************************************************************         
                                                                                
LCABNETD DSECT                     DSECT FOR TABLE OF CABLE NETWORKS            
LCABNET  DS    CL4                 NETWORK CODE                                 
LCABNUM  DS    AL2                 NETWORK NUMERIC CODE                         
LCABNAME DS    CL30                NETWORK NAME                                 
LCABNETL EQU   *-LCABNETD                                                       
                                                                                
LBRONETD DSECT                     DSECT FOR TABLE OF BROADCAST NETWRKS         
LBRONET  DS    CL3                 NETWORK CODE                                 
LBRONAME DS    CL30                NETWORK NAME                                 
LBRONETL EQU   *-LBRONETD                                                       
                                                                                
LSYNNETD DSECT                     DSECT FOR TABLE OF SYNDICATORS               
LSYNNET  DS    CL3                 NETWORK CODE                                 
LSYNNAME DS    CL30                NETWORK NAME                                 
LSYNNETL EQU   *-LSYNNETD                                                       
                                                                                
LNHBNETD DSECT                     DSECT FOR TABLE OF HISPNIC BROADCAST         
LNHBNET  DS    CL3                 NETWORK CODE                                 
LNHBNAME DS    CL30                NETWORK NAME                                 
LNHBNETL EQU   *-LNHBNETD                                                       
                                                                                
LNHCNETD DSECT                     DSECT FOR TABLE OF HISP CABLE NETS           
LNHCNET  DS    CL4                 NETWORK CODE                                 
LNHCNUM  DS    AL2                 NETWORK NUMERIC CODE                         
LNHCNAME DS    CL30                NETWORK NAME                                 
LNHCNETL EQU   *-LNHCNETD                                                       
                                                                                
LAGGNETD DSECT                     DSECT FOR TABLE OF AGGREGATE NETWRKS         
LAGGNET  DS    CL3                 NETWORK CODE                                 
LAGGNUM  DS    AL2                 NETWORK NUMERIC CODE (NIELSEN)               
LAGGNAME DS    CL30                NETWORK NAME                                 
LAGGNETL EQU   *-LAGGNETD                                                       
                                                                                
LNHANETD DSECT                     DSECT FOR TABLE OF HISPANIC AGGRGATS         
LNHANET  DS    CL3                 NETWORK CODE                                 
LNHANUM  DS    AL2                 NETWORK NUMERIC CODE (NIELSEN)               
LNHANAME DS    CL30                NETWORK NAME                                 
LNHANETL EQU   *-LNHANETD                                                       
                                                                                
