*          DATA SET DEDEMFFD   AT LEVEL 012 AS OF 04/17/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21BFFD      DATE 04/17/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DEMMSGH  DS    CL8                                                              
DEMMSG   DS    CL60     1    2   60  A  P N             T        Y              
DEMSRVH  DS    CL8                                                              
DEMSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P N             T        Y              
DEMACTH  DS    CL8                                                              
DEMACT   DS    CL8      2   11    8  A  U H        M    T    I   Y              
         DS    CL8                                                              
         DS    CL4      2   21    4  L  P N             T        Y              
DEMFILH  DS    CL8                                                              
DEMFIL   DS    CL3      2   27    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      2   32    6  L  P N             T        Y              
DEMSRCH  DS    CL8                                                              
DEMSRC   DS    CL3      2   42    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      2   47    8  L  P N             T        Y              
DEMSTNH  DS    CL8                                                              
DEMSTN   DS    CL24     2   56   24  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL5      3    2    5  L  P N             T        Y              
DEMBOKH  DS    CL8                                                              
DEMBOK   DS    CL30     3   11   30  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      4    2    8  L  P N             T        Y              
DEMDATH  DS    CL8                                                              
DEMDAT   DS    CL69     4   11   69  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL5      5    2    5  L  P N             T        Y              
DEMDEMH  DS    CL8                                                              
DEMDEM   DS    CL69     5   11   69  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P N             T        Y              
DEMOPTH  DS    CL8                                                              
DEMOPT   DS    CL69     6   11   69  A  U H             T        Y              
DEMTABH  DS    CL8                                                              
DEMTAB   DS    CL1      7   11    1  A  U N             T        Y              
DEMHD1H  DS    CL8                                                              
DEMHD1   DS    CL78     8    2   78  A  P H             T        Y              
DEMHD2H  DS    CL8                                                              
DEMHD2   DS    CL78     9    2   78  A  P H             T        Y              
DEMHD3H  DS    CL8                                                              
DEMHD3   DS    CL78    10    2   78  A  P H             T        Y              
DEMLN1H  DS    CL8                                                              
DEMLN1   DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2024 BYTES                            
