*          DATA SET DEDUPLFIXT AT LEVEL 001 AS OF 02/11/05                      
************************************************************                    
*NUMTAB - TABLE OF PROGRAM NUMBERS TO SET IN MAP                                
*NEW NTI + OLD NTI + NTILONG + NET + FLAG + BOOKS + EOR(0)                      
*1 BEFORE DATE LIST MEANS DO NOT REDIRECT PROGRAM NUMBER                        
*  FOR THESE BOOKS                                                              
*NOTHING BEFORE DATE LIST MEANS REDIRECT PROG NUMBER FOR THESE BOOKS            
************************************************************                    
                                                                                
NUMTABS  DS    0X                  SYNDICATION PROGRAMS                         
         DC    AL2(8701),AL2(3414),C'0000145786',C'THN S',AL1(DIFFNET)          
         DC    C'040329',AL1(0)                                                 
         DC    AL2(8702),AL2(3415),C'0000145611',C'FXS S',AL1(SAMENET)          
         DC    C'040329',AL1(0)                                                 
         DC    AL2(8703),AL2(3416),C'0000145627',C'FXS S',AL1(SAMENET)          
         DC    C'040329',AL1(0)                                                 
         DC    AL2(8704),AL2(3417),C'0000145673',C'FXS S',AL1(SAMENET)          
         DC    C'040329',AL1(0)                                                 
         DC    AL2(8705),AL2(3418),C'0000145748',C'FXS S',AL1(SAMENET)          
         DC    C'040329',AL1(0)                                                 
         DC    AL2(8706),AL2(3419),C'0000145749',C'FXS S',AL1(SAMENET)          
         DC    C'040329',AL1(0)                                                 
         DC    AL2(8707),AL2(3420),C'0000145750',C'FXS S',AL1(SAMENET)          
         DC    C'040329',AL1(0)                                                 
         DC    AL2(8708),AL2(3421),C'0000145751',C'FXS S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    AL2(8709),AL2(3423),C'0000145575',C'FXS S',AL1(DIFFNET)          
         DC    C'040322',AL1(0)                                                 
         DC    AL2(8710),AL2(3424),C'0000145576',C'FXS S',AL1(SAMENET)          
         DC    C'040322',AL1(0)                                                 
         DC    AL2(8711),AL2(3425),C'0000145577',C'FXS S',AL1(SAMENET)          
         DC    C'040322',AL1(0)                                                 
         DC    AL2(8712),AL2(3618),C'0000148016',C'FXS S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    AL2(8713),AL2(3619),C'0000148033',C'FXS S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    AL2(8714),AL2(3620),C'0000147794',C'FXS S',AL1(SAMENET)          
         DC    C'040614',AL1(0)                                                 
         DC    AL2(8715),AL2(3621),C'0000147795',C'FXS S',AL1(SAMENET)          
         DC    C'040614',AL1(0)                                                 
         DC    AL2(8716),AL2(3622),C'0000148141',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'041220',AL1(0)                                          
         DC    AL2(8717),AL2(3623),C'0000148142',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040712',AL1(0)                                          
         DC    AL2(8718),AL2(3624),C'0000148143',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040705',AL1(0)                                          
         DC    AL2(8719),AL2(3625),C'0000147985',C'FXS S',AL1(SAMENET)          
         DC    C'040614',AL1(0)                                                 
         DC    AL2(8720),AL2(3626),C'0000147986',C'FXS S',AL1(SAMENET)          
         DC    C'040614',AL1(0)                                                 
         DC    AL2(8721),AL2(3627),C'0000148146',C'FXS S',AL1(SAMENET)          
         DC    C'040621',AL1(0)                                                 
         DC    AL2(8722),AL2(3628),C'0000147988',C'FXS S',AL1(SAMENET)          
         DC    C'040614',AL1(0)                                                 
         DC    AL2(8723),AL2(3629),C'0000147989',C'FXS S',AL1(SAMENET)          
         DC    C'040614',AL1(0)                                                 
         DC    AL2(8724),AL2(3806),C'0000148179',C'UNE S',AL1(DIFFNET)          
         DC    C'040816',AL1(0)                                                 
         DC    AL2(8725),AL2(3807),C'0000149484',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040816',C'040823',C'040830',C'040906',AL1(0)            
         DC    AL2(8726),AL2(3808),C'0000149609',C'FXS S',AL1(DIFFNET)          
         DC    C'040816',AL1(0)                                                 
         DC    AL2(8727),AL2(3809),C'0000149610',C'FXS S',AL1(DIFFNET)          
         DC    C'040816',AL1(0)                                                 
         DC    AL2(8728),AL2(3810),C'0000149611',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040816',C'040823',C'040830',C'040906',AL1(0)            
         DC    AL2(8729),AL2(3811),C'0000149612',C'FXS S',AL1(DIFFNET)          
         DC    C'040816',AL1(0)                                                 
         DC    AL2(8730),AL2(3812),C'0000149613',C'FXS S',AL1(DIFFNET)          
         DC    C'040816',C'040830',AL1(0)                                       
         DC    AL2(8731),AL2(3813),C'0000149766',C'FXS S',AL1(DIFFNET)          
         DC    C'040823',AL1(0)                                                 
         DC    AL2(8732),AL2(3814),C'0000149767',C'FXS S',AL1(DIFFNET)          
         DC    C'040823',AL1(0)                                                 
         DC    AL2(8733),AL2(3815),C'0000149768',C'FXS S',AL1(DIFFNET)          
         DC    C'040823',AL1(0)                                                 
         DC    AL2(8734),AL2(3816),C'0000149769',C'FXS S',AL1(DIFFNET)          
         DC    C'040823',AL1(0)                                                 
         DC    AL2(8735),AL2(3817),C'0000149770',C'FXS S',AL1(DIFFNET)          
         DC    C'040823',AL1(0)                                                 
         DC    AL2(8736),AL2(3818),C'0000149771',C'FXS S',AL1(DIFFNET)          
         DC    C'040823',AL1(0)                                                 
         DC    AL2(8737),AL2(3819),C'0000149772',C'FXS S',AL1(DIFFNET)          
         DC    C'040823',AL1(0)                                                 
         DC    AL2(8738),AL2(3820),C'0000150062',C'PRM S',AL1(DIFFNET)          
         DC    AL1(0)                                                           
         DC    AL2(8739),AL2(3821),C'0000149938',C'FXS S',AL1(DIFFNET)          
         DC    C'040830',AL1(0)                                                 
         DC    AL2(8740),AL2(3822),C'0000149948',C'FXS S',AL1(DIFFNET)          
         DC    C'040830',AL1(0)                                                 
         DC    AL2(8741),AL2(3823),C'0000149949',C'FXS S',AL1(DIFFNET)          
         DC    C'040830',AL1(0)                                                 
         DC    AL2(8742),AL2(3824),C'0000149950',C'FXS S',AL1(SAMENET)          
         DC    C'040830',AL1(0)                                                 
         DC    AL2(8743),AL2(3825),C'0000150048',C'PRM S',AL1(DIFFNET)          
         DC    AL1(0)                                                           
         DC    AL2(8744),AL2(3826),C'0000149872',C'T/L S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',AL1(0)                                
         DC    AL2(8745),AL2(3827),C'0000150211',C'NBU S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    AL2(8746),AL2(3828),C'0000149875',C'NBU S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',AL1(0)                                
         DC    AL2(8747),AL2(3829),C'0000149971',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',AL1(0)                                
         DC    AL2(8748),AL2(3830),C'0000149972',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',AL1(0)                                
         DC    AL2(8749),AL2(3831),C'0000149994',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',AL1(0)                                
         DC    AL2(8750),AL2(3832),C'0000149995',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',AL1(0)                                
         DC    AL2(8751),AL2(3833),C'0000150040',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',C'040927',AL1(0)                      
         DC    AL2(8752),AL2(3834),C'0000150041',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040913',C'040920',C'040927',C'041004',C'041011'         
         DC    C'041018',C'041025',C'041101',C'041108',C'041115',AL1(0)         
         DC    AL2(8753),AL2(3835),C'0000150079',C'FXS S',AL1(SAMENET)          
         DC    C'040906',AL1(0)                                                 
         DC    AL2(8754),AL2(3836),C'0000150080',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040906',C'040913',C'040920',AL1(0)                      
         DC    AL2(8755),AL2(3837),C'0000150081',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040906',C'040913',C'040920',AL1(0)                      
         DC    AL2(8756),AL2(3838),C'0000150116',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040906',C'040913',C'040920',C'041213',AL1(0)            
         DC    AL2(8757),AL2(3839),C'0000150117',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040906',C'040913',C'040920',C'041011',AL1(0)            
         DC    AL2(8758),AL2(3840),C'0000150118',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040906',C'040913',C'040920',C'041011',AL1(0)            
         DC    AL2(8770),AL2(3841),C'0000150486',C'FXS S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    AL2(8771),AL2(3842),C'0000150488',C'FXS S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    AL2(8759),AL2(3843),C'0000150121',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040906',C'040913',AL1(0)                                
         DC    AL2(8760),AL2(3844),C'0000150122',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',C'040920',AL1(0)                      
         DC    AL2(8761),AL2(3845),C'0000150123',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',C'040920',AL1(0)                      
         DC    AL2(8762),AL2(3846),C'0000150124',C'FXS S',AL1(DIFFNET)          
         DC    C'040906',AL1(0)                                                 
         DC    AL2(8763),AL2(3847),C'0000150125',C'FXS S',AL1(DIFFNET)          
         DC    AL1(1),C'040906',C'040913',C'040920',C'041004',C'041011'         
         DC    C'041018',C'041025',C'041101',C'041108',C'041115'                
         DC    C'041122',C'041129',C'041206',C'041227',AL1(0)                   
         DC    AL2(8764),AL2(3848),C'0000150126',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040906',C'040913',C'040920',C'041213',C'050110'         
         DC    C'050117',C'050124',AL1(0)                                       
         DC    AL2(8765),AL2(3849),C'0000150127',C'FXS S',AL1(SAMENET)          
         DC    C'040906',AL1(0)                                                 
         DC    AL2(8766),AL2(3850),C'0000150128',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'040906',C'041018',C'041101',AL1(0)                      
         DC    AL2(8767),AL2(3851),C'0000150129',C'FXS S',AL1(SAMENET)          
         DC    C'040906',AL1(0)                                                 
         DC    AL2(8768),AL2(3852),C'0000150681',C'FXS S',AL1(SAMENET)          
         DC    AL1(1),C'041108',C'041206',AL1(0)                                
         DC    AL2(8769),AL2(3853),C'0000150682',C'FXS S',AL1(SAMENET)          
         DC    C'040927',C'041011',C'041018',C'041025',C'041101',AL1(0)         
         DC    AL2(8772),AL2(4087),C'0000153524',C'FXS S',AL1(DIFFNET)          
         DC    C'050117',C'050124',AL1(0)                                       
         DC    AL2(8773),AL2(4088),C'0000153525',C'FXS S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    AL2(8774),AL2(4089),C'0000153526',C'FXS S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    AL2(8775),AL2(4090),C'0000153380',C'FXS S',AL1(SAMENET)          
         DC    C'050110',C'050117',C'050124',AL1(0)                             
         DC    AL2(8776),AL2(4091),C'0000153586',C'FXS S',AL1(SAMENET)          
         DC    AL1(0)                                                           
         DC    X'FF'                                                            
                                                                                
NUMTABN  DS    0X                  NTI PROGRAMS                                 
         DC    AL2(17051),AL2(8923),C'0000120080',C'NBC T',AL1(SAMENET)         
         DC    C'010519',C'020518',C'030517',C'040515',AL1(0)                   
         DC    X'FF'                                                            
                                                                                
NUMTABD  DSECT                                                                  
NEWNTI   DS    AL2                                                              
OLDNTI   DS    AL2                                                              
NTILONG  DS    CL10                                                             
NETW     DS    CL5                                                              
NETFLAG  DS    X                                                                
DIFFNET  EQU   X'00'                                                            
SAMENET  EQU   X'01'               DUPLICATE NUMBRS ARE WITHIN SAME NET         
DATELIST DS    0CL6                                                             
                                                                                
