*          DATA SET DEFSTDSPD  AT LEVEL 002 AS OF 07/01/94                      
*                                                                               
FSTTBLD  DSECT                                                                  
FSTFILE  DS    CL2                 FILE CODE                                    
FSTELEM  DS    X                   FAST ELEMENT CODE                            
FSTMODF  DS    C                   MODIFIER                                     
FSTADDR  DS    A                   ADDRESS OF FORMULA TABLE                     
FSTTBLN  EQU   *-FSTFILE                                                        
*                                                                               
FSTD     DSECT                                                                  
FSTDSP   DS    X                   DEMO DISPMNT INTO ELEMENT                    
FSTLEN   DS    X                   LENGTH OF ENTIRE FSTTBL ENTRY                
FSTFLGS  DS    X                   FLAGS FOR PROCESSING THIS ENTRY              
FSTELQ   DS    X                   ACTUAL ELEMENT CODE IN RECD                  
FSTDEMS  DS    0X                  DEMO DSPS THAT SUM TO CURRENT BCKT           
*                                                                               
