*          DATA SET DEINTTP95D AT LEVEL 002 AS OF 06/06/95                      
         SPACE 2                                                                
*                                  9507 ARB FILE CONVERSION                     
INTSAT   DS    CL5                 SATELLITE STATION CALL LETTERS               
         ORG   INTDATA                                                          
INTUNIVS DS    0XL4                UNIVERSE VALUES                              
         ORG   INTDATA                                                          
INTMTYP  DS    X                   MARKET TYPE                                  
INTDAY   DS    X                   DAY (START-END)                              
INTWEEKS DS    X                   ACTIVE WEEKS                                 
INTPNAM  DS    CL14                PROGRAM NAME                                 
INTDPT   DS    CL3                 ARB DAYPART NUMBER                           
INTAQH   DS    CL1                 AQH,CUME,EXCL CUME INDIC                     
INTGEO   DS    CL1                 MSA,TSA,ADI                                  
INTLISN  DS    CL1                 AWAY FROM HOME LISTENING?                    
INTACCS  DS    0X                  ACCUMULATOR VALUES                           
