*          DATA SET DEINTTPT3D AT LEVEL 004 AS OF 08/24/93                      
         SPACE 2                                                                
*                                  TPT FILE CONVERSION FIELDS                   
INTSAT   DS    CL5                 SATELLITE STATION CALL LETTERS               
         ORG   INTDATA                                                          
INTUNIVS DS    0XL4                UNIVERSE VALUES                              
         ORG   INTDATA                                                          
INTMTYP  DS    X                   MARKET TYPE                                  
INTDAY   DS    X                   DAY (START-END)                              
INTWEEKS DS    X                   ACTIVE WEEKS                                 
INTPNAM  DS    CL14                PROGRAM NAME                                 
INTPNAM6 DS    CL6                 6 CHAR PROGRAM NAME                          
INTPNUM  DS    XL4                 PROGRAM NUMBER                               
INTPTYP  DS    CL2                 PROGRAM TYPE                                 
INTAFFL  DS    CL5                 AFFILIATIONS                                 
INTREV   DS    CL1                 REVISION NUMBER                              
INTPRSRC DS    CL2                 PROGRAMMING SOURCE                           
INTACCS  DS    0X                  ACCUMULATOR VALUES                           
