*          DATA SET DEINTTPTD  AT LEVEL 001 AS OF 11/02/81                      
         SPACE 2                                                                
*                                  TPT FILE CONVERSION FIELDS                   
INTSAT   DS    CL5                 SATELLITE STATION CALL LETTERS               
         ORG   INTDATA                                                          
INTUNIVS DS    0XL4                UNIVERSE VALUES                              
         ORG   INTDATA                                                          
INTMTYP  DS    X                   MARKET TYPE                                  
INTDAY   DS    X                   DAY (START-END)                              
INTWEEKS DS    X                   ACTIVE WEEKS                                 
INTPNAM  DS    CL14                PROGRAM NAME                                 
INTACCS  DS    0X                  ACCUMULATOR VALUES                           
