*          DATA SET DEINTNETD  AT LEVEL 001 AS OF 11/02/81                      
         SPACE 2                                                                
*                                  NETWORK FILE CONVERSION FIELDS               
INTMTYP  DS    X                   MARKET TYPE                                  
INTPNUM  DS    CL2                 PROGRAM NUMBER                               
INTDTYP  DS    X                   DATA TYPE                                    
INTPTYP  DS    X                   PROGRAM TYPE                                 
INTDPT   DS    X                   DAYPART                                      
INTPREM  DS    X                   PREMIERE                                     
INTRCH   DS    XL2                 REACH                                        
INTSCNT  DS    XL2                 STATION COUNT                                
INTCOVR  DS    XL2                 COVERAGE                                     
INTWEEKS DS    X                   ACTIVE WEEKS                                 
INTPNAME DS    CL14                PROGRAM NAME                                 
INTACCS  DS    0XL4                ACCUMULATOR VALUES                           
