*          DATA SET DEINTNT4D  AT LEVEL 009 AS OF 09/04/01                      
*                                  NTI FILE CONVERSION FIELDS (8733)            
INTDYBIT DS    B                   DAY CODE BIT SETTING                         
INTDUR   DS    X                   DURATION IN QUARTER HOURS                    
INTDURM  DS    X                   DURATION IN MINUTES                          
INTSTIM  DS    XL2                 PROGRAM START TIME - MILITARY                
INTETIM  DS    XL2                 PROGRAM END TIME - MILITARY                  
*                                                                               
INTPNUM  DS    XL2                 PROGRAM NUMBER                               
INTPNTI  DS    CL5                 5 CHAR NTI # PWOS                            
INTPTYP4 DS    CL4                 PROGRAM TYPE                                 
INTSPTYP DS    CL4                 SUB PROGRAM TYPE                             
INTDPT   DS    C                   NSI DAYPART (ALWAYS ZERO)                    
INTPREM  DS    C                   PREMIERE INDICATOR                           
INTPNAME DS    CL25                PROGRAM NAME                                 
INTTITLE DS    CL32                EPISODE TITLE                                
INTAUD   DS    XL2                 AUDIENCE PROJECTION                          
INTSTAC  DS    XL2                 STATION COUNT                                
INTCOV   DS    XL2                 COVERAGE                                     
INTRSF   DS    X                   REDUCED STAT FACILITIES INDICATOR            
*                                                                               
INTMTYP  DS    X                   MARKET TYPE                                  
INTDTYP  DS    X                   DATA TYPE - SET BY TELECAST TYPE             
INTIBOOK DS    XL2                 INTERNAL BOOK VALUE (FOR '5E' ELEM)          
INTDPT2  DS    CL2                 NTI DAYPART                                  
INTVAR   DS    7XL7    XL1,XL1     VAR - 7 DAYS    START QH/END QH              
*                      XL1                         DURATION IN MINUTES          
*                      XL2,XL2                     START TIME/END TIME          
*                                                                               
INTACCS  DS    0F                  WORK AREA VALUES                             
