*          DATA SET DEINTPAVD  AT LEVEL 001 AS OF 10/29/81                      
         SPACE 2                                                                
*                                  PAV FILE CONVERSION FIELDS                   
INTMTYP  DS    X                   MARKET TYPE                                  
INTPNUM  DS    XL2                 PROGRAM NUMBER                               
INTDTYP  DS    X                   DATA TYPE                                    
INTWEEKS DS    X                   ACTIVE WEEKS                                 
INTPNAME DS    CL14                PROGRAM NAME                                 
INTACCS  DS    0X                  ACCUMULATOR VALUES                           
