*          DATA SET DEINTRCYD  AT LEVEL 001 AS OF 06/12/09                      
* INTERIM RECORD FOR THE RADIO COUNTY COVERAGE CONVERSION.                      
*                                                                               
         ORG   INTDATA                                                          
INTSTATE DS    XL1                 STATE CODE                                   
INTCNTY  DS    HL2                 COUNTY CODE                                  
INTSTAT  DS    CL4                 STATION                                      
INTBAND  DS    CL1                 AM/FM BAND INDICATOR                         
INTSTCH  DS    CL2                 STATE ALPHA 2 CHARACTER ABBREVIATION         
INTCTYNA DS    CL22                ALPHA COUNTY NAME                            
INTMETRC DS    HL2                 METRO MARKET CODE                            
INTMETRA DS    CL32                ALPHA METRO MARKET NAME                      
INTDMAC  DS    HL2                 DMA CODE                                     
INTDMAA  DS    CL32                ALPHA DMA NAME                               
INTRACEW DS    CL1                 RACE WEIGHTING INDICATOR                     
INTTIER  DS    HL1                 TIER                                         
INTSTCIT DS    CL19                STATION CITY OF LICENSE                      
INTSTCTY DS    CL18                STATION COUNTY OF LICENSE                    
INTSTSTA DS    CL2                 STATE ABBREVIATION OF LICENSE                
INTSTAFS DS    CL16                AFFILIATIONS (MAX 8 * 2 BYTES EA)            
INTSTDYP DS    CL6                 STATION DAY POWER                            
INTSTNTP DS    CL6                 STATION NIGHT POWER                          
INTSTFRQ DS    CL5                 STATION FREQUENCY                            
INTSTMKN DS    CL32                STATION MARKET NAME                          
INTDPT   DS    XL1                 DAYPART ID                                   
INTDPQH  DS    HL2                 DAYPART TOTAL QH DURATION                    
INTDPTNM DS    CL14                DAYPART NAME                                 
INTDMILS DS    HL2                 DAYPART MILITARY START TIME                  
INTDMILE DS    HL2                 DAYPART MILITARY END TIME                    
         DS    XL10                SPARE                                        
*                                                                               
INTACCS  DS    0X                  ACCUMULATOR VALUES                           
