*          DATA SET DEINTPAV3D AT LEVEL 004 AS OF 05/16/11                      
         SPACE 2                                                                
*                                  PAV FILE CONVERSION FIELDS                   
INTMTYP  DS    X                   MARKET TYPE                                  
INTREVID DS    XL1                 REVISION ID = X'FF'                          
INTREV   DS    XL1                 REVISION NUMBER                              
INTDTYP  DS    X                   DATA TYPE                                    
INTWEEKS DS    X                   ACTIVE WEEKS                                 
INTPNAME DS    CL14                PROGRAM NAME                                 
INTPNAM6 DS    CL6                 6 CHAR PROGRAM NAME                          
INTPNUM  DS    XL4                 PROGRAM NUMBER                               
INTPTYP  DS    CL2                 PROGRAM TYPE                                 
INTAFFL  DS    CL5                 AFFILIATIONS                                 
INTPRSRC DS    CL2                 PROGRAM SOURCE                               
INTNDAYS DS    XL1                 NUMBER OF DAYS                               
INTADUR2 DS    XL2                 TOTAL DUR. FOR PRGM RECS (2-BYTE)            
         DS    XL5                 (SPARE)                                      
INTACCS  DS    0X                  ACCUMULATOR VALUES                           
