*          DATA SET DEISGEND   AT LEVEL 002 AS OF 02/21/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB2FFFD      DATE 02/21/06                 
         SPACE 1                                                                
TB2FFFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
XXXHEADH DS    XL8                                                              
XXXHEAD  DS    CL60     1    2   60  A  P N             T        Y              
XXXLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
XXXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 136  BYTES                            
