*          DATA SET DELMDSECT  AT LEVEL 020 AS OF 10/08/18                      
* DSECT TO COVER THE LOCAL MONTHLY WORK RECORDS                                 
***********************************************************************         
LMDSECT    DSECT                                                                
W_REC      DS    0CL(W_LMRECLQ)      ENTIRE RECORD, INCLUDING SPARE             
*                                                                               
W_REC_WITHOUT_JOIN_INDICATOR DS 0CL(W_REC_WITHOUT_JOIN_INDICATOR_LQ)            
W_KREC     DS    0CL(W_KRECQ)        KEY OF THE RECORD                          
W_RECDATA  DS    0CL(W_LMRECDLQ)     RECORD UP TO SPARE                         
W_RECNOR   DS    0CL(W_RECNORLQ)     RECORD INCLUDING TEMP "NORMAL" INF         
*                                                                               
*-------------------------------------------------------------------            
* KEY AREA                                                                      
*-------------------------------------------------------------------            
W_KAREA    DS    0CL(W_KAREALQ)                                                 
W_KFILETYPE DS   CL01                                                           
W_KFILETYPE_MONTHLY  EQU  C'M',,C'C'                                            
W_KFILETYPE_WEEKLY   EQU  C'w',,C'C'                                            
W_KFILETYPE_UNIVERSE EQU  C'U',,C'C'                                            
W_KSEQ     DS    XL01     Sequence Code                                         
W_KWEEK    DS    CL01     Week #                                                
*                                                                               
W_KDAY     DS    CL01     Day Sequence #                                        
MONDAY_FRIDAY  EQU  C'0',,C'C'                                                  
MONDAY         EQU  C'1',,C'C'                                                  
TUESDAY        EQU  C'2',,C'C'                                                  
WEDNESDAY      EQU  C'3',,C'C'                                                  
THURSDAY       EQU  C'4',,C'C'                                                  
FRIDAY         EQU  C'5',,C'C'                                                  
AV_EXCL_WKND   EQU  C'6',,C'C'                                                  
SATURDAY       EQU  C'7',,C'C'                                                  
SUNDAY         EQU  C'8',,C'C'                                                  
AV_INCL_WKND   EQU  C'9',,C'C'                                                  
*                                                                               
W_KDAY_ALF DS    CL03     Day Alpha: M-F,MON,TUE,WED,THU,FRI,SAT,SUN,           
*                                    AV2,AV3,AV4,AV5,AV6,AV7                    
MON_ALF  EQU   C'MON',3,C'C'                                                    
TUE_ALF  EQU   C'TUE',3,C'C'                                                    
WED_ALF  EQU   C'WED',3,C'C'                                                    
THU_ALF  EQU   C'THU',3,C'C'                                                    
FRI_ALF  EQU   C'FRI',3,C'C'                                                    
SAT_ALF  EQU   C'SAT',3,C'C'                                                    
SUN_ALF  EQU   C'SUN',3,C'C'                                                    
MF_ALF   EQU   C'M-F',3,C'C'                                                    
AV2_ALF  EQU   C'AV2',3,C'C'                                                    
AV3_ALF  EQU   C'AV3',3,C'C'                                                    
AV4_ALF  EQU   C'AV4',3,C'C'                                                    
AV5_ALF  EQU   C'AV5',3,C'C'                                                    
AV6_ALF  EQU   C'AV6',3,C'C'                                                    
AV7_ALF  EQU   C'AV7',3,C'C'                                                    
*                                                                               
W_KCODE    DS    CL02     Record Code                                           
*                                                                               
W_KDTYPE   DS    0CL(W_KDTYPLQ)   THESE FIELDS DEFINE A TYPE OF DATA            
W_KDTUNPL  DS    0CL(W_KDTUNPLQ)                                                
* THESE FIELDS DEFINE THE TYPE OF DATA THAT HAS UNIQUE PROGRAM                  
* LINEUPS FOR EACH TYPE.                                                        
W_KRSRVC   DS    CL1      Reporting Service                                     
RSRVC_NSI  EQU   C'1',,C'C' 1 = NSI-Nielsen Station Index                       
RSRVC_NHSI EQU   C'2',,C'C' 2 = NHSI-Nielsen Hispanic Station Index             
*                                (valid prior to Oct27/2011)                    
RSRVC_NSID EQU   C'3',,C'C' 3 = NSID-Nielsen Station Index LPM Prelim           
RSRVC_NHSD EQU   C'4',,C'C' 4 = NHSID-Nielsen Hisp Sta Indx LPM Prelim          
*                                (valid prior to Oct27/2011)                    
RSRVC_NHIL EQU   C'5',,C'C' 5 = NHIL-Nielsen Local Cable Service                
RSRVC_NSIP EQU   C'6',,C'C' 6 = NSI LPM DMA Preview                             
*                                (valid prior to June/2018 survey)              
RSRVC_NSIX EQU   C'7',,C'C' 7 = NSIX-NSI Parallel/Impact Data                   
RSRVC_NCM  EQU   C'C',,C'C' C = NCM-National CineMedia                          
*                                                                               
W_KMKTC    DS    CL03     Market Code                                           
W_KRPRD    DS    CL02     Report Period                                         
W_KRPYR    DS    CL04     Report Year                                           
W_KDISC    DS    CL04     Distributor Code                                      
W_KDTUNPLQ EQU   *-W_KRSRVC                                                     
* THE REST OF THE FIELDS IDENTIFY DATA THAT HAS THE SAME PROGRAM                
* LINEUP ACROSS THE VARIOUS TYPES.                                              
W_KSPEXC   DS    CL02     Special Report Exclusion Indicator                    
W_KPBACK   DS    CL01     Playback Type                                         
PLB_LO     EQU   C'O',,C'C'   Live Only                                         
PLB_LS     EQU   C'S',,C'C'   Live +SD                                          
PLB_L1     EQU   C'1',,C'C'   Live +1                                           
PLB_L3     EQU   C'3',,C'C'   Live +3                                           
PLB_L7     EQU   C'7',,C'C'   Live +7                                           
W_KSAMTY   DS    CL01     Sample Type                                           
STYP_TDMA  EQU   C'1',,C'C'    Total DMA                                        
STYP_WIRED EQU   C'2',,C'C'    Wired                                            
STYP_NCM_TDMA        EQU   C'A',,C'C'    NCM Total DMA                          
STYP_NCM_RATING_G    EQU   C'B',,C'C'    NCM Rating G                           
STYP_NCM_RATING_NR   EQU   C'C',,C'C'    NCM Rating NR                          
STYP_NCM_RATING_PG   EQU   C'D',,C'C'    NCM Rating PG                          
STYP_NCM_RATING_PG13 EQU   C'E',,C'C'    NCM Rating PG-13                       
STYP_NCM_RATING_R    EQU   C'F',,C'C'    NCM Rating R                           
W_KSUBSI   DS    CL05     SubSample Indicator                                   
W_KDTYPLQ  EQU   *-W_KRSRVC                                                     
*                                                                               
W_KOCALL   DS    CL04     Legacy Call Letters                                   
W_KCALDT   DS    CL18     Calendar Date Time                                    
           ORG   W_KCALDT                                                       
W_KDATE    DS    CL6      MM/DD/  EX: 12/04/                                    
W_KYEAR    DS    CL4      YEAR    EX: 2010                                      
W_KTIME    DS    CL8                                                            
***********************************************************************         
* DEIS AUG/13: I DON'T UNDERSTAND THE FOLLOWING COMMENT. THE FIELDS             
*              BELOW DON'T OVERLAP THE FIELDS ABOVE.                            
*                                                                               
* FIELDS BELOW PARTIALLY OVERWRITES THE DATE/TIME FIELD, SPECIFICALLY           
* IT OVERWRITES THE TIME PART OF THE FIELD.  SINCE WE HAVE NO USE FOR           
* THE TIME IN ITS CHARACTER FORMAT, INSTEAD WE ARE STORING PROGRAM              
* RELATED QUARTER HOUR INFORMATION IN HEX-DECIMAL.                              
***********************************************************************         
W_KQHR     DS    XL1      ACTUAL-QH     EX: X'0B'                               
*                                                                               
W_KAWKS    DS    CL04     Activity Weeks                                        
           ORG   W_KAWKS                                                        
W_KAWK1    DS    CL1          WEEK 1                                            
W_KAWK2    DS    CL1          WEEK 2                                            
W_KAWK3    DS    CL1          WEEK 3                                            
W_KAWK4    DS    CL1          WEEK 4                                            
*                                                                               
W_KDAYMAP  DS    CL28     MAP OF SEQUENTIAL DAY # IN THE MONTH                  
           ORG   W_KDAYMAP                                                      
W_KDAY1    DS    CL1      MONDAY    /WEEK1                                      
W_KDAY2    DS    CL1      TUESDAY   /WEEK1                                      
W_KDAY3    DS    CL1      WEDNESDAY /WEEK1                                      
W_KDAY4    DS    CL1      THURSDAY  /WEEK1                                      
W_KDAY5    DS    CL1      FRIDAY    /WEEK1                                      
W_KDAY6    DS    CL1      SATURDAY  /WEEK1                                      
W_KDAY7    DS    CL1      SUNDAY    /WEEK1                                      
W_KDAY8    DS    CL1      MONDAY    /WEEK2                                      
W_KDAY9    DS    CL1      TUESDAY   /WEEK2                                      
W_KDAY10   DS    CL1      WEDNESDAY /WEEK2                                      
W_KDAY11   DS    CL1      THURSDAY  /WEEK2                                      
W_KDAY12   DS    CL1      FRIDAY    /WEEK2                                      
W_KDAY13   DS    CL1      SATURDAY  /WEEK2                                      
W_KDAY14   DS    CL1      SUNDAY    /WEEK2                                      
W_KDAY15   DS    CL1      MONDAY    /WEEK3                                      
W_KDAY16   DS    CL1      TUESDAY   /WEEK3                                      
W_KDAY17   DS    CL1      WEDNESDAY /WEEK3                                      
W_KDAY18   DS    CL1      THURSDAY  /WEEK3                                      
W_KDAY19   DS    CL1      FRIDAY    /WEEK3                                      
W_KDAY20   DS    CL1      SATURDAY  /WEEK3                                      
W_KDAY21   DS    CL1      SUNDAY    /WEEK3                                      
W_KDAY22   DS    CL1      MONDAY    /WEEK4                                      
W_KDAY23   DS    CL1      TUESDAY   /WEEK4                                      
W_KDAY24   DS    CL1      WEDNESDAY /WEEK4                                      
W_KDAY25   DS    CL1      THURSDAY  /WEEK4                                      
W_KDAY26   DS    CL1      FRIDAY    /WEEK4                                      
W_KDAY27   DS    CL1      SATURDAY  /WEEK4                                      
W_KDAY28   DS    CL1      SUNDAY    /WEEK4                                      
*                                                                               
W_KAREALQ  EQU   *-W_KFILETYPE                                                  
W_KRECQ    EQU   *-W_KAREA                                                      
*                                                                               
*-------------------------------------------------------------------            
* MARKET INFORMATION AREA                                                       
*-------------------------------------------------------------------            
W_MHQREC   DS    0CL(W_MHQRECQ)                                                 
W_MHQCODE  DS    CL02     Record Code                                           
W_MHQFMTV  DS    CL04     Format Version                                        
W_MHQMKTC  DS    CL03     Market Code                                           
W_MHQDMAC  DS    CL03     DMA Code                                              
W_MHQMRNK  DS    CL03     Market Rank                                           
W_MHQGEOI  DS    CL07     Geography Indicator                                   
W_MHQGEONM DS    CL26     Geography Name                                        
W_MHQSDT   DS    CL18     Start Date Time Of Survey                             
W_MHQEDT   DS    CL18     End Date Time Of Survey                               
W_MHQNDAYS DS    CL03     Number Of Days In Survey                              
W_MHQNWKS  DS    CL02     Number Of Weeks In Survey                             
W_MHQRDST  DS    CL07     Reporting Day Start Time                              
W_MHQRSRVC DS    CL01     Reporting Service                                     
W_MHQSPEXC DS    CL02     Special Report Exclusion Indicator                    
W_MHQSUBSI DS    CL05     SubSample Indicator                                   
W_MHQHEASI DS    CL01     Header Sample Type                                    
W_MHQREPRO DS    CL01     Reprocessed                                           
W_MHQDACCR DS    CL01     Data Accredited                                       
W_MHQPBACK DS    CL01     Playback Type                                         
W_MHQINTRV DS    CL02     Time Interval                                         
W_MHQCMETH DS    CL01     Collection Method                                     
* Note: Nielsen increased this input field from 1 character to 2 in             
*       2017. We translate it to 1 byte for internal representation, to         
*       minimize required code changes on our end. Note that because we         
*       use DFSORT'S CHANGE= operator to perform the translation (which         
*       chokes if it sees an unexpected value), we set the Collection           
*       Method to "?" if we see a value we're not ready for. Then we            
*       just throw those records away.                                          
*                                                               Nielsen         
*                                                               value:          
*                                                              --------         
W_COLLECTION_METHOD_INVALID                  EQU C'?',,C'C'   *UNKNOWN*         
W_COLLECTION_METHOD_SET_METER                EQU C'1',,C'C'          1          
W_COLLECTION_METHOD_LPM                      EQU C'2',,C'C'          2          
W_COLLECTION_METHOD_LPM_PRELIM               EQU C'3',,C'C'          3          
W_COLLECTION_METHOD_DIARY_ONLY               EQU C'4',,C'C'          4          
W_COLLECTION_METHOD_SET_METER_IMPACT         EQU C'5',,C'C'          5          
W_COLLECTION_METHOD_CODE_READER              EQU C'6',,C'C'          6          
W_COLLECTION_METHOD_CODE_READER_IMPACT       EQU C'7',,C'C'          7          
W_COLLECTION_METHOD_NCM                      EQU C'C',,C'C'          CM         
W_COLLECTION_METHOD_LPM_PPM_IMPACT           EQU C'F',,C'C'          8          
W_COLLECTION_METHOD_SET_METER_PPM_IMPACT     EQU C'G',,C'C'          9          
W_COLLECTION_METHOD_SET_METER_RPD_IMPACT     EQU C'H',,C'C'          10         
W_COLLECTION_METHOD_CODE_READER_RPD_IMPACT   EQU C'I',,C'C'          11         
W_COLLECTION_METHOD_RPD_PLUS_IMPACT          EQU C'J',,C'C'          12         
W_COLLECTION_METHOD_SET_METER_PPM_RPD_IMPACT EQU C'K',,C'C'          13         
W_COLLECTION_METHOD_LPM_PPM                  EQU C'L',,C'C'          20         
W_COLLECTION_METHOD_SET_METER_PPM            EQU C'M',,C'C'          30         
W_COLLECTION_METHOD_SET_METER_RPD            EQU C'N',,C'C'          40         
W_COLLECTION_METHOD_CODE_READER_RPD          EQU C'O',,C'C'          50         
W_COLLECTION_METHOD_RPD_PLUS                 EQU C'P',,C'C'          60         
W_MHQCTIND DS    CL01     Contest Indicator                                     
W_MHQRPRD  DS    CL02     Report Period                                         
W_MHQRYEAR DS    CL04     Report Year                                           
W_MHQMKTZ  DS    CL02     Market Time Zone                                      
*                            TIME ZONES                                         
TIMEZN_EAST EQU  C'01',2,C'C'   EASTERN                                         
TIMEZN_CENT EQU  C'02',2,C'C'   CENTRAL                                         
TIMEZN_MOUN EQU  C'03',2,C'C'   MOUNTAIN                                        
TIMEZN_PACI EQU  C'04',2,C'C'   PACIFIC                                         
TIMEZN_ALAS EQU  C'05',2,C'C'   ALASKAN                                         
TIMEZN_HAWA EQU  C'06',2,C'C'   HAWAIIAN                                        
*                                                                               
W_MHQMKCLS DS    CL01     Market Class Code                                     
W_MHQDMEXC DS    CL01     Distributor, Market, or Mobile                        
*                          Exclusion Indicator                                  
W_MHQDSAVE DS    CL01     Daylight Saving Time Indicator                        
W_MHQRECQ  EQU   *-W_MHQCODE                                                    
*                                                                               
*-------------------------------------------------------------------            
* DISTRIBUTOR INFORMATION AREA                                                  
*-------------------------------------------------------------------            
W_DHRREC   DS    0CL(W_DHRRECQ)                                                 
W_DHRCODE  DS    CL02     Record Code                                           
W_DHRMKTC  DS    CL03     Market Code                                           
W_DHRRSRVC DS    CL01     Reporting Service                                     
W_DHRSDT   DS    CL18     Start DateTime Of Survey                              
W_DHREDT   DS    CL18     End DateTimeOf Survey                                 
W_DHRMOOC  DS    CL03     Market of Origin Code                                 
W_DHRDISC  DS    CL04     Distributor Code                                      
W_DHRCALL  DS    CL12     Call Letters                                          
W_DHROCALL DS    CL04     Legacy Call Letters                                   
W_DHRPPLUS DS    CL01     Parent Plus Indicator                                 
PARENT_PLUS_YES EQU C'+',,C'C'  Parent Plus                                     
PARENT_PLUS_NO  EQU C' ',,C'C'  Not Parent Plus                                 
W_DHRCLONG DS    CL25     Cable Long Name                                       
W_DHRBCHAN DS    CL07     Broadcast Channel Number                              
W_DHRDSRC  DS    CL01     Distribution Source Type                              
DIS_BROAD  EQU   C'B',,C'C' Broadcast                                           
DIS_CABLE  EQU   C'C',,C'C' Cable                                               
W_DHRAFFL1 DS    CL07     Primary Affiliation                                   
W_DHRAFFL2 DS    CL07     Secondary Affiliation                                 
W_DHRAFFL3 DS    CL07     Tertiary Affiliation                                  
W_DHRDGRP  DS    CL05     Distributor Group                                     
W_DHRPRNT  DS    CL01     Parent Indicator                                      
W_DHPARYQ  EQU   C'Y',,C'C'   Parent station                                    
W_DHRSATL  DS    CL01     Satellite Indicator                                   
W_DHRSTOT  DS    CL01     Station Totals Indicator                              
W_DHRSTYQ  EQU   C'Y',,C'C'    Station has Tsa Impressions                      
W_DHRSTYDQ EQU   C't',,C'C'    DDS flag that we filled the Tsa slots            
*                              with DMA demos                                   
W_DHRSTYPE DS    CL01     Station Type Code                                     
W_DHRAEIND DS    CL01     Audience Estimates Indicator                          
W_DHRREPST DS    CL01     Reportability Status                                  
REPORTAB_VIP     EQU C'V',,C'C'   Reportable on the VIP                         
REPORTAB_DPT     EQU C'D',,C'C'   Daypart reportable                            
*                                  non-standard streams                         
REPORTAB_LM_ONLY EQU C'M',,C'C'   Local Monthlies only                          
*                                  (not reportable in VIP)                      
REPORTAB_NONE    EQU C'N',,C'C'   No audience estimates                         
W_DHRPNIND DS    CL01     Program Names Indicator                               
W_DHRRECQ  EQU   *-W_DHRCODE                                                    
*                                                                               
*-------------------------------------------------------------------            
* PROGRAM INFORMATION AREA                                                      
*-------------------------------------------------------------------            
W_PNRAREA  DS    0CL(W_PNRAREAQ)                                                
W_PNRSEQ   DS    CL4      Telecast Id, with telecasts broken at 5AM             
W_PNRPGID  DS    XL4      Program Id for contiguous/overlapping telcsts         
W_PNRSPGID DS    XL2      Sub-program Id for weekend only programs,             
*                          broken by day and into cont/overlp sections          
W_PNRSQH   DS    XL1      Overall "report" start QH derived from all            
*                          telecasts of the program.                            
W_PNREQH   DS    XL1      Overall "report" end QH derived from all              
*                          telecasts of the program.                            
W_PNRSQHD  DS    XL1      Detailed "report" start QH derived only from          
*                          the telecasts included in the current PAV av         
W_PNREQHD  DS    XL1      Detailed "report" end QH derived only from            
*                          the telecasts included in the current PAV av         
W_PNRLQH   DS    XL2      Total number of QHs included in the average           
*                                                                               
W_PNRREC   DS    0CL(W_PNRRECQ)                                                 
W_PNRCODE  DS    CL02     Record Code                                           
W_PNRMKTC  DS    CL03     Market Code                                           
W_PNRDISC  DS    CL04     Distributor Code                                      
W_PNRCALL  DS    CL12     Call Letters                                          
W_PNROCALL DS    CL04     Legacy Call Letters                                   
W_PNRPPLUS DS    CL01     Parent Plus Indicator                                 
           ORG   W_PNRPPLUS                                                     
W_NCM_MPAA_RATING DS CL1  NCM: MPAA Rating (see NCM Sample Type)                
W_PNRQHSDT DS    CL18     Quarter Hour Start Date Time                          
           ORG   W_PNRQHSDT                                                     
W_PNRSDT   DS    CL10     Start Date                                            
           DS    C        Blank                                                 
W_PNRSTIME DS    CL7      Start Time                                            
           ORG   W_PNRSTIME                                                     
W_PNRSHH   DS    CL2      HH                                                    
           DS    C        :                                                     
W_PNRSMM   DS    CL2      MM                                                    
W_PNRSAMPM DS    CL2      AM/PM                                                 
           ORG   W_PNRSAMPM                                                     
W_PNRSAP   DS    CL1      A/P                                                   
           DS    CL1      M                                                     
W_PNRQHEDT DS    CL18     Quarter Hour End Date Time                            
           ORG   W_PNRQHEDT                                                     
W_PNREDT   DS    CL10     End Date                                              
           DS    C        Blank                                                 
W_PNRETIME DS    CL7      End Time                                              
           ORG   W_PNRETIME                                                     
W_PNREHH   DS    CL2      HH                                                    
           DS    C        :                                                     
W_PNREMM   DS    CL2      MM                                                    
W_PNREAMPM DS    CL2      AM/PM                                                 
W_PNRPCODE DS    CL10     Program Code                                          
W_PNRPNAME DS    CL14     Program Name                                          
W_PNRSUBT  DS    CL12     Subtitle                                              
W_PNRCLONG DS    CL25     Cable Long Name                                       
W_PNRPTYP  DS    CL02     Program Type                                          
W_PNRPSRC  DS    CL03     Program Source                                        
W_PNRSNAM  DS    CL01     Satellite Name Indicator                              
W_PNRRECQ  EQU   *-W_PNRCODE                                                    
W_PNRAREAQ EQU   *-W_PNRSEQ                                                     
*                                                                               
*-------------------------------------------------------------------            
* QUARTER HOUR DISTRIBUTOR AREA                                                 
*-------------------------------------------------------------------            
W_QDRREC   DS    0CL(W_QDRRECQ)                                                 
W_QDRHEAD  DS    0CL(W_QDRHEADQ)                                                
W_QDRCODE  DS    CL02     Record Code                                           
W_QDRDISC  DS    CL04     Distributor Code                                      
W_QDRMKTC  DS    CL03     Market Code                                           
W_QDRRSRVC DS    CL01     Reporting Service                                     
W_QDRSAMTY DS    CL01     Sample Type                                           
W_QDRPBACK DS    CL01     Playback Type                                         
W_QDREXCI  DS    CL01     Excluded                                              
W_QDRHEADQ EQU   *-W_QDRCODE      LENGTH OF HEADER INFORMATION                  
*          DEMOS ARE ALIGNED ON FULL-WORD BOUNDARY                              
W_QDRDEMOS DS    0XL(W_QDRDEMLQ)                                                
W_QDRMTROA DS    XL04     Metro A Quarter Hour Viewing HH                       
W_QDRMTROB DS    XL04     Metro B Quarter Hour Viewing HH                       
W_QDRSTRDM DS    0XL(W_QDRSTRLQ)  DEMOS THAT MATCH THE TSA AREA                 
W_QDRHHLDS DS    XL04     Household Viewing                                     
W_QDRCH25  DS    XL04     Demo Viewing Dem#1                                    
W_QDRCH611 DS    XL04     Demo Viewing Dem#2                                    
W_QDRM1214 DS    XL04     Demo Viewing Dem#3                                    
W_QDRM1517 DS    XL04     Demo Viewing Dem#4                                    
W_QDRM1820 DS    XL04     Demo Viewing Dem#5                                    
W_QDRM2124 DS    XL04     Demo Viewing Dem#6                                    
W_QDRM2534 DS    XL04     Demo Viewing Dem#7                                    
W_QDRM3549 DS    XL04     Demo Viewing Dem#8                                    
W_QDRM5054 DS    XL04     Demo Viewing Dem#9                                    
W_QDRM5564 DS    XL04     Demo Viewing Dem#10                                   
W_QDRM65P  DS    XL04     Demo Viewing Dem#11                                   
W_QDRF1214 DS    XL04     Demo Viewing Dem#12                                   
W_QDRF1517 DS    XL04     Demo Viewing Dem#13                                   
W_QDRF1820 DS    XL04     Demo Viewing Dem#14                                   
W_QDRF2124 DS    XL04     Demo Viewing Dem#15                                   
W_QDRF2534 DS    XL04     Demo Viewing Dem#16                                   
W_QDRF3549 DS    XL04     Demo Viewing Dem#17                                   
W_QDRF5054 DS    XL04     Demo Viewing Dem#18                                   
W_QDRF5564 DS    XL04     Demo Viewing Dem#19                                   
W_QDRF65P  DS    XL04     Demo Viewing Dem#20                                   
W_QDRWW    DS    XL04     Demo Viewing Dem#21                                   
W_QDRSTRLQ EQU   *-W_QDRHHLDS                                                   
W_QDRDEMLQ EQU   *-W_QDRMTROA                                                   
W_QDRRECQ  EQU   *-W_QDRCODE                                                    
*                                                                               
*-------------------------------------------------------------------            
* STATION TOTALS AREA                                                           
*-------------------------------------------------------------------            
W_STRREC   DS    0CL(W_STRRECQ)                                                 
W_STRHEAD  DS    0CL(W_STRHEADQ)                                                
W_STRCODE  DS    CL02     Record Code                                           
W_STRDISC  DS    CL04     Distributor Code                                      
W_STRMKTC  DS    CL03     Market Code                                           
W_STRRSRVC DS    CL01     Reporting Service                                     
W_STRSAMTY DS    CL01     Sample Type                                           
W_STRPBACK DS    CL01     Playback Type                                         
W_STREXCI  DS    CL01     Excluded                                              
W_STRHEADQ EQU   *-W_STRCODE      LENGTH OF HEADER INFORMATION                  
W_STRSPAR1 DS    XL3      ALIGN DEMOS ON FULL-WORD BOUNDARY                     
W_STRDEMOS DS    0XL(W_STRDEMLQ)                                                
W_STRHHLDS DS    XL04     Household Viewing                                     
W_STRCH25  DS    XL04     Demo Viewing Dem#1                                    
W_STRCH611 DS    XL04     Demo Viewing Dem#2                                    
W_STRM1214 DS    XL04     Demo Viewing Dem#3                                    
W_STRM1517 DS    XL04     Demo Viewing Dem#4                                    
W_STRM1820 DS    XL04     Demo Viewing Dem#5                                    
W_STRM2124 DS    XL04     Demo Viewing Dem#6                                    
W_STRM2534 DS    XL04     Demo Viewing Dem#7                                    
W_STRM3549 DS    XL04     Demo Viewing Dem#8                                    
W_STRM5054 DS    XL04     Demo Viewing Dem#9                                    
W_STRM5564 DS    XL04     Demo Viewing Dem#10                                   
W_STRM65P  DS    XL04     Demo Viewing Dem#11                                   
W_STRF1214 DS    XL04     Demo Viewing Dem#12                                   
W_STRF1517 DS    XL04     Demo Viewing Dem#13                                   
W_STRF1820 DS    XL04     Demo Viewing Dem#14                                   
W_STRF2124 DS    XL04     Demo Viewing Dem#15                                   
W_STRF2534 DS    XL04     Demo Viewing Dem#16                                   
W_STRF3549 DS    XL04     Demo Viewing Dem#17                                   
W_STRF5054 DS    XL04     Demo Viewing Dem#18                                   
W_STRF5564 DS    XL04     Demo Viewing Dem#19                                   
W_STRF65P  DS    XL04     Demo Viewing Dem#20                                   
W_STRWW    DS    XL04     Demo Viewing Dem#21                                   
W_STRDEMLQ EQU   *-W_STRHHLDS                                                   
*                                                                               
W_STRRECQ  EQU   *-W_STRCODE                                                    
*                                                                               
*-------------------------------------------------------------------            
* UNIVERSE AREA                                                                 
*-------------------------------------------------------------------            
W_UERREC   DS    0CL(W_UERRECQ)                                                 
W_UERHEAD  DS    0CL(W_UERHEADQ)                                                
W_UERCODE  DS    CL02     Record Code                                           
W_UERMKTC  DS    CL03     Market Code                                           
W_UERRSRVC DS    CL01     Reporting Service                                     
W_UERSAMTY DS    CL01     Sample Type                                           
W_UERHEADQ EQU   *-W_UERCODE      LENGTH OF HEADER INFORMATION                  
           DS    XL1      ALIGN DEMOS ON FULL-WORD BOUNDARY                     
W_UERDEMOS DS    0XL(W_UERDEMLQ)                                                
W_UERMTROA DS    XL04     Metro A Quarter Hour Universe HH                      
W_UERMTROB DS    XL04     Metro B Quarter Hour Universe HH                      
W_UERHHLDS DS    XL04     Household Universe                                    
W_UERCH25  DS    XL04     Demo Universe Dem#1                                   
W_UERCH611 DS    XL04     Demo Universe Dem#2                                   
W_UERM1214 DS    XL04     Demo Universe Dem#3                                   
W_UERM1517 DS    XL04     Demo Universe Dem#4                                   
W_UERM1820 DS    XL04     Demo Universe Dem#5                                   
W_UERM2124 DS    XL04     Demo Universe Dem#6                                   
W_UERM2534 DS    XL04     Demo Universe Dem#7                                   
W_UERM3549 DS    XL04     Demo Universe Dem#8                                   
W_UERM5054 DS    XL04     Demo Universe Dem#9                                   
W_UERM5564 DS    XL04     Demo Universe Dem#10                                  
W_UERM65P  DS    XL04     Demo Universe Dem#11                                  
W_UERF1214 DS    XL04     Demo Universe Dem#12                                  
W_UERF1517 DS    XL04     Demo Universe Dem#13                                  
W_UERF1820 DS    XL04     Demo Universe Dem#14                                  
W_UERF2124 DS    XL04     Demo Universe Dem#15                                  
W_UERF2534 DS    XL04     Demo Universe Dem#16                                  
W_UERF3549 DS    XL04     Demo Universe Dem#17                                  
W_UERF5054 DS    XL04     Demo Universe Dem#18                                  
W_UERF5564 DS    XL04     Demo Universe Dem#19                                  
W_UERF65P  DS    XL04     Demo Universe Dem#20                                  
W_UERWW    DS    XL04     Demo Universe Dem#21                                  
W_UERDEMLQ EQU   *-W_UERMTROA                                                   
*                                                                               
W_UERRECQ  EQU   *-W_UERCODE                                                    
*                                                                               
*-------------------------------------------------------------------            
* HUT/PUT AREA (DMA)                                                            
*-------------------------------------------------------------------            
W_HPTREC   DS    0CL(W_HPTRECQ)                                                 
W_HPTHEAD  DS    0CL(W_HPTHEADQ)                                                
W_HPTCODE  DS    CL02     Record Code                                           
W_HPTDISC  DS    CL04     Distributor Code                                      
W_HPTMKTC  DS    CL03     Market Code                                           
W_HPTRSRVC DS    CL01     Reporting Service                                     
W_HPTSAMTY DS    CL01     Sample Type                                           
W_HPTPBACK DS    CL01     Playback Type                                         
W_HPTEXCI  DS    CL01     Excluded                                              
W_HPTHEADQ EQU   *-W_HPTCODE      LENGTH OF HEADER INFORMATION                  
           DS    XL3      ALIGN ON FULL-WORD BOUNDARY                           
W_HPTDEMOS DS    0XL(W_HPTDEMLQ)                                                
W_HPTMTROA DS    XL04     Metro A Quarter Hour Viewing HH                       
W_HPTMTROB DS    XL04     Metro B Quarter Hour Viewing HH                       
W_HPTHHLDS DS    XL04     Household Viewing                                     
W_HPTCH25  DS    XL04     Demo Viewing Dem#1                                    
W_HPTCH611 DS    XL04     Demo Viewing Dem#2                                    
W_HPTM1214 DS    XL04     Demo Viewing Dem#3                                    
W_HPTM1517 DS    XL04     Demo Viewing Dem#4                                    
W_HPTM1820 DS    XL04     Demo Viewing Dem#5                                    
W_HPTM2124 DS    XL04     Demo Viewing Dem#6                                    
W_HPTM2534 DS    XL04     Demo Viewing Dem#7                                    
W_HPTM3549 DS    XL04     Demo Viewing Dem#8                                    
W_HPTM5054 DS    XL04     Demo Viewing Dem#9                                    
W_HPTM5564 DS    XL04     Demo Viewing Dem#10                                   
W_HPTM65P  DS    XL04     Demo Viewing Dem#11                                   
W_HPTF1214 DS    XL04     Demo Viewing Dem#12                                   
W_HPTF1517 DS    XL04     Demo Viewing Dem#13                                   
W_HPTF1820 DS    XL04     Demo Viewing Dem#14                                   
W_HPTF2124 DS    XL04     Demo Viewing Dem#15                                   
W_HPTF2534 DS    XL04     Demo Viewing Dem#16                                   
W_HPTF3549 DS    XL04     Demo Viewing Dem#17                                   
W_HPTF5054 DS    XL04     Demo Viewing Dem#18                                   
W_HPTF5564 DS    XL04     Demo Viewing Dem#19                                   
W_HPTF65P  DS    XL04     Demo Viewing Dem#20                                   
W_HPTWW    DS    XL04     Demo Viewing Dem#21                                   
W_HPTDEMLQ EQU   *-W_HPTMTROA                                                   
*                                                                               
W_HPTRECQ  EQU   *-W_HPTCODE                                                    
*                                                                               
*-------------------------------------------------------------------            
* HUT/PUT AREA (TSA)                                                            
*-------------------------------------------------------------------            
W_HPSREC   DS    0CL(W_HPSRECQ)                                                 
W_HPSHEAD  DS    0CL(W_HPSHEADQ)                                                
W_HPSCODE  DS    CL02     Record Code                                           
W_HPSDISC  DS    CL04     Distributor Code                                      
W_HPSMKTC  DS    CL03     Market Code                                           
W_HPSRSRVC DS    CL01     Reporting Service                                     
W_HPSSAMTY DS    CL01     Sample Type                                           
W_HPSPBACK DS    CL01     Playback Type                                         
W_HPSEXCI  DS    CL01     Excluded                                              
W_HPSHEADQ EQU   *-W_HPSCODE      LENGTH OF HEADER INFORMATION                  
           DS    XL3      ALIGN ON FULL-WORD BOUNDARY                           
W_HPSDEMOS DS    0XL(W_HPSDEMLQ)                                                
W_HPSHHLDS DS    XL04     Household Viewing                                     
W_HPSCH25  DS    XL04     Demo Viewing Dem#1                                    
W_HPSCH611 DS    XL04     Demo Viewing Dem#2                                    
W_HPSM1214 DS    XL04     Demo Viewing Dem#3                                    
W_HPSM1517 DS    XL04     Demo Viewing Dem#4                                    
W_HPSM1820 DS    XL04     Demo Viewing Dem#5                                    
W_HPSM2124 DS    XL04     Demo Viewing Dem#6                                    
W_HPSM2534 DS    XL04     Demo Viewing Dem#7                                    
W_HPSM3549 DS    XL04     Demo Viewing Dem#8                                    
W_HPSM5054 DS    XL04     Demo Viewing Dem#9                                    
W_HPSM5564 DS    XL04     Demo Viewing Dem#10                                   
W_HPSM65P  DS    XL04     Demo Viewing Dem#11                                   
W_HPSF1214 DS    XL04     Demo Viewing Dem#12                                   
W_HPSF1517 DS    XL04     Demo Viewing Dem#13                                   
W_HPSF1820 DS    XL04     Demo Viewing Dem#14                                   
W_HPSF2124 DS    XL04     Demo Viewing Dem#15                                   
W_HPSF2534 DS    XL04     Demo Viewing Dem#16                                   
W_HPSF3549 DS    XL04     Demo Viewing Dem#17                                   
W_HPSF5054 DS    XL04     Demo Viewing Dem#18                                   
W_HPSF5564 DS    XL04     Demo Viewing Dem#19                                   
W_HPSF65P  DS    XL04     Demo Viewing Dem#20                                   
W_HPSWW    DS    XL04     Demo Viewing Dem#21                                   
W_HPSDEMLQ EQU   *-W_HPSHHLDS                                                   
*                                                                               
W_HPSRECQ  EQU   *-W_HPSCODE                                                    
*                                                                               
*-------------------------------------------------------------------            
* MISC FIELDS                                                                   
*-------------------------------------------------------------------            
W_MISC     DS    0CL(W_MISCLQ)                                                  
W_RECTYPE  DS    CL1      RECORD TYPE                                           
RECTYPE_ALL_WKS  EQU  C'A',,C'C'    TP AVERAGE: IND DAY ALL WK AVG              
RECTYPE_DAY_AVG  EQU  C'I',,C'C'    TP AVERAGE: IND DAY/PROGRAM                 
*        !!! NOTE: ALL WK AVG NEEDS TO SORT BEFORE IND DAY ('A' < 'I')          
*                                                                               
RECTYPE_MF_4WK   EQU   C'M',,C'C'   TP AVERAGE: M-F 4-WEEK MONTHLY AVG          
RECTYPE_MF_W     EQU   C'W',,C'C'   TP AVERAGE: M-F BROKEN BY WEEKS             
*        !!! NOTE: 4-WEEK AVG NEEDS TO SORT BEFORE WEEKLIES('M' < 'W')          
*                                                                               
RECTYPE_ASTCAST  EQU   C'A',,C'C'   PAV AVERAGE: "AS TELECAST"                  
RECTYPE_NOR      EQU   C'N',,C'C'   PAV AVERAGE: "NORMAL"                       
*    !!! NOTE: "AS TELECAST" NEEDS TO SORT BEFORE "NORMAL" ('A' < 'N')          
*                                                                               
RECTYPE_UER      EQU   C'U',,C'C'   UNIVERSE RECORD                             
RECTYPE_HPT      EQU   C'H',,C'C'   HUT/PUT RECORD                              
RECTYPE_ITB      EQU   C'T',,C'C'   INTAB RECORD                                
RECTYPE_PNR      EQU   C'L',,C'C'   PROGRAM LINEUP                              
RECTYPE_PQR      EQU   C'Q',,C'C'   PROGRAM LINEUP BROKEN UP BY QHR             
RECTYPE_PUP      EQU   C'P',,C'C'   PROGRAM UPDATE BROKEN UP BY QHR             
RECTYPE_TEMP     EQU   C'X',,C'C'   TEMPORARY WORK RECORD                       
*                                                                               
W_PNAMEBK  DS    CL1      PROGRAM NAME BREAKOUT FLAG (FOR M-F TP AVG)           
PNAME_#    EQU   C'#',,C'C'       PROGRAM RAN 3 OR 4 TIMES A WEEK               
PNAME_SP   EQU   C' ',,C'C'       PROGRAM RAN 5 TIMES A WEEK                    
*                                                                               
W_TPPAVFLG DS    CL1      TIME PERIOD/PROGRAM AVERAGE FLAG                      
TPREC      EQU   C'T',,C'C'       TIME PERIOD RECORD                            
PAVREC     EQU   C'P',,C'C'       PROGRAM AVERAGE RECORD                        
*                                                                               
W_PREVIEW  DS    CL1              FLAG FOR PREVIEW DATA                         
PREVW      EQU   C'P',,C'C'          THIS IS PREVIEW DATA                       
NOTPREVW   EQU   C' ',,C'C'          THIS IS NOT PREVIEW DATA                   
*                                                                               
W_LMRECDLQ EQU   *-W_KAREA        LENGTH OF DATA UP TO SPARE                    
*                                                                               
W_SPARE    DS    CL87                                                           
*                                                                               
W_REC_WITHOUT_JOIN_INDICATOR_LQ EQU *-W_KAREA                                   
W_JOIN_INDICATOR DS C                                                           
W_ALL_WEEK_INDICATOR EQU C'B',,C'C'  THIS IS TESTED BY DELMTPI                  
*                                                                               
W_MISCLQ   EQU   *-W_RECTYPE                                                    
W_LMRECLQ  EQU   *-W_KAREA        LENGTH OF ENTIRE RECORD, INCL SPARE           
*                                                                               
*-------------------------------------------------------------------            
* TEMPORARY FIELDS AT THE END OF THE WORK RECORDS                               
*-------------------------------------------------------------------            
*                                                                               
           ORG   W_SPARE                                                        
*** TEMPORARY FIELDS USED FOR PAV MULTI-DAY AVERAGES ***                        
W_WEEKEND_AVG DS C                  TYPE OF MULTI-DAY AVERAGE                   
W_WKND_EXCL EQU  C'E',,C'C'          EXCLUDE WEEKENDS                           
W_WKND_INCL EQU  C'I',,C'C'          INCLUDE WEEKENDS, AND EXCLUDE              
*                                    PROGRAMS THAT DON'T HAVE WEEKENDS          
W_DAY_MF   DS    C                  FILL THIS  WITH THE M-F DAY CODE            
*                                   IF RECORD IS FOR A WEEKDAY                  
*                                                                               
           ORG   W_SPARE                                                        
*** TEMPORARY FIELDS USED FOR PAV "NORMAL" AVERAGES ***                         
W_NORSQH   DS    XL(L'W_PNRSQH)     "NORMAL" START QUARTER HOUR                 
W_NOREQH   DS    XL(L'W_PNREQH)     "NORMAL" END QUARTER HOUR                   
W_NORSTIME DS    CL(L'W_PNRSTIME)   "NORMAL" ST TIME (FOR VIP COMPARE)          
W_NORETIME DS    CL(L'W_PNRSTIME)   "NORMAL" END TIME (FOR READABILITY)         
W_NORAVALF DS    CL(L'W_KDAY_ALF)   AVERAGE TYPE ALFA                           
W_NORINCL  DS    C                  "NORMAL" INCLUDE FLAG                       
*                                   NOTE: INCL NEEDS TO SORT FIRST              
W_NORINCYQ EQU   C'0',,C'C'         - THIS QH IS WITHIN THE "NORMAL"            
*                                     BOUNDARIES                                
W_NORINCNQ EQU   C'1',,C'C'         - THIS QH IS OUTSIDE THE "NORMAL"           
*                                     BOUNDARIES                                
W_RECNORLQ EQU   *-W_KAREA          LENGTH OF DATA INCLUDING "NORMAL"           
*                                     INFORMATION                               
*** TEMPORARY FIELDS USED FOR "REPORT" START AND END TIMES ****                 
W_REPSQH   DS    XL(L'W_PNRSQH)     "NORMAL" START QUARTER HOUR                 
W_REPEQH   DS    XL(L'W_PNREQH)     "NORMAL" END QUARTER HOUR                   
W_REPSTIME DS    CL(L'W_PNRSTIME)   "NORMAL" ST TIME (FOR VIP COMPARE)          
W_REPETIME DS    CL(L'W_PNRSTIME)   "NORMAL" END TIME (FOR READABILITY)         
*                                                                               
***********************************************************************         
* DSECT TO COVER "NORMAL" LINE RECORDS.                                         
* THESE ARE INTERMEDIATE RECORDS USED DURING PAV PROCESSING.                    
***********************************************************************         
NOR_RECD   DSECT                                                                
NOR_INFO   DS    0CL(NOR_INFOLQ)                                                
*                                                                               
NOR_SIGNAL DS    CL9                C'** NOR **'                                
NOR_KDTYPE DS    CL(L'W_KDTYPE)     DATA TYPE FIELDS                            
NOR_PNAME  DS    CL(L'W_PNRPNAME)   PROGRAM NAME                                
NOR_PGID   DS    CL(L'W_PNRPGID)    PROGRAM ID                                  
NOR_SPGID  DS    CL(L'W_PNRSPGID)   SUB-PROGRAM ID                              
NOR_SQH    DS    XL(L'W_PNRSQH)     "NORMAL" START QUARTER HOUR                 
NOR_EQH    DS    XL(L'W_PNREQH)     "NORMAL" END QUARTER HOUR                   
NOR_STIME  DS    CL(L'W_PNRSTIME)   "NORMAL" ST TIME (FOR VIP COMPARE)          
NOR_ETIME  DS    CL(L'W_PNRETIME)   "NORMAL" END TIME (FOR READABILITY)         
NOR_INFOLQ EQU   *-NOR_SIGNAL       LENGTH UP TO AVERAGE TYPE                   
NOR_AV_ALF DS    CL(L'W_KDAY_ALF)   AVERAGE TYPE ALFA                           
*                                                                               
***********************************************************************         
* DSECT TO COVER "REPORT" START AND END TIME RECORDS.                           
* THESE ARE INTERMEDIATE RECORDS USED DURING PAV PROCESSING.                    
***********************************************************************         
REP_RECD   DSECT                                                                
*                                                                               
REP_SIGNAL DS    CL18               C'** REPORT TIMES **'                       
REP_KDTYPE DS    CL(L'W_KDTYPE)     DATA TYPE FIELDS                            
REP_PNAME  DS    CL(L'W_PNRPNAME)   PROGRAM NAME                                
REP_PGID   DS    CL(L'W_PNRPGID)    PROGRAM ID                                  
REP_SPGID  DS    CL(L'W_PNRSPGID)   SUB-PROGRAM ID                              
REP_SQH    DS    XL(L'W_PNRSQH)     "REPORT" START QUARTER HOUR                 
REP_EQH    DS    XL(L'W_PNREQH)     "REPORT" END QUARTER HOUR                   
REP_STIME  DS    CL(L'W_PNRSTIME)   "REPORT" ST TIME (FOR VIP COMPARE)          
REP_ETIME  DS    CL(L'W_PNRETIME)   "REPORT" END TIME (FOR READABILITY)         
*                                                                               
***********************************************************************         
*          DATA SET DEDPTDSECT AT LEVEL 179 AS OF 09/28/10                      
* DSECT TO COVER THE LOCAL MONTHLY WORK RECORDS                                 
***********************************************************************         
WD_LMDSECT DSECT                                                                
WD_REC     DS    0CL(WD_LMRECLQ)     ENTIRE RECORD, INCLUDING SPARE             
WD_KREC    DS    0CL(WD_KRECQ)       KEY OF THE RECORD                          
WD_RECDATA DS    0CL(WD_LMRECDLQ)    RECORD UP TO SPARE                         
*                                                                               
*-------------------------------------------------------------------            
* KEY AREA                                                                      
*-------------------------------------------------------------------            
WD_KAREA   DS    0CL(WD_KAREALQ)                                                
WD_KSEQ    DS    CL02     Sequence Code                                         
WD_KWEEK   DS    CL01     Week #                                                
*                                                                               
WD_KDAY    DS    CL01     Day Sequence #                                        
*                          *** SEE W_KDAY FOR EQUATES                           
WD_KDAY_ALF DS   CL03     Day Alpha: M-F,MON,TUE,WED,THU,FRI,SAT,SUN,           
*                                    AV2,AV3,AV4,AV5,AV6,AV7                    
*                          *** SEE W_KDAY_ALF FOR EQUATES                       
WD_KCODE   DS    CL02     Record Code                                           
*                                                                               
WD_KDTYPE  DS    0CL(WD_KDTYPLQ)  THESE FIELDS DEFINE A TYPE OF DATA            
WD_KDTUNPL DS    0CL(WD_KDTUNPLQ)                                               
* THESE FIELDS DEFINE THE TYPE OF DATA THAT HAS UNIQUE PROGRAM                  
* LINEUPS FOR EACH TYPE.                                                        
WD_KRSRVC  DS    CL1      Reporting Service                                     
*                          1 = NSI-Nielsen Station Index                        
*                          2 = NHSI-Nielsen Hispanic Station Index              
*                          3 = NSID-Nielsen Station Index LPM Prelim            
*                          4 = NHSID-Nielsen Hisp Sta Index LPM Prelim          
*                          6 = NSI LPM DMA Preview                              
*                          7 = NSIX-Nielsen Station Index Parallel              
WD_KMKTC   DS    CL03     Market Code                                           
WD_KRPRD   DS    CL02     Report Period                                         
WD_KRPYR   DS    CL04     Report Year                                           
WD_KDISC   DS    CL04     Distributor Code                                      
WD_KSPEXC  DS    CL02     Special Report Exclusion Indicator                    
WD_KDTUNPLQ EQU  *-WD_KRSRVC                                                    
* THE REST OF THE FIELDS IDENTIFY DATA THAT HAS THE SAME PROGRAM                
* LINEUP ACROSS THE VARIOUS TYPES.                                              
WD_KPBACK  DS    CL01     Playback Type                                         
WD_KSAMTY  DS    CL01     Sample Type                                           
WD_STYP_TDMA  EQU   C'1',,C'C'    Total DMA                                     
WD_STYP_WIRED EQU   C'2',,C'C'    Wired                                         
WD_KSUBSI  DS    CL05     SubSample Indicator                                   
WD_KDTYPLQ EQU   *-WD_KRSRVC                                                    
*                                                                               
WD_KOCALL  DS    CL04     Legacy Call Letters                                   
WD_KCALDT  DS    CL18     Calendar Date Time                                    
           ORG   WD_KCALDT                                                      
WD_KDATE   DS    CL6      MM/DD/  EX: 12/04/                                    
WD_KYEAR   DS    CL4      YEAR    EX: 2010                                      
WD_KTIME   DS    CL8                                                            
***********************************************************************         
* DEIS AUG/13: I DON'T UNDERSTAND THE FOLLOWING COMMENT. THE FIELDS             
*              BELOW DON'T OVERLAP THE FIELDS ABOVE.                            
*                                                                               
* FIELDS BELOW PARTIALLY OVERWRITES THE DATE/TIME FIELD, SPECIFICALLY           
* IT OVERWRITES THE TIME PART OF THE FIELD.  SINCE WE HAVE NO USE FOR           
* THE TIME IN ITS CHARACTER FORMAT, INSTEAD WE ARE STORING PROGRAM              
* RELATED QUARTER HOUR INFORMATION IN HEX-DECIMAL.                              
***********************************************************************         
WD_KQHR    DS    XL1      ACTUAL-QH     EX: X'0B'                               
*                                                                               
WD_KAWKS   DS    CL04     Activity Weeks                                        
           ORG   WD_KAWKS                                                       
WD_KAWK1   DS    CL1          WEEK 1                                            
WD_KAWK2   DS    CL1          WEEK 2                                            
WD_KAWK3   DS    CL1          WEEK 3                                            
WD_KAWK4   DS    CL1          WEEK 4                                            
*                                                                               
WD_KDAYMAP DS    CL28     MAP OF SEQUENTIAL DAY # IN THE MONTH                  
           ORG   WD_KDAYMAP                                                     
WD_KDAY1   DS    CL1      MONDAY    /WEEK1                                      
WD_KDAY2   DS    CL1      TUESDAY   /WEEK1                                      
WD_KDAY3   DS    CL1      WEDNESDAY /WEEK1                                      
WD_KDAY4   DS    CL1      THURSDAY  /WEEK1                                      
WD_KDAY5   DS    CL1      FRIDAY    /WEEK1                                      
WD_KDAY6   DS    CL1      SATURDAY  /WEEK1                                      
WD_KDAY7   DS    CL1      SUNDAY    /WEEK1                                      
WD_KDAY8   DS    CL1      MONDAY    /WEEK2                                      
WD_KDAY9   DS    CL1      TUESDAY   /WEEK2                                      
WD_KDAY10  DS    CL1      WEDNESDAY /WEEK2                                      
WD_KDAY11  DS    CL1      THURSDAY  /WEEK2                                      
WD_KDAY12  DS    CL1      FRIDAY    /WEEK2                                      
WD_KDAY13  DS    CL1      SATURDAY  /WEEK2                                      
WD_KDAY14  DS    CL1      SUNDAY    /WEEK2                                      
WD_KDAY15  DS    CL1      MONDAY    /WEEK3                                      
WD_KDAY16  DS    CL1      TUESDAY   /WEEK3                                      
WD_KDAY17  DS    CL1      WEDNESDAY /WEEK3                                      
WD_KDAY18  DS    CL1      THURSDAY  /WEEK3                                      
WD_KDAY19  DS    CL1      FRIDAY    /WEEK3                                      
WD_KDAY20  DS    CL1      SATURDAY  /WEEK3                                      
WD_KDAY21  DS    CL1      SUNDAY    /WEEK3                                      
WD_KDAY22  DS    CL1      MONDAY    /WEEK4                                      
WD_KDAY23  DS    CL1      TUESDAY   /WEEK4                                      
WD_KDAY24  DS    CL1      WEDNESDAY /WEEK4                                      
WD_KDAY25  DS    CL1      THURSDAY  /WEEK4                                      
WD_KDAY26  DS    CL1      FRIDAY    /WEEK4                                      
WD_KDAY27  DS    CL1      SATURDAY  /WEEK4                                      
WD_KDAY28  DS    CL1      SUNDAY    /WEEK4                                      
*                                                                               
WD_KAREALQ EQU   *-WD_KSEQ                                                      
WD_KRECQ   EQU   *-WD_KAREA                                                     
*                                                                               
*-------------------------------------------------------------------            
* MARKET INFORMATION AREA                                                       
*-------------------------------------------------------------------            
WD_MHQREC  DS    0CL(WD_MHQRECQ)                                                
WD_MHQCODE DS    CL02     Record Code                                           
WD_MHQFMTV DS    CL04     Format Version                                        
WD_MHQMKTC DS    CL03     Market Code                                           
WD_MHQDMAC DS    CL03     DMA Code                                              
WD_MHQMRNK DS    CL03     Market Rank                                           
WD_MHQGEOI DS    CL07     Geography Indicator                                   
WD_MHQGEONM DS   CL26     Geography Name                                        
WD_MHQSDT  DS    CL18     Start Date Time Of Survey                             
WD_MHQEDT  DS    CL18     End Date Time Of Survey                               
WD_MHQNDAYS DS   CL03     Number Of Days In Survey                              
WD_MHQNWKS DS    CL02     Number Of Weeks In Survey                             
WD_MHQRDST DS    CL07     Reporting Day Start Time                              
WD_MHQRSRVC DS   CL01     Reporting Service                                     
WD_MHQSPEXC DS   CL02     Special Report Exclusion Indicator                    
WD_MHQSUBSI DS   CL05     SubSample Indicator                                   
WD_MHQHEASI DS   CL01     Header Sample Type                                    
WD_MHQREPRO DS   CL01     Reprocessed                                           
WD_MHQDACCR DS   CL01     Data Accredited                                       
WD_MHQPBACK DS   CL01     Playback Type                                         
WD_MHQINTRV DS   CL02     Time Interval                                         
WD_MHQCMETH DS   CL01     Collection Method                                     
WD_MHQCTIND DS   CL01     Contest Indicator                                     
WD_MHQRPRD DS    CL02     Report Period                                         
WD_MHQRYEAR DS   CL04     Report Year                                           
WD_MHQMKTZ DS    CL02     Market Time Zone                                      
*                         *** SEE EQUATES FOR W_MHQMKTZ                         
WD_MHQMKCLS DS   CL01     Market Class Code                                     
WD_MHQDMEXC DS   CL01     Distributor or Market Exclusion Indicator             
WD_MHQDSAVE DS   CL01     Daylight Saving Time Indicator                        
WD_MHQRECQ EQU   *-WD_MHQCODE                                                   
*                                                                               
*-------------------------------------------------------------------            
* DISTRIBUTOR INFORMATION AREA                                                  
*-------------------------------------------------------------------            
WD_DHRREC  DS    0CL(WD_DHRRECQ)                                                
WD_DHRCODE DS    CL02     Record Code                                           
WD_DHRMKTC DS    CL03     Market Code                                           
WD_DHRRSRVC DS   CL01     Reporting Service                                     
WD_DHRSDT  DS    CL18     Start DateTime Of Survey                              
WD_DHREDT  DS    CL18     End DateTimeOf Survey                                 
WD_DHRMOOC DS    CL03     Market of Origin Code                                 
WD_DHRDISC DS    CL04     Distributor Code                                      
WD_DHRCALL DS    CL12     Call Letters                                          
WD_DHROCALL DS   CL04     Legacy Call Letters                                   
WD_DHRPPLUS DS   CL01     Parent Plus Indicator                                 
WD_DHRCLONG DS   CL25     Cable Long Name                                       
WD_DHRBCHAN DS   CL07     Broadcast Channel Number                              
WD_DHRDSRC DS    CL01     Distribution Source Type                              
WD_DHRAFFL1 DS   CL07     Primary Affiliation                                   
WD_DHRAFFL2 DS   CL07     Secondary Affiliation                                 
WD_DHRAFFL3 DS   CL07     Tertiary Affiliation                                  
WD_DHRDGRP DS    CL05     Distributor Group                                     
WD_DHRPRNT DS    CL01     Parent Indicator                                      
WD_DHPARYQ EQU   C'Y',,C'C'   Parent station                                    
WD_DHRSATL DS    CL01     Satellite Indicator                                   
WD_DHRSTOT DS    CL01     Station Totals Indicator                              
WD_DHRSTYQ EQU   C'Y',,C'C'    Station has Tsa Impressions                      
WD_DHRSTYPE DS   CL01     Station Type Code                                     
WD_DHRAEIND DS   CL01     Audience Estimates Indicator                          
WD_DHRREPST DS   CL01     Reportability Status                                  
WD_REPORTAB_VIP  EQU  C'V',,C'C'   Reportable on the VIP                        
WD_REPORTAB_DPT  EQU  C'D',,C'C'   Daypart reportable                           
WD_DHRPNIND DS   CL01     Program Names Indicator                               
WD_DHRRECQ EQU   *-WD_DHRCODE                                                   
*                                                                               
*-------------------------------------------------------------------            
* PROGRAM INFORMATION AREA                                                      
*-------------------------------------------------------------------            
WD_PNRAREA DS    0CL(WD_PNRAREAQ)                                               
WD_PNRSEQ  DS    CL4      ID that identifies a telecast, broken at 5AM          
WD_PNRPGID DS    XL4      Program Id for contiguous/overlapping telcsts         
WD_PNRSQH  DS    XL1      PRGM-SQH      EX: X'0A'                               
WD_PNREQH  DS    XL1      PRGM-EQH      EX: X'0D'                               
WD_PNRLQH  DS    XL2      TOTAL-PGM-QH  EX: X'0004'                             
WD_PNRREC  DS    0CL(WD_PNRRECQ)                                                
WD_PNRCODE DS    CL02     Record Code                                           
WD_PNRMKTC DS    CL03     Market Code                                           
WD_PNRDISC DS    CL04     Distributor Code                                      
WD_PNRCALL DS    CL12     Call Letters                                          
WD_PNROCALL DS   CL04     Legacy Call Letters                                   
WD_PNRPPLUS DS   CL01     Parent Plus Indicator                                 
WD_PNRQHSDT DS   CL18     Quarter Hour Start Date Time                          
           ORG   WD_PNRQHSDT                                                    
WD_PNRSDT  DS    CL10     Start Date                                            
           DS    C        Blank                                                 
WD_PNRSTIME DS   CL7      Start Time                                            
           ORG   WD_PNRSTIME                                                    
WD_PNRSHH  DS    CL2      HH                                                    
           DS    C        :                                                     
WD_PNRSMM  DS    CL2      MM                                                    
WD_PNRSAMPM DS   CL2      AM/PM                                                 
           ORG   WD_PNRSAMPM                                                    
WD_PNRSAP  DS    CL1      A/P                                                   
           DS    CL1      M                                                     
WD_PNRQHEDT DS   CL18     Quarter Hour End Date Time                            
           ORG   WD_PNRQHEDT                                                    
WD_PNREDT  DS    CL10     End Date                                              
           DS    C        Blank                                                 
WD_PNRETIME DS   CL7      End Time                                              
           ORG   WD_PNRETIME                                                    
WD_PNREHH  DS    CL2      HH                                                    
           DS    C        :                                                     
WD_PNREMM  DS    CL2      MM                                                    
WD_PNREAMPM DS   CL2      AM/PM                                                 
WD_PNRPCODE DS   CL10     Program Code                                          
WD_PNRPNAME DS   CL14     Program Name                                          
WD_PNRSUBT DS    CL12     Subtitle                                              
WD_PNRCLONG DS   CL25     Cable Long Name                                       
WD_PNRPTYP DS    CL02     Program Type                                          
WD_PNRPSRC DS    CL03     Program Source                                        
WD_PNRSNAM DS    CL01     Satellite Name Indicator                              
WD_PNRRECQ EQU   *-WD_PNRCODE                                                   
WD_PNRAREAQ EQU  *-WD_PNRSEQ                                                    
*                                                                               
*-------------------------------------------------------------------            
* QUARTER HOUR DISTRIBUTOR AREA                                                 
*-------------------------------------------------------------------            
WD_QDRREC  DS    0CL(WD_QDRRECQ)                                                
WD_QDRHEAD DS    0CL(WD_QDRHEADQ)                                               
WD_QDRCODE DS    CL02     Record Code                                           
WD_QDRDISC DS    CL04     Distributor Code                                      
WD_QDRMKTC DS    CL03     Market Code                                           
WD_QDRRSRVC DS   CL01     Reporting Service                                     
WD_QDRSAMTY DS   CL01     Sample Type                                           
WD_QDRPBACK DS   CL01     Playback Type                                         
WD_QDREXCI DS    CL01     Excluded                                              
WD_QDRHEADQ EQU  *-WD_QDRCODE     LENGTH OF HEADER INFORMATION                  
WD_QDRDEMOS DS   0XL(WD_QDRDEMLQ)                                               
WD_QDRMTROA DS   XL04     Metro A Quarter Hour Viewing HH                       
WD_QDRMTROB DS   XL04     Metro B Quarter Hour Viewing HH                       
WD_QDRHHLDS DS   XL04     Household Viewing                                     
WD_QDRCH25 DS    XL04     Demo Viewing Dem#1                                    
WD_QDRCH611 DS   XL04     Demo Viewing Dem#2                                    
WD_QDRM1214 DS   XL04     Demo Viewing Dem#3                                    
WD_QDRM1517 DS   XL04     Demo Viewing Dem#4                                    
WD_QDRM1820 DS   XL04     Demo Viewing Dem#5                                    
WD_QDRM2124 DS   XL04     Demo Viewing Dem#6                                    
WD_QDRM2534 DS   XL04     Demo Viewing Dem#7                                    
WD_QDRM3549 DS   XL04     Demo Viewing Dem#8                                    
WD_QDRM5054 DS   XL04     Demo Viewing Dem#9                                    
WD_QDRM5564 DS   XL04     Demo Viewing Dem#10                                   
WD_QDRM65P DS    XL04     Demo Viewing Dem#11                                   
WD_QDRF1214 DS   XL04     Demo Viewing Dem#12                                   
WD_QDRF1517 DS   XL04     Demo Viewing Dem#13                                   
WD_QDRF1820 DS   XL04     Demo Viewing Dem#14                                   
WD_QDRF2124 DS   XL04     Demo Viewing Dem#15                                   
WD_QDRF2534 DS   XL04     Demo Viewing Dem#16                                   
WD_QDRF3549 DS   XL04     Demo Viewing Dem#17                                   
WD_QDRF5054 DS   XL04     Demo Viewing Dem#18                                   
WD_QDRF5564 DS   XL04     Demo Viewing Dem#19                                   
WD_QDRF65P DS    XL04     Demo Viewing Dem#20                                   
WD_QDRWW   DS    XL04     Demo Viewing Dem#21                                   
WD_QDRDEMLQ EQU  *-WD_QDRMTROA                                                  
WD_QDRRECQ EQU   *-WD_QDRCODE                                                   
*                                                                               
*-------------------------------------------------------------------            
* STATION TOTALS AREA                                                           
*-------------------------------------------------------------------            
WD_STRREC  DS    0CL(WD_STRRECQ)                                                
WD_STRHEAD DS    0CL(WD_STRHEADQ)                                               
WD_STRCODE DS    CL02     Record Code                                           
WD_STRDISC DS    CL04     Distributor Code                                      
WD_STRMKTC DS    CL03     Market Code                                           
WD_STRRSRVC DS   CL01     Reporting Service                                     
WD_STRSAMTY DS   CL01     Sample Type                                           
WD_STRPBACK DS   CL01     Playback Type                                         
WD_STREXCI DS    CL01     Excluded                                              
WD_STRHEADQ EQU  *-WD_STRCODE     LENGTH OF HEADER INFORMATION                  
        DS    XL3      ALIGN DEMOS ON FULL-WORD BOUNDARY                        
WD_STRDEMOS DS   0XL(WD_STRDEMLQ)                                               
WD_STRHHLDS DS   XL04     Household Viewing                                     
WD_STRCH25 DS    XL04     Demo Viewing Dem#1                                    
WD_STRCH611 DS   XL04     Demo Viewing Dem#2                                    
WD_STRM1214 DS   XL04     Demo Viewing Dem#3                                    
WD_STRM1517 DS   XL04     Demo Viewing Dem#4                                    
WD_STRM1820 DS   XL04     Demo Viewing Dem#5                                    
WD_STRM2124 DS   XL04     Demo Viewing Dem#6                                    
WD_STRM2534 DS   XL04     Demo Viewing Dem#7                                    
WD_STRM3549 DS   XL04     Demo Viewing Dem#8                                    
WD_STRM5054 DS   XL04     Demo Viewing Dem#9                                    
WD_STRM5564 DS   XL04     Demo Viewing Dem#10                                   
WD_STRM65P DS    XL04     Demo Viewing Dem#11                                   
WD_STRF1214 DS   XL04     Demo Viewing Dem#12                                   
WD_STRF1517 DS   XL04     Demo Viewing Dem#13                                   
WD_STRF1820 DS   XL04     Demo Viewing Dem#14                                   
WD_STRF2124 DS   XL04     Demo Viewing Dem#15                                   
WD_STRF2534 DS   XL04     Demo Viewing Dem#16                                   
WD_STRF3549 DS   XL04     Demo Viewing Dem#17                                   
WD_STRF5054 DS   XL04     Demo Viewing Dem#18                                   
WD_STRF5564 DS   XL04     Demo Viewing Dem#19                                   
WD_STRF65P DS    XL04     Demo Viewing Dem#20                                   
WD_STRWW   DS    XL04     Demo Viewing Dem#21                                   
WD_STRDEMLQ EQU  *-WD_STRHHLDS                                                  
WD_STRRECQ EQU   *-WD_STRCODE                                                   
*                                                                               
*-------------------------------------------------------------------            
* DAYPART CUMES AREA                                                            
*-------------------------------------------------------------------            
WD_CDRREC  DS    0CL(WD_CDRRECQ)                                                
WD_CDRHEAD DS    0CL(WD_CDRHEADQ)                                               
WD_CDRCODE DS    CL02     RECORD CODE                                           
WD_CDRDISC DS    CL04     DISTRIBUTOR CODE                                      
WD_CDRMKTC DS    CL03     MARKET CODE                                           
WD_CDRRSRVC DS   CL01     REPORTING SERVICE                                     
WD_CDRSAMTY DS   CL01     SAMPLE TYPE                                           
WD_CDRPBACK DS   CL01     PLAYBACK TYPE                                         
WD_CDRDPART DS   CL08     DAYPART CODE                                          
WD_CDRKDSEQ DS   XL3      KEYL DAY/SQH/EQH - FILL IN BY EXIT                    
WD_CDRIDPTC DS   XL1      INTERNAL DAYPART CODE - FILL IN BY EXIT               
WD_CDRHEADQ EQU  *-WD_CDRCODE     LENGTH OF HEADER INFORMATION                  
WD_CDRDEMOS DS   0XL(WD_CDRDEMLQ)                                               
WD_CDRAWMTROA DS XL04     METROA VIEWING  AVERAGE WEEK                          
WD_CDRAWMTROB DS XL04     METROB VIEWING  AVERAGE WEEK                          
WD_CDRAWHHLDS DS XL04     HOUSEHOLD VIEWING  AVERAGE WEEK                       
WD_CDRAWPDEMS DS  0XL(WD_CDRAWPDEMLQ)                                           
WD_CDRAWCH25 DS  XL04     DEMO VIEWING DEM#1 AVERAGE WEEK                       
WD_CDRAWCH611 DS XL04     DEMO VIEWING DEM#2 AVERAGE WEEK                       
WD_CDRAWM1214 DS XL04     DEMO VIEWING DEM#3 AVERAGE WEEK                       
WD_CDRAWM1517 DS XL04     DEMO VIEWING DEM#4 AVERAGE WEEK                       
WD_CDRAWM1820 DS XL04     DEMO VIEWING DEM#5 AVERAGE WEEK                       
WD_CDRAWM2124 DS XL04     DEMO VIEWING DEM#6 AVERAGE WEEK                       
WD_CDRAWM2534 DS XL04     DEMO VIEWING DEM#7 AVERAGE WEEK                       
WD_CDRAWM3549 DS XL04     DEMO VIEWING DEM#8 AVERAGE WEEK                       
WD_CDRAWM5054 DS XL04     DEMO VIEWING DEM#9 AVERAGE WEEK                       
WD_CDRAWM5564 DS XL04     DEMO VIEWING DEM#10 AVERAGE WEEK                      
WD_CDRAWM65P DS  XL04     DEMO VIEWING DEM#11 AVERAGE WEEK                      
WD_CDRAWF1214 DS XL04     DEMO VIEWING DEM#12 AVERAGE WEEK                      
WD_CDRAWF1517 DS XL04     DEMO VIEWING DEM#13 AVERAGE WEEK                      
WD_CDRAWF1820 DS XL04     DEMO VIEWING DEM#14 AVERAGE WEEK                      
WD_CDRAWF2124 DS XL04     DEMO VIEWING DEM#15 AVERAGE WEEK                      
WD_CDRAWF2534 DS XL04     DEMO VIEWING DEM#16 AVERAGE WEEK                      
WD_CDRAWF3549 DS XL04     DEMO VIEWING DEM#17 AVERAGE WEEK                      
WD_CDRAWF5054 DS XL04     DEMO VIEWING DEM#18 AVERAGE WEEK                      
WD_CDRAWF5564 DS XL04     DEMO VIEWING DEM#19 AVERAGE WEEK                      
WD_CDRAWF65P DS  XL04     DEMO VIEWING DEM#20 AVERAGE WEEK                      
WD_CDRAWWW   DS  XL04     DEMO VIEWING DEM#21 AVERAGE WEEK                      
WD_CDRAWPDEMLQ EQU *-WD_CDRAWCH25                                               
WD_CDR4WMTROA DS XL04     METROA VIEWING  4 WEEK                                
WD_CDR4WMTROB DS XL04     METROB VIEWING  4 WEEK                                
WD_CDR4WHHLDS DS XL04     HOUSEHOLD VIEWING 4 WEEK                              
WD_CDR4WPDEMS DS  0XL(WD_CDR4WPDEMLQ)                                           
WD_CDR4WCH25 DS  XL04     DEMO VIEWING DEM#1 4 WEEK                             
WD_CDR4WCH611 DS XL04     DEMO VIEWING DEM#2 4 WEEK                             
WD_CDR4WM1214 DS XL04     DEMO VIEWING DEM#3 4 WEEK                             
WD_CDR4WM1517 DS XL04     DEMO VIEWING DEM#4 4 WEEK                             
WD_CDR4WM1820 DS XL04     DEMO VIEWING DEM#5 4 WEEK                             
WD_CDR4WM2124 DS XL04     DEMO VIEWING DEM#6 4 WEEK                             
WD_CDR4WM2534 DS XL04     DEMO VIEWING DEM#7 4 WEEK                             
WD_CDR4WM3549 DS XL04     DEMO VIEWING DEM#8 4 WEEK                             
WD_CDR4WM5054 DS XL04     DEMO VIEWING DEM#9 4 WEEK                             
WD_CDR4WM5564 DS XL04     DEMO VIEWING DEM#10 4 WEEK                            
WD_CDR4WM65P DS  XL04     DEMO VIEWING DEM#11 4 WEEK                            
WD_CDR4WF1214 DS XL04     DEMO VIEWING DEM#12 4 WEEK                            
WD_CDR4WF1517 DS XL04     DEMO VIEWING DEM#13 4 WEEK                            
WD_CDR4WF1820 DS XL04     DEMO VIEWING DEM#14 4 WEEK                            
WD_CDR4WF2124 DS XL04     DEMO VIEWING DEM#15 4 WEEK                            
WD_CDR4WF2534 DS XL04     DEMO VIEWING DEM#16 4 WEEK                            
WD_CDR4WF3549 DS XL04     DEMO VIEWING DEM#17 4 WEEK                            
WD_CDR4WF5054 DS XL04     DEMO VIEWING DEM#18 4 WEEK                            
WD_CDR4WF5564 DS XL04     DEMO VIEWING DEM#19 4 WEEK                            
WD_CDR4WF65P DS  XL04     DEMO VIEWING DEM#20 4 WEEK                            
WD_CDR4WWW   DS  XL04     DEMO VIEWING DEM#21 4 WEEK                            
WD_CDR4WPDEMLQ EQU *-WD_CDR4WCH25                                               
WD_CDRDEMLQ EQU  *-WD_CDRAWMTROA                                                
WD_CDRRECQ EQU   *-WD_CDRCODE                                                   
*                                                                               
*-------------------------------------------------------------------            
* MISC FIELDS                                                                   
*-------------------------------------------------------------------            
WD_MISREC  DS    0CL(WD_MISRECQ)                                                
WD_RECTYPE DS    CL1      RECORD TYPE                                           
*                                                                               
WD_RECTYPE_UER      EQU   C'U',,C'C'   UNIVERSE RECORD                          
WD_RECTYPE_HPT      EQU   C'H',,C'C'   HUT/PUT RECORD                           
WD_RECTYPE_CDPT     EQU   C'C',,C'C'   CUME DAYPART RECORD                      
* !!! NOTE: NEED SORT ORDER C'U' > C'H' > C'C'                                  
*                                                                               
WD_LMRECDLQ EQU  *-WD_KAREA       LENGTH OF DATA UP TO SPARE                    
*                                                                               
WD_SPARE   DS    CL89                                                           
*                                                                               
WD_JOIN_INDICATOR DS C                                                          
*                                                                               
WD_MISRECQ EQU   *-WD_RECTYPE                                                   
WD_LMRECLQ EQU   *-WD_KAREA       LENGTH OF ENTIRE RECORD, INCL SPARE           
*                                                                               
*                                                                               
         EJECT                                                                  
* ++INCLUDE DELMINDXD (USED BY DELMCALC)                                        
*                                                                               
       ++INCLUDE DELMINDXD                                                      
