*          DATA SET DEMATRIX1  AT LEVEL 037 AS OF 05/07/20                      
* SAME AS DEMTRIX1B  EXCEPT THIS TRIES TO ELIMINATE 4 FIL/SRC COMBO             
* KEY:                                                                          
* E = ENABLED                                                                   
* D=SHOWN BUT DISABLED (GREYED OUT)                                             
* S=STATION CAPTION                                                             
* N=NETWORK CAPTION                                                             
* U=UNKNOWN OPTION                                                              
* ED = ENABLED (DEFAULT) ON/OFF ITEMS                                           
* DD = DISABLED (DEFAULT) ON/OFF ITEMS                                          
* NA = NOT AVAILABLE                                                            
* BOLD=PROD NEEDS CONFIRM                                                       
* BOLD/ITAL = NEED MAINFRAME WORK TO SUPPORT                                    
* NSI TP,NSI T4,NSI PAV,NSI WTP,SRC T4,MFX T4,MFX PAV,ARB TP,                   
* ARB RTP,NHT T4,NHT PAV,BBM TP,CSI TP                                          
*                                                                               
*************  PROPOSER STUFF **********************                            
PSRCNUM  EQU   3      NUMBER OF DIFFERENT SOURCES                               
PSRCLEN  EQU   5      5 BYTE ENTRIES                                            
PSRCCODE DC    AL1(1)    LENGTH OF PSRCCODE ENTRIES                             
         DC    CL1'N'                                                           
         DC    CL1'S'                                                           
         DC    CL1'M'                                                           
PSOURCES DC    AL2(1),AL1(5)                                                    
         DC    CL5'NSI  '                                                       
         DC    CL5'SRC  '                                                       
         DC    CL5'MFX  '                                                       
*  PROPOSER SOURCE DESCRIPTION                                                  
PSRCDISL EQU   20     20 BYTE ENTRIES                                           
PSRCDIS  DC    CL20'Nielsen            '                                        
         DC    CL20'Strategy Research  '                                        
         DC    CL20'Mediafax           '                                        
* CONTAINS THE A(OF BOOK TABLE TO POINT TO) FOR EACH SRC FOR PROPOSER           
* EACH DIIFERENT SRC COMBO MUST HAVE AN ADDRESS TO A TABLE                      
APBOOKTL  EQU   4     LENGTH OF EACH ADDRESS TABLE ENTRY                        
APBOOKTB DC    AL4(BKTPCDE0)                                                    
         DC    AL4(BKTPCDE0)                                                    
         DC    AL4(BKTPCDE0)                                                    
*                                                                               
*SOURCE                                                                         
SRCFILN  EQU   24          NUMBER OF SOURCE FILE COMBO                          
SOURCES  DC    AL2(1),AL1(5)                                                    
         DC    CL5'NSI  '                                                       
         DC    CL5'NSI  '                                                       
         DC    CL5'NSI  '                                                       
         DC    CL5'NSI  '                                                       
         DC    CL5'NSI  '                                                       
         DC    CL5'NSI  '                                                       
****     DC    CL5'NSI  '                                                       
         DC    CL5'NSO  '     This will be converted by by DEM NSI              
         DC    CL5'ARB  '                                                       
         DC    CL5'ARB  '                                                       
         DC    CL5'TRI  '                                                       
         DC    CL5'NHT  '                                                       
         DC    CL5'NHT  '                                                       
         DC    CL5'BBM  '                                                       
         DC    CL5'BBM  '                                                       
         DC    CL5'CSI  '                                                       
         DC    CL5'CSI  '                                                       
         DC    CL5'RAR  '                                                       
         DC    CL5'NSI  '                                                       
         DC    CL5'FUS  '                                                       
         DC    CL5'FUS  '                                                       
         DC    CL5'VID  '                                                       
         DC    CL5'IHT  '                                                       
         DC    CL5'COM  '                                                       
         DC    CL5'COM  '                                                       
*SOURCE DISCRIPTION                                                             
SRCDIS   DC    AL2(2),AL1(21)                                                   
         DC    CL21'Nielsen              '                                      
         DC    CL21'Nielsen              '                                      
         DC    CL21'Nielsen              '                                      
         DC    CL21'Nielsen              '                                      
         DC    CL21'Nielsen              '                                      
         DC    CL21'Nielsen              '                                      
         DC    CL21'Nielsen              '                                      
         DC    CL21'Nielsen Audio        '                                      
         DC    CL21'Nielsen Audio        '                                      
         DC    CL21'Triton               '                                      
         DC    CL21'NHTI-Nielsen Hispanic'                                      
         DC    CL21'NHTI-Nielsen Hispanic'                                      
         DC    CL21'BBM Canadian         '                                      
         DC    CL21'BBM Canadian         '                                      
         DC    CL21'CSI-Nielsen Canadian '                                      
         DC    CL21'CSI-Nielsen Canadian '                                      
         DC    CL21'RADAR                '                                      
         DC    CL21'County Coverage      '                                      
         DC    CL21'Fusion               '                                      
         DC    CL21'Fusion               '                                      
         DC    CL21'Videology            '                                      
         DC    CL21'Nielsen Audio Roll-up'                                      
         DC    CL21'comScore             '                                      
         DC    CL21'comScore             '                                      
* FILE                                                                          
FILES    DC    AL2(3),AL1(5)                                                    
         DC    CL5'TP   '                                                       
         DC    CL5'T4   '                                                       
         DC    CL5'PAV  '                                                       
         DC    CL5'WTP  '                                                       
         DC    CL5'LPM  '                                                       
         DC    CL5'OTP  '                                                       
*****    DC    CL5'OPA  '                                                       
         DC    CL5'PAV  '      OPA - will be converted by DEM to OPA            
         DC    CL5'RTV  '                                                       
         DC    CL5'RTP  '                                                       
         DC    CL5'RTP  '                                                       
         DC    CL5'TP   '                                                       
         DC    CL5'PAV  '                                                       
         DC    CL5'TP   '                                                       
         DC    CL5'WTP  '                                                       
         DC    CL5'TP   '                                                       
         DC    CL5'WTP  '                                                       
         DC    CL5'RTP  '                                                       
         DC    CL5'CTP  '                                                       
         DC    CL5'TP   '                                                       
         DC    CL5'T4   '      FUSION T4                                        
         DC    CL5'TP   '      Videology                                        
         DC    CL5'RTP  '      IHeart                                           
         DC    CL5'TP   '                                                       
         DC    CL5'OTP  '                                                       
*FILE DESCRIPTION                                                               
FILEDISC DC    AL2(4),AL1(25)                                                   
         DC    CL25'Typical Time Period    '                                    
         DC    CL25'4 Week Time Period     '                                    
         DC    CL25'Program Average        '                                    
         DC    CL25'Weekly Metered         '                                    
         DC    CL25'Local People Meter Wkly'                                    
         DC    CL25'Overnights Time Period '                                    
         DC    CL25'Overnights Program AVG '                                    
         DC    CL25'Typical Time Period    '                                    
         DC    CL25'Radio Time Period      '                                    
         DC    CL25'Radio Time Period      '                                    
         DC    CL25'Time Period            '                                    
         DC    CL25'Program Average        '                                    
         DC    CL25'Monthly Time Period    '                                    
         DC    CL25'Weekly Time Period     '                                    
         DC    CL25'Monthly Time Period    '                                    
         DC    CL25'Weekly Time Period     '                                    
         DC    CL25'Radio Time Period      '                                    
         DC    CL25'County Time period     '                                    
         DC    CL25'Typical Time Period    '                                    
         DC    CL25'4 Week Time Period     '                                    
         DC    CL25'Typical Time Period    '                                    
         DC    CL25'Radio Time Period      '                                    
         DC    CL25'Typical Time Period    '                                    
         DC    CL25'Overnights Time Period '                                    
*                                                                               
*                                                                               
*****************************************************************               
AFFLTABL EQU   30           LENGTH OF EACH DEMO TAB ENTRY                       
AFFLCODL EQU   5            LENGTH OF EACH DEM MOD ENTRY                        
AFFLNAML EQU   AFFLTABL-AFFLCODL   L(DESPCRIPTION ENTRY)                        
* IN MARKET SHARE AFFILIATION TABLE                                             
AFFILTAB DC    0CL(5+25)                                                        
         DC    CL5'A    ',CL25'ABC                     '                        
         DC    CL5'C    ',CL25'CBS                     '                        
         DC    CL5'F    ',CL25'FOX                     '                        
         DC    CL5'I    ',CL25'Independent             '                        
         DC    CL5'IS   ',CL25'Ind Hispanic            '                        
         DC    CL5'IT   ',CL25'WTBS                    '                        
         DC    CL5'MFX  ',CL25'MundoFox                '                        
         DC    CL5'N    ',CL25'NBC                     '                        
         DC    CL5'P    ',CL25'PBS                     '                        
         DC    CL5'PC   ',CL25'PBS Commercial          '                        
         DC    CL5'PX   ',CL25'Paxson                  '                        
         DC    CL5'T    ',CL25'Telemundo               '                        
         DC    CL5'TF   ',CL25'Telefutura              '                        
         DC    CL5'U    ',CL25'Univision               '                        
         DC    CL5'UMA  ',CL25'UniMas                  '                        
         DC    CL5'UP   ',CL25'UPN                     '                        
         DC    CL5'WB   ',CL25'Warner Brothers         '                        
         DC    AL2(0)                                                           
*                                                                               
*                                                                               
* CONTAINS THE A(OF AFFLLIATION TABLES ) FOR EACH SRC\FIL COMBO                 
AAFFLTL   EQU   4     LENGTH OF EACH ADDRESS TABLE ENTRY                        
AAFFLTN   EQU   8     NUMBER OF ENTRIES IN ADDR TABLE                           
AAFFLTAB DC    AL4(AFFILTAB)       NSI/TP                                       
         DC    AL4(AFFILTAB)       NSI/T4                                       
         DC    AL4(0)              NSI/PAV                                      
         DC    AL4(0)              NSI/WTP                                      
         DC    AL4(0)              NSI/LPM                                      
         DC    AL4(0)              NSI/OTP                                      
         DC    AL4(0)              NSI/OPA                                      
***      DC    AL4(0)              SRC/T4                                       
***      DC    AL4(0)              MFX/T4                                       
***      DC    AL4(0)              MFX/PAV                                      
***      DC    AL4(0)              ARB/TP                                       
         DC    AL4(0)              ARB/TP                                       
         DC    AL4(0)              ARB/RTP                                      
         DC    AL4(0)              TRI/RTP                                      
         DC    AL4(0)              NHTI/TP                                      
         DC    AL4(0)              NHTI/PAV                                     
*****    DC    AL4(0)                                                           
         DC    AL4(0)              BBM/TP                                       
         DC    AL4(0)              BBM/WTP                                      
         DC    AL4(0)              CSI/TP                                       
         DC    AL4(0)              CSI/WTP                                      
         DC    AL4(0)              RAR/RTP                                      
         DC    AL4(0)              NSI/CTP                                      
         DC    AL4(0)              FUS/TP                                       
         DC    AL4(0)              FUS/T4                                       
         DC    AL4(0)              VID/TP                                       
         DC    AL4(0)              IHT/TP                                       
         DC    AL4(0)              comScore/TP                                  
         DC    AL4(0)              comScore/OTP                                 
*                                                                               
                                                                                
*                                                                               
*****************************************************************               
*===========  demo modifier tables should go here ==============                
DEMOTABL EQU   40           LENGTH OF EACH DEMO TAB ENTRY                       
DEMOMODN EQU   12           NUMBER OF DEMO MOD ENTRIES                          
DEMOMODL EQU   5            LENGTH OF EACH DEM MOD ENTRY                        
DEMODISL EQU   DEMOTABL-DEMOMODL   L(DESCRIPTION ENTRY)                         
DEMODISP EQU   DEMOTABL-DEMODISL   DISPLACEMENT TO DESCRIPTION                  
*                                                                               
* DEMO MODFIERS                                                                 
*                                                                               
DEMOMOD1 DC    CL1'/'                                                           
         DC    CL5'R/S/P',CL35'RATING/SHARES/PUTS      '                        
         DC    CL5' /T/Q',CL35'Imps/TSA Shares/TSA Tot '                        
         DC    CL5'R    ',CL35'Ratings                 '                        
         DC    CL5'S    ',CL35'Share                   '                        
         DC    CL5'P    ',CL35'Puts                    '                        
         DC    CL5'D    ',CL35'Market Impressions      '                        
*        DC    CL5'D    ',CL35'DMA Impressions         '                        
         DC    CL5'B    ',CL35'Extended DMA Share      '                        
         DC    CL5'E    ',CL35'Extended DMA Share      '                        
         DC    CL5'T    ',CL35'TSA Share               '                        
         DC    CL5'Q    ',CL35'TSA Totals              '                        
         DC    CL5'     ',CL35'Impressions             '                        
         DC    CL5'U    ',CL35'Universes               '                        
         DC    AL2(0)                                                           
                                                                                
* DEMO MODIFIERS                                                                
DEMOMOD2 DC    CL1'/'                                                           
*        DC    CL5'R/S/ ',CL35'RATING/SHARES/PUTS      '                        
         DC    CL5'R    ',CL35'Ratings                 '                        
**       DC    CL5'S    ',CL35'SHARE                   '                        
*        DC    CL5'E    ',CL35'Extended DMA Share      '                        
         DC    CL5'E    ',CL35'Extended Ratings        '                        
         DC    CL5'     ',CL35'Impressions             '                        
         DC    AL2(0)                                                           
                                                                                
* DEMO MODIFIERS                                                                
*                                                                               
DEMOMOD3 DC    CL1'/'                                                           
         DC    CL5'R/S/P',CL35'RATING/SHARES/PUTS      '                        
         DC    CL5'R    ',CL35'Ratings                 '                        
         DC    CL5'S    ',CL35'Share                   '                        
         DC    CL5'P    ',CL35'Puts                    '                        
         DC    CL5'     ',CL35'Impressions             '                        
         DC    CL5'U    ',CL35'Universes               '                        
         DC    AL2(0)                                                           
*                                                                               
DEMOMOD4 DC    CL1'/'                                                           
         DC    CL5'R/S/P',CL35'RATING/SHARES/PUTS      '                        
         DC    CL5' /T/Q',CL35'Imps/TSA Shares/TSA Tot '                        
         DC    CL5'R    ',CL35'Ratings                 '                        
         DC    CL5'S    ',CL35'Share                   '                        
         DC    CL5'P    ',CL35'Puts                    '                        
         DC    CL5'A    ',CL35'ADI Impressions         '                        
         DC    CL5'B    ',CL35'Extended DMA Share      '                        
         DC    CL5'E    ',CL35'Extended DMA Share      '                        
         DC    CL5'T    ',CL35'TSA Share               '                        
         DC    CL5'Q    ',CL35'TSA Totals              '                        
***      DC    CL5'     ',CL35'TSA Impressions         '                        
         DC    CL5'     ',CL35'Impressions             '                        
         DC    CL5'U    ',CL35'Universes               '                        
         DC    AL2(0)                                                           
                                                                                
DEMOMOD5 DC    CL1'/'                                                           
         DC    CL5'R/S/P',CL35'RATING/SHARES/PUTS      '                        
         DC    CL5' /T/Q',CL35'Imps/TSA Shares/TSA Tot '                        
         DC    CL5'R    ',CL35'Ratings                 '                        
         DC    CL5'S    ',CL35'Share                   '                        
         DC    CL5'P    ',CL35'Puts                    '                        
         DC    CL5'A    ',CL35'USA Impressions         '                        
         DC    CL5'B    ',CL35'Extended DMA Share      '                        
         DC    CL5'E    ',CL35'Extended DMA Share      '                        
         DC    CL5'T    ',CL35'TSA Share               '                        
         DC    CL5'Q    ',CL35'TSA Totals              '                        
         DC    CL5'     ',CL35'Impressions             '                        
         DC    CL5'U    ',CL35'Universes               '                        
         DC    AL2(0)                                                           
*                                                                               
DEMOMOD6 DC    CL1'/'                                                           
         DC    CL5'R    ',CL35'Ratings                 '                        
         DC    CL5'U    ',CL35'Universes               '                        
         DC    CL5'S    ',CL35'Share                   '                        
         DC    CL5'     ',CL35'Impressions             '                        
         DC    AL2(0)                                                           
                                                                                
DEMOMOD7 DC    CL1'/'                                                           
         DC    CL5'R/S/P',CL35'RATING/SHARES/PUTS      '                        
         DC    CL5'R    ',CL35'Ratings                 '                        
         DC    CL5'S    ',CL35'Share                   '                        
         DC    CL5'P    ',CL35'Puts                    '                        
         DC    CL5'U    ',CL35'Universes               '                        
         DC    AL2(0)                                                           
                                                                                
                                                                                
DEMOMOD8 DC    CL1'/'                                                           
         DC    CL5'R/S/P',CL35'RATING/SHARES/PUTS      '                        
         DC    CL5'R    ',CL35'Ratings                 '                        
         DC    CL5'S    ',CL35'Share                   '                        
         DC    CL5'P    ',CL35'Puts                    '                        
         DC    CL5'D    ',CL35'Market Impressions      '                        
         DC    CL5'B    ',CL35'Extended DMA Share      '                        
         DC    CL5'E    ',CL35'Extended DMA Share      '                        
         DC    CL5'     ',CL35'Impressions             '                        
         DC    CL5'U    ',CL35'Universes               '                        
         DC    AL2(0)                                                           
                                                                                
DEMOMOD9 DC    CL1'/'                                                           
         DC    CL5'L    ',CL35'Universes               '                        
         DC    CL5'A    ',CL35'Viewers                 '                        
         DC    CL5'S    ',CL35'Shares                  '                        
         DC    CL5'D    ',CL35'Daily Cume %            '                        
         DC    CL5'C    ',CL35'Weekly Cume %           '                        
         DC    CL5'E    ',CL35'Station Shares          '                        
         DC    CL5'F    ',CL35'DMA Shares              '                        
         DC    AL2(0)                                                           
*                                                                               
DEMOMO10 DC    CL1'/'                                                           
         DC    CL5'R/S/P',CL35'RATING/SHARES/PUTS|rating/share/hut'             
         DC    CL5'R    ',CL35'Ratings|rating          '                        
         DC    CL5'S    ',CL35'Share|share             '                        
         DC    CL5'P    ',CL35'Puts|hut                '                        
         DC    CL5'     ',CL35'Impressions|avg_aud     '                        
         DC    CL5'U    ',CL35'Universes|universe      '                        
         DC    CL5'M    ',CL35'Indexes|demo_index      '                        
         DC    AL2(0)                                                           
*                                                                               
                                                                                
* CONTAINS THE A(OF DEMO TABLE TO POINT TO) FOR EACH SRC\FIL COMBO              
ADEMOTL   EQU   4     LENGTH OF EACH ADDRESS TABLE ENTRY                        
ADEMOTN   EQU   8     NUMBER OF ENTRIES IN ADDR TABLE                           
ADEMOTAB DC    AL4(DEMOMOD1)       NSI/TP                                       
         DC    AL4(DEMOMOD1)       NSI/T4                                       
         DC    AL4(DEMOMOD1)       NSI/PAV                                      
         DC    AL4(DEMOMOD1)       NSI/WTP                                      
         DC    AL4(DEMOMOD1)       NSI/LPM                                      
         DC    AL4(DEMOMOD1)       NSI/OTP                                      
         DC    AL4(DEMOMOD1)       NSI/OPA                                      
         DC    AL4(DEMOMOD7)       ARB/TP                                       
         DC    AL4(DEMOMOD4)       ARB/RTP                                      
         DC    AL4(DEMOMOD4)       TRI/RTP                                      
         DC    AL4(DEMOMOD3)       NHTI/TP                                      
         DC    AL4(DEMOMOD3)       NHTI/PAV                                     
         DC    AL4(DEMOMOD2)       BBM/TP                                       
         DC    AL4(DEMOMOD2)       BBM/WTP                                      
         DC    AL4(DEMOMOD6)       CSI/TP                                       
         DC    AL4(DEMOMOD6)       CSI/WTP                                      
         DC    AL4(DEMOMOD5)       RAR/RTP                                      
         DC    AL4(DEMOMOD9)       NSI/CTP                                      
         DC    AL4(DEMOMOD1)       FUS/TP                                       
         DC    AL4(DEMOMOD1)       FUS/T4                                       
         DC    AL4(DEMOMOD1)       VID/TP                                       
         DC    AL4(DEMOMOD4)       IHT/RTP                                      
         DC    AL4(DEMOMO10)       comScore/TP                                  
         DC    AL4(DEMOMO10)       comScore/OTP                                 
*                                                                               
*****************************************************************               
*===========  BOOK TYPE CODE  TABLE SHOULD GO HERE =============                
BKTPTABL EQU   35           LENGTH OF EACH BKTYPE CODE ENTRY                    
BKTPCDEN EQU   9            NUMBER OF BOOK TYPE CODE ENTRIES                    
BKTPCDEL EQU   5            LENGTH OF EACH BOOK TYPE CODE ENTRY                 
BKTPDISL EQU   BKTPTABL-BKTPCDEL   L(DESPCRIPTION ENTRY)                        
BKTPDISP EQU   BKTPTABL-BKTPDISL   DISPLACEMENT TO DESCRIPTION                  
*                                                                               
* BOOK TYPE CODES AND BOOK TYPE CODE DESCRIPTIONS                               
*  this table is only for proposer                                              
BKTPCDE0 DS    0CL(5+30)                                                        
         DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'B    ',CL30'Black                         '                  
         DC    CL5'H    ',CL30'Hispanic                      '                  
         DC    CL5'C    ',CL30'Cable                         '                  
         DC    CL5'M    ',CL30'Metro                         '                  
         DC    CL5'T    ',CL30'Trading Area                  '                  
         DC    CL5'O    ',CL30'Olympic Excl.                 '                  
         DC    CL5'OL   ',CL30'Olympic Excl. Live            '                  
         DC    CL5'OS   ',CL30'Oly X. Live+SD                '                  
         DC    CL5'O3   ',CL30'Oly X. Live+3                 '                  
         DC    CL5'E    ',CL30'Extended                      '                  
         DC    CL5'D    ',CL30'DMA Prv/Spcl                  '                  
         DC    CL5'N    ',CL30'Special FoxNet                '                  
         DC    CL5'X    ',CL30'Misc Exclusions               '                  
         DC    CL5'A    ',CL30'Parent Only                   '                  
         DC    CL5'W    ',CL30'Hardwired Cable               '                  
         DC    CL5'P    ',CL30'People Meter                  '                  
         DC    CL5'I    ',CL30'Hispanic LPM                  '                  
         DC    CL5'L    ',CL30'Live                          '                  
         DC    CL5'L1   ',CL30'Live+1                        '                  
         DC    CL5'L3   ',CL30'Live+3                        '                  
         DC    CL5'LS   ',CL30'Live+SD                       '                  
         DC    CL5'J    ',CL30'Live Hispanic                 '                  
         DC    CL5'H1   ',CL30'Live+1 Hispanic               '                  
         DC    CL5'H3   ',CL30'Live+3 Hispanic               '                  
         DC    CL5'HS   ',CL30'Live+SD Hispanic              '                  
         DC    CL5'1    ',CL30'Standard 0 Cell               '                  
         DC    CL5'2    ',CL30'Hispanic 0 Cell               '                  
         DC    CL5'3    ',CL30'Cable 0 Cell                  '                  
         DC    CL5'4    ',CL30'Hardwired 0 Cell              '                  
         DC    CL5'U    ',CL30'Live Cable                    '                  
         DC    CL5'C1   ',CL30'Live+1 Cable                  '                  
         DC    CL5'Z    ',CL30'Live Hardwired                '                  
         DC    CL5'W1   ',CL30'Live+1 HARDWIRED              '                  
         DC    CL5'W3   ',CL30'Live+3 HARDWIRED              '                  
         DC    CL5'WS   ',CL30'Live+SD Hardwired             '                  
         DC    CL5'SS   ',CL30'Live+SD Hardwired Parent Only '                  
         DC    CL5'QS   ',CL30'Live+SD Parent Only           '                  
         DC    CL5'HT   ',CL30'Hispanic Test                 '                  
* The Following 15 Entries are Temporary                                        
         DC    CL5'ZL   ',CL30'HUT Live                      '                  
         DC    CL5'ZU   ',CL30'HUT DMA Live                  '                  
         DC    CL5'ZZ   ',CL30'HUT Wired Live                '                  
         DC    CL5'ZJ   ',CL30'HUT Hisp Live                 '                  
         DC    CL5'ZS   ',CL30'HUT Live+SD                   '                  
         DC    CL5'ZA   ',CL30'HUT Wired L+SD                '                  
         DC    CL5'ZE   ',CL30'HUT Hisp L+SD                 '                  
         DC    CL5'Z3   ',CL30'HUT Live+3                    '                  
         DC    CL5'ZD   ',CL30'HUT DMA L+3                   '                  
         DC    CL5'ZB   ',CL30'HUT Wired L+3                 '                  
         DC    CL5'ZF   ',CL30'HUT Hisp L+3                  '                  
         DC    CL5'Z7   ',CL30'HUT Live+7                    '                  
         DC    CL5'ZC   ',CL30'HUT DMA L+7                   '                  
         DC    CL5'ZW   ',CL30'HUT Wired L+7                 '                  
         DC    CL5'ZH   ',CL30'HUT Hisp L+7                  '                  
* The Following 15 Entries are for HYBRID (EXTENDED)                            
         DC    CL5'YL   ',CL30'Impact Live                '                     
         DC    CL5'YU   ',CL30'Impact DMA Live            '                     
         DC    CL5'YZ   ',CL30'Impact Wired Live          '                     
         DC    CL5'YJ   ',CL30'Impact Hisp Live           '                     
         DC    CL5'Y1   ',CL30'Impact Live+1              '                     
         DC    CL5'YK   ',CL30'Impact DMA Live+1          '                     
         DC    CL5'YM   ',CL30'Impact Wired Live+1        '                     
         DC    CL5'YN   ',CL30'Impact Hisp Live+1         '                     
         DC    CL5'YS   ',CL30'Impact Live+SD             '                     
         DC    CL5'YA   ',CL30'Impact Wired L+SD          '                     
         DC    CL5'YE   ',CL30'Impact Hisp L+SD           '                     
         DC    CL5'Y3   ',CL30'Impact Live+3              '                     
         DC    CL5'YD   ',CL30'Impact DMA L+3             '                     
         DC    CL5'YB   ',CL30'Impact Wired L+3           '                     
         DC    CL5'YF   ',CL30'Impact Hisp L+3            '                     
         DC    CL5'Y7   ',CL30'Impact Live+7              '                     
         DC    CL5'YC   ',CL30'Impact DMA L+7             '                     
         DC    CL5'YW   ',CL30'Impact Wired L+7           '                     
         DC    CL5'YH   ',CL30'Impact Hisp L+7            '                     
         DC    AL2(0)                                                           
*                                                                               
*                                                                               
BKTPCDE1 DS    0CL(5+30)                                                        
         DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'B    ',CL30'Black                         '                  
         DC    CL5'H    ',CL30'Hispanic                      '                  
         DC    CL5'C    ',CL30'Cable                         '                  
         DC    CL5'M    ',CL30'Metro                         '                  
         DC    CL5'T    ',CL30'Trading Area                  '                  
         DC    CL5'O    ',CL30'Olympic Excl.                 '                  
         DC    CL5'OL   ',CL30'Olympic Excl. Live            '                  
         DC    CL5'OS   ',CL30'Oly X. Live+SD                '                  
         DC    CL5'O3   ',CL30'Oly X. Live+3                 '                  
         DC    CL5'E    ',CL30'Extended                      '                  
         DC    CL5'D    ',CL30'DMA Prv/Spcl                  '                  
         DC    CL5'N    ',CL30'Special FoxNet                '                  
         DC    CL5'P    ',CL30'People Meter                  '                  
         DC    CL5'X    ',CL30'Misc Exclusions               '                  
         DC    CL5'A    ',CL30'Parent Only                   '                  
         DC    CL5'W    ',CL30'Hardwired Cable               '                  
         DC    CL5'I    ',CL30'Hispanic LPM                  '                  
         DC    CL5'L    ',CL30'Live                          '                  
         DC    CL5'L1   ',CL30'Live+1                        '                  
         DC    CL5'LS   ',CL30'Live+SD                       '                  
         DC    CL5'L3   ',CL30'Live+3                        '                  
         DC    CL5'J    ',CL30'Live Hispanic                 '                  
         DC    CL5'H1   ',CL30'Live+1 Hispanic               '                  
         DC    CL5'H3   ',CL30'Live+3 Hispanic               '                  
         DC    CL5'HS   ',CL30'Live+SD Hispanic              '                  
         DC    CL5'1    ',CL30'Standard 0 Cell               '                  
         DC    CL5'2    ',CL30'Hispanic 0 Cell               '                  
         DC    CL5'3    ',CL30'Cable 0 Cell                  '                  
         DC    CL5'4    ',CL30'Hardwired 0 Cell              '                  
         DC    CL5'U    ',CL30'Live Cable                    '                  
         DC    CL5'C1   ',CL30'Live+1 Cable                  '                  
         DC    CL5'C3   ',CL30'Live+3 Cable                  '                  
         DC    CL5'Z    ',CL30'Live Hardwired                '                  
         DC    CL5'W1   ',CL30'Live+1 Hardwired              '                  
         DC    CL5'W3   ',CL30'Live+3 Hardwired              '                  
         DC    CL5'WS   ',CL30'Live+SD Hardwired             '                  
         DC    CL5'SS   ',CL30'Live+SD Hardwired Parent Only '                  
         DC    CL5'QS   ',CL30'Live+SD Parent Only           '                  
         DC    CL5'HT   ',CL30'Hispanic Test                 '                  
* The Following 15 Entries are Temporary                                        
         DC    CL5'ZL   ',CL30'HUT Live                      '                  
         DC    CL5'ZU   ',CL30'HUT DMA Live                  '                  
         DC    CL5'ZZ   ',CL30'HUT Wired Live                '                  
         DC    CL5'ZJ   ',CL30'HUT Hisp Live                 '                  
         DC    CL5'ZS   ',CL30'HUT Live+SD                   '                  
         DC    CL5'ZA   ',CL30'HUT Wired L+SD                '                  
         DC    CL5'ZE   ',CL30'HUT Hisp L+SD                 '                  
         DC    CL5'Z3   ',CL30'HUT Live+3                    '                  
         DC    CL5'ZD   ',CL30'HUT DMA L+3                   '                  
         DC    CL5'ZB   ',CL30'HUT Wired L+3                 '                  
         DC    CL5'ZF   ',CL30'HUT Hisp L+3                  '                  
         DC    CL5'Z7   ',CL30'HUT Live+7                    '                  
         DC    CL5'ZC   ',CL30'HUT DMA L+7                   '                  
         DC    CL5'ZW   ',CL30'HUT Wired L+7                 '                  
         DC    CL5'ZH   ',CL30'HUT Hisp L+7                  '                  
* The Following 15 Entries are for HYBRID (EXTENDED)                            
         DC    CL5'YL   ',CL30'Impact Live                '                     
         DC    CL5'YU   ',CL30'Impact DMA Live            '                     
         DC    CL5'YZ   ',CL30'Impact Wired Live          '                     
         DC    CL5'YJ   ',CL30'Impact Hisp Live           '                     
         DC    CL5'Y1   ',CL30'Impact Live+1              '                     
         DC    CL5'YK   ',CL30'Impact DMA Live+1          '                     
         DC    CL5'YM   ',CL30'Impact Wired Live+1        '                     
         DC    CL5'YN   ',CL30'Impact Hisp Live+1         '                     
         DC    CL5'YS   ',CL30'Impact Live+SD             '                     
         DC    CL5'YA   ',CL30'Impact Wired L+SD          '                     
         DC    CL5'YE   ',CL30'Impact Hisp L+SD           '                     
         DC    CL5'Y3   ',CL30'Impact Live+3              '                     
         DC    CL5'YD   ',CL30'Impact DMA L+3             '                     
         DC    CL5'YB   ',CL30'Impact Wired L+3           '                     
         DC    CL5'YF   ',CL30'Impact Hisp L+3            '                     
         DC    CL5'Y7   ',CL30'Impact Live+7              '                     
         DC    CL5'YC   ',CL30'Impact DMA L+7             '                     
         DC    CL5'YW   ',CL30'Impact Wired L+7           '                     
         DC    CL5'YH   ',CL30'Impact Hisp L+7            '                     
         DC    AL2(0)                                                           
*                                                                               
BKTPCDE2 DS    0CL(5+30)                                                        
         DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'B    ',CL30'Black                         '                  
         DC    CL5'E    ',CL30'Black PPM                     '                  
         DC    CL5'H    ',CL30'Hispanic                      '                  
         DC    CL5'I    ',CL30'Hispanic PPM                  '                  
         DC    CL5'P    ',CL30'People Meter                  '                  
         DC    CL5'D    ',CL30'Holiday PPM                   '                  
         DC    CL5'S    ',CL30'Holiday Hispanic              '                  
         DC    CL5'K    ',CL30'Holiday Black                 '                  
         DC    CL5'C    ',CL30'CSAR                          '                  
         DC    AL2(0)                                                           
*                                                                               
BKTPCDE3 DS    0CL(5+30)                                                        
         DC    CL5'     ',CL30'Standard Survey               '                  
         DC    AL2(0)                                                           
*                                                                               
BKTPCDE4 DS    0CL(5+30)           Nielsen NHTI booktypes                       
         DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'5    ',CL30'Sp. Dominant                  '                  
         DC    CL5'6    ',CL30'Eng. Dominant                 '                  
         DC    CL5'7    ',CL30'Bilingual                     '                  
         DC    AL2(0)                                                           
*                                                                               
BKTPCDE5 DS    0CL(5+30)           NSI/PAV                                      
         DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'B    ',CL30'Black                         '                  
         DC    CL5'H    ',CL30'Hispanic                      '                  
         DC    CL5'M    ',CL30'Metro                         '                  
         DC    CL5'T    ',CL30'Trading Area                  '                  
         DC    CL5'O    ',CL30'Olympic Excl.                 '                  
         DC    CL5'OL   ',CL30'Olympic Excl. Live            '                  
         DC    CL5'OS   ',CL30'Oly X. Live+SD                '                  
         DC    CL5'O3   ',CL30'Oly X. Live+3                 '                  
         DC    CL5'E    ',CL30'Extended                      '                  
         DC    CL5'D    ',CL30'DMA Prv/Spcl                  '                  
         DC    CL5'N    ',CL30'Special FoxNet                '                  
         DC    CL5'P    ',CL30'People Meter                  '                  
         DC    CL5'X    ',CL30'Misc Exclusions               '                  
         DC    CL5'I    ',CL30'Hispanic LPM                  '                  
         DC    CL5'L    ',CL30'Live                          '                  
         DC    CL5'L1   ',CL30'Live+1                        '                  
         DC    CL5'LS   ',CL30'Live+SD                       '                  
         DC    CL5'L3   ',CL30'Live+3                        '                  
         DC    CL5'J    ',CL30'Live Hispanic                 '                  
         DC    CL5'H1   ',CL30'Live+1 Hispanic               '                  
         DC    CL5'H3   ',CL30'Live+3 Hispanic               '                  
         DC    CL5'HS   ',CL30'Live+SD Hispanic              '                  
         DC    CL5'1    ',CL30'Standard Zero Cell            '                  
         DC    CL5'2    ',CL30'Hispanic Zero Cell            '                  
         DC    CL5'SS   ',CL30'Live+SD Hardwired Parent Only '                  
         DC    CL5'QS   ',CL30'Live+SD Parent Only           '                  
         DC    CL5'HT   ',CL30'Hispanic Test                 '                  
* The Following 15 Entries are Temporary                                        
         DC    CL5'ZL   ',CL30'HUT Live                      '                  
         DC    CL5'ZU   ',CL30'HUT DMA Live                  '                  
         DC    CL5'ZZ   ',CL30'HUT Wired Live                '                  
         DC    CL5'ZJ   ',CL30'HUT Hisp Live                 '                  
         DC    CL5'ZS   ',CL30'HUT Live+SD                   '                  
         DC    CL5'ZA   ',CL30'HUT Wired L+SD                '                  
         DC    CL5'ZE   ',CL30'HUT Hisp L+SD                 '                  
         DC    CL5'Z3   ',CL30'HUT Live+3                    '                  
         DC    CL5'ZD   ',CL30'HUT DMA L+3                   '                  
         DC    CL5'ZB   ',CL30'HUT Wired L+3                 '                  
         DC    CL5'ZF   ',CL30'HUT Hisp L+3                  '                  
         DC    CL5'Z7   ',CL30'HUT Live+7                    '                  
         DC    CL5'ZC   ',CL30'HUT DMA L+7                   '                  
         DC    CL5'ZW   ',CL30'HUT Wired L+7                 '                  
         DC    CL5'ZH   ',CL30'HUT Hisp L+7                  '                  
* The Following 15 Entries are for HYBRID (EXTENDED)                            
         DC    CL5'YL   ',CL30'Impact Live                '                     
         DC    CL5'YU   ',CL30'Impact DMA Live            '                     
         DC    CL5'YZ   ',CL30'Impact Wired Live          '                     
         DC    CL5'YJ   ',CL30'Impact Hisp Live           '                     
         DC    CL5'Y1   ',CL30'Impact Live+1              '                     
         DC    CL5'YK   ',CL30'Impact DMA Live+1          '                     
         DC    CL5'YM   ',CL30'Impact Wired Live+1        '                     
         DC    CL5'YN   ',CL30'Impact Hisp Live+1         '                     
         DC    CL5'YS   ',CL30'Impact Live+SD             '                     
         DC    CL5'YA   ',CL30'Impact Wired L+SD          '                     
         DC    CL5'YE   ',CL30'Impact Hisp L+SD           '                     
         DC    CL5'Y3   ',CL30'Impact Live+3              '                     
         DC    CL5'YD   ',CL30'Impact DMA L+3             '                     
         DC    CL5'YB   ',CL30'Impact Wired L+3           '                     
         DC    CL5'YF   ',CL30'Impact Hisp L+3            '                     
         DC    CL5'Y7   ',CL30'Impact Live+7              '                     
         DC    CL5'YC   ',CL30'Impact DMA L+7             '                     
         DC    CL5'YW   ',CL30'Impact Wired L+7           '                     
         DC    CL5'YH   ',CL30'Impact Hisp L+7            '                     
         DC    AL2(0)                                                           
*                                                                               
*                                                                               
BKTPCDE6 DS    0CL(5+30)                                                        
***      DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'     ',CL30'Weekly                        '                  
         DC    AL2(0)                                                           
BKTPCDE7 DS    0CL(5+30)                                                        
****     DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'     ',CL30'Weekly                        '                  
         DC    AL2(0)                                                           
BKTPCDE8 DS    0CL(5+30)                                                        
         DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'P    ',CL30'People Meter                  '                  
         DC    AL2(0)                                                           
*                                                                               
BKTPCDE9 DS    0CL(5+30)                                                        
         DC    CL5'     ',CL30'Standard Survey               '                  
         DC    CL5'D    ',CL30'Holiday                       '                  
         DC    AL2(0)                                                           
*                                                                               
BKTPCD10 DS    0CL(5+30)                                                        
         DC    CL5'L    ',CL30'Live                          '                  
         DC    AL2(0)                                                           
*                                                                               
* CONTAINS THE A(OF BOOK TABLE TO POINT TO) FOR EACH SRC\FIL COMBO              
* EACH FILE SRC COMBO MUST HAVE AN ADDRESS TO A TABLE                           
ABOOKTL   EQU   4     LENGTH OF EACH ADDRESS TABLE ENTRY                        
ABOOKTAB DC    A(BKTPCDE1)         NSI/TP                                       
         DC    AL4(BKTPCDE1)       NSI/T4                                       
         DC    AL4(BKTPCDE5)       NSI/PAV                                      
         DC    AL4(BKTPCDE3)       NSI/WTP                                      
***      DC    AL4(BKTPCDE3)       NSI/LPM                                      
         DC    AL4(BKTPCDE8)       NSI/LPM                                      
         DC    AL4(BKTPCDE1)       NSI/OTP                                      
         DC    AL4(BKTPCDE1)       NSI/OPA                                      
***      DC    AL4(BKTPCDE3)       SRC/T4                                       
***      DC    AL4(BKTPCDE3)       MFX/T4                                       
***      DC    AL4(BKTPCDE3)       MFX/PAV                                      
***      DC    AL4(BKTPCDE3)       ARB/TP                                       
         DC    AL4(BKTPCDE3)       ARB/TP                                       
         DC    AL4(BKTPCDE2)       ARB/RTP                                      
         DC    AL4(BKTPCDE9)       TRI/RTP                                      
         DC    AL4(BKTPCDE4)       NHTI/TP                                      
         DC    AL4(BKTPCDE4)       NHTI/PAV                                     
         DC    AL4(BKTPCDE3)       BBM/TP                                       
         DC    AL4(BKTPCDE6)       BBM/WTP                                      
**       DC    AL4(BKTPCDE3)       CSI/TP                                       
**       DC    AL4(BKTPCDE3)       CSI/WTP                                      
         DC    AL4(BKTPCDE3)       CSI/TP                                       
         DC    AL4(BKTPCDE7)       CSI/WTP                                      
         DC    AL4(BKTPCDE2)       RAR/RTP                                      
         DC    AL4(BKTPCDE1)       NSI/CTP                                      
         DC    AL4(BKTPCDE1)       FUS/TP                                       
         DC    AL4(BKTPCDE1)       FUS/T4                                       
         DC    AL4(BKTPCDE1)       VID/TP                                       
         DC    AL4(BKTPCDE2)       IHT/RTP                                      
         DC    AL4(BKTPCD10)       comScore/TP                                  
         DC    AL4(BKTPCD10)       comScore/OTP                                 
*                                                                               
*                                                                               
*****************************************************************               
*===========  Day Time Avg   ABLE SHOULD GO HERE =============                  
DAYTMTBL EQU   31           LENGTH OF EACH DAY TIME ENTRY                       
DYTMCDEL EQU   6            LENGTH OF EACH DAY TIME CODE                        
DYTMDISL EQU   25           LENGTH OF DECRIPTION                                
DYTMDISP EQU   DAYTMTBL-DYTMDISL   DISPLACEMENT TO DESCRIPTION                  
*                                                                               
* DAY TIME AVG TYPE CODES AND CODE DESCRIPTIONS                                 
*                                                                               
DAYTMTB1 DC    CL6'M-F   ',CL25'M - Fri Avg             '                       
         DC    CL6'M-SU  ',CL25'M - Su Avg              '                       
         DC    CL6'SA-SU ',CL25'Sa - Su Avg             '                       
         DC    AL2(0)                                                           
*                                                                               
DAYTMTB2 DC    CL6'M-F   ',CL25'M - Fri Avg             '                       
         DC    CL6'M-SU  ',CL25'M - Su Avg              '                       
         DC    CL6'SA-SU ',CL25'Sa - Su Avg             '                       
         DC    AL2(0)                                                           
*                                                                               
DAYTMTB3 DC    CL6'M-F   ',CL25'M - Fri Avg             '                       
         DC    CL6'M-SU  ',CL25'M - Su Avg              '                       
         DC    CL6'SA-SU ',CL25'Sa - Su Avg             '                       
         DC    CL6'VAR   ',CL25'Various Rotation        '                       
         DC    CL6'AVG2  ',CL25'2-Day Average Rotation  '                       
         DC    CL6'AVG3  ',CL25'3-Day Average Rotation  '                       
         DC    CL6'AVG4  ',CL25'4-Day Average Rotation  '                       
         DC    CL6'AVG5  ',CL25'5-Day Average Rotation  '                       
         DC    CL6'AVG6  ',CL25'6-Day Average Rotation  '                       
         DC    AL2(0)                                                           
*                                                                               
DAYTMTB4 DC    CL6'M-F   ',CL25'M - Fri Avg             '                       
         DC    CL6'SU-SA ',CL25'Su - Sa Avg             '                       
         DC    CL6'Prime ',CL25'Prime Rotation          '                       
         DC    AL2(0)                                                           
*                                                                               
* CONTAINS THE A(OF DAY TIME AVG TAB TO POINT TO)                               
ADAYTML   EQU   4     LENGTH OF EACH ADDRESS TABLE ENTRY                        
ADAYTMTB DC    AL4(DAYTMTB2)       NSI TP                                       
         DC    AL4(DAYTMTB2)       NSI T4                                       
         DC    AL4(DAYTMTB1)       NSI PAV                                      
         DC    AL4(DAYTMTB2)       NSI WTP                                      
         DC    AL4(DAYTMTB2)       NSI LPM                                      
         DC    AL4(DAYTMTB2)       NSI OTP                                      
         DC    AL4(DAYTMTB2)       NSI OPA                                      
***      DC    AL4(0)              SRC T4                                       
***      DC    AL4(DAYTMTB2)       MFX T4                                       
***      DC    AL4(DAYTMTB2)       MFX PAV                                      
***      DC    AL4(0)              ARB TP                                       
         DC    AL4(DAYTMTB2)       ARB TP                                       
         DC    AL4(0)              ARB RTP                                      
         DC    AL4(0)              TRI RTP                                      
         DC    AL4(0)              NHT TP                                       
         DC    AL4(0)              NHT PAV                                      
         DC    AL4(0)              BBM TP                                       
         DC    AL4(0)              BBM WTP                                      
         DC    AL4(0)              CSI TP                                       
         DC    AL4(0)              CSI WTP                                      
         DC    AL4(0)              RAR RTP                                      
         DC    AL4(0)              NSI CTP                                      
         DC    AL4(DAYTMTB2)       FUS TP                                       
         DC    AL4(DAYTMTB2)       FUS T4                                       
         DC    AL4(DAYTMTB2)       VID TP                                       
         DC    AL4(0)              IHT RTP                                      
         DC    AL4(DAYTMTB2)       comScore TP                                  
         DC    AL4(DAYTMTB2)       comScore OTP                                 
                                                                                
*                                                                               
** TABLE OF ADDRESSES OF DAY/TIME TABLES FOR  XTRCVER4  AND HIGHER **           
*                                                                               
ADAYTMTB2 DS   0C                                                               
         DC    AL4(DAYTMTB2)       NSI TP                                       
         DC    AL4(DAYTMTB2)       NSI T4                                       
         DC    AL4(DAYTMTB3)       NSI PAV                                      
         DC    AL4(DAYTMTB2)       NSI WTP                                      
         DC    AL4(DAYTMTB2)       NSI LPM                                      
         DC    AL4(DAYTMTB2)       NSI OTP                                      
         DC    AL4(DAYTMTB2)       NSI OPA                                      
         DC    AL4(DAYTMTB2)       ARB TP                                       
         DC    AL4(0)              ARB RTP                                      
         DC    AL4(0)              TRI RTP                                      
         DC    AL4(0)              NHT TP                                       
         DC    AL4(0)              NHT PAV                                      
         DC    AL4(0)              BBM TP                                       
         DC    AL4(0)              BBM WTP                                      
         DC    AL4(0)              CSI TP                                       
         DC    AL4(0)              CSI WTP                                      
         DC    AL4(0)              RAR RTP                                      
         DC    AL4(DAYTMTB4)       NSI CTP                                      
***      DC    AL4(0)              NSI CTP                                      
         DC    AL4(DAYTMTB2)       FUS TP                                       
         DC    AL4(DAYTMTB2)       FUS T4                                       
         DC    AL4(DAYTMTB2)       VID TP                                       
         DC    AL4(0)              IHT RTP                                      
         DC    AL4(DAYTMTB2)       comScore TP                                  
         DC    AL4(DAYTMTB2)       comScore OTP                                 
         EJECT                                                                  
*****************************************************************               
*===========  Program types and descriptions     =============                  
PRGTPTBL EQU   37           LENGTH OF EACH PROGRAM TYPE ENTRY                   
PRGTPCDL EQU   2            LENGTH OF EACH PROGRAM TYPE CODE                    
PRGDESPL EQU   35           LENGTH OF DECRIPTION                                
PRGDDISP EQU   PRGTPTBL-PRGDESPL   DISPLACEMENT TO DESCRIPTION                  
*                                                                               
* DAY TIME AVG TYPE CODES AND CODE DESCRIPTIONS                                 
*                                                                               
PRGTPTB1 DC    AL2(6)         program number                                    
         DC    CL2'LS',CL35'Local Sports                       '                
         DC    CL2'SA',CL35'Sports Anthology                   '                
         DC    CL2'SC',CL35'Sports Commentary                  '                
         DC    CL2'SE',CL35'Sports Events                      '                
         DC    CL2'SN',CL35'Sports News                        '                
         DC    CL2'**',CL35'All Other Programs                 '                
         DC    AL2(0)                                                           
*                                                                               
* CONTAINS THE A(OF DAY TIME AVG TAB TO PINT TO)                                
APRGTPL   EQU   4     LENGTH OF EACH ADDRESS TABLE ENTRY                        
APRGTPTB DC    AL4(PRGTPTB1)     NSI/TP                                         
         DC    AL4(PRGTPTB1)     NSI/T4                                         
         DC    AL4(PRGTPTB1)     NSI/PAV                                        
         DC    AL4(0)            NSI/WTP                                        
         DC    AL4(0)            NSI/LPM                                        
         DC    AL4(0)            NSI/OTP                                        
         DC    AL4(0)            NSI/OPA                                        
***      DC    AL4(0)            SRC/T4                                         
***      DC    AL4(0)            MFX/T4                                         
***      DC    AL4(0)            MFX/PAV                                        
***      DC    AL4(0)            ARB/TP                                         
         DC    AL4(PRGTPTB1)     ARB/TP                                         
         DC    AL4(0)            ARB/RTP                                        
         DC    AL4(0)            TRI/RTP                                        
         DC    AL4(0)            NHT/TP                                         
         DC    AL4(0)            NHT/PAV                                        
         DC    AL4(0)            BBM/TP                                         
         DC    AL4(0)            BBM/WTP                                        
         DC    AL4(0)            CSI/TP                                         
         DC    AL4(0)            CSI/WTP                                        
         DC    AL4(0)            RAR/RTP                                        
         DC    AL4(0)            NSI/CTP                                        
         DC    AL4(0)            FUS/TP                                         
         DC    AL4(0)            FUS/T4                                         
         DC    AL4(0)            VID/TP                                         
         DC    AL4(0)            IHT/RTP                                        
         DC    AL4(0)            comScore/TP                                    
         DC    AL4(0)            comScore/OTP                                   
         EJECT                                                                  
* THIS TABLE INDICATES THE DIFFERENT START/END/INCREMENT TIMES FOR              
*  THE DIFFERENT SOURCE/FILE COMBINATIONS                                       
                                                                                
SETIMES  DS    0XL(2+2+1)                                                       
         DC     AL2(0300,0300+2400),AL1(30)     NSI TP                          
         DC     AL2(0500,0500+2400),AL1(30)     NSI T4                          
         DC     AL2(0600,0200+2400),AL1(30)     NSI PAV                         
         DC     AL2(0500,0500+2400),AL1(30)     NSI WTP                         
         DC     AL2(0500,0500+2400),AL1(30)     NSI LPM                         
         DC     AL2(0300,0300+2400),AL1(30)     NSI OTP                         
         DC     AL2(0600,0200+2400),AL1(30)     NSI OPA                         
***      DC     AL2(0600,0200+2400),AL1(30)     SRC T4                          
***      DC     AL2(0600,0200+2400),AL1(30)     MFX T4                          
***      DC     AL2(0600,0200+2400),AL1(30)     MFX PAV                         
***      DC     AL2(0600,0200+2400),AL1(30)     ARB TP                          
         DC     AL2(0500,0500+2400),AL1(30)     ARB TP                          
         DC     AL2(0500,0500+2400),AL1(30)     ARB RTP                         
         DC     AL2(0500,0500+2400),AL1(30)     TRI RTP                         
         DC     AL2(0600,0200+2400),AL1(30)     NHT TP                          
         DC     AL2(0600,0200+2400),AL1(30)     NHT PAV                         
         DC     AL2(0600,0200+2400),AL1(30)     BBM TP                          
         DC     AL2(0600,0200+2400),AL1(30)     BBM WTP                         
         DC     AL2(0600,0200+2400),AL1(30)     CSI TP                          
         DC     AL2(0600,0200+2400),AL1(30)     CSI WTP                         
         DC     AL2(0600,0200+2400),AL1(30)     RAR RTP                         
         DC     AL2(0500,0500+2400),AL1(30)     NSI CTP                         
         DC     AL2(0500,0500+2400),AL1(30)     FUS TP                          
         DC     AL2(0500,0500+2400),AL1(30)     FUS T4                          
         DC     AL2(0500,0500+2400),AL1(30)     VID TP                          
         DC     AL2(0500,0500+2400),AL1(30)     IHT RTP                         
         DC     AL2(0300,0300+2400),AL1(30)     comScore TP                     
         DC     AL2(0300,0300+2400),AL1(30)     comScore OTP                    
         EJECT                                                                  
************************************************************                    
*ACTION                                                                         
* DISPLAY                                                                       
*                                                                               
TENTRYL   EQU   26            TOT LGTH OF EACH OF THE FOLLOWING ENTRIES         
ENTRYL    EQU   TENTRYL-2      LENGTH OF THE OPTIONS ENTRY                      
ENTDISP   EQU   TENTRYL-ENTRYL  DISPL TO ENTRY OPTIONS                          
*                                                                               
M1ACTDIS DC    AL2(5),AL1(E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E+        
               ,E)                                                              
* PERIOD                                                                        
         DC    AL2(6),AL1(E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,D,E,E,E,E,E+        
               ,E)                                                              
* AVAIL                                                                         
         DC    AL2(7),AL1(E,E,E,E,E,E,E,D,E,E,E,E,E,E,E,E,E,D,E,E,E,E,E+        
               ,E)                                                              
* BOOK                                                                          
         DC    AL2(8),AL1(E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E+        
               ,E)                                                              
* STATION                                                                       
         DC    AL2(9),AL1(E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E+        
               ,E)                                                              
* SPILL                                                                         
         DC    AL2(10),AL1(E,E,E,E,E,E,E,E,E,E,D,D,E,E,E,E,E,E,E,E,E,E,+        
               E,E)                                                             
* MARKET                                                                        
         DC    AL2(11),AL1(E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,+        
               E,E)                                                             
*                                                                               
* PROGNAME                                                                      
         DC    AL2(12),AL1(E,E,E,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,D,D,E,D,+        
               E,E)                                                             
* PROGMKT                                                                       
         DC    AL2(13),AL1(E,E,E,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,D,D,E,D,+        
               E,E)                                                             
*                                                                               
* AFFID                                                                         
         DC    AL2(14),AL1(E,E,D,U,U,D,D,E,U,U,D,D,U,U,U,U,U,D,D,D,E,U,+        
               E,E)                                                             
* DEMO                                                                          
         DC    AL2(15),AL1(D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*                                                                               
*OPTIONS - DATA DISPLAY                                                         
* SHOW SUMMARY                                                                  
         DC    AL2(16),AL1(E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,D,E,E,E,E,+        
               E,E)                                                             
* SHOW DETAIL QH                                                                
         DC    AL2(17),AL1(E,E,D,E,E,E,D,E,D,D,D,D,E,E,E,E,E,E,E,E,E,D,+        
               E,E)                                                             
* SHOW DETAIL HH                                                                
         DC    AL2(18),AL1(E,E,D,E,E,E,D,E,D,D,E,D,E,E,E,E,E,D,E,E,E,D,+        
               E,E)                                                             
* SHOW DETAIL HR                                                                
         DC    AL2(19),AL1(E,E,D,E,E,E,D,E,E,E,E,D,E,E,E,E,E,D,E,E,E,E,+        
               E,E)                                                             
* SHOW MOST RUN PROGRAMS                                                        
         DC    AL2(20),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
* SHOW ALL PROGRAMS THAT RAN - 1 WK ONLY                                        
         DC    AL2(21),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     1 WK OR MORE                                                              
         DC    AL2(22),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     2 WKS ONLY                                                                
         DC    AL2(23),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     2 WKS OR MORE                                                             
         DC    AL2(24),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     3 WKS ONLY                                                                
         DC    AL2(25),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     3 WKS OR MORE                                                             
         DC    AL2(26),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     4 WKS ONLY                                                                
         DC    AL2(27),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     4 WKS OR MORE                                                             
         DC    AL2(28),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     5 WKS ONLY                                                                
         DC    AL2(29),AL1(D,D,D,D,D,D,D,D,D,D,E,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
*     5 WKS OR MORE                                                             
         DC    AL2(30),AL1(D,D,D,D,D,D,D,D,D,D,E,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
* SHOW ALL PROGRAMS THAT RAN ....                                               
         DC    AL2(31),AL1(D,D,E,D,D,D,D,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
* INCLUDE NORMAL PROGRAMMING                                                    
         DC    AL2(32),AL1(D,D,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
* SHOW PROGRAM NAME (DEFAULT ON)                                                
         DC    AL2(33),AL1(ED,ED,ON,ED,ED,ED,ON,ED,NA,NA,ED,ON,ED,ED,ED+        
               ,ED,NA,ED,ED,ED,ED,NA,ED,ED)                                     
* SHOW DECIMAL VALUE                                                            
         DC    AL2(34),AL1(ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED+        
               ,ED,ED,ED,ED,ED,ED,ED,ED,ED)                                     
* SHOW WHOLE NUMBERS                                                            
         DC    AL2(35),AL1(ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED,ED+        
               ,ED,ED,ED,ED,ED,ED,ED,ED,ED)                                     
*OPTIONS - PROGRAM FILTER                                                       
* INCLUDE ALL PROGRAMS                                                          
         DC    AL2(36),AL1(E,E,E,D,D,E,E,E,E,E,D,E,E,E,E,E,E,D,E,E,E,E,+        
               E,E)                                                             
* INCLUDE <PROGRAM TYPE>                                                        
         DC    AL2(37),AL1(E,E,D,D,D,E,E,E,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               E,E)                                                             
*                                                                               
*OPTIONS - MISC                                                                 
* METHODOLOGY                                                                   
         DC    AL2(38),AL1(R,R,R,D,D,R,R,R,D,D,D,D,D,D,D,D,D,D,R,R,R,D,+        
               R,R)                                                             
* SVI                                                                           
         DC    AL2(39),AL1(E,E,D,D,D,E,D,E,D,D,D,D,D,D,D,D,D,D,D,D,E,D,+        
               E,E)                                                             
*                                                                               
*REQUEST FORM                                                                   
* STATION BUTTON CAPTION (DEFAULT="STATIONS...")                                
*  S=STATION N=NETWORK                                                          
         DC    AL2(40),AL1(S,S,S,S,S,S,S,S,S,S,N,N,S,S,S,S,S,S,S,S,S,D,+        
               S,S)                                                             
* SEARCH BY NETWORK AND SYNDICATED                                              
****     DC    AL2(41),AL1(E,D,E,D,D,E,E,E,E,NA,NA,NA,NA,NA,NA,D)               
         DC    AL2(41),AL1(E,D,E,D,D,D,D,D,NA,NA,NA,NA,NA,NA,NA,NA,NA,D+        
               ,D,D,E,NA,E,D)                                                   
*                                                                               
*STATIONS SELECTION                                                             
* AVAILABLE MARKETS TAB - "INCLUDE SPILL STATIONS"                              
         DC    AL2(42),AL1(E,E,E,E,E,E,E,E,E,E,D,D,E,E,E,E,E,E,E,E,E,E,+        
               D,D)                                                             
* AVAILABLE MARKETS TAB - "INCLUDE PUBLIC STATIONS"                             
         DC    AL2(43),AL1(E,E,E,E,E,E,E,E,E,E,D,D,D,D,D,D,E,D,E,E,E,E,+        
               D,D)                                                             
* SPILL STATIONS TAB                                                            
         DC    AL2(44),AL1(E,E,E,E,E,E,E,E,E,E,D,D,E,E,E,E,E,E,E,E,E,E,+        
               E,E)                                                             
*                                                                               
*BOOKS SELECTION                                                                
* "BOOKS" TAB - "MAJORITY PROGRAMMING"/"BREAKOUT BY                             
* WEEKS"/"SPECIFIED WEEK..."                                                    
         DC    AL2(45),AL1(E,D,E,D,D,D,D,E,D,D,D,D,E,E,D,D,D,D,E,E,E,D,+        
               E,D)                                                             
* "BOOKS" TAB - "ADD MULTIBOOK AVG" BUTTON                                      
         DC    AL2(46),AL1(E,E,D,D,D,D,D,E,D,D,E,D,E,D,E,D,D,D,E,E,E,D,+        
               E,D)                                                             
*BOOKS TAB - LATEST/LAT2AVG/LAT3AVG/LAT4AVG                                     
         DC    AL2(47),AL1(E,E,E,D,D,D,D,E,E,E,D,D,E,E,E,E,E,D,E,E,E,E,+        
               E,D)                                                             
* "BOOKS" TAB - SPECIFY AVAILABLE BOOK TYPES, (H,B,O) (MBK WKS W/ALL            
* NSI SPECIAL BKS)                                                              
         DC    AL2(48),AL1(E,E,E,D,D,E,E,E,D,D,E,E,D,D,D,D,D,E,E,E,E,D,+        
               E,E)                                                             
*                                                                               
*    PROJECTIONS TAB                                                            
* PROJECTION 1 - SHARE/PUT                                                      
         DC    AL2(49),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               E,D)                                                             
* PROJECTION 2 - 2 YEAR AVG PUT                                                 
         DC    AL2(50),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 3 - SHARE                                                          
         DC    AL2(51),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 4 - 2 YEAR AVG SHARE                                               
         DC    AL2(52),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 5 - ALTERNATE DAY/TIME SHARE                                       
         DC    AL2(53),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 6 - SELECTED SHARE                                                 
         DC    AL2(54),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 7 - SUPPLIED PUT AND SHARE                                         
         DC    AL2(55),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 8 - HUT                                                            
         DC    AL2(56),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 9 - HPT                                                            
         DC    AL2(57),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 10 - INDEX                                                         
         DC    AL2(58),AL1(E,E,E,D,D,D,D,D,D,D,D,D,E,D,E,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 11 - RATING                                                        
         DC    AL2(59),AL1(E,E,E,D,D,D,D,D,D,D,D,D,U,U,U,U,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 12 - DEMO                                                          
         DC    AL2(60),AL1(E,E,E,D,D,D,D,D,D,D,D,D,U,U,U,U,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 13 -PUT AVG YEAR  (PAVG)                                           
         DC    AL2(61),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               E,D)                                                             
* PROJECTION 14 - SHARE AVG YEAR  (SAVG)                                        
         DC    AL2(62),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 15 - PUT INDEX                                                     
         DC    AL2(63),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 16 - SHARE INDEX                                                   
         DC    AL2(64),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 17 - PUT INDEX MULTIPLIED                                          
         DC    AL2(65),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 18- PUT SHARE                                                      
         DC    AL2(FMDOPT90),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,+        
               E,E,D,D,D)                                                       
*                                                                               
* DAY/TIME SELECTION PERSONAL ROTATIONSTAB                                      
         DC    AL2(66),AL1(E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,D,E,E,E,E,+        
               E,E)                                                             
*                                                                               
* DEMOS SELECTION WEEKLY HOUSEHOLD CHECKBOX                                     
         DC    AL2(67),AL1(E,E,E,D,D,D,E,D,D,D,D,D,D,D,D,D,D,D,D,D,E,D,+        
               E,D)                                                             
*                                                                               
* REPORT FORMATS,BOOK COMPARISON                                                
         DC    AL2(68),AL1(E,E,D,E,E,E,D,E,E,E,E,D,E,E,E,E,E,E,E,E,E,E,+        
               E,E)                                                             
* STATION COMPARISON                                                            
         DC    AL2(69),AL1(E,E,D,E,E,E,D,E,E,E,E,D,E,E,E,E,E,E,E,E,E,E,+        
               E,E)                                                             
* DEMO COMPARISON                                                               
         DC    AL2(70),AL1(E,E,D,E,E,E,D,E,E,E,E,D,E,E,E,E,E,E,E,E,E,E,+        
               E,E)                                                             
* BOOK RANKERS                                                                  
         DC    AL2(71),AL1(E,E,D,E,E,E,D,E,E,E,E,D,E,E,E,E,E,E,E,E,E,E,+        
               E,E)                                                             
*                                                                               
* PROGRAM AVERAGE FORMATS                                                       
         DC    AL2(72),AL1(D,D,E,D,D,D,E,D,D,D,D,E,D,D,D,D,D,D,D,D,D,D,+        
               D,D)                                                             
* PROGRAMS BY MARKET (NET AND SYN PROG FORMAT)                                  
         DC    AL2(73),AL1(E,E,E,D,D,E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,E,D,+        
               E,E)                                                             
* WEEKLY HOUSEHOLD RATINGS FORMATS FORMATS                                      
         DC    AL2(74),AL1(E,E,E,D,D,E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,E,D,+        
               E,E)                                                             
* LILO FORMAT                                                                   
         DC    AL2(75),AL1(E,E,D,E,E,E,D,E,D,D,D,D,E,E,E,E,D,D,E,E,E,D,+        
               E,E)                                                             
* BOOKS AVERAGE WEEKLY                                                          
         DC    AL2(80),AL1(D,D,D,E,E,D,D,D,D,D,D,D,D,E,D,E,D,D,D,D,D,D,+        
               D,D)                                                             
* INCLUDE CABLE                                                                 
         DC    AL2(88),AL1(E,E,D,D,D,E,D,E,D,D,D,D,D,D,D,D,D,D,E,E,E,E,+        
               E,E)                                                             
* ALLOW WHOLE NUMBERS / 0 DECIMAL                                               
         DC    AL2(99),AL1(E,E,E,D,D,E,E,D,D,D,D,D,D,D,D,D,D,D,E,E,E,E,+        
               E,E)                                                             
* ALLOW 1 DECIMAL                                                               
         DC    AL2(100),AL1(E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E,E+        
               ,E,E)                                                            
* ALLOW 2 DECIMAL                                                               
         DC    AL2(101),AL1(E,E,E,E,E,E,E,D,D,D,D,D,E,E,D,D,D,D,E,E,E,D+        
               ,E,E)                                                            
* ADD MULTIWEEKS BUTTON                                                         
         DC    AL2(102),AL1(D,D,D,E,E,D,D,D,D,D,D,D,D,E,D,E,D,D,D,D,E,D+        
               ,D,D)                                                            
*&&DO                                                                           
* VIEWERS-PER-HOUSEHOLD                                                         
         DC    AL2(FMDOPT92)                                                    
         DC     AL1(D,D,D,E,D,D,D,D,D)                                          
*&&                                                                             
* MMU upgrade                                                                   
         DC    AL2(96),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D,+        
               D,D)                                                             
* PROJECTION 103 -PUT AVG YEAR  (PAY)       S                                   
         DC    AL2(103),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D+        
               ,D,D)                                                            
* PROJECTION 104 - SHARE AVG YEAR  (SAY)                                        
         DC    AL2(104),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D+        
               ,D,D)                                                            
* PROJECTION 105 -PUT AVG BOOK  (PAB)                                           
         DC    AL2(105),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D+        
               ,E,D)                                                            
* PROJECTION 106 - SHARE AVG BOOK  (SAB)                                        
         DC    AL2(106),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D+        
               ,D,D)                                                            
* PROJECTION 107 -PUT AVG QTR  (PAQ)                                            
         DC    AL2(107),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D+        
               ,D,D)                                                            
* PROJECTION 108 - SHARE AVG QTR (SAQ)                                          
         DC    AL2(108),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D+        
               ,D,D)                                                            
* PROJECTION 109 - IN STATION SHARE                                             
         DC    AL2(109),AL1(E,E,D,D,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,D+        
               ,D,D)                                                            
* LPM UPGRADE                                                                   
         DC    AL2(110),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D+        
               ,D,D)                                                            
* OTHER BLANK LINE TO ENTER                                                     
         DC    AL2(111),AL1(E,E,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,E,E,D+        
               ,D,D)                                                            
* ALLOW MARKET NAME ON REPORT                                                   
         DC    AL2(112),AL1(E,E,D,D,D,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,D+        
               ,E,D)                                                            
* ALLOW AFFILIATION ON REPORT                                                   
         DC    AL2(113),AL1(E,E,D,D,D,E,D,D,D,D,D,D,D,D,D,D,D,D,D,D,E,D+        
               ,E,E)                                                            
NOMORE   DC    AL2(00)                                                          
                                                                                
* !! THIS IS NOT UP TO DATE                                                     
*                                                                               
* COLUMN : 1   2   3   4   5   6   7   8   9   10  11  12  13                   
*         --- --- --- --- --- --- --- --- --- --- --- --- ---                   
* SOURCE : N   N   N   N   S   M   M   A   A   N   N   B   N                    
* FILE   : T   4   P   T   4   4   P   T   T   T   P   T   T                    
* (MEDIA): T   T   T   W   T   T   T   T   R   H   H   C   C                    
                                                                                
*                                                                               
*                                                                               
*                                                                               
R        EQU   C'R'                RATINGS                                      
I        EQU   C' '                IMPRESSIONS (BLANK AS MODIFIER CODE)         
E        EQU   C'E'                ENABLED                                      
D        EQU   C'D'                DISABLED                                     
S        EQU   C'S'                STATION CAPTION                              
N        EQU   C'N'                NETWORK CAPTION                              
U        EQU   C'U'                ? ALIAS                                      
DD       EQU   X'20'               "DISABLED DEFAULT" ALIAS                     
ED       EQU   X'21'               "ENABLED DEFAULT" ALIAS                      
ON       EQU   X'22'               "ON ONLY" ALIAS                              
NA       EQU   X'23'               N/A ALIAS                                    
