*          DATA SET DENADCATS  AT LEVEL 036 AS OF 03/13/19                      
* TABLE OF PREFIXES USED TO DEFINE NAD CATAGORIES                               
* CATAGORY NAME FOLLOWED BY CATAGORY NUMBER                                     
* THESE BREAKS MUST BE LESS THAN C'A' (191) OR THE RESEARCH WRITER              
* WILL NOT BE ABLE TO STACK THEM.                                               
*                                                                               
PFXTAB   DS    0CL8                                                             
         DC    AL1(01),C'USA    '                                               
         DC    AL1(05),C'SPANISH'  ONLY NHTI 92/10                              
         DC    AL1(06),C'ENGLISH'  ONLY NHTI 92/10                              
         DC    AL1(07),C'BILING '  ONLY NHTI 92/10                              
         DC    AL1(11),C'N/EAST '                                               
         DC    AL1(12),C'E/CENT '                                               
         DC    AL1(13),C'W/CENT '                                               
         DC    AL1(14),C'SOUTH  '                                               
         DC    AL1(15),C'PACIFIC'                                               
         DC    AL1(16),C'S/EAST '                                               
         DC    AL1(17),C'S/WEST '                                               
         DC    AL1(21),C'CS/A   '                                               
         DC    AL1(22),C'CS/B   '                                               
         DC    AL1(23),C'CS/C+D '                                               
         DC    AL1(29),C'PAYWCBL'      EFF JAN/05                               
         DC    AL1(30),C'BASWCBL'      EFF JAN/05                               
         DC    AL1(31),C'ANY/CBL'                                               
         DC    AL1(32),C'PAY/CBL'                                               
         DC    AL1(33),C'BAS/CBL'                                               
         DC    AL1(34),C'NO/CBL '                                               
         DC    AL1(35),C'PAYCBL+'      EFF SEP/96                               
         DC    AL1(36),C'BASCBL+'      EFF SEP/96                               
         DC    AL1(37),C'BRDCST '      EFF SEP/96                               
         DC    AL1(38),C'ANYCBL+'      EFF SEP/96                               
         DC    AL1(39),C'DBS    '      EFF SEP/03                               
         DC    AL1(40),C'DVR HH '      EFF MAY/07                               
         DC    AL1(41),C'HHS/1  '                                               
         DC    AL1(42),C'HHS/2  '                                               
         DC    AL1(43),C'HHS/3+ '                                               
         DC    AL1(44),C'HHS/4+ '                                               
         DC    AL1(45),C'HHS/3  '                                               
         DC    AL1(51),C'ANY18- '                                               
         DC    AL1(52),C'ANY12- '                                               
         DC    AL1(53),C'ANY6-  '                                               
         DC    AL1(54),C'ANY3-  '                                               
         DC    AL1(55),C'ANY6-11'                                               
         DC    AL1(56),C'ANY1217'                                               
         DC    AL1(60),C'$125K+ '  EFF JAN/05                                   
         DC    AL1(61),C'$15M-  '                                               
         DC    AL1(62),C'$20M+  '                                               
         DC    AL1(63),C'$30K+  '                                               
         DC    AL1(64),C'$40K+  '                                               
         DC    AL1(65),C'$50K+  '  EFF SEP/89                                   
         DC    AL1(66),C'$60K+  '  EFF SEP/89                                   
         DC    AL1(67),C'$30M-  '  EFF SEP/89                                   
         DC    AL1(68),C'$20K-  '  EFF SEP/89                                   
         DC    AL1(71),C'$30+/NA'                                               
         DC    AL1(72),C'$30+POM'                                               
         DC    AL1(73),C'$30+COL'                                               
         DC    AL1(74),C'$40+/NA'  EFF SEP/89                                   
         DC    AL1(75),C'$40+POM'  EFF SEP/89                                   
         DC    AL1(76),C'$40+COL'  EFF SEP/89                                   
         DC    AL1(77),C'$40DUAL'  EFF SEP/90                                   
         DC    AL1(78),C'$50DUAL'      EFF SEP/96                               
         DC    AL1(80),C'$20-30 '  EFF SEP/90                                   
         DC    AL1(81),C'$30-40 '  EFF SEP/90                                   
         DC    AL1(82),C'$40-50 '  EFF SEP/90                                   
         DC    AL1(83),C'$50-60 '  EFF SEP/90                                   
         DC    AL1(84),C'$60-75 '      EFF SEP/96                               
         DC    AL1(85),C'$75K+  '      EFF SEP/96                               
         DC    AL1(86),C'$50+/NA'      EFF SEP/96                               
         DC    AL1(87),C'$50+POM'      EFF SEP/96                               
         DC    AL1(88),C'$50+COL'      EFF SEP/96                               
         DC    AL1(89),C'OR/HISP'      EFF SEP/06                               
         DC    AL1(90),C'OR/NHSP'      EFF SEP/06                               
*                                                                               
         DC    AL1(91),C'$TZ/E  '  EFF SEP/90                                   
         DC    AL1(92),C'$TZ/C  '  EFF SEP/90                                   
         DC    AL1(93),C'$TZ/M+P'  EFF SEP/90                                   
         DC    AL1(94),C'$75-99 '  EFF SEP/03                                   
         DC    AL1(95),C'$100K+ '  EFF SEP/03                                   
         DC    AL1(96),C'$75+/NA'  EFF SEP/03                                   
         DC    AL1(97),C'$75+POM'  EFF SEP/03                                   
         DC    AL1(98),C'$75+COL'  EFF SEP/03                                   
         DC    AL1(99),C'$75DUAL'  EFF SEP/03                                   
         DC    AL1(100),C'W/DVD  '  EFF SEP/03                                  
         DC    AL1(101),C'W/VCR  '  EFF SEP/90                                  
         DC    AL1(102),C'W/REMOT'  EFF SEP/90                                  
         DC    AL1(103),C'1TV    '  EFF SEP/90                                  
         DC    AL1(104),C'2TV    '  EFF SEP/90                                  
         DC    AL1(105),C'3TV    '  EFF SEP/90                                  
         DC    AL1(106),C'4+TV   '  EFF SEP/90                                  
         DC    AL1(107),C'VGO    '  EFF JAN/05                                  
         DC    AL1(108),C'OR/HISS'  EFF JAN/07                                  
         DC    AL1(109),C'OR/HISB'  EFF JAN/07                                  
         DC    AL1(110),C'OR/HISE'  EFF JAN/07                                  
         DC    AL1(111),C'HOH25- '  EFF SEP/90                                  
         DC    AL1(112),C'HOH2534'  EFF SEP/90                                  
         DC    AL1(113),C'HOH3554'  EFF SEP/90                                  
         DC    AL1(114),C'HOH5564'  EFF SEP/90                                  
         DC    AL1(115),C'HOH65+ '  EFF SEP/90                                  
         DC    AL1(118),C'HHU50S2'  EFF SEP/90                                  
         DC    AL1(119),C'HHO50S2'  EFF SEP/90                                  
         DC    AL1(121),C'ED8-   '  EFF SEP/90                                  
         DC    AL1(122),C'ED12-  '  EFF SEP/90                                  
         DC    AL1(123),C'ED12   '  EFF SEP/90                                  
         DC    AL1(124),C'ED16-  '  EFF SEP/90                                  
         DC    AL1(125),C'ED16+  '  EFF SEP/90                                  
         DC    AL1(131),C'OCC/WC '  EFF SEP/90                                  
         DC    AL1(132),C'OCC/BC '  EFF SEP/90                                  
         DC    AL1(133),C'OCC/NO '  EFF SEP/90                                  
         DC    AL1(134),C'OHTNE  '  EFF SEP/07                                  
         DC    AL1(135),C'OHTCEN '  EFF SEP/07                                  
         DC    AL1(136),C'OHTSE  '  EFF SEP/07                                  
         DC    AL1(137),C'OHTSW  '  EFF SEP/07                                  
         DC    AL1(138),C'OHTPAC '  EFF SEP/07                                  
         DC    AL1(141),C'RACE/B '  EFF SEP/90                                  
         DC    AL1(142),C'RACE/W '  EFF SEP/90                                  
         DC    AL1(143),C'OHLSE= '  EFF SEP/07                                  
         DC    AL1(144),C'OHLOSP '  EFF SEP/07                                  
         DC    AL1(145),C'OHLMSP '  EFF SEP/07                                  
         DC    AL1(146),C'OHLMENG'  EFF SEP/07                                  
         DC    AL1(147),C'OHLOENG'  EFF SEP/07                                  
         DC    AL1(148),C'RENT/H '  EFF JAN/05                                  
         DC    AL1(149),C'OWN/H  '  EFF JAN/05                                  
         DC    AL1(151),C'CAR    '  EFF SEP/90                                  
         DC    AL1(152),C'CAR1   '  EFF SEP/90                                  
         DC    AL1(153),C'CAR2+  '  EFF SEP/90                                  
         DC    AL1(154),C'CAR/NEW'  EFF SEP/90                                  
         DC    AL1(156),C'TRK    '  EFF SEP/90                                  
         DC    AL1(157),C'TRK1   '  EFF SEP/90                                  
         DC    AL1(158),C'TRK2+  '  EFF SEP/90                                  
         DC    AL1(159),C'TRK/NEW'  EFF SEP/90                                  
         DC    AL1(161),C'DOG    '  EFF SEP/90                                  
         DC    AL1(162),C'CAT    '  EFF SEP/90                                  
         DC    AL1(163),C'PC     '  EFF SEP/99                                  
         DC    AL1(164),C'NO PC  '  EFF SEP/99                                  
         DC    AL1(165),C'PCNET  '  EFF SEP/99                                  
         DC    AL1(166),C'PCNONET'  EFF SEP/99                                  
         DC    AL1(167),C'PMG    '  EFF FEB/01                                  
         DC    AL1(168),C'FMG    '  EFF FEB/01                                  
         DC    AL1(169),C'AMG    '  EFF FEB/01                                  
         DC    AL1(170),C'CORE   '  CORE DEMO FOR EVN FILE: NAD170              
         DC    AL1(171),C'FT     '  CORE DEMO FOR TVQ FILE: NAD170              
         DC    AL1(172),C'OPI    '  OPTIMUM PROGRAM INDEX (OPI)                 
         DC    AL1(173),C'OHCMEX '  EFF SEP/07                                  
         DC    AL1(174),C'OHCNMEX'  EFF SEP/07                                  
         DC    AL1(175),C'IAG ORG'  IAG ORIGINAL                                
         DC    AL1(176),C'IAG RPT'  IAG REPEAT                                  
         DC    AL1(177),C'IAG    '  IAG AUTOMATIC ORIGINAL/REPEAT               
         DC    AL1(181),C'AA     '  AVG AUD                     (WB1)           
         DC    AL1(182),C'GAA    '  GROSS AVG AUDIENCE          (WB1)           
         DC    AL1(183),C'MBA    '  MULTI BARTER ACTIVITY       (WB1)           
         DC    AL1(184),C'TCA    '  TOTAL COMMERCIAL AUDIENCE   (WB1)           
         DC    AL1(185),C'TPA    '  TOTAL PROG ANNOUNCEMENTS (WB1/TCR)          
         DC    AL1(186),C'AA+S   '  AVG AUD+SPOTS/SPINS         (TCR)           
         DC    AL1(187),C'GAA+S  '  GROSS AVG AUD+SPOTS/SPINS   (TCR)           
         DC    AL1(188),C'GSA    '  GROSS SPOT AUD              (TCR)           
         DC    AL1(189),C'GSA+S  '  GROSS SPOT AUD+SPOTS/SPINS  (TCR)           
*                                                                               
         DC    AL1(240),C'UI1    '  USER INDEXES. NOT REAL NAD CATEGS           
         DC    AL1(241),C'UI2    '                                              
         DC    AL1(242),C'UI3    '                                              
         DC    AL1(243),C'UI4    '                                              
*                                                                               
PREFIXES EQU   (*-PFXTAB)/L'PFXTAB                                              
