*          DATA SET DENADUNIV  AT LEVEL 097 AS OF 12/06/08                      
*                                                                               
* UNIVERSE ESTIMATES FOR NAD FILE                                               
* SECTION/START BOOK/UNIVERSE ESTIMATES                                         
* SEE DEMDISP FOR ACTUAL DEMOS WHICH ARE IN THIS TABLE                          
*                                                                               
         DS    0H                                                               
NADUTAB  DS    0C                                                               
* COMPOSITE                                                                     
         DC    AL1(01),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(9540,4407,9783,2248,3218,6196,5679,4760,2898)                
         DC    AL2(8924,3171,6020,5469,4476,2259,2126,3818,2220)                
         DC    AL2(0482,0477)                                                   
*                                                                               
         DC    AL1(01),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(9420,4226,9676,2252,3269,6163,5597,4648,2849)                
         DC    AL2(8827,3213,5983,5382,4367,2223,2087,3767,2196)                
         DC    AL2(0483,0481)                                                   
*                                                                               
         DC    AL1(01),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(9310,4165,9564,2232,3287,6087,5489,4515,2844)                
         DC    AL2(8749,3249,5945,5305,4254,2213,2044,3687,2161)                
         DC    AL2(0479,0484)                                                   
*                                                                               
         DC    AL1(01),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(9210,4106,9483,2228,3333,6041,5413,4408,2827)                
         DC    AL2(8644,3289,5899,5231,4146,2171,2010,3631,2145)                
         DC    AL2(0501,0506)                                                   
*                                                                               
         DC    AL1(01),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(9310,4255,9557,2204,3345,6034,5410,4414,2914)                
         DC    AL2(8620,3323,5899,5240,4112,2163,1975,3558,2126)                
         DC    AL2(0503,0494)                                                   
*                                                                               
         DC    AL1(01),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(9210,4167,9460,2225,3389,5999,5326,4322,2870)                
         DC    AL2(8557,3368,5870,5167,4033,2137,1957,3549,2102)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(01),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(9040,4023,9341,2250,3397,5918,5222,4228,2847)                
         DC    AL2(8447,3368,5783,5054,3939,2129,1990,3502,2065)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(01),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(8860,3882,9190,2272,3397,5815,5089,4118,2807)                
         DC    AL2(8298,3356,5667,4908,3824,2105,1988,3436,2019)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(01),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(8740,3724,9083,2314,3397,5738,4975,4048,2789)                
         DC    AL2(8198,3346,5580,4790,3755,2100,2025,3401,1982)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(01),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(8590,3643,8956,2357,3396,5650,4870,3958,2745)                
*        DC    AL2(8080,3334,5485,4676,3666,2076,2068,3340,1977)                
*                                                                               
*        DC    AL1(01),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(8490,3480,8857,2413,3403,5578,4754,3891,2724)                
*        DC    AL2(7986,3334,5405,4555,3595,2067,2107,3287,1903)                
*                                                                               
*        DC    AL1(01),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(8380,3309,8748,2460,3399,5497,4649,3820,2690)                
*        DC    AL2(7887,3322,5318,4449,3526,2049,2137,3255,1904)                
*                                                                               
* NORTHEAST                                                                     
         DC    AL1(11),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2050,1005,2184,0472,0708,1371,1259,1065,0659)                
         DC    AL2(1951,0688,1310,1192,0985,0498,0420,0749,0429)                
         DC    AL2(0104,0102)                                                   
*                                                                               
         DC    AL1(11),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2037,0971,2172,0476,0723,1372,1248,1046,0651)                
         DC    AL2(1940,0701,1309,1180,0967,0493,0415,0745,0427)                
         DC    AL2(0104,0105)                                                   
*                                                                               
         DC    AL1(11),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2039,0950,2172,0478,0736,1371,1239,1028,0657)                
         DC    AL2(1947,0719,1318,1178,0953,0496,0411,0739,0426)                
         DC    AL2(0104,0105)                                                   
*                                                                               
         DC    AL1(11),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2032,0957,2167,0480,0751,1369,1230,1011,0658)                
         DC    AL2(1936,0732,1316,1169,0936,0491,0407,0732,0427)                
         DC    AL2(0110,0111)                                                   
*                                                                               
         DC    AL1(11),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2055,0988,2173,0479,0724,1318,1201,1026,0690)                
         DC    AL2(1898,0699,1274,1151,0937,0492,0439,0720,0441)                
         DC    AL2(0109,0106)                                                   
*                                                                               
         DC    AL1(11),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2043,0983,2158,0486,0736,1333,1205,1009,0683)                
         DC    AL2(1889,0710,1270,1137,0921,0489,0436,0720,0437)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(11),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2006,0937,2133,0491,0738,1316,1182,0988,0679)                
         DC    AL2(1866,0711,1251,1112,0901,0488,0444,0711,0430)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(11),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1985,0906,2119,0501,0746,1306,1164,0973,0675)                
         DC    AL2(1853,0716,1240,1092,0885,0487,0448,0704,0242)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(11),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1964,0875,2103,0513,0749,1295,1143,0961,0673)                
         DC    AL2(1839,0717,1225,1071,0874,0489,0459,0700,0419)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(11),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1939,0872,2080,0523,0750,1277,1122,0944,0666)                
*        DC    AL2(1819,0717,1209,1050,0857,0485,0470,0690,0419)                
*                                                                               
*        DC    AL1(11),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1911,0826,2061,0537,0754,1264,1099,0930,0661)                
*        DC    AL2(1801,0718,1192,1025,0843,0484,0479,0681,0405)                
*                                                                               
*        DC    AL1(11),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1889,0785,2032,0546,0752,1243,1073,0912,0652)                
*        DC    AL2(1776,0714,1171,1000,0826,0479,0486,0674,0405)                
*                                                                               
* EAST CENTRAL                                                                  
         DC    AL1(12),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1304,0568,1321,0307,0422,0819,0751,0646,0407)                
         DC    AL2(1186,0407,0784,0714,0605,0314,0295,0506,0299)                
         DC    AL2(0068,0067)                                                   
*                                                                               
         DC    AL1(12),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1289,0549,1311,0309,0431,0817,0743,0633,0401)                
         DC    AL2(1177,0414,0781,0705,0592,0310,0291,0501,0297)                
         DC    AL2(0068,0067)                                                   
*                                                                               
         DC    AL1(12),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1272,0534,1298,0306,0433,0807,0728,0616,0403)                
         DC    AL2(1165,0416,0774,0693,0576,0309,0286,0491,0293)                
         DC    AL2(0068,0067)                                                   
*                                                                               
         DC    AL1(12),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1263,0526,1292,0308,0441,0805,0721,0604,0402)                
         DC    AL2(1155,0424,0772,0686,0564,0304,0282,0486,0293)                
         DC    AL2(0071,0071)                                                   
*                                                                               
         DC    AL1(12),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1281,0546,1301,0392,0456,0819,0733,0606,0396)                
         DC    AL2(1172,0453,0798,0708,0563,0294,0279,0503,0302)                
         DC    AL2(0071,0070)                                                   
*                                                                               
         DC    AL1(12),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1276,0537,1297,0314,0485,0820,0726,0597,0393)                
         DC    AL2(1171,0481,0799,0702,0556,0294,0278,0504,0301)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(12),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1258,0523,1289,0319,0469,0813,0716,0588,0393)                
         DC    AL2(1163,0464,0792,0690,0546,0294,0284,0500,0297)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(12),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1249,0515,1289,0328,0477,0814,0710,0582,0393)                
         DC    AL2(1163,0471,0790,0683,0539,0296,0288,0500,0296)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(12),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1244,0501,1289,0338,0483,0812,0702,0579,0395)                
         DC    AL2(1163,0475,0787,0674,0536,0299,0297,0500,0293)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(12),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1236,0483,1282,0347,0487,0807,0693,0571,0392)                
*        DC    AL2(1157,0478,0781,0664,0528,0298,0306,0495,0295)                
*                                                                               
*        DC    AL1(12),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1228,0459,1276,0356,0490,0801,0681,0566,0392)                
*        DC    AL2(1150,0480,0774,0650,0521,0299,0314,0490,0286)                
*                                                                               
*        DC    AL1(12),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1222,0445,1282,0369,0498,0803,0677,0565,0394)                
*        DC    AL2(1156,0487,0775,0647,0521,0301,0323,0494,0291)                
*                                                                               
* WEST CENTRAL                                                                  
         DC    AL1(13),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1523,0706,1505,0346,0490,0947,0872,0729,0453)                
         DC    AL2(1386,0484,0929,0851,0699,0356,0338,0619,0365)                
         DC    AL2(0073,0072)                                                   
*                                                                               
         DC    AL1(13),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1501,0680,1488,0346,0498,0941,0860,0712,0445)                
         DC    AL2(1371,0491,0923,0837,0682,0351,0332,0611,0361)                
         DC    AL2(0071,0073)                                                   
*                                                                               
         DC    AL1(13),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1477,0656,1469,0341,0498,0926,0840,0689,0446)                
         DC    AL2(1353,0493,0912,0821,0662,0349,0325,0597,0354)                
         DC    AL2(0071,0073)                                                   
*                                                                               
         DC    AL1(13),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1464,0624,1459,0342,0507,0921,0830,0647,0444)                
         DC    AL2(1340,0501,0907,0811,0647,0343,0320,0589,0354)                
         DC    AL2(0075,0077)                                                   
*                                                                               
         DC    AL1(13),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1498,0676,1496,0355,0532,0946,0839,0656,0457)                
         DC    AL2(1374,0540,0943,0831,0644,0342,0316,0573,0338)                
         DC    AL2(0082,0082)                                                   
*                                                                               
         DC    AL1(13),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1489,0662,1490,0360,0542,0946,0830,0665,0453)                
         DC    AL2(1371,0550,0943,0823,0634,0341,0314,0574,0335)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(13),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1471,0650,1482,0367,0547,0940,0820,0656,0453)                
         DC    AL2(1363,0554,0936,0811,0624,0342,0322,0571,0331)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(13),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1462,0624,1481,0376,0556,0939,0813,0649,0453)                
         DC    AL2(1362,0561,0933,0801,0616,0344,0327,0570,0330)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(13),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1451,0597,1473,0384,0559,0932,0800,0642,0453)                
         DC    AL2(1354,0563,0925,0786,0608,0345,0335,0567,0325)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(13),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1435,0583,1456,0393,0561,0921,0784,0628,0447)                
*        DC    AL2(1338,0562,0911,0770,0595,0342,0343,0558,0325)                
*                                                                               
*        DC    AL1(13),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1430,0562,1448,0404,0565,0914,0770,0621,0446)                
*        DC    AL2(1331,0566,0904,0754,0587,0343,0351,0553,0315)                
*                                                                               
*        DC    AL1(13),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1411,0538,1441,0415,0568,0907,0758,0614,0444)                
*        DC    AL2(1324,0568,0896,0741,0579,0343,0359,0551,0317)                
*                                                                               
* SOUTH                                                                         
         DC    AL1(14),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2914,1326,2956,0696,0973,1859,1699,1431,0887)                
         DC    AL2(2662,0943,1782,1615,1326,0688,0665,1165,0682)                
         DC    AL2(0150,0145)                                                   
*                                                                               
         DC    AL1(14),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2855,1282,2905,0692,0980,1836,1662,1388,0869)                
         DC    AL2(2615,0949,1758,1578,1284,0673,0647,1141,0669)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(14),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2793,1279,2859,0664,0956,1799,1605,1312,0883)                
         DC    AL2(2558,0983,1744,1540,1203,0654,0595,1103,0661)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(14),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2751,1246,2228,0671,1009,1789,1581,1284,0856)                
         DC    AL2(2538,0997,1737,1519,1180,0644,0590,1103,0654)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(14),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2697,1204,2789,0678,1011,1763,1548,1254,0857)                
         DC    AL2(2503,0996,1710,1485,1152,0640,0599,1088,0643)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(14),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2647,1168,2752,0687,1016,1740,1515,1225,0845)                
         DC    AL2(2469,0998,1684,1449,1122,0633,0601,1072,0631)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(14),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2600,1119,2708,0697,1012,1710,1474,1198,0836)                
         DC    AL2(2428,0991,1651,1408,1096,0629,0609,1057,0617)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(14),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2537,1103,2664,0709,1010,1680,1440,1168,0820)                
*        DC    AL2(2387,0986,1620,1371,1067,0619,0620,1036,0614)                
*                                                                               
*        DC    AL1(14),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2488,1059,2618,0722,1006,1649,1397,1141,0808)                
*        DC    AL2(2344,0980,1587,1327,1039,0612,0629,1013,0587)                
*                                                                               
*        DC    AL1(14),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(2443,0995,2560,0729,0995,1609,1352,1109,0790)                
*        DC    AL2(2291,0966,1545,1283,1009,0600,0631,0993,0581)                
*                                                                               
* PACIFIC                                                                       
         DC    AL1(15),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1749,0802,1817,0427,0625,1201,1098,0889,0492)                
         DC    AL2(1739,0648,1216,1097,0862,0403,0409,0780,0448)                
         DC    AL2(0088,0091)                                                   
*                                                                               
         DC    AL1(15),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1738,0784,1801,0429,0637,1198,1085,0869,0436)                
         DC    AL2(1724,0659,1212,1082,0842,0397,0402,0770,0443)                
         DC    AL2(0088,0093)                                                   
*                                                                               
         DC    AL1(15),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1711,0768,1762,0423,0638,1176,1057,0837,0473)                
         DC    AL2(1700,0666,1201,1062,0814,0389,0390,0747,0432)                
         DC    AL2(0088,0093)                                                   
*                                                                               
         DC    AL1(15),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1680,0753,1733,0418,0641,1158,1035,0811,0466)                
         DC    AL2(1667,0668,1183,1041,0788,0379,0380,0730,0427)                
         DC    AL2(0091,0096)                                                   
*                                                                               
         DC    AL1(15),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1683,0766,1727,0396,0638,1132,1013,0795,0489)                
         DC    AL2(1619,0649,1139,1011,0766,0381,0347,0659,0384)                
         DC    AL2(0089,0088)                                                   
*                                                                               
         DC    AL1(15),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1651,0742,1687,0396,0638,1111,0985,0767,0475)                
         DC    AL2(1688,0650,1122,0987,0742,0370,0339,0648,0375)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(15),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1608,0710,1649,0395,0633,1085,0956,0742,0465)                
         DC    AL2(1551,0643,1094,0956,0716,0364,0341,0633,0384)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(15),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1517,0669,1549,0380,0602,1016,0887,0689,0441)                
         DC    AL2(1451,0610,1020,0883,0662,0345,0324,0590,0338)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(15),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1481,0632,1510,0382,0594,0989,0856,0668,0432)                
         DC    AL2(1414,0600,0992,0851,0641,0338,0325,0577,0328)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(15),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1443,0602,1474,0385,0588,0965,0831,0647,0420)                
*        DC    AL2(1379,0591,0964,0821,0619,0332,0329,0561,0324)                
*                                                                               
*        DC    AL1(15),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1433,0574,1454,0394,0588,0950,0807,0633,0417)                
*        DC    AL2(1360,0590,0948,0799,0605,0329,0334,0550,0310)                
*                                                                               
*        DC    AL1(15),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1415,0546,1433,0401,0586,0935,0789,0620,0410)                
*        DC    AL2(1340,0587,0931,0778,0591,0326,0338,0543,0310)                
*                                                                               
* SOUTHEAST                                                                     
         DC    AL1(16),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1840,0843,1871,0420,0596,1149,1056,0904,0589)                
         DC    AL2(1669,0574,1094,0997,0831,0453,0394,0679,0396)                
         DC    AL2(0091,0088)                                                   
*                                                                               
         DC    AL1(16),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1804,0817,1841,0419,0602,1136,1034,0878,0577)                
         DC    AL2(1614,0579,1081,0975,0806,0444,0384,0666,0389)                
         DC    AL2(0090,0088)                                                   
*                                                                               
         DC    AL1(16),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1778,0802,1819,0414,0604,1120,1013,0852,0577)                
         DC    AL2(1624,0583,1071,0960,0784,0442,0376,0651,0382)                
         DC    AL2(0090,0088)                                                   
*                                                                               
         DC    AL1(16),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1753,0787,1800,0413,0611,1109,0996,0830,0572)                
         DC    AL2(1600,0589,1060,0944,0763,0432,0369,0640,0380)                
         DC    AL2(0094,0092)                                                   
*                                                                               
         DC    AL1(16),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1750,0813,1799,0402,0603,1103,0992,0829,0583)                
         DC    AL2(1586,0588,1058,0941,0751,0428,0363,0653,0396)                
         DC    AL2(0092,0089)                                                   
*                                                                               
         DC    AL1(16),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* SOUTHWEST                                                                     
         DC    AL1(17),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1074,0483,1085,0276,0377,0710,0643,0527,0298)                
         DC    AL2(0993,0369,0688,0618,0495,0235,0271,0486,0286)                
         DC    AL2(0059,0057)                                                   
*                                                                               
         DC    AL1(17),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1051,0465,1063,0273,0379,0699,0628,0510,0291)                
         DC    AL2(0974,0370,0677,0603,0478,0229,0263,0475,0280)                
         DC    AL2(0058,0057)                                                   
*                                                                               
         DC    AL1(17),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1033,0456,1045,0270,0379,0687,0612,0493,0289)                
         DC    AL2(0961,0373,0669,0592,0464,0227,0256,0463,0274)                
         DC    AL2(0058,0057)                                                   
*                                                                               
         DC    AL1(17),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1018,0442,1032,0268,0382,0680,0601,0479,0286)                
         DC    AL2(0946,0376,0662,0581,0450,0222,0251,0454,0272)                
         DC    AL2(0060,0060)                                                   
*                                                                               
         DC    AL1(17),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1043,0467,1061,0263,0393,0696,0613,0483,0299)                
         DC    AL2(0973,0395,0687,0599,0452,0226,0232,0451,0265)                
         DC    AL2(0061,0060)                                                   
*                                                                               
         DC    AL1(17),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* COUNTY SIZE A                                                                 
         DC    AL1(21),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(3782,1864,4004,0897,1365,2610,2390,1952,1115)                
         DC    AL2(3663,1363,2546,2305,1828,0856,0812,1490,0849)                
         DC    AL2(0192,0194)                                                   
*                                                                               
         DC    AL1(21),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(3753,1804,3971,0901,1389,2603,2362,1910,1099)                
         DC    AL2(3633,1384,2563,2275,1787,0845,0783,1474,0841)                
         DC    AL2(0193,0200)                                                   
*                                                                               
         DC    AL1(21),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(3729,1775,3936,0898,1404,2581,2324,1860,1098)                
         DC    AL2(3613,1406,2530,2247,1744,0843,0784,1446,0830)                
         DC    AL2(0193,0200)                                                   
*                                                                               
         DC    AL1(21),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(3696,1762,3907,0895,1422,2562,2296,1818,1093)                
         DC    AL2(3575,1422,2511,2220,1703,0829,0771,1425,0828)                
         DC    AL2(0201,0208)                                                   
*                                                                               
         DC    AL1(21),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(3881,1858,4034,0910,1432,2591,2338,1882,1183)                
         DC    AL2(3617,1409,2518,2251,1753,0859,0804,1408,0847)                
         DC    AL2(0207,0203)                                                   
*                                                                               
         DC    AL1(21),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(3836,1831,3985,0917,1447,2569,2296,1839,1184)                
         DC    AL2(3581,1424,2498,2214,1714,0848,0794,1400,0835)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(21),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(3753,1760,3921,0923,1445,2525,2243,1792,1151)                
         DC    AL2(3521,1419,2451,2157,1688,0842,0804,1375,0817)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(21),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(3693,1704,3868,0936,1450,2490,2195,1750,1135)                
         DC    AL2(3470,1419,2411,2104,1624,0834,0806,1353,0801)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(21),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(3629,1631,3806,0949,1443,2446,2137,1714,1123)                
         DC    AL2(3412,1408,2362,2044,1588,0829,0817,1333,0782)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(21),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(3556,1606,3740,0963,1438,2400,2085,1669,1102)                
*        DC    AL2(3351,1398,2314,1988,1545,0817,0832,1304,0778)                
*                                                                               
*        DC    AL1(21),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(3516,1532,3696,0985,1439,2367,2033,1639,1094)                
*        DC    AL2(3310,1397,2278,1936,1513,0814,0846,1282,0748)                
*                                                                               
*        DC    AL1(21),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(3468,1454,3646,1004,1435,2329,1985,1607,1080)                
*        DC    AL2(3264,1389,2237,1887,1482,0807,0857,1268,0747)                
*                                                                               
* COUNTY SIZE B                                                                 
         DC    AL1(22),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2933,1347,2960,0684,0988,1894,1730,1439,0860)                
         DC    AL2(2681,0961,1825,1655,1346,0666,0638,1165,0638)                
         DC    AL2(0148,0143)                                                   
*                                                                               
         DC    AL1(22),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2882,1302,2917,0683,1000,1877,1698,1399,0843)                
         DC    AL2(2642,0970,1806,1622,1308,0653,0624,1146,0666)                
         DC    AL2(0146,0145)                                                   
*                                                                               
         DC    AL1(22),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2836,1266,2876,0675,1002,1849,1660,1355,0840)                
         DC    AL2(2610,0977,1788,1594,1270,0648,0609,1118,0654)                
         DC    AL2(0146,0145)                                                   
*                                                                               
         DC    AL1(22),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2798,1240,2844,0673,1015,1831,1633,1319,0832)                
         DC    AL2(2572,0988,1770,1567,1233,0634,0598,1097,0650)                
         DC    AL2(0153,0151)                                                   
*                                                                               
         DC    AL1(22),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2835,1292,2891,0682,1041,1851,1647,1327,0857)                
         DC    AL2(2599,1028,1801,1589,1230,0631,0599,1100,0657)                
         DC    AL2(0157,0152)                                                   
*                                                                               
         DC    AL1(22),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2801,1254,2861,0699,1054,1640,1621,1298,0844)                
         DC    AL2(2578,1041,1791,1566,1205,0623,0593,1097,0649)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(22),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2744,1217,2822,0695,1055,1813,1587,1268,0836)                
         DC    AL2(2542,1040,1763,1530,1175,0620,0602,1080,0637)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(22),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2666,1165,2750,0695,1044,1764,1531,1223,0818)                
         DC    AL2(2472,1025,1709,1470,1129,0607,0596,1050,0617)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(22),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2628,1117,2717,0707,1044,1740,1496,1200,0812)                
         DC    AL2(2440,1021,1682,1434,1108,0605,0606,1038,0605)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(22),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2582,1089,2679,0720,1043,1713,1464,1174,0799)                
*        DC    AL2(2405,1018,1654,1400,1081,0598,0619,1019,0603)                
*                                                                               
*        DC    AL1(22),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2548,1036,2648,0736,1045,1691,1429,1153,0792)                
*        DC    AL2(2375,1017,1629,1362,1059,0595,0630,1002,0580)                
*                                                                               
*        DC    AL1(22),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(2515,0990,2616,0751,1044,1667,1397,1132,0782)                
*        DC    AL2(2346,1013,1603,1331,1039,0590,0639,0992,0580)                
*                                                                               
* COUNTY SIZE C + D                                                             
         DC    AL1(23),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2825,1196,2819,0667,0865,1692,1560,1369,0923)                
         DC    AL2(2580,0847,1650,1508,1302,0737,0676,1163,0696)                
         DC    AL2(0142,0140)                                                   
*                                                                               
         DC    AL1(23),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2785,1160,2789,0668,0880,1683,1538,1340,0908)                
         DC    AL2(2552,0859,1640,1485,1272,0726,0665,1148,0688)                
         DC    AL2(0140,0140)                                                   
*                                                                               
         DC    AL1(23),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2745,1124,2753,0659,0881,1658,1505,1300,0906)                
         DC    AL2(2527,0866,1627,1464,1241,0722,0651,1123,0677)                
         DC    AL2(0140,0140)                                                   
*                                                                               
         DC    AL1(23),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2716,1104,2732,0660,0896,1648,1484,1271,0902)                
         DC    AL2(2498,0880,1617,1444,1210,0709,0641,1109,0677)                
         DC    AL2(0147,0147)                                                   
*                                                                               
         DC    AL1(23),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2594,1105,2632,0611,0873,1592,1426,1205,0875)                
         DC    AL2(2407,0885,1581,1400,1129,0673,0572,1049,0622)                
         DC    AL2(0139,0139)                                                   
*                                                                               
         DC    AL1(23),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2573,1082,2613,0620,0889,1590,1410,1185,0883)                
         DC    AL2(2398,0902,1582,1388,1114,0688,0570,1053,0616)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(23),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2543,1046,2598,0631,0897,1579,1391,1168,0861)                
         DC    AL2(2384,0909,1570,1367,1096,0667,0583,1047,0612)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(23),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2501,1013,2572,0641,0903,1561,1363,1145,0854)                
         DC    AL2(2356,0912,1547,1334,1071,0664,0586,1033,0602)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(23),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2483,0976,2560,0658,0910,1552,1342,1134,0854)                
         DC    AL2(2346,0917,1536,1312,1059,0666,0602,1030,0595)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(23),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2452,0948,2537,0674,0915,1537,1321,1115,0844)                
*        DC    AL2(2324,0918,1517,1288,1040,0661,0617,1017,0596)                
*                                                                               
*        DC    AL1(23),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2426,0912,2513,0692,0919,1520,1292,1099,0838)                
*        DC    AL2(2301,0920,1498,1257,1023,0658,0631,1003,0575)                
*                                                                               
*        DC    AL1(23),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(2397,0865,2486,0705,0920,1501,1267,1081,0828)                
*        DC    AL2(2277,0920,1478,1231,1005,0652,0641,0995,0577)                
*                                                                               
* CABLE STATUS ANY                                                              
         DC    AL1(31),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(6046,3011,6226,1359,2041,4002,3755,3152,1732)                
         DC    AL2(5755,2059,3902,3555,2920,1413,1348,2323,1354)                
         DC    AL2(0277,0321)                                                   
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(5875,2832,6138,1416,2092,3993,3660,3036,1695)                
         DC    AL2(5654,2073,3869,3502,2839,1367,1292,2366,1376)                
         DC    AL2(0301,0297)                                                   
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(5720,2678,5947,1361,2043,3842,3489,2884,1702)                
         DC    AL2(5509,2021,3765,3374,2744,1367,1263,2214,1285)                
         DC    AL2(0301,0297)                                                   
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(91,04)                                   
         DC    AL2(5580,2668,5743,1337,2040,3724,3365,2734,1632)                
         DC    AL2(5305,2045,3669,3264,2575,1284,1200,2126,1271)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(5486,2640,5670,1324,2017,3685,3329,2703,1602)                
         DC    AL2(5243,2024,3631,3230,2547,1263,1189,2104,1258)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(5190,2473,5366,1284,1958,3522,3145,2548,1487)                
         DC    AL2(4958,1962,3450,3041,2388,1178,1136,2028,1205)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(89,04)                                   
         DC    AL2(4958,2299,5156,1267,1920,3384,3006,2415,1441)                
         DC    AL2(4741,1914,3295,2898,2247,1136,1136,1950,1135)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(4777,2223,4971,1225,1857,3275,2910,2334,1377)                
         DC    AL2(4577,1851,3188,2804,2172,1089,1099,1886,1097)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(88,07)                                   
         DC    AL2(4600,2135,4834,1192,1803,3179,2812,2263,1365)                
         DC    AL2(4436,1794,3094,2730,3107,1041,1088,1867,1112)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(88,04)                                   
         DC    AL2(4520,2102,4752,1176,1775,3138,2771,2228,1334)                
         DC    AL2(4366,1767,3052,2693,2078,1019,1075,1838,1096)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(4379,2040,4606,1140,1721,3041,2690,2163,1289)                
         DC    AL2(4235,1714,2963,2616,2018,0984,1044,1784,1064)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(87,09)                                   
         DC    AL2(4379,2038,4605,1139,1719,3038,2687,2162,1292)                
         DC    AL2(4234,1712,2960,2614,2017,0986,1042,1782,1063)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(87,07)                                   
         DC    AL2(4299,1921,4536,1183,1724,2972,2577,2109,1291)                
         DC    AL2(4177,1710,2912,2549,1974,0982,1048,1724,1010)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(87,01)                                   
         DC    AL2(4253,1903,4489,1171,1707,2943,2553,2088,1275)                
         DC    AL2(4135,1694,2885,2525,1954,0970,1038,1706,1000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(31),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(4169,1886,4391,1128,1699,2863,2498,2025,1253)                
         DC    AL2(4061,1679,2818,2461,1913,0961,0993,1682,1002)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(31),AL1(4+20*2),AL1(86,07)                                   
*        DC    AL2(4065,1836,4297,1143,1691,2806,2434,1966,1216)                
*        DC    AL2(3976,1664,2756,2392,1858,0939,1009,1645,0995)                
*        DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(31),AL1(4+20*2),AL1(86,01)                                   
*        DC    AL2(3960,1798,4188,1119,1656,2749,2385,1921,1170)                
*        DC    AL2(3888,1633,2705,2347,1818,0908,0989,1609,0975)                
*                                                                               
*        DC    AL1(31),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(3916,1781,4143,1108,1641,2723,2362,1900,1154)                
*        DC    AL2(3847,1616,2678,2324,1800,0897,0979,1594,0966)                
*                                                                               
*        DC    AL1(31),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(3634,1600,3853,1088,1571,2565,2182,1734,1043)                
*        DC    AL2(3607,1575,2535,2146,1645,0830,0938,1521,0876)                
*                                                                               
*        DC    AL1(31),AL1(4+20*2),AL1(84,07)                                   
*        DC    AL2(3555,1518,3773,1113,1544,2501,2104,1685,1023)                
*        DC    AL2(3499,1536,2442,2030,1580,0822,0950,1464,0857)                
*                                                                               
*        DC    AL1(31),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(3451,1476,3665,1082,1502,2433,2047,1638,0990)                
*        DC    AL2(3402,1495,2376,1976,1536,0797,0924,1423,0833)                
*                                                                               
* CABLE STATUS PAY                                                              
         DC    AL1(32),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2710,1523,2884,0733,1020,2043,1925,1596,0565)                
         DC    AL2(2801,1014,1991,1833,1550,0548,0776,1258,0758)                
         DC    AL2(0162,0179)                                                   
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2607,1408,2800,0759,1017,2031,1855,1508,0545)                
         DC    AL2(2718,1049,1984,1785,1443,0504,0733,1225,0738)                
         DC    AL2(0176,0168)                                                   
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2585,1368,2769,0760,1039,2033,1818,1465,0541)                
         DC    AL2(2689,1049,1978,1748,1417,0507,0715,1215,0723)                
         DC    AL2(0176,0168)                                                   
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2599,1369,2755,0778,1066,2038,1807,1438,0532)                
         DC    AL2(2711,1093,2031,1789,1413,0484,0736,1190,0727)                
         DC    AL2(0187,0177)                                                   
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(91,04)                                   
         DC    AL2(2652,1465,2785,0780,1099,2072,1840,1425,0526)                
         DC    AL2(2742,1134,2071,1820,1405,0482,0735,1206,0737)                
         DC    AL2(0181,0175)                                                   
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2704,1491,2836,0792,1118,2107,1872,1451,0539)                
         DC    AL2(2791,1153,2105,1851,1429,0493,0746,1226,0749)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2712,1460,2855,0786,1189,2131,1887,1434,0539)                
         DC    AL2(2783,1182,2122,1854,1403,0471,0724,1278,0775)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(89,04)                                   
         DC    AL2(2637,1399,2816,0793,1174,2104,1861,1392,0524)                
         DC    AL2(2708,1178,2063,1802,1347,0461,0737,1259,0754)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2610,1384,2786,0784,1161,2080,1841,1378,0519)                
         DC    AL2(2679,1164,2040,1782,1332,0457,0728,1242,0744)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(88,07)                                   
         DC    AL2(2507,1353,2686,0779,1145,2040,1776,1318,0483)                
         DC    AL2(2581,1111,1970,1743,1300,0429,0715,1182,0712)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(88,04)                                   
         DC    AL2(2504,1350,2683,0778,1142,2036,1773,1318,0484)                
         DC    AL2(2580,1109,1969,1742,1300,0428,0716,1179,0711)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2429,1311,2603,0755,1108,1977,1722,1280,0468)                
         DC    AL2(2606,1077,1913,1694,1264,0415,0695,1146,0691)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(87,09)                                   
         DC    AL2(2404,1299,2577,0748,1097,1959,1706,1267,0462)                
         DC    AL2(2482,1067,1896,1678,1253,0410,0689,1135,0684)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(87,07)                                   
         DC    AL2(2340,1224,2504,0781,1107,1919,1637,1221,0432)                
         DC    AL2(2504,1125,1939,1674,1233,0398,0704,1118,0673)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(87,01)                                   
         DC    AL2(2322,1215,2486,0775,1099,1905,1625,1212,0429)                
         DC    AL2(2486,1117,1926,1663,1224,0394,0698,1109,0668)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(32),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2285,1205,2434,0735,1105,1867,1610,1158,0418)                
         DC    AL2(2484,1139,1927,1662,1189,0394,0669,1087,0666)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(32),AL1(4+20*2),AL1(86,07)                                   
*        DC    AL2(2276,1194,2434,0757,1119,1862,1597,1146,0419)                
*        DC    AL2(2474,1146,1912,1639,1172,0396,0690,1081,0672)                
*        DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(32),AL1(4+20*2),AL1(86,01)                                   
*        DC    AL2(2297,1203,2456,0762,1127,1876,1610,1158,0425)                
*        DC    AL2(2492,1153,1923,1649,1181,0401,0694,1087,0676)                
*                                                                               
*        DC    AL1(32),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2284,1197,2443,0758,1121,1866,1601,1152,0423)                
*        DC    AL2(2478,1146,1912,1640,1175,0399,0690,1081,0672)                
*                                                                               
*        DC    AL1(32),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2184,1089,2336,0751,1097,1799,1513,1076,0394)                
*        DC    AL2(2375,1135,1834,1550,1096,0379,0657,1069,0628)                
*                                                                               
*        DC    AL1(32),AL1(4+20*2),AL1(84,07)                                   
*        DC    AL2(2137,1027,2280,0769,1085,1739,1446,1035,0393)                
*        DC    AL2(2278,1101,1746,1456,1036,0374,0667,1024,0601)                
*                                                                               
*        DC    AL1(32),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(2084,1002,2225,0750,1059,1697,1412,1010,0383)                
*        DC    AL2(2225,1075,1705,1423,1012,0365,0651,0999,0586)                
*                                                                               
* CABLE STATUS BASIC                                                            
         DC    AL1(33),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(3336,1488,3342,0626,1021,1959,1830,1556,1167)                
         DC    AL2(2954,1045,1911,1722,1370,0865,0572,1065,0596)                
         DC    AL2(0115,0142)                                                   
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(3268,1424,3338,0657,1075,1963,1804,1529,1150)                
         DC    AL2(2936,1023,1885,1718,1396,0863,0559,1141,0638)                
         DC    AL2(0125,0129)                                                   
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(3135,1310,3178,0601,1004,1810,1671,1419,1161)                
         DC    AL2(2820,0973,1787,1626,1327,0860,0521,0999,0562)                
         DC    AL2(0125,0129)                                                   
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2950,1197,3011,0586,0983,1717,1578,1319,1090)                
         DC    AL2(2630,0933,1653,1507,1203,0810,0497,0970,0552)                
         DC    AL2(0123,0119)                                                   
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(91,04)                                   
         DC    AL2(2906,1203,2959,0557,0941,1652,1525,1309,1106)                
         DC    AL2(2563,0912,1598,1444,1703,0802,0465,0920,0534)                
         DC    AL2(0127,0123)                                                   
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2782,1150,2834,0531,0899,1578,1457,1253,1063)                
         DC    AL2(2452,0871,1526,1379,1118,0771,0443,0878,0509)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2478,1013,2514,0499,0798,1381,1259,1114,0958)                
         DC    AL2(2175,0780,1327,1187,0985,0705,0412,0753,0430)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(89,04)                                   
         DC    AL2(2321,0900,2341,0474,0747,1281,1145,1023,0917)                
         DC    AL2(2032,0737,1232,1096,0900,0675,0399,0692,0381)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2167,0839,2186,0442,0696,1195,1069,0956,0858)                
         DC    AL2(1898,0687,1149,1022,0840,0632,0372,0644,0354)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(88,07)                                   
         DC    AL2(2093,0782,2149,0413,0658,1140,1036,0945,0882)                
         DC    AL2(1854,0683,1124,0987,0807,0612,0372,0685,0400)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(88,04)                                   
         DC    AL2(2016,0752,2070,0398,0633,1097,0998,0911,0850)                
         DC    AL2(1787,0657,1083,0951,0778,0589,0359,0659,0386)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1950,0729,2003,0386,0613,1064,0967,0883,0821)                
         DC    AL2(1729,0636,1050,0923,0754,0569,0384,0638,0373)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(87,09)                                   
         DC    AL2(1975,0739,2028,0391,0622,1079,0981,0895,0830)                
         DC    AL2(1752,0645,1064,0936,0764,0576,0353,0647,0379)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(87,07)                                   
         DC    AL2(1959,0697,2032,0402,0617,1053,0940,0888,0859)                
         DC    AL2(1673,0585,0973,0875,0741,0584,0344,0606,0337)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(87,01)                                   
         DC    AL2(1931,0688,2003,0396,0608,1038,0928,0876,0846)                
         DC    AL2(1649,0577,0959,0862,0730,0576,0340,0597,0332)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(33),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1884,0681,1957,0393,0594,0996,0888,0867,0835)                
         DC    AL2(1577,0540,0891,0799,0724,0567,0324,0595,0336)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(33),AL1(4+20*2),AL1(86,07)                                   
*        DC    AL2(1789,0642,1863,0386,0572,0944,0837,0820,0797)                
*        DC    AL2(1502,0518,0844,0753,0686,0543,0319,0564,0323)                
*        DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(33),AL1(4+20*2),AL1(86,01)                                   
*        DC    AL2(1663,0595,1732,0357,0529,0873,0775,0763,0745)                
*        DC    AL2(1396,0480,0782,0698,0637,0507,0295,0522,0299)                
*                                                                               
*        DC    AL1(33),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1632,0584,1700,0350,0520,0857,0761,0748,0731)                
*        DC    AL2(1369,0470,0766,0684,0625,0498,0289,0513,0294)                
*                                                                               
*        DC    AL1(33),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1450,0511,1517,0337,0474,0766,0669,0658,0649)                
*        DC    AL2(1232,0440,0701,0596,0549,0451,0281,0452,0248)                
*                                                                               
*        DC    AL1(33),AL1(4+20*2),AL1(84,07)                                   
*        DC    AL2(1418,0491,1493,0344,0459,0762,0658,0650,0630)                
*        DC    AL2(1221,0435,0696,0574,0544,0448,0283,0440,0256)                
*                                                                               
*        DC    AL1(33),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1367,0474,1440,0332,0443,0736,0635,0628,0607)                
*        DC    AL2(1177,0420,0617,0553,0524,0432,0273,0424,0247)                
*                                                                               
* CABLE STATUS NO CABLE                                                         
         DC    AL1(34),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(3494,1397,3558,0849,1177,2193,1924,1608,1166)                
         DC    AL2(3169,1113,2118,1914,1557,0846,0779,1495,0868)                
         DC    AL2(0205,0156)                                                   
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(3545,1435,3538,0836,1178,2170,1937,1612,1154)                
         DC    AL2(3173,1141,2114,1880,1528,0856,0796,1401,0820)                
         DC    AL2(0178,0187)                                                   
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(3590,1487,3617,0871,1244,2245,2000,1631,1142)                
         DC    AL2(3240,1228,2180,1931,1510,0846,0808,1473,0876)                
         DC    AL2(0178,0187)                                                   
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(3661,1540,3717,0864,1284,2286,2029,1651,1205)                
         DC    AL2(3303,1263,2215,1935,1530,0877,0777,1471,0875)                
         DC    AL2(0191,0210)                                                   
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(91,04)                                   
         DC    AL2(3752,1587,3814,0867,1306,2310,2046,1680,1282)                
         DC    AL2(3317,1278,2230,1976,1537,0879,0775,1432,0855)                
         DC    AL2(0195,0195)                                                   
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(3824,1615,3887,0881,1328,2349,2081,1711,1312)                
         DC    AL2(3379,1300,2268,2010,1565,0900,0786,1455,0868)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(4020,1695,4092,0941,1432,2477,2181,1774,1373)                
         DC    AL2(3599,1408,2421,2126,1646,0981,0821,1521,0897)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(89,04)                                   
         DC    AL2(4082,1725,4185,0983,1477,2534,2216,1813,1406)                
         DC    AL2(3706,1454,2488,2156,1692,0993,0854,1552,0930)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(4263,1800,4370,1025,1540,2644,2313,1894,1470)                
         DC    AL2(3870,1517,2595,2250,1767,1040,0891,1616,0968)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(88,07)                                   
         DC    AL2(4260,1747,4356,1080,1594,2636,2277,1855,1442)                
         DC    AL2(3862,1562,2573,2178,1717,1064,0901,1569,0907)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(88,04)                                   
         DC    AL2(4340,1780,4438,1096,1622,2681,2318,1890,1473)                
         DC    AL2(3932,1589,2615,2215,1746,1087,0913,1598,0923)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(4481,1842,4584,1132,1676,2774,2399,1955,1518)                
         DC    AL2(4063,1642,2704,2292,1806,1121,0944,1652,0955)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(87,09)                                   
         DC    AL2(4481,1844,4585,1133,1678,2777,2402,1956,1515)                
         DC    AL2(4064,1644,2707,2294,1807,1119,0946,1654,0956)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(87,07)                                   
         DC    AL2(4441,1803,4547,1131,1673,2766,2398,1939,1498)                
         DC    AL2(4021,1636,2668,2241,1781,1118,0977,1677,0972)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(87,01)                                   
         DC    AL2(4487,1821,4594,1143,1690,2795,2422,1960,1514)                
         DC    AL2(4063,1652,2695,2265,1801,1130,0987,1695,0982)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(34),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(4571,1838,4692,1186,1698,2875,2477,2023,1536)                
         DC    AL2(4137,1667,2762,2329,1842,1139,1032,1719,0980)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(34),AL1(4+20*2),AL1(86,07)                                   
*        DC    AL2(4525,1807,4659,1214,1705,2844,2436,1992,1529)                
*        DC    AL2(4104,1670,2729,2284,1808,1137,1059,1695,0982)                
*        DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(34),AL1(4+20*2),AL1(86,01)                                   
*        DC    AL2(4630,1845,4768,1238,1740,2901,2485,2037,1575)                
*        DC    AL2(4192,1701,2780,2329,1848,1168,1079,1731,1002)                
*                                                                               
*        DC    AL1(34),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(4674,1862,4813,1249,1755,2927,2508,2058,1591)                
*        DC    AL2(4233,1718,2807,2352,1866,1179,1089,1746,1011)                
*                                                                               
*        DC    AL1(34),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(4856,1880,5004,1325,1832,3013,2572,2157,1681)                
*        DC    AL2(4379,1759,2870,2409,1950,1237,1169,1766,1027)                
*                                                                               
*        DC    AL1(34),AL1(4+20*2),AL1(84,07)                                   
*        DC    AL2(4825,1791,4975,1347,1855,2996,2554,2135,1667)                
*        DC    AL2(4388,1786,2876,2419,1946,1227,1187,1791,1047)                
*                                                                               
*        DC    AL1(34),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(4929,1833,5083,1378,1897,3064,2602,2182,1700)                
*        DC    AL2(4485,1827,2942,2473,1990,1252,1213,1832,1071)                
*                                                                               
* HOUSEHOLD SIZE 1                                                              
         DC    AL1(41),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2235,0452,1304,0044,0165,0360,0394,0452,0868)                
         DC    AL2(0929,0279,0555,0560,0446,0308,0002,0000,0000)                
         DC    AL2(0007,0011)                                                   
*                                                                               
         DC    AL1(41),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2278,0485,1382,0052,0198,0410,0436,0469,0895)                
         DC    AL2(0898,0263,0535,0542,0433,0303,0018,0000,0000)                
         DC    AL2(0009,0007)                                                   
*                                                                               
         DC    AL1(41),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2287,0486,1414,0050,0202,0414,0438,0468,0926)                
         DC    AL2(0949,0307,0587,0578,0439,0306,0001,0000,0000)                
         DC    AL2(0010,0008)                                                   
*                                                                               
         DC    AL1(41),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2143,0452,1300,0046,0182,0367,0380,0427,0875)                
         DC    AL2(0842,0280,0514,0501,0376,0280,0001,0000,0000)                
         DC    AL2(0008,0010)                                                   
*                                                                               
         DC    AL1(41),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2217,0465,1327,0050,0193,0370,0384,0431,0895)                
         DC    AL2(0886,0305,0549,0533,0394,0288,0003,0000,0000)                
         DC    AL2(0009,0010)                                                   
*                                                                               
         DC    AL1(41),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2162,0451,1286,0051,0203,0369,0373,0401,0862)                
         DC    AL2(0874,0305,0550,0536,0390,0278,0002,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(41),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2112,0442,1289,0053,0203,0366,0366,0404,0870)                
         DC    AL2(0822,0297,0517,0497,0353,0262,0001,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(41),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2049,0420,1234,0054,0200,0345,0347,0382,0834)                
         DC    AL2(0813,0307,0516,0498,0344,0248,0002,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(41),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2027,0420,1247,0057,0205,0347,0347,0389,0844)                
         DC    AL2(0778,0295,0490,0471,0327,0241,0002,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(41),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1976,0430,1238,0052,0205,0341,0343,0390,0844)                
*        DC    AL2(0736,0285,0462,0435,0303,0236,0002,0000,0000)                
*                                                                               
*        DC    AL1(41),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1929,0419,1211,0054,0209,0329,0324,0375,0833)                
*        DC    AL2(0717,0277,0438,0413,0290,0240,0001,0000,0000)                
*                                                                               
*        DC    AL1(41),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1870,0378,1147,0056,0197,0304,0293,0343,0798)                
*        DC    AL2(0723,0284,0447,0425,0287,0234,0000,0000,0000)                
*                                                                               
* HOUSEHOLD SIZE 2                                                              
         DC    AL1(42),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(3070,1397,3131,0326,0748,1409,1441,1564,1412)                
         DC    AL2(2769,0678,1198,1215,1258,1347,0098,0121,0066)                
         DC    AL2(0076,0052)                                                   
*                                                                               
         DC    AL1(42),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(3012,1349,3037,0316,0734,1379,1395,1522,1373)                
         DC    AL2(2759,0704,1219,1210,1235,1323,0094,0112,0062)                
         DC    AL2(0067,0052)                                                   
*                                                                               
         DC    AL1(42),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2928,1337,3020,0340,0762,1386,1367,1490,1362)                
         DC    AL2(2829,0752,1270,1242,1251,1346,0100,0119,0067)                
         DC    AL2(0072,0059)                                                   
*                                                                               
         DC    AL1(42),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(3010,1339,3053,0353,0798,1404,1368,1469,1377)                
         DC    AL2(2736,0742,1205,1172,1185,1323,0091,0118,0066)                
         DC    AL2(0086,0061)                                                   
*                                                                               
         DC    AL1(42),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(3023,1387,3090,0350,0813,1399,1365,1462,1424)                
         DC    AL2(2732,0776,1241,1181,1166,1307,0099,0107,0059)                
         DC    AL2(0087,0062)                                                   
*                                                                               
         DC    AL1(42),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2995,1325,3020,0347,0796,1361,1312,1427,1411)                
         DC    AL2(2734,0802,1248,1177,1159,1297,0102,0113,0085)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(42),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2926,1267,2944,0360,0805,1330,1255,1366,1377)                
         DC    AL2(2666,0783,1214,1141,1120,1280,0099,0121,0070)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(42),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2825,1214,2850,0352,0786,1271,1192,1326,1356)                
         DC    AL2(2577,0759,1148,1072,1060,1263,0092,0108,0062)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(42),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2761,1156,2784,0344,0768,1231,1152,1301,1333)                
         DC    AL2(2526,0745,1114,1031,1039,1251,0091,0103,0059)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(42),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2730,1136,2751,0345,0767,1208,1137,1273,1318)                
*        DC    AL2(2490,0735,1084,1004,1025,1241,0099,0106,0061)                
*                                                                               
*        DC    AL1(42),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2690,1070,2708,0372,0779,1187,1076,1233,1305)                
*        DC    AL2(2455,0728,1064,0964,1011,1238,0092,0108,0057)                
*                                                                               
*        DC    AL1(42),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(2663,1051,2679,0383,0781,1156,1043,1222,1296)                
*        DC    AL2(2439,0739,1050,0939,1005,1229,0087,0104,0055)                
*                                                                               
* HOUSEHOLD SIZE 3+                                                             
*        DC    AL1(45),AL1(4+20*2),AL1(94,09)                                   
*        DC    AL2(1730,1072,2051,0515,0802,1539,1381,1084,0351)                
*        DC    AL2(1920,0807,1411,1250,0968,0343,0399,0599,0301)                
*        DC    AL2(0119,0123)                                                   
*                                                                               
*        DC    AL1(44),AL1(4+20*2),AL1(94,09)                                   
*        DC    AL2(2505,1487,3297,1363,1503,2888,2463,1660,0268)                
*        DC    AL2(3305,1407,2856,2444,1804,0262,1628,3099,1855)                
*        DC    AL2(0280,0291)                                                   
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(4235,2559,5348,1878,2305,4427,3844,2744,0619)                
         DC    AL2(5225,2214,4267,3694,2772,0605,2027,3698,2156)                
         DC    AL2(0399,0546)                                                   
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(4130,2432,5260,1884,2340,4378,3770,2657,0581)                
         DC    AL2(5170,2245,4229,3630,2699,0597,1991,3656,2134)                
         DC    AL2(0408,0423)                                                   
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(4041,2342,5131,1843,2324,4287,3684,2557,0556)                
         DC    AL2(4971,2190,4088,3486,2564,0560,1942,3569,2093)                
         DC    AL2(0397,0417)                                                   
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(4057,2316,5130,1829,2354,4271,3666,2512,0575)                
         DC    AL2(5067,2268,4180,3559,2586,0569,1918,3513,2088)                
         DC    AL2(0407,0435)                                                   
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(4070,2404,5140,1804,2339,4266,3661,2522,0595)                
         DC    AL2(5004,2242,4109,3527,2552,0568,1873,3452,2067)                
         DC    AL2(0408,0422)                                                   
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(4053,2391,5155,1827,2390,4268,3641,2494,0597)                
         DC    AL2(4948,2261,4072,3454,2485,0584,1853,3436,2037)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(4002,2315,5108,1837,2389,4222,3600,2458,0600)                
         DC    AL2(4959,2288,4052,3416,2466,0587,1890,3381,1996)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(3986,2248,5101,1866,2411,4199,3550,2410,0617)                
         DC    AL2(4908,2290,4003,3338,2420,0594,1894,3328,1957)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(43),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(3952,2148,5052,1913,2424,4160,3476,2358,0612)                
         DC    AL2(4894,2306,3976,3288,2389,0608,1932,3298,1923)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(43),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(3884,2077,4967,1960,2424,4101,3390,2295,0583)                
*        DC    AL2(4854,2314,3939,3237,2338,0599,1967,3234,1916)                
*                                                                               
*        DC    AL1(43),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(3871,1991,4938,1987,2415,4062,3354,2283,0586)                
*        DC    AL2(4814,2329,3903,3178,2294,0589,2014,3179,1846)                
*                                                                               
*        DC    AL1(43),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(3847,1880,4922,2021,2421,4037,3313,2255,0596)                
*        DC    AL2(4725,2299,3821,3085,2234,0586,2050,3151,1849)                
*                                                                               
* HOUSEHOLD SIZE 4+                                                             
         DC    AL1(44),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2505,1487,3297,1363,1503,2888,2463,1660,0268)                
         DC    AL2(3305,1407,2856,2444,1804,0262,1628,3099,1855)                
         DC    AL2(0280,0291)                                                   
*                                                                               
         DC    AL1(44),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2490,1448,3327,1397,1550,2918,2462,1652,0267)                
         DC    AL2(3350,1477,2893,2446,1783,0267,1632,3077,1838)                
         DC    AL2(0286,0310)                                                   
*                                                                               
         DC    AL1(44),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2475,1418,3279,1366,1554,2888,2445,1612,0248)                
         DC    AL2(3206,1424,2784,2347,1696,0243,1592,2998,1789)                
         DC    AL2(0282,0303)                                                   
*                                                                               
         DC    AL1(44),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2459,1390,3262,1346,1564,2863,2420,1576,0263)                
         DC    AL2(3264,1469,2847,2402,1712,0244,1565,2969,1795)                
         DC    AL2(0288,0310)                                                   
*                                                                               
         DC    AL1(44),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2421,1425,3202,1305,1517,2816,2382,1558,0258)                
         DC    AL2(3162,1416,2749,2347,1665,0234,1509,2876,1768)                
         DC    AL2(0283,0295)                                                   
*                                                                               
         DC    AL1(44),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2404,1405,3201,1316,1553,2812,2364,1530,0260)                
         DC    AL2(3134,1439,2728,2286,1616,0230,1486,2836,1733)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(44),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2377,1367,3182,1344,1549,2788,2336,1516,0256)                
         DC    AL2(3174,1486,2748,2271,1609,0250,1533,2809,1698)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(44),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2365,1317,3176,1342,1553,2773,2316,1494,0266)                
         DC    AL2(3128,1466,2707,2232,1588,0245,1521,2779,1680)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(44),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2344,1254,3144,1385,1566,2749,2262,1454,0261)                
         DC    AL2(3124,1481,2695,2204,1568,0253,1555,2759,1655)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(44),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2338,1237,3144,1445,1585,2748,2233,1446,0260)                
*        DC    AL2(3140,1501,2692,2187,1560,0264,1616,2720,1655)                
*                                                                               
*        DC    AL1(44),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2352,1186,3146,1478,1600,2754,2239,1440,0249)                
*        DC    AL2(3130,1529,2696,2173,1529,0248,1669,2670,1588)                
*                                                                               
*        DC    AL1(44),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(2357,1139,3159,1518,1590,2744,2230,1455,0260)                
*        DC    AL2(3101,1520,2657,2110,1509,0256,1726,2628,1585)                
*                                                                               
* HOUSEHOLD SIZE 3                                                              
         DC    AL1(45),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1730,1072,2051,0515,0802,1539,1381,1084,0351)                
         DC    AL2(1920,0807,1411,1250,0968,0343,0399,0599,0301)                
         DC    AL2(0119,0123)                                                   
*                                                                               
         DC    AL1(45),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1640,0984,1934,0487,0790,1461,1308,1006,0315)                
         DC    AL2(1820,0768,1337,1184,0916,0330,0359,0578,0296)                
         DC    AL2(0122,0113)                                                   
*                                                                               
         DC    AL1(45),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1566,0924,1852,0477,0770,1399,1239,0945,0308)                
         DC    AL2(1765,0766,1304,1139,0868,0317,0350,0571,0304)                
         DC    AL2(0115,0114)                                                   
*                                                                               
         DC    AL1(45),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1598,0926,1868,0483,0790,1408,1246,0936,0312)                
         DC    AL2(1803,0799,1333,1157,0874,0325,0353,0544,0293)                
         DC    AL2(0119,0125)                                                   
*                                                                               
         DC    AL1(45),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1649,0979,1938,0499,0822,1450,1279,0964,0337)                
         DC    AL2(1842,0826,1360,1180,0887,0334,0364,0576,0299)                
         DC    AL2(0125,0127)                                                   
*                                                                               
*                                                                               
* PRESENCE OF NON-ADULTS (ANY UNDER 18)                                         
         DC    AL1(51),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(3523,1959,4047,1623,1912,3720,3266,2047,0191)                
         DC    AL2(3509,1454,3149,2854,1992,0182,2126,3818,2222)                
         DC    AL2(0262,0238)                                                   
*                                                                               
         DC    AL1(51),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(3459,1875,4019,1638,1945,3696,3214,1992,0189)                
         DC    AL2(3463,1484,3116,2789,1922,0184,2087,3767,2196)                
         DC    AL2(0266,0245)                                                   
*                                                                               
         DC    AL1(51),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(3393,1837,3954,1595,1945,3628,3163,1926,0197)                
         DC    AL2(3428,1482,3076,2756,1885,0189,2044,3687,2161)                
         DC    AL2(0252,0245)                                                   
*                                                                               
         DC    AL1(51),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(3356,1802,3915,1569,1970,3596,3139,1862,0192)                
         DC    AL2(3404,1495,3068,2752,1855,0176,2010,3631,2154)                
         DC    AL2(0253,0242)                                                   
*                                                                               
         DC    AL1(51),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(3452,1906,3960,1568,1986,3652,3172,1891,0192)                
         DC    AL2(3425,1519,3086,2778,1852,0174,1975,3558,2126)                
         DC    AL2(0261,0238)                                                   
*                                                                               
         DC    AL1(51),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(3459,1889,3982,1578,2027,3660,3178,1872,0190)                
         DC    AL2(3484,1578,3131,2798,1848,0183,1957,3549,2102)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(51),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(3469,1848,3992,1603,2059,3659,3166,1848,0201)                
         DC    AL2(3510,1615,3142,2792,1837,0193,1990,3502,2065)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(51),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(3381,1758,3933,1621,2052,3599,3090,1791,0200)                
         DC    AL2(3438,1595,3082,2712,1792,0190,1988,3436,2019)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(51),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(3347,1665,3881,1656,2051,3545,3014,1737,0206)                
         DC    AL2(3385,1589,3029,2650,1746,0192,2025,3401,1982)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(51),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(3289,1607,3816,1682,2045,3480,2943,1683,0207)                
*        DC    AL2(3336,1583,2976,2603,1699,0192,2068,3340,1977)                
*                                                                               
*        DC    AL1(51),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(3271,1542,3784,1716,2049,3455,2907,1657,0195)                
*        DC    AL2(3338,1624,2976,2572,1664,0194,2107,3287,1903)                
*                                                                               
*        DC    AL1(51),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(3269,1466,3827,1771,2082,3470,2900,1659,0207)                
*        DC    AL2(3356,1646,2965,2537,1655,0212,2137,3255,1904)                
*                                                                               
* PRESENCE OF NON-ADULTS (ANY UNDER 12)                                         
         DC    AL1(52),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2709,1409,3079,0933,1701,2883,2508,1319,0126)                
         DC    AL2(2607,1211,2415,2219,1355,0104,0995,3818,2222)                
         DC    AL2(0162,0117)                                                   
*                                                                               
         DC    AL1(52),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2673,1359,3062,0943,1722,2867,2475,1285,0127)                
         DC    AL2(2569,1229,2389,2171,1304,0105,0987,3767,2196)                
         DC    AL2(0161,0120)                                                   
*                                                                               
         DC    AL1(52),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2675,1365,3074,0945,1741,2869,2487,1275,0136)                
         DC    AL2(2593,1239,2396,2188,1313,0115,1007,3687,2161)                
         DC    AL2(0157,0121)                                                   
*                                                                               
         DC    AL1(52),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2619,1311,3004,0902,1748,2812,2441,1204,0128)                
         DC    AL2(2550,1253,2377,2164,1264,0098,0953,3631,2154)                
         DC    AL2(0154,0116)                                                   
*                                                                               
         DC    AL1(52),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2621,1348,2960,0857,1751,2780,2400,1154,0126)                
         DC    AL2(2500,1265,2336,2131,1201,0093,0861,3558,2126)                
         DC    AL2(0145,0111)                                                   
*                                                                               
         DC    AL1(52),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2599,1307,2935,0869,1769,2756,2381,1111,0119)                
         DC    AL2(2512,1292,2346,2137,1183,0097,0883,3549,2102)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(52),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2589,1286,2930,0882,1801,2759,2361,1079,0119)                
         DC    AL2(2496,1307,2332,2114,1154,0096,0880,3502,2065)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(52),AL1(4+20*2),AL1(86,11)                                   
         DC    AL2(2494,1193,2832,0883,1770,2665,2266,1009,0115)                
         DC    AL2(2420,1296,2266,2030,1093,0092,0879,3436,2019)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(52),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2471,1128,2798,0908,1771,2632,2213,0973,0116)                
         DC    AL2(2390,1290,2237,1993,1069,0092,0892,3401,1982)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(52),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2414,1080,2741,0919,1769,2573,2140,0919,0121)                
*        DC    AL2(2345,1281,2196,1954,1032,0090,0893,3340,1977)                
*                                                                               
*        DC    AL1(52),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2410,1027,2726,0943,1778,2568,2122,0898,0112)                
*        DC    AL2(2331,1299,2188,1942,1004,0082,0918,3287,1903)                
*                                                                               
*        DC    AL1(52),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(2418,0983,2757,0988,1794,2589,2127,0909,0115)                
*        DC    AL2(2355,1318,2193,1925,1007,0092,0961,3255,1904)                
*                                                                               
* PRESENCE OF NON-ADULTS (ANY UNDER 6)                                          
         DC    AL1(53),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1716,0821,1970,0547,1313,1859,1527,0624,0074)                
         DC    AL2(1643,0937,1550,1394,0685,0055,0362,2498,0902)                
         DC    AL2(0113,0060)                                                   
*                                                                               
         DC    AL1(53),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1689,0775,1947,0560,1312,1837,1493,0603,0077)                
         DC    AL2(1619,0942,1532,1367,0657,0055,0373,2461,0890)                
         DC    AL2(0113,0059)                                                   
*                                                                               
         DC    AL1(53),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1692,0786,1957,0558,1330,1839,1502,0596,0079)                
         DC    AL2(1636,0959,1536,1384,0654,0061,0373,2426,0900)                
         DC    AL2(0109,0059)                                                   
*                                                                               
         DC    AL1(53),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1651,0740,1894,0530,1317,1782,1460,0551,0076)                
         DC    AL2(1610,0972,1524,1360,0622,0053,0350,2334,0857)                
         DC    AL2(0104,0059)                                                   
*                                                                               
         DC    AL1(53),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1641,0763,1857,0509,1324,1760,1431,0506,0070)                
         DC    AL2(1553,0970,1474,1318,0566,0047,0312,2238,0806)                
         DC    AL2(0099,0052)                                                   
*                                                                               
         DC    AL1(53),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1630,0739,1852,0519,1333,1758,1431,0491,0065)                
         DC    AL2(1581,0989,1500,1344,0572,0049,0331,2263,0816)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(53),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1627,0735,1853,0527,1362,1755,1420,0464,0068)                
         DC    AL2(1569,1006,1492,1327,0544,0049,0331,2219,0782)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(53),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1592,0693,1808,0538,1341,1714,1368,0438,0067)                
         DC    AL2(1546,1019,1472,1291,0509,0047,0335,2199,0782)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(53),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1587,0658,1799,0560,1348,1704,1339,0421,0068)                
         DC    AL2(1545,1021,1470,1282,0506,0048,0342,2193,0774)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(53),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1558,0627,1767,0566,1339,1672,1301,0400,0071)                
*        DC    AL2(1522,1006,1448,1260,0500,0047,0348,2142,0779)                
*                                                                               
*        DC    AL1(53),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1563,0603,1774,0583,1358,1683,1295,0389,0065)                
*        DC    AL2(1517,1019,1450,1252,0482,0045,0344,2149,0765)                
*                                                                               
*        DC    AL1(53),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1532,0557,1742,0595,1340,1651,1253,0376,0064)                
*        DC    AL2(1485,1011,1413,1211,0485,0047,0346,2096,0745)                
*                                                                               
* PRESENCE OF NON-ADULTS (ANY UNDER 3)                                          
         DC    AL1(54),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1019,0464,1189,0383,0868,1126,0857,0302,0041)                
         DC    AL2(0991,0635,0942,0812,0346,0029,0187,1205,0395)                
         DC    AL2(0094,0043)                                                   
*                                                                               
         DC    AL1(54),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(0989,0423,1142,0388,0843,1083,0806,0283,0041)                
         DC    AL2(0960,0627,0914,0792,0322,0029,0189,1168,0387)                
         DC    AL2(0092,0038)                                                   
*                                                                               
         DC    AL1(54),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1026,0439,1187,0392,0880,1120,0844,0289,0046)                
         DC    AL2(1010,0658,0951,0827,0338,0036,0195,1201,0411)                
         DC    AL2(0090,0042)                                                   
*                                                                               
         DC    AL1(54),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(0982,0403,1126,0372,0860,1067,0803,0254,0039)                
         DC    AL2(0978,0660,0931,0801,0309,0029,0177,1145,0391)                
         DC    AL2(0085,0039)                                                   
*                                                                               
         DC    AL1(54),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(0985,0428,1121,0345,0856,1063,0812,0250,0041)                
         DC    AL2(0949,0654,0905,0778,0285,0029,0157,1088,0366)                
         DC    AL2(0078,0034)                                                   
*                                                                               
         DC    AL1(54),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(0966,0413,1108,0348,0856,1054,0804,0238,0036)                
         DC    AL2(0947,0668,0908,0790,0278,0027,0181,1083,0389)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(54),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(0984,0417,1132,0358,0889,1075,0821,0227,0038)                
         DC    AL2(0971,0684,0927,0800,0275,0029,0172,1069,0349)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(54),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(0957,0386,1092,0368,0853,1036,0769,0224,0038)                
         DC    AL2(0951,0682,0911,0768,0260,0027,0167,1042,0339)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(54),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(0949,0363,1081,0382,0853,1025,0744,0212,0038)                
         DC    AL2(0948,0682,0907,0759,0256,0027,0169,1035,0331)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(54),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(0940,0352,1075,0379,0862,1020,0736,0198,0041)                
*        DC    AL2(0943,0681,0902,0757,0253,0026,0165,1059,0356)                
*                                                                               
*        DC    AL1(54),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(0930,0329,1064,0387,0863,1011,0720,0187,0036)                
*        DC    AL2(0923,0684,0886,0735,0230,0025,0161,1040,0344)                
*                                                                               
*        DC    AL1(54),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(0935,0308,1068,0413,0869,1019,0711,0188,0032)                
*        DC    AL2(0933,0687,0891,0726,0237,0028,0179,1057,0352)                
*                                                                               
* PRESENCE OF NON-ADULTS (ANY 6-11)                                             
         DC    AL1(55),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1702,0893,1912,0551,0875,1790,1695,1000,0079)                
         DC    AL2(1634,0587,1502,1436,1020,0069,0842,2940,2222)                
         DC    AL2(0067,0075)                                                   
*                                                                               
         DC    AL1(55),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1680,0865,1905,0549,0900,1781,1673,0970,0080)                
         DC    AL2(1600,0606,1480,1396,0974,0066,0811,2902,2196)                
         DC    AL2(0068,0079)                                                   
*                                                                               
         DC    AL1(55),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1712,0885,1946,0564,0939,1816,1708,0967,0085)                
         DC    AL2(1648,0632,1518,1432,0991,0074,0841,2879,2161)                
         DC    AL2(0071,0081)                                                   
*                                                                               
         DC    AL1(55),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1646,0841,1883,0530,0920,1759,1662,0924,0082)                
         DC    AL2(1590,0606,1473,1397,0962,0065,0798,2831,2154)                
         DC    AL2(0071,0074)                                                   
*                                                                               
         DC    AL1(55),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1614,0849,1811,0487,0899,1698,1594,0874,0080)                
         DC    AL2(1536,0607,1428,1356,0906,0059,0712,2731,2126)                
         DC    AL2(0065,0074)                                                   
*                                                                               
         DC    AL1(55),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1607,0826,1808,0503,0919,1688,1588,0852,0079)                
         DC    AL2(1546,0618,1431,1352,0904,0066,0738,2724,2102)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(55),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1566,0790,1757,0504,0905,1656,1542,0821,0071)                
         DC    AL2(1494,0609,1385,1308,0863,0060,0730,2649,2065)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(55),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1485,0723,1683,0483,0884,1582,1480,0764,0070)                
         DC    AL2(1427,0584,1326,1241,0824,0059,0714,2586,2019)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(55),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1468,0684,1656,0490,0881,1555,1449,0740,0072)                
         DC    AL2(1398,0577,1297,1211,0802,0059,0722,2550,1982)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(55),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1428,0654,1613,0499,0882,1513,1397,0697,0071)                
*        DC    AL2(1368,0571,1271,1190,0775,0057,0720,2525,1977)                
*                                                                               
*        DC    AL1(55),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1432,0616,1614,0519,0894,1518,1397,0687,0068)                
*        DC    AL2(1378,0604,1281,1200,0756,0051,0753,2471,1903)                
*                                                                               
*        DC    AL1(55),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1458,0613,1669,0554,0921,1563,1433,0709,0073)                
*        DC    AL2(1415,0619,1301,1205,0776,0062,0795,2457,1904)                
*                                                                               
* PRESENCE OF NON-ADULTS (ANY 12-17)                                            
         DC    AL1(56),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1565,0952,1844,1275,0505,1659,1511,1293,0100)                
         DC    AL2(1645,0449,1415,1263,1163,0107,2126,1041,0788)                
         DC    AL2(0158,0176)                                                   
*                                                                               
         DC    AL1(56),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1498,0892,1799,1271,0527,1621,1457,1231,0093)                
         DC    AL2(1607,0463,1383,1206,1111,0109,2087,0980,0736)                
         DC    AL2(0159,0186)                                                   
*                                                                               
         DC    AL1(56),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1421,0847,1716,1235,0507,1542,1388,1170,0094)                
         DC    AL2(1539,0435,1329,1160,1073,0103,2044,0945,0718)                
         DC    AL2(0156,0177)                                                   
*                                                                               
         DC    AL1(56),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1406,0838,1703,1214,0515,1525,1380,1146,0095)                
         DC    AL2(1534,0435,1320,1161,1072,0105,2010,0924,0707)                
         DC    AL2(0150,0181)                                                   
*                                                                               
         DC    AL1(56),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1476,0905,1747,1205,0490,1573,1417,1215,0096)                
         DC    AL2(1567,0422,1343,1190,1119,0105,1975,0875,0677)                
         DC    AL2(0162,0181)                                                   
*                                                                               
         DC    AL1(56),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1558,0957,1872,1231,0563,1677,1500,1266,0102)                
         DC    AL2(1685,0488,1423,1240,1149,0112,1957,0958,0735)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(56),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1581,0930,1897,1249,9572,1687,1512,1274,0114)                
         DC    AL2(1727,0514,1472,1275,1180,0124,1990,0965,0744)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(56),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1585,0918,1935,1263,0601,1717,1532,1281,0118)                
         DC    AL2(1729,0509,1472,1268,1193,0126,1988,0962,0740)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(56),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1567,0872,1907,1280,0595,1685,1498,1255,0124)                
         DC    AL2(1689,0506,1432,1226,1155,0128,2025,0951,0728)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(56),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1545,0846,1875,1298,0586,1657,1472,1235,0121)                
*        DC    AL2(1664,0500,1401,1201,1134,0130,2068,0937,0718)                
*                                                                               
*        DC    AL1(56),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1525,0816,1855,1322,0580,1633,1450,1229,0117)                
*        DC    AL2(1682,0528,1408,1177,1123,0140,2107,0909,0695)                
*                                                                               
*        DC    AL1(56),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(1528,0771,1885,1365,0606,1645,1446,1229,0125)                
*        DC    AL2(1705,0550,1411,1167,1120,0152,2137,0898,0695)                
*                                                                               
* INCOME UNDER 15000                                                            
         DC    AL1(61),AL1(4+20*2),AL1(88,10)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(61),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2440,0470,2283,0485,0697,1051,0849,0752,1134)                
         DC    AL2(1436,0544,0791,0616,0488,0579,0374,0826,0453)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(61),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2576,0482,2378,0527,0741,1113,0895,0800,1160)                
         DC    AL2(1538,0591,0855,0659,0531,0611,0414,0877,0478)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(61),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2656,0537,2463,0568,0784,1166,0941,0831,1183)                
*        DC    AL2(1623,0637,0904,0686,0547,0640,0465,0909,0510)                
*                                                                               
*        DC    AL1(61),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2857,0588,2677,0648,0890,1310,1030,0896,1251)                
*        DC    AL2(1785,0729,1019,0771,0591,0686,0513,0993,0547)                
*                                                                               
*        DC    AL1(61),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*                                                                               
* INCOME 20,000+                                                                
         DC    AL1(62),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(6529,3812,7020,1665,2413,4877,4562,3787,1588)                
         DC    AL2(7104,2535,5005,4629,3811,1554,1647,2758,1659)                
         DC    AL2(0349,0370)                                                   
*                                                                               
         DC    AL1(62),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(6575,3724,7058,1704,2490,4918,4553,3755,1598)                
         DC    AL2(7134,2612,5024,4600,3752,1570,1631,2759,1647)                
         DC    AL2(0370,0399)                                                   
*                                                                               
         DC    AL1(62),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(6569,3632,7046,1712,2536,4914,4517,3680,1609)                
         DC    AL2(7102,2745,5033,4568,3683,1551,1622,2750,1639)                
         DC    AL2(0370,0399)                                                   
*                                                                               
         DC    AL1(62),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(6398,3511,6852,1705,2562,4826,4397,3518,1521)                
         DC    AL2(6928,2672,4971,4488,3564,1457,1539,2671,1614)                
         DC    AL2(0382,0407)                                                   
*                                                                               
         DC    AL1(62),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(6212,3551,6655,1623,2488,4687,4288,3424,1485)                
         DC    AL2(6698,2553,4829,4385,3463,1390,1510,2524,1544)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(62),AL1(4+20*2),AL1(88,10)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(62),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(5512,3074,6019,1579,2365,4250,3817,3025,1339)                
         DC    AL2(6103,2484,4404,3908,3078,1271,1458,2283,1379)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(62),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(5232,2899,5790,1566,2307,4091,3643,2891,1289)                
         DC    AL2(5868,2410,4230,3732,2951,1226,1443,2186,1312)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(62),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(4985,2731,5563,1559,2247,3930,3470,2757,1234)                
*        DC    AL2(5654,2346,4076,3586,2833,1175,1426,2092,1271)                
*                                                                               
*        DC    AL1(62),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(4642,2502,5205,1507,2110,3675,3238,2612,1142)                
*        DC    AL2(5338,2224,3828,3333,2689,1113,1391,1913,1144)                
*                                                                               
*        DC    AL1(62),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(4493,2354,5041,1541,2092,3581,3114,2497,1083)                
*        DC    AL2(5189,2204,3721,3197,2580,1079,1419,1873,1134)                
*                                                                               
* INCOME 30,000+                                                                
         DC    AL1(63),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(5083,3208,5608,1346,1915,4042,3827,3186,1100)                
         DC    AL2(5824,2037,4189,3929,3296,1155,1361,2220,1338)                
         DC    AL2(0286,0307)                                                   
*                                                                               
         DC    AL1(63),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(5026,3096,5566,1363,1957,4029,3779,3123,1081)                
         DC    AL2(5753,2068,4142,3851,3203,1138,1346,2188,1311)                
         DC    AL2(0302,0341)                                                   
*                                                                               
         DC    AL1(63),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(5054,3010,5568,1367,1995,4008,3723,3034,1128)                
         DC    AL2(5779,2117,4172,3828,3155,1158,1334,2174,1303)                
         DC    AL2(0302,0341)                                                   
*                                                                               
         DC    AL1(63),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(4911,2894,5392,1356,1996,3919,3618,2909,1052)                
         DC    AL2(5618,2112,4097,3745,3056,1083,1312,2087,1273)                
         DC    AL2(0308,0345)                                                   
*                                                                               
         DC    AL1(63),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(4695,2866,5164,1283,1909,3752,3472,2786,1011)                
         DC    AL2(5357,2039,3938,3607,2915,1008,1228,1926,1192)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(63),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(4457,2745,4973,1260,1891,3638,3329,2657,0960)                
         DC    AL2(5140,1990,3784,3438,2781,0960,1175,1878,1142)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(63),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(4227,2548,4742,1229,1809,3444,3136,2515,0945)                
         DC    AL2(4938,1931,3622,3261,2654,0939,1159,1748,1060)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(63),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(3905,2344,4411,1170,1696,3189,2905,2338,0886)                
         DC    AL2(4603,1818,3360,3007,2458,0891,1120,1618,0993)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(63),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(3595,2158,4130,1131,1611,2991,2704,2177,0826)                
         DC    AL2(4312,1715,3145,2802,2303,0836,1082,1506,0919)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(63),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(3323,1981,3852,1092,1500,2764,2482,2023,0782)                
*        DC    AL2(4030,1602,2921,2593,2154,0789,1027,1367,0855)                
*                                                                               
*        DC    AL1(63),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(2969,1755,3470,1019,1344,2495,2230,1854,0692)                
*        DC    AL2(3662,1455,2640,2319,1976,0715,0961,1167,0723)                
*                                                                               
*        DC    AL1(63),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(2763,1589,3255,1010,1287,2345,2073,1722,0643)                
*        DC    AL2(3430,1394,2470,2127,1822,0671,0960,1094,0689)                
*                                                                               
* INCOME 40,000+                                                                
         DC    AL1(64),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(3828,2563,4334,1046,1442,3177,3048,2569,0770)                
         DC    AL2(4582,1560,3322,3056,2702,0849,1084,1698,1028)                
         DC    AL2(0247,0253)                                                   
*                                                                               
         DC    AL1(64),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(3773,2478,4306,1065,1472,3170,2992,2518,0765)                
         DC    AL2(4507,1567,3260,3056,2618,0845,1056,1643,0994)                
         DC    AL2(0247,0275)                                                   
*                                                                               
         DC    AL1(64),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(3696,2341,4200,1045,1465,3066,2864,2385,0787)                
         DC    AL2(4317,1665,3224,2975,2526,0841,1020,1582,0952)                
         DC    AL2(0247,0275)                                                   
*                                                                               
         DC    AL1(64),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(3610,2244,4085,1037,1461,2994,2783,2292,0763)                
         DC    AL2(4317,1562,3144,2899,2466,0809,1016,1510,0931)                
         DC    AL2(0248,0277)                                                   
*                                                                               
         DC    AL1(64),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(3341,2182,3805,0968,1366,2804,2603,2136,0691)                
         DC    AL2(3991,1453,2938,2698,2277,0724,0932,1321,0826)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(64),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(3078,2022,3366,0924,1309,2635,2418,1881,0642)                
         DC    AL2(3726,1382,2737,2496,2112,0671,0854,1249,0771)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(64),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(2828,1822,3285,0863,1205,2408,2205,1825,0614)                
         DC    AL2(3470,1299,2535,2287,1950,0642,0809,1112,0677)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(64),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2564,1640,2993,0795,1095,2164,1987,1663,0583)                
         DC    AL2(3169,1194,2291,2052,1774,0614,0757,0996,0619)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(64),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2304,1479,2741,0753,1019,1985,1808,1514,0531)                
         DC    AL2(2904,1101,2096,1869,1627,0564,0716,0904,0560)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(64),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(2082,1322,2499,0723,0923,1794,1621,1380,0484)                
*        DC    AL2(2660,1005,1905,1692,1489,0518,0670,0780,0505)                
*                                                                               
*        DC    AL1(64),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1753,1105,2142,0647,0784,1539,1380,1198,0410)                
*        DC    AL2(2292,0871,1633,1419,1288,0445,0602,0635,0404)                
*                                                                               
*        DC    AL1(64),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*                                                                               
* INCOME 50,000+                                                                
         DC    AL1(65),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2812,1958,3244,0781,1040,2383,2313,1988,0547)                
         DC    AL2(3486,1147,2518,2389,2118,0634,0813,1213,0743)                
         DC    AL2(0175,0202)                                                   
*                                                                               
         DC    AL1(65),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2736,1870,3200,0787,1051,2360,2237,1930,0554)                
         DC    AL2(3391,1127,2429,2288,2033,0632,0772,1147,0698)                
         DC    AL2(0193,0215)                                                   
*                                                                               
         DC    AL1(65),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2652,1752,3104,0779,1044,2268,2122,1816,0565)                
         DC    AL2(3290,1125,2377,2195,1934,0616,0743,1087,0644)                
         DC    AL2(0193,0215)                                                   
*                                                                               
         DC    AL1(65),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2552,1649,2976,0758,1022,2179,2036,1723,0541)                
         DC    AL2(3165,1103,2287,2118,1848,0588,0732,1047,0644)                
         DC    AL2(0189,0212)                                                   
*                                                                               
         DC    AL1(65),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2304,1569,2712,0692,0937,1995,1850,1565,0486)                
         DC    AL2(2856,1015,2086,1910,1660,0516,0643,0849,0542)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(65),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(2033,1383,2438,0654,0862,1805,1644,1408,0426)                
         DC    AL2(2567,0926,1870,1690,1491,0481,0584,0784,0475)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(65),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1855,1251,2223,0589,0793,1624,1487,1269,0410)                
         DC    AL2(2356,0851,1708,1531,1360,0440,0537,0677,0414)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(65),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* INCOME 60,000+                                                                
         DC    AL1(66),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1983,1426,2333,0569,0728,1713,1669,1465,0378)                
         DC    AL2(2529,0810,1803,1713,1562,0466,0580,0834,0509)                
         DC    AL2(0133,0151)                                                   
*                                                                               
         DC    AL1(66),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1959,1375,2339,0577,0752,1712,1617,1428,0408)                
         DC    AL2(2491,0799,1756,1655,1522,0476,0538,0788,0475)                
         DC    AL2(0147,0154)                                                   
*                                                                               
         DC    AL1(66),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1869,1272,2241,0562,0723,1626,1525,1340,0408)                
         DC    AL2(2388,0793,1701,1569,1426,0459,0519,0737,0443)                
         DC    AL2(0147,0162)                                                   
*                                                                               
         DC    AL1(66),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1778,1174,2104,0541,0649,1533,1430,1250,0381)                
         DC    AL2(2277,0781,1634,1501,1344,0426,0507,0685,0429)                
         DC    AL2(0139,0159)                                                   
*                                                                               
         DC    AL1(66),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1531,1056,1856,0477,0613,1354,1247,1097,0337)                
         DC    AL2(1963,0687,1414,1280,1148,0364,0418,0524,0336)                
         DC    AL2(0133,0148)                                                   
*                                                                               
         DC    AL1(66),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1320,0921,1626,0451,0566,1205,1082,0866,0279)                
         DC    AL2(1721,0606,1242,1119,1018,0309,0378,0470,0292)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(66),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1154,0786,1422,0380,0496,1029,0943,0822,0262)                
         DC    AL2(1508,0532,1078,0955,0882,0289,0334,0398,0240)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(66),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* INCOME 20,000-                                                                
         DC    AL1(68),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(3011,0595,2763,0583,0805,1320,1107,0973,1310)                
         DC    AL2(1820,0637,1016,0840,0665,0706,0480,1060,0563)                
         DC    AL2(0134,0108)                                                   
*                                                                               
         DC    AL1(68),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2845,0542,2618,0548,0780,1245,1045,0893,1251)                
         DC    AL2(1693,0601,0959,0782,0615,0653,0456,1008,0549)                
         DC    AL2(0119,0093)                                                   
*                                                                               
         DC    AL1(68),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2741,0533,2519,0519,0751,1174,0973,0836,1235)                
         DC    AL2(1648,0594,0912,0738,0572,0663,0423,0937,0522)                
         DC    AL2(0110,0091)                                                   
*                                                                               
         DC    AL1(68),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2812,0595,2631,0524,0772,1214,1016,0891,1298)                
         DC    AL2(1717,0617,0929,0742,0582,0715,0417,0961,0539)                
         DC    AL2(0120,0100)                                                   
*                                                                               
         DC    AL1(68),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(3098,0704,2903,0581,0857,1347,1123,0990,1429)                
         DC    AL2(1925,0721,1070,0855,0649,0773,0466,1034,0582)                
         DC    AL2(0131,0105)                                                   
*                                                                               
         DC    AL1(68),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* UPPER INCOME DEMOS (30,000+ WITH NON-ADULTS)                                  
         DC    AL1(71),AL1(4+20*2),AL1(88,10)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(71),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1756,1074,2092,0828,0939,1916,1711,1105,0103)                
         DC    AL2(2069,0811,1846,1672,1232,0110,1120,1618,0993)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(71),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1636,0992,1980,0807,0906,1811,1605,1029,0099)                
         DC    AL2(1965,0783,1750,1579,1158,0106,1082,1506,0919)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(71),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1502,0896,1816,0769,0834,1650,1451,0937,0100)                
*        DC    AL2(1823,0729,1618,1460,1072,0101,1072,1367,0855)                
*                                                                               
*        DC    AL1(71),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1332,0785,1618,0714,0730,1476,1295,0853,0080)                
*        DC    AL2(1637,0649,1438,1285,0969,0094,0961,1167,0723)                
*                                                                               
*        DC    AL1(71),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*                                                                               
* UPPER INCOME DEMOS (30,000+ HOH POM)                                          
         DC    AL1(72),AL1(4+20*2),AL1(88,10)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(72),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(1366,0812,1461,0369,0576,1149,1080,0827,0197)                
         DC    AL2(1530,0580,1186,1090,0905,0223,0379,0585,0358)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(72),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(1284,0768,1397,0366,0560,1100,1026,0783,0188)                
         DC    AL2(1468,0564,1137,1042,0863,0214,0373,0556,0337)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(72),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1402,0833,1549,0443,0612,1202,1110,0876,0214)                
*        DC    AL2(1648,0624,1258,1159,0976,0249,0445,0611,0389)                
*                                                                               
*        DC    AL1(72),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1313,0761,1478,0444,0605,1156,1050,0815,0202)                
*        DC    AL2(1574,0607,1197,1090,0921,0234,0445,0562,0346)                
*                                                                               
*        DC    AL1(72),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*                                                                               
* UPPER INCOME DEMOS (30,000+ HOH 1+ YRS COLL)                                  
         DC    AL1(73),AL1(4+20*2),AL1(88,10)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(73),AL1(4+20*2),AL1(87,10)                                   
         DC    AL2(2183,1244,2316,0566,0931,1763,1636,1221,0397)                
         DC    AL2(2443,0959,1871,1713,1337,0405,0576,0959,0578)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(73),AL1(4+20*2),AL1(86,10)                                   
         DC    AL2(2007,1147,2169,0548,0881,1650,1520,1137,0373)                
         DC    AL2(2284,0903,1747,1595,1250,0380,0555,0889,0532)                
         DC    AL2(0,0)                                                         
*                                                                               
*        DC    AL1(73),AL1(4+20*2),AL1(85,10)                                   
*        DC    AL2(1832,1038,2002,0530,0818,1518,1391,1045,0340)                
*        DC    AL2(2113,0842,1612,1470,1156,0347,0529,0818,0507)                
*                                                                               
*        DC    AL1(73),AL1(4+20*2),AL1(84,10)                                   
*        DC    AL2(1680,0925,1860,0518,0767,1413,1279,0969,0317)                
*        DC    AL2(1960,0782,1484,1348,1074,0325,0518,0723,0441)                
*                                                                               
*        DC    AL1(73),AL1(4+20*2),AL1(84,01)                                   
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*        DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
*                                                                               
* UPPER INCOME DEMOS (40,000+ WITH NON-ADULTS)                                  
         DC    AL1(74),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1677,1142,1984,0755,0774,1837,1682,1174,0076)                
         DC    AL2(2001,0677,1791,1683,1296,0096,1083,1698,1028)                
         DC    AL2(0124,0122)                                                   
*                                                                               
         DC    AL1(74),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1636,1095,1977,0767,0795,1827,1644,1145,0081)                
         DC    AL2(1950,0679,1745,1612,1246,0098,1056,1643,0994)                
         DC    AL2(0133,0136)                                                   
*                                                                               
         DC    AL1(74),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1576,1029,1907,0729,0782,1760,1591,1086,0085)                
         DC    AL2(1904,0678,1706,1566,1198,0097,1019,1582,0953)                
         DC    AL2(0125,0142)                                                   
*                                                                               
         DC    AL1(74),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1540,0977,1858,0722,0777,1716,1552,1046,0081)                
         DC    AL2(1862,0670,1672,1534,1169,0088,1016,1510,0932)                
         DC    AL2(0124,0142)                                                   
*                                                                               
         DC    AL1(74),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1460,0985,1760,0683,0730,1639,1463,0999,0071)                
         DC    AL2(1745,0612,1567,1440,1112,0080,0932,1321,0826)                
         DC    AL2(0127,0135)                                                   
*                                                                               
         DC    AL1(74),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1372,0917,1682,0649,0710,1552,1380,0936,0072)                
         DC    AL2(1670,0613,1487,1357,1033,0083,0854,1249,0771)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(74),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1266,0828,1544,0604,0649,1422,1269,0864,0068)                
         DC    AL2(1551,0570,1381,1250,0963,0077,0809,1112,0677)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(74),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* UPPER INCOME DEMOS (40,000+ HOH POM)                                          
         DC    AL1(75),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1501,1004,1623,0383,0535,1276,1263,1039,0187)                
         DC    AL2(1689,0538,1280,1257,1098,0234,0422,0698,0419)                
         DC    AL2(0080,0085)                                                   
*                                                                               
         DC    AL1(75),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1475,0973,1626,0396,0550,1290,1243,1023,0188)                
         DC    AL2(1652,0537,1252,1216,1059,0231,0414,0668,0393)                
         DC    AL2(0092,0092)                                                   
*                                                                               
         DC    AL1(75),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1468,0941,1606,0395,0552,1260,1209,0992,0198)                
         DC    AL2(1670,0563,1279,1223,1051,0236,0400,0657,0392)                
         DC    AL2(0091,0101)                                                   
*                                                                               
         DC    AL1(75),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1451,0908,1575,0395,0575,1246,1189,0943,0192)                
         DC    AL2(1654,0571,1268,1213,1030,0234,0412,0625,0380)                
         DC    AL2(0091,0100)                                                   
*                                                                               
         DC    AL1(75),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1427,0942,1593,0408,0589,1256,1173,0936,0206)                
         DC    AL2(1633,0568,1252,1186,1013,0235,0394,0574,0356)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(75),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1278,0829,1427,0371,0537,1129,1053,0839,0178)                
         DC    AL2(1485,0519,1136,1080,0924,0210,0357,0532,0324)                
         DC    AL2(0105,0102)                                                   
*                                                                               
         DC    AL1(75),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1155,0760,1303,0337,0491,1035,0968,0765,0162)                
         DC    AL2(1348,0472,1032,0970,0838,0192,0336,0495,0300)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(75),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* UPPER INCOME DEMOS (40,000+ HOH 1+ YRS COL )                                  
         DC    AL1(76),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2488,1597,2727,0634,0913,2069,2002,1634,0429)                
         DC    AL2(2851,0937,2123,2041,1732,0482,0681,1156,0690)                
         DC    AL2(0134,0144)                                                   
*                                                                               
         DC    AL1(76),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2403,1511,2653,0626,0900,2019,1915,1576,0423)                
         DC    AL2(2734,0903,2025,1932,1645,0471,0643,1081,0641)                
         DC    AL2(0143,0148)                                                   
*                                                                               
         DC    AL1(76),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2256,1354,2463,0588,0851,1855,1756,1425,0413)                
         DC    AL2(2570,0866,1917,1814,1521,0446,0605,0989,0585)                
         DC    AL2(0130,0145)                                                   
*                                                                               
         DC    AL1(76),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2198,1306,2388,0575,0686,1815,1700,1349,0400)                
         DC    AL2(2469,0858,1845,1736,1444,0432,0590,0968,0595)                
         DC    AL2(0132,0141)                                                   
*                                                                               
         DC    AL1(76),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2017,1242,2214,0541,0818,1693,1581,1237,0358)                
         DC    AL2(2282,0807,1727,1619,1335,0398,0534,0847,0522)                
         DC    AL2(0133,0137)                                                   
*                                                                               
         DC    AL1(76),AL1(4+20*2),AL1(89,09)                                   
         DC    AL2(1851,1142,2047,0518,0771,1579,1459,1139,0320)                
         DC    AL2(2128,0758,1614,1518,1251,0343,0509,0783,0481)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(76),AL1(4+20*2),AL1(88,09)                                   
         DC    AL2(1739,1066,1927,0488,0734,1477,1368,1067,0312)                
         DC    AL2(2038,0743,1545,1425,1179,0338,0485,0734,0440)                
         DC    AL2(0,0)                                                         
*                                                                               
         DC    AL1(76),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* DUAL INCOME HH - 40K+                                                         
         DC    AL1(77),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1644,1776,1956,0537,0732,1634,1555,1191,0144)                
         DC    AL2(2068,0723,1635,1566,1316,0224,0572,0760,0473)                
         DC    AL2(0120,0131)                                                   
*                                                                               
         DC    AL1(77),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1598,1730,1926,0539,0739,1624,1509,1150,0146)                
         DC    AL2(1998,0709,1576,1508,1260,0215,0549,0737,0464)                
         DC    AL2(0121,0129)                                                   
*                                                                               
         DC    AL1(77),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1569,1673,1877,0527,0747,1573,1458,1093,0148)                
         DC    AL2(1951,0708,1543,1460,1213,0214,0525,0708,0442)                
         DC    AL2(0128,0136)                                                   
*                                                                               
         DC    AL1(77),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1567,1657,1870,0541,0747,1559,1433,1082,0153)                
         DC    AL2(1940,0713,1535,1450,1193,0212,0527,0669,0428)                
         DC    AL2(0139,0143)                                                   
*                                                                               
         DC    AL1(77),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1504,1615,1800,0508,0700,1502,1389,1056,0152)                
         DC    AL2(1848,0672,1470,1381,1144,0203,0507,0611,0403)                
         DC    AL2(0131,0137)                                                   
*                                                                               
         DC    AL1(77),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* INCOME 20-29999                                                               
         DC    AL1(80),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1446,0604,1412,0319,0498,0835,0745,0601,0488)                
         DC    AL2(1280,0498,0816,0700,0515,0399,0286,0538,0321)                
         DC    AL2(0063,0063)                                                   
*                                                                               
         DC    AL1(80),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1549,0628,1492,0341,0532,0889,0774,0633,0517)                
         DC    AL2(1381,0544,0882,0749,0550,0432,0285,0571,0337)                
         DC    AL2(0070,0067)                                                   
*                                                                               
         DC    AL1(80),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1515,0622,1478,0345,0541,0906,0794,0646,0481)                
         DC    AL2(1323,0538,0861,0740,0528,0393,0288,0576,0336)                
         DC    AL2(0068,0058)                                                   
*                                                                               
         DC    AL1(80),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1487,0617,1460,0349,0566,0907,0779,0609,0469)                
         DC    AL2(1310,0560,0874,0743,0508,0374,0281,0584,0341)                
         DC    AL2(0074,0062)                                                   
*                                                                               
         DC    AL1(80),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1517,0685,1491,0340,0579,0935,0816,0638,0474)                
         DC    AL2(1341,0563,0891,0778,0548,0382,0282,0598,0352)                
         DC    AL2(0069,0064)                                                   
*                                                                               
         DC    AL1(80),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* INCOME 30-39999                                                               
         DC    AL1(81),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1255,0645,1274,0300,0473,0865,0779,0617,0330)                
         DC    AL2(1242,0477,0867,0786,0594,0306,0277,0522,0310)                
         DC    AL2(0056,0054)                                                   
*                                                                               
         DC    AL1(81),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1253,0618,1260,0299,0485,0859,0787,0605,0316)                
         DC    AL2(1256,0501,0882,0795,0585,0293,0290,0545,0317)                
         DC    AL2(0052,0058)                                                   
*                                                                               
         DC    AL1(81),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1358,0669,1368,0322,0530,0942,0859,0649,0341)                
         DC    AL2(1343,0542,0948,0853,0629,0317,0314,0592,0351)                
         DC    AL2(0055,0060)                                                   
*                                                                               
         DC    AL1(81),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1301,0650,1307,0319,0535,0925,0835,0617,0298)                
         DC    AL2(1301,0550,0953,0846,0610,0274,0296,0577,0342)                
         DC    AL2(0060,0068)                                                   
*                                                                               
         DC    AL1(81),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1354,0684,1359,0315,0543,0948,0868,0650,0321)                
         DC    AL2(1366,0586,0999,0910,0638,0284,0296,0605,0366)                
         DC    AL2(0059,0065)                                                   
*                                                                               
         DC    AL1(81),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* INCOME 40-49999                                                               
         DC    AL1(82),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(1016,0605,1090,0265,0402,0794,0735,0581,0223)                
         DC    AL2(1096,0413,0804,0754,0584,0215,0271,0485,0285)                
         DC    AL2(0055,0051)                                                   
*                                                                               
         DC    AL1(82),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(1037,0608,1106,0278,0421,0810,0755,0588,0211)                
         DC    AL2(1167,0440,0831,0768,0585,0213,0283,0496,0297)                
         DC    AL2(0053,0057)                                                   
*                                                                               
         DC    AL1(82),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1044,0589,1096,0266,0421,0798,0742,0569,0222)                
         DC    AL2(1146,0450,0847,0780,0592,0225,0277,0495,0295)                
         DC    AL2(0054,0061)                                                   
*                                                                               
         DC    AL1(82),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1058,0595,1109,0279,0439,0815,0747,0569,0222)                
         DC    AL2(1152,0459,0857,0781,0598,0221,0284,0463,0287)                
         DC    AL2(0059,0065)                                                   
*                                                                               
         DC    AL1(82),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1037,0613,1093,0276,0429,0809,0753,0571,0205)                
         DC    AL2(1135,0438,0852,0787,0617,0208,0289,0472,0284)                
         DC    AL2(0060,0061)                                                   
*                                                                               
         DC    AL1(82),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* INCOME 50-59999                                                               
         DC    AL1(83),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(0829,0532,0911,0212,0312,0670,0644,0523,0169)                
         DC    AL2(0957,0337,0715,0676,0556,0168,0233,0379,0234)                
         DC    AL2(0042,0051)                                                   
*                                                                               
         DC    AL1(83),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(0777,0495,0861,0210,0300,0647,0620,0502,0146)                
         DC    AL2(0900,0329,0673,0633,0512,0156,0234,0359,0222)                
         DC    AL2(0042,0053)                                                   
*                                                                               
         DC    AL1(83),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(0783,0480,0863,0217,0321,0642,0597,0476,0157)                
         DC    AL2(0902,0332,0676,0626,0508,0157,0224,0350,0214)                
         DC    AL2(0046,0052)                                                   
*                                                                               
         DC    AL1(83),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(0774,0475,0872,0217,0328,0646,0606,0473,0160)                
         DC    AL2(0888,0322,0653,0617,0504,0162,0225,0362,0215)                
         DC    AL2(0050,0053)                                                   
*                                                                               
         DC    AL1(83),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(0773,0513,0857,0216,0324,0641,0603,0468,0149)                
         DC    AL2(0893,0328,0672,0631,0512,0152,0225,0326,0206)                
         DC    AL2(0052,0051)                                                   
*                                                                               
         DC    AL1(83),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* EASTERN TZ                                                                    
         DC    AL1(91),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(4733,2209,4908,1086,1575,3049,2800,2386,1511)                
         DC    AL2(4393,1526,2915,2656,2211,1156,0997,1749,1013)                
         DC    AL2(0238,0238)                                                   
*                                                                               
         DC    AL1(91),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(4679,2136,4863,1091,1603,3039,2764,2335,1489)                
         DC    AL2(4353,1550,2903,2618,2162,1140,0981,1730,1004)                
         DC    AL2(0239,0235)                                                   
*                                                                               
         DC    AL1(91),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(4646,2089,4835,1087,1621,3017,2726,2281,1496)                
         DC    AL2(4336,1574,2897,2593,2117,1142,0967,1704,0994)                
         DC    AL2(0238,0237)                                                   
*                                                                               
         DC    AL1(91),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(4608,2077,4807,1089,1648,3002,2695,2233,1491)                
         DC    AL2(4294,1597,2882,2563,2069,1123,0954,1683,0993)                
         DC    AL2(0250,0248)                                                   
*                                                                               
         DC    AL1(91),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(4634,2142,4810,1080,1632,2969,2686,2247,1525)                
         DC    AL2(4248,1584,2852,2555,2057,1109,0979,1689,1028)                
         DC    AL2(0246,0240)                                                   
*                                                                               
         DC    AL1(91),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* CENTRAL TZ                                                                    
         DC    AL1(92),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2772,1268,2782,0669,0925,1763,1610,1345,0822)                
         DC    AL2(2533,0906,1710,1550,1268,0639,0652,1164,0687)                
         DC    AL2(0143,0141)                                                   
*                                                                               
         DC    AL1(92),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2727,1225,2744,0668,0936,1748,1582,1310,0806)                
         DC    AL2(2499,0915,1694,1521,1234,0628,0638,1146,0677)                
         DC    AL2(0143,0142)                                                   
*                                                                               
         DC    AL1(92),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(2687,1191,2708,0660,0938,1722,1548,1270,0806)                
         DC    AL2(2471,0922,1678,1495,1199,0625,0625,1120,0666)                
         DC    AL2(0141,0142)                                                   
*                                                                               
         DC    AL1(92),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(2660,1663,2688,0660,0953,1711,1528,1240,0802)                
         DC    AL2(2444,0935,1667,1475,1169,0613,0615,1105,0665)                
         DC    AL2(0148,0149)                                                   
*                                                                               
         DC    AL1(92),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(2732,1225,2759,0633,0981,1753,1552,1253,0834)                
         DC    AL2(2505,0985,1726,1514,1173,0620,0591,1098,0648)                
         DC    AL2(0154,0152)                                                   
*                                                                               
         DC    AL1(92),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* CENTRAL TZ                                                                    
         DC    AL1(93),AL1(4+20*2),AL1(94,09)                                   
         DC    AL2(2035,0931,2094,0493,0718,1384,1269,1029,0565)                
         DC    AL2(1998,0738,1395,1263,0997,0464,0477,0905,0522)                
         DC    AL2(0101,0104)                                                   
*                                                                               
         DC    AL1(93),AL1(4+20*2),AL1(93,09)                                   
         DC    AL2(2014,0904,2069,0493,0729,1376,1250,1003,0554)                
         DC    AL2(1975,0748,1386,1243,0971,0455,0467,0891,0515)                
         DC    AL2(0101,0105)                                                   
*                                                                               
         DC    AL1(93),AL1(4+20*2),AL1(92,09)                                   
         DC    AL2(1977,0866,2021,0485,0728,1348,1215,0964,0542)                
         DC    AL2(1942,0754,1370,1216,0938,0447,0453,0863,0501)                
         DC    AL2(0100,0105)                                                   
*                                                                               
         DC    AL1(93),AL1(4+20*2),AL1(91,09)                                   
         DC    AL2(1942,0866,1989,0480,0732,1329,1191,0935,0534)                
         DC    AL2(1907,0757,1350,1193,0908,0435,0442,0844,0496)                
         DC    AL2(0104,0109)                                                   
*                                                                               
         DC    AL1(93),AL1(4+20*2),AL1(90,09)                                   
         DC    AL2(1953,0888,1989,0462,0741,1312,1172,0914,0555)                
         DC    AL2(1869,0755,1322,1171,0882,0434,0405,0771,0450)                
         DC    AL2(0103,0102)                                                   
*                                                                               
         DC    AL1(93),AL1(4+20*2),AL1(84,01)                                   
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* PRESENCE OF VCR                                                               
         DC    AL1(101),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(7575,3901,7971,1908,2756,5416,5009,4150,1965)                
         DC    AL2(7506,2733,5224,4787,3875,1712,1859,3313,1935)                
         DC    AL2(0394,0405)                                                   
*                                                                               
         DC    AL1(101),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(7282,3675,7625,1895,2765,5309,4852,3924,1758)                
         DC    AL2(7261,2731,5154,4671,3738,1571,1797,3239,1886)                
         DC    AL2(0401,0408)                                                   
*                                                                               
         DC    AL1(101),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(6964,3502,7292,1840,2717,5141,4666,3726,1636)                
         DC    AL2(6988,2685,5009,4510,3587,1480,1738,3122,1837)                
         DC    AL2(0390,0402)                                                   
*                                                                               
         DC    AL1(101),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(6677,3372,7021,1800,2695,5007,4505,3553,1531)                
         DC    AL2(6751,2630,4871,4372,3455,1410,1665,3025,1810)                
         DC    AL2(0407,0412)                                                   
*                                                                               
         DC    AL1(101),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(6694,3459,6958,1769,2710,4981,4480,3480,1515)                
         DC    AL2(6674,2660,4860,4374,3374,1363,1638,2953,1776)                
         DC    AL2(0396,0391)                                                   
*                                                                               
         DC    AL1(101),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* PRESENCE OF REMOTE                                                            
         DC    AL1(102),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(8716,4160,9008,2076,2991,5796,5342,4466,2557)                
         DC    AL2(8281,2926,5615,5142,4200,2060,1974,3514,2043)                
         DC    AL2(0434,0437)                                                   
*                                                                               
         DC    AL1(102),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(8442,3942,8725,2037,2978,5674,5180,4284,2433)                
         DC    AL2(8078,2939,5503,4985,4027,1991,1889,3420,1987)                
         DC    AL2(0425,0426)                                                   
*                                                                               
         DC    AL1(102),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(8120,3776,8439,1937,2915,5460,4971,4075,2398)                
         DC    AL2(7787,2887,5320,4804,3843,1929,1770,3229,1884)                
         DC    AL2(0430,0413)                                                   
*                                                                               
         DC    AL1(102),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(7727,3608,8060,1898,2831,5256,4722,3880,2270)                
         DC    AL2(7529,2830,5169,4615,3691,1857,1694,3031,1797)                
         DC    AL2(0439,0419)                                                   
*                                                                               
         DC    AL1(102),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(7254,3533,7532,1762,2704,4951,4458,3601,2092)                
         DC    AL2(7059,2712,4899,4382,3438,1702,1584,2792,1701)                
         DC    AL2(0396,0387)                                                   
*                                                                               
         DC    AL1(102),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* NUMBER OF TV SETS 1                                                           
         DC    AL1(103),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(2776,1061,2404,0506,0899,1479,1260,0962,0792)                
         DC    AL2(2218,0919,1564,1388,0963,0527,0316,0811,0416)                
         DC    AL2(0115,0090)                                                   
*                                                                               
         DC    AL1(103),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2807,1013,2450,0482,0960,1484,1329,0922,0807)                
         DC    AL2(2177,0943,1526,1355,0924,0522,0342,0852,0449)                
         DC    AL2(0108,0091)                                                   
*                                                                               
         DC    AL1(103),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3054,1145,2723,0642,1105,1712,1393,1024,0855)                
         DC    AL2(2457,1148,1794,1501,0986,0541,0564,0895,0461)                
         DC    AL2(0125,0125)                                                   
*                                                                               
         DC    AL1(103),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(3211,1222,2871,0661,1194,1785,1469,1038,0934)                
         DC    AL2(2585,1203,1888,1566,1038,0574,0395,1060,0563)                
         DC    AL2(0145,0161)                                                   
*                                                                               
         DC    AL1(103),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3306,1310,3025,0646,1177,1803,1547,1151,1038)                
         DC    AL2(2620,1214,1876,1582,1055,0611,0418,1045,0566)                
         DC    AL2(0149,0150)                                                   
*                                                                               
         DC    AL1(103),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* NUMBER OF TV SETS 2                                                           
         DC    AL1(104),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3415,1562,3556,0728,1260,2267,2074,1628,1067)                
         DC    AL2(3065,1042,2049,1904,1558,0825,0637,1435,0786)                
         DC    AL2(0163,0127)                                                   
*                                                                               
         DC    AL1(104),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(3382,1577,3499,0730,1213,2213,1998,1629,1031)                
         DC    AL2(3105,1152,2111,1904,1477,0804,0633,1391,0738)                
         DC    AL2(0138,0138)                                                   
*                                                                               
         DC    AL1(104),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3321,1505,3389,0673,1215,2127,1981,1548,1030)                
         DC    AL2(3074,1111,2038,1887,1449,0839,0601,1432,0824)                
         DC    AL2(0136,0142)                                                   
*                                                                               
         DC    AL1(104),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(3367,1567,3485,0711,1243,2185,2011,1593,1073)                
         DC    AL2(3137,1178,2062,1915,1448,0855,0633,1349,0793)                
         DC    AL2(0153,0139)                                                   
*                                                                               
         DC    AL1(104),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3743,1738,3824,0799,1336,2415,2220,1790,1171)                
         DC    AL2(3491,1266,2327,2151,1712,0930,0745,1480,0905)                
         DC    AL2(0173,0151)                                                   
*                                                                               
         DC    AL1(104),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* NUMBER OF TV SETS 3                                                           
         DC    AL1(105),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(1994,1020,2210,0533,0684,1413,1339,1164,0598)                
         DC    AL2(2024,0710,1351,1235,1044,0498,0531,0923,0572)                
         DC    AL2(0124,0125)                                                   
*                                                                               
         DC    AL1(105),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2006,0978,2249,0592,0681,1475,1346,1198,0612)                
         DC    AL2(2107,0679,1407,1304,1148,0509,0615,0940,0602)                
         DC    AL2(0138,0132)                                                   
*                                                                               
         DC    AL1(105),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1892,0942,2140,0558,0636,1406,1305,1159,0587)                
         DC    AL2(1994,0637,1320,1201,1096,0512,0634,0834,0509)                
         DC    AL2(0138,0129)                                                   
*                                                                               
         DC    AL1(105),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(1698,0833,1963,0495,0594,1302,1211,1084,0520)                
         DC    AL2(1775,0551,1149,1048,0976,0489,0535,0770,0473)                
         DC    AL2(0120,0114)                                                   
*                                                                               
         DC    AL1(105),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(1587,0818,1847,0489,0574,1219,1107,0980,0501)                
         DC    AL2(1671,0563,1119,1001,0865,0429,0510,0710,0436)                
         DC    AL2(0119,0121)                                                   
*                                                                               
         DC    AL1(105),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* NUMBER OF TV SETS 4+                                                          
         DC    AL1(106),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(1355,0764,1614,0481,0374,1037,1007,1007,0441)                
         DC    AL2(1618,0500,1056,0942,0912,0409,0643,0649,0488)                
         DC    AL2(0080,0135)                                                   
*                                                                               
         DC    AL1(106),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(1225,0698,1529,0449,0414,0991,0924,0899,0399)                
         DC    AL2(1438,0439,0939,0819,0818,0389,0497,0585,0407)                
         DC    AL2(0100,0120)                                                   
*                                                                               
         DC    AL1(106),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1043,0574,1312,0377,0331,0842,0811,0785,0343)                
         DC    AL2(1224,0353,0793,0717,0723,0321,0446,0526,0368)                
         DC    AL2(0080,0088)                                                   
*                                                                               
         DC    AL1(106),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(0934,0485,1164,0361,0303,0769,0723,0694,0300)                
         DC    AL2(1147,0358,0801,0702,0684,0253,0446,0453,0325)                
         DC    AL2(0082,0093)                                                   
*                                                                               
         DC    AL1(106),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(0674,0388,0862,0270,0259,0597,0536,0493,0205)                
         DC    AL2(0840,0280,0578,0506,0481,0193,0302,0324,0219)                
         DC    AL2(0063,0062)                                                   
*                                                                               
         DC    AL1(106),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* HOH AGE UNDER 25                                                              
         DC    AL1(111),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(5020,0240,0462,0398,0435,0454,0069,0026,0005)                
         DC    AL2(0437,0423,0432,0057,0014,0003,0020,0172,0030)                
         DC    AL2(0103,0066)                                                   
*                                                                               
         DC    AL1(111),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(4610,0208,0412,0371,0393,0407,0048,0017,0003)                
         DC    AL2(0428,0416,0424,0059,0011,0003,0020,0162,0033)                
         DC    AL2(0089,0055)                                                   
*                                                                               
         DC    AL1(111),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(4470,0196,0405,0362,0386,0399,0050,0017,0005)                
         DC    AL2(0433,0420,0428,0053,0012,0002,0024,0150,0032)                
         DC    AL2(0083,0062)                                                   
*                                                                               
         DC    AL1(111),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(4970,0224,0447,0394,0430,0441,0058,0016,0004)                
         DC    AL2(0460,0449,0456,0055,0011,0003,0018,0152,0033)                
         DC    AL2(0101,0073)                                                   
*                                                                               
         DC    AL1(111),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(5120,0250,0459,0400,0441,0453,0067,0017,0004)                
         DC    AL2(0452,0440,0448,0047,0012,0003,0023,0152,0030)                
         DC    AL2(0100,0068)                                                   
*                                                                               
         DC    AL1(111),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* HOH AGE 25-34                                                                 
         DC    AL1(112),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(1877,0982,1705,0279,1539,1666,1518,0150,0030)                
         DC    AL2(1710,1621,1693,1640,0083,0013,0246,1498,0745)                
         DC    AL2(0025,0018)                                                   
*                                                                               
         DC    AL1(112),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(1874,0977,1713,0305,1569,1680,1506,0134,0023)                
         DC    AL2(1711,1627,1693,1641,0079,0014,0247,1514,0757)                
         DC    AL2(0029,0017)                                                   
*                                                                               
         DC    AL1(112),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1934,1000,1756,0322,1607,1718,1522,0135,0028)                
         DC    AL2(1746,1677,1733,1677,0063,0011,0237,1495,0747)                
         DC    AL2(0029,0015)                                                   
*                                                                               
         DC    AL1(112),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(1982,1032,1811,0307,1651,1773,1595,0145,0029)                
         DC    AL2(1800,1728,1786,1720,0067,0010,0245,1521,0775)                
         DC    AL2(0027,0019)                                                   
*                                                                               
         DC    AL1(112),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2058,1080,1852,0291,1677,1807,1636,0161,0036)                
         DC    AL2(1866,1793,1853,1799,0069,0009,0225,1549,0793)                
         DC    AL2(0027,0019)                                                   
*                                                                               
         DC    AL1(112),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* HOH AGE 35-54                                                                 
         DC    AL1(113),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3884,2369,4175,1371,0960,3572,3500,3127,0141)                
         DC    AL2(4089,0777,3404,3419,3284,0068,1705,1991,1353)                
         DC    AL2(0305,0330)                                                   
*                                                                               
         DC    AL1(113),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(3770,2272,4081,1353,1004,3546,3414,3000,0127)                
         DC    AL2(4016,0810,3363,3321,3182,0060,1660,1931,1307)                
         DC    AL2(0310,0349)                                                   
*                                                                               
         DC    AL1(113),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3639,2183,3974,1334,1008,3477,3316,2892,0121)                
         DC    AL2(3904,0782,3281,3223,3098,0055,1626,1870,1275)                
         DC    AL2(0310,0344)                                                   
*                                                                               
         DC    AL1(113),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(3477,2076,3825,1306,0966,0338,3171,2785,0125)                
         DC    AL2(3765,0743,3165,3117,3001,0051,1587,1792,1246)                
         DC    AL2(0314,0346)                                                   
*                                                                               
         DC    AL1(113),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3487,2143,3819,1300,0935,3304,3153,2792,0145)                
         DC    AL2(3719,0729,3132,3082,2964,0051,1583,1712,1212)                
         DC    AL2(0314,0344)                                                   
*                                                                               
         DC    AL1(113),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* HOH AGE 55-64                                                                 
         DC    AL1(114),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(1216,0590,1369,0147,0201,0323,0409,1098,0866)                
         DC    AL2(1235,0245,0289,0174,0962,0938,0107,0104,0062)                
         DC    AL2(0037,0047)                                                   
*                                                                               
         DC    AL1(114),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(1233,0591,1391,0168,0220,0351,0442,1103,0837)                
         DC    AL2(1253,0264,0306,0184,0964,0940,0114,0115,0073)                
         DC    AL2(0044,0049)                                                   
*                                                                               
         DC    AL1(114),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1233,0569,1376,0164,0206,0325,0431,1097,0837)                
         DC    AL2(1241,0256,0296,0174,0958,0939,0115,0120,0073)                
         DC    AL2(0043,0047)                                                   
*                                                                               
         DC    AL1(114),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(1248,0548,1391,0171,0207,0329,0420,1110,0856)                
         DC    AL2(1240,0268,0308,0177,0948,0928,0116,0108,0065)                
         DC    AL2(0048,0053)                                                   
*                                                                               
         DC    AL1(114),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(1252,0564,1405,0163,0209,0311,0398,1106,0898)                
         DC    AL2(1240,0255,0287,0157,0964,0950,0108,0092,0058)                
         DC    AL2(0048,0049)                                                   
*                                                                               
         DC    AL1(114),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* HOH AGE 65+                                                                   
         DC    AL1(115),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(2061,0227,2071,0055,0082,0182,0183,0359,1857)                
         DC    AL2(1454,0107,0202,0178,0132,1237,0048,0052,0032)                
         DC    AL2(0013,0017)                                                   
*                                                                               
         DC    AL1(115),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2061,0227,2071,0055,0082,0182,0183,0359,1857)                
         DC    AL2(1454,0107,0202,0178,0132,1237,0048,0052,0032)                
         DC    AL2(0013,0017)                                                   
*                                                                               
         DC    AL1(115),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(2057,0217,2053,0050,0080,0168,0170,0374,1853)                
         DC    AL2(1425,0114,0207,0178,0122,1206,0042,0052,0034)                
         DC    AL2(0014,0015)                                                   
*                                                                               
         DC    AL1(115),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(2006,0227,2010,0050,0080,0161,0169,0353,1813)                
         DC    AL2(1378,0101,0185,0162,0119,1179,0044,0058,0036)                
         DC    AL2(0011,0015)                                                   
*                                                                               
         DC    AL1(115),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2001,0228,2022,0052,0083,0160,0157,0338,1831)                
         DC    AL2(1346,0107,0180,0155,0104,1151,0036,0053,0034)                
         DC    AL2(0014,0015)                                                   
*                                                                               
         DC    AL1(115),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* HOH AGE WIHTIN HH SIZE UNDER 50                                               
         DC    AL1(118),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(2194,1190,1623,0339,0861,1573,1298,0747,0026)                
         DC    AL2(1660,0890,1640,1408,0767,0009,0079,0114,0061)                
         DC    AL2(0073,0052)                                                   
*                                                                               
         DC    AL1(118),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2205,1192,1629,0342,0881,1592,1309,0739,0019)                
         DC    AL2(1650,0901,1631,1391,0747,0009,0082,0106,0058)                
         DC    AL2(0069,0050)                                                   
*                                                                               
         DC    AL1(118),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(2236,1204,1669,0364,0922,1620,1318,0730,0030)                
         DC    AL2(1750,0985,1730,1467,0672,0010,0085,0114,0064)                
         DC    AL2(0074,0057)                                                   
*                                                                               
         DC    AL1(118),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(2165,1190,1632,0371,0938,1590,1273,0682,0025)                
         DC    AL2(1630,0958,1613,1343,0670,0010,0074,0113,0063)                
         DC    AL2(0086,0062)                                                   
*                                                                               
         DC    AL1(118),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2253,1232,1660,0370,0958,1602,1296,0684,0036)                
         DC    AL2(1697,1012,1678,1404,0681,0010,0084,0103,0056)                
         DC    AL2(0086,0061)                                                   
*                                                                               
         DC    AL1(118),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* HOH AGE WIHTIN HH SIZE OVER 50                                                
         DC    AL1(119),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3111,0658,2813,0031,0052,0197,0537,1269,2254)                
         DC    AL2(2038,0067,0113,0367,0937,1645,0020,0007,0005)                
         DC    AL2(0010,0011)                                                   
*                                                                               
         DC    AL1(119),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(3085,0642,2787,0026,0048,0193,0519,1252,2249)                
         DC    AL2(2006,0067,0123,0361,0922,1617,0014,0006,0005)                
         DC    AL2(0007,0009)                                                   
*                                                                               
         DC    AL1(119),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3033,0620,2764,0026,0041,0180,0487,1228,2258)                
         DC    AL2(2029,0074,0127,0352,0928,1643,0017,0005,0004)                
         DC    AL2(0008,0011)                                                   
*                                                                               
         DC    AL1(119),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(2988,0600,2721,0028,0042,0180,0475,1215,2227)                
         DC    AL2(1948,0064,0106,0329,0891,1593,0018,0005,0003)                
         DC    AL2(0009,0010)                                                   
*                                                                               
         DC    AL1(119),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2987,0619,2757,0030,0048,0166,0453,1209,2284)                
         DC    AL2(1922,0069,0112,0310,0879,1585,0019,0004,0003)                
         DC    AL2(0010,0011)                                                   
*                                                                               
         DC    AL1(119),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* EDUCATION HOH - UNDER 8 YEARS                                                 
         DC    AL1(121),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(0902,0195,0970,0169,0183,0343,0317,0375,0569)                
         DC    AL2(0818,0213,0351,0302,0312,0415,0172,0252,0150)                
         DC    AL2(0041,0049)                                                   
*                                                                               
         DC    AL1(121),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(0930,0201,0981,0175,0187,0353,0333,0386,0363)                
         DC    AL2(0858,0230,0382,0322,0332,0423,0184,0261,0162)                
         DC    AL2(0039,0050)                                                   
*                                                                               
         DC    AL1(121),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(0908,0208,0971,0177,0192,0359,0340,0382,0543)                
         DC    AL2(0851,0220,0372,0314,0337,0425,0183,0253,0155)                
         DC    AL2(0040,0047)                                                   
*                                                                               
         DC    AL1(121),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(0973,0220,1047,0185,0202,0372,0354,0409,0599)                
         DC    AL2(0921,0244,0408,0357,0363,0453,0185,0267,0161)                
         DC    AL2(0041,0050)                                                   
*                                                                               
         DC    AL1(121),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(1029,0244,1114,0184,0198,0382,0365,0447,0655)                
         DC    AL2(0942,0236,0408,0367,0386,0469,0184,0259,0163)                
         DC    AL2(0046,0042)                                                   
*                                                                               
         DC    AL1(121),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* EDUCATION HOH - 1-3 YEARS HS                                                  
         DC    AL1(122),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(1065,0344,1096,0256,0345,0580,0516,0461,0442)                
         DC    AL2(0902,0318,0529,0457,0389,0313,0240,0469,0264)                
         DC    AL2(0061,0056)                                                   
*                                                                               
         DC    AL1(122),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(1099,0345,1136,0276,0365,0612,0538,0487,0442)                
         DC    AL2(0937,0334,0550,0478,0411,0322,0245,0471,0268)                
         DC    AL2(0065,0054)                                                   
*                                                                               
         DC    AL1(122),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1039,0343,1097,0270,0359,0592,0510,0458,0432)                
         DC    AL2(0896,0325,0519,0445,0382,0316,0237,0450,0256)                
         DC    AL2(0062,0049)                                                   
*                                                                               
         DC    AL1(122),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(1033,0342,1096,0261,0348,0578,0499,0466,0444)                
         DC    AL2(0918,0337,0535,0452,0391,0321,0221,0429,0249)                
         DC    AL2(0067,0060)                                                   
*                                                                               
         DC    AL1(122),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(1099,0379,1149,0266,0355,0382,0365,0447,0655)                
         DC    AL2(0942,0236,0408,0367,0386,0469,0184,0259,0163)                
         DC    AL2(0065,0063)                                                   
*                                                                               
         DC    AL1(122),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* EDUCATION HOH - 4 YEARS HS                                                    
         DC    AL1(123),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3175,1506,3293,0801,1127,2076,1875,1564,0977)                
         DC    AL2(2948,1112,2017,1813,1451,0713,0733,1309,0759)                
         DC    AL2(0174,0167)                                                   
*                                                                               
         DC    AL1(123),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(3169,1488,3291,0804,1176,2098,1880,1528,0964)                
         DC    AL2(2944,1152,2037,1822,1421,0693,0729,1330,0768)                
         DC    AL2(0174,0168)                                                   
*                                                                               
         DC    AL1(123),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3412,1588,3525,0874,1293,2281,2008,1619,1021)                
         DC    AL2(3174,1283,2221,1950,1495,0738,0770,1424,0831)                
         DC    AL2(0199,0191)                                                   
*                                                                               
         DC    AL1(123),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(3335,1560,3456,0877,1293,2254,1981,1578,0975)                
         DC    AL2(3105,1287,2186,1906,1445,0703,0768,1360,0798)                
         DC    AL2(0205,0199)                                                   
*                                                                               
         DC    AL1(123),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3388,1654,3497,0867,1310,2272,1999,1595,1001)                
         DC    AL2(3097,1303,2188,1907,1432,0703,0751,1389,0827)                
         DC    AL2(0193,0195)                                                   
*                                                                               
         DC    AL1(123),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* EDUCATION HOH - 1-3 YEARS COLLEGE                                             
         DC    AL1(124),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(2241,1190,2262,0578,0845,1636,1467,1137,0477)                
         DC    AL2(2092,0816,1571,1403,1081,0375,0530,0935,0556)                
         DC    AL2(0124,0117)                                                   
*                                                                               
         DC    AL1(124),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2126,1113,2143,0554,0822,1558,1382,1062,0450)                
         DC    AL2(1993,0802,1511,1312,1005,0361,0795,0892,0531)                
         DC    AL2(0113,0117)                                                   
*                                                                               
         DC    AL1(124),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1801,0908,1806,0460,0694,1295,1150,0887,0393)                
         DC    AL2(1688,0690,1279,1123,0839,0309,0401,0733,0436)                
         DC    AL2(0093,0100)                                                   
*                                                                               
         DC    AL1(124),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(1733,0897,1753,0449,0712,1282,1124,0831,0373)                
         DC    AL2(1605,0673,1219,1069,0790,0286,0395,0738,0452)                
         DC    AL2(0095,0098)                                                   
*                                                                               
         DC    AL1(124),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(1662,0867,1656,0423,0680,1198,1049,0765,0365)                
         DC    AL2(1547,0671,1186,1029,0736,0276,0368,0680,0414)                
         DC    AL2(0093,0097)                                                   
*                                                                               
         DC    AL1(124),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* EDUCATION HOH - 4+ YEARS COLLEGE                                              
         DC    AL1(125),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(2157,1171,2162,0445,0717,1562,1505,1223,0434)                
         DC    AL2(2164,0713,1551,1495,1243,0444,0450,0854,0492)                
         DC    AL2(0083,0088)                                                   
*                                                                               
         DC    AL1(125),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2096,1119,2125,0443,0719,1543,1464,1185,0430)                
         DC    AL2(2095,0695,1504,1448,1197,0423,0434,0812,0468)                
         DC    AL2(0091,0093)                                                   
*                                                                               
         DC    AL1(125),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(2150,1118,2166,0452,0749,1560,1482,1169,0456)                
         DC    AL2(2139,0731,1554,1474,1201,0425,0455,0827,0483)                
         DC    AL2(0085,0097)                                                   
*                                                                               
         DC    AL1(125),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(2136,1087,2132,0457,0779,1556,1455,1124,0436)                
         DC    AL2(2094,0747,1552,1448,1158,0408,0441,0837,0495)                
         DC    AL2(0093,0099)                                                   
*                                                                               
         DC    AL1(125),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2132,1110,2141,0465,0803,1583,1466,1108,0425)                
         DC    AL2(2088,0756,1555,1463,1154,0395,0436,0794,0472)                
         DC    AL2(0105,0097)                                                   
*                                                                               
         DC    AL1(125),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* OCCUPATION WHITE COLLAR                                                       
         DC    AL1(131),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3609,2409,3747,0933,1414,2933,2765,2177,0488)                
         DC    AL2(3438,1307,2660,2499,2011,0472,0895,1544,0917)                
         DC    AL2(0183,0189)                                                   
*                                                                               
         DC    AL1(131),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(3611,2368,3763,0946,1445,2957,2740,2153,0510)                
         DC    AL2(3432,1317,2661,2467,1986,0478,0882,1517,0891)                
         DC    AL2(0199,0198)                                                   
*                                                                               
         DC    AL1(131),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3573,2286,3708,0948,1449,2909,2682,2086,0509)                
         DC    AL2(3409,1337,2665,2447,1945,0466,0879,1502,0898)                
         DC    AL2(0199,0207)                                                   
*                                                                               
         DC    AL1(131),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(3579,2260,3692,0951,1502,2902,2658,2018,0513)                
         DC    AL2(3491,1381,2678,2443,1909,0475,0876,1485,0900)                
         DC    AL2(0208,0215)                                                   
*                                                                               
         DC    AL1(131),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3561,2315,3704,0951,1517,2894,2629,1996,0539)                
         DC    AL2(3392,1398,2665,2418,1870,0475,0844,1393,0849)                
         DC    AL2(0220,0218)                                                   
*                                                                               
         DC    AL1(131),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* OCCUPATION BLUE COLLAR                                                        
         DC    AL1(132),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3012,1657,3046,0981,1359,2442,2139,1567,0374)                
         DC    AL2(3329,1474,2676,2370,1757,0405,0915,1644,0977)                
         DC    AL2(0223,0214)                                                   
*                                                                               
         DC    AL1(132),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2959,1592,3007,0970,1370,2408,2103,1513,0377)                
         DC    AL2(3323,1511,2660,2349,1709,0411,0905,1656,0976)                
         DC    AL2(0210,0214)                                                   
*                                                                               
         DC    AL1(132),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(2955,1589,3004,0955,1397,2413,2108,1485,0357)                
         DC    AL2(3314,1539,2662,2333,1671,0414,0886,1646,0965)                
         DC    AL2(0206,0214)                                                   
*                                                                               
         DC    AL1(132),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(2909,1555,2975,0957,1395,2385,2067,1460,0377)                
         DC    AL2(3243,1536,2609,2273,1602,0399,0869,1615,0958)                
         DC    AL2(0217,0218)                                                   
*                                                                               
         DC    AL1(132),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3046,1645,3076,0960,1412,2430,2124,1519,0422)                
         DC    AL2(3315,1577,2667,2335,1631,0413,0875,1645,0988)                
         DC    AL2(0216,0212)                                                   
*                                                                               
         DC    AL1(132),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* OCCUPATION NOT IN LABOR FORCE                                                 
         DC    AL1(133),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(2919,0342,2991,0335,0446,0821,0755,1017,2036)                
         DC    AL2(2158,0391,0684,0600,0708,1382,0317,0610,0329)                
         DC    AL2(0076,0074)                                                   
*                                                                               
         DC    AL1(133),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2850,0306,2906,0336,0454,0799,0754,0982,1963)                
         DC    AL2(2073,0385,0662,0567,0672,1334,0300,0594,0329)                
         DC    AL2(0074,0068)                                                   
*                                                                               
         DC    AL1(133),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(2782,0290,2852,0329,0441,0765,0699,0944,1961)                
         DC    AL2(2026,0374,0619,0525,0639,1333,0278,0538,0298)                
         DC    AL2(0075,0063)                                                   
*                                                                               
         DC    AL1(133),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(2722,0291,2817,0321,0436,0754,0688,0929,1938)                
         DC    AL2(1982,0372,0612,0516,0635,1297,0266,0531,0296)                
         DC    AL2(0076,0073)                                                   
*                                                                               
         DC    AL1(133),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2703,0295,2778,0293,0415,0710,0657,0899,1954)                
         DC    AL2(1915,0348,0567,0487,0611,1275,0256,0511,0289)                
         DC    AL2(0067,0063)                                                   
*                                                                               
         DC    AL1(133),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* RACE - BLACK                                                                  
         DC    AL1(141),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(1076,0522,1145,0339,0452,0801,0697,0539,0269)                
         DC    AL2(0912,0384,0659,0559,0425,0194,0328,0576,0331)                
         DC    AL2(0074,0068)                                                   
*                                                                               
         DC    AL1(141),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(1071,0508,1137,0342,0461,0797,0689,0525,0264)                
         DC    AL2(0905,0387,0653,0553,0417,0193,0322,0564,0327)                
         DC    AL2(0075,0068)                                                   
*                                                                               
         DC    AL1(141),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1030,0502,1112,0333,0458,0779,0670,0504,0261)                
         DC    AL2(0889,0387,0644,0543,0403,0187,0310,0554,0323)                
         DC    AL2(0077,0067)                                                   
*                                                                               
         DC    AL1(141),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(1024,0512,1110,0336,0467,0779,0665,0495,0261)                
         DC    AL2(0883,0391,0642,0537,0395,0186,0310,0553,0329)                
         DC    AL2(0074,0073)                                                   
*                                                                               
         DC    AL1(141),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(1079,0534,1139,0338,0477,0795,0679,0505,0274)                
         DC    AL2(0910,0406,0661,0555,0406,0191,0309,0555,0334)                
         DC    AL2(0076,0069)                                                   
*                                                                               
         DC    AL1(141),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* RACE - WHITE                                                                  
         DC    AL1(142),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(8141,3720,8280,1814,2633,5139,4748,4037,2555)                
         DC    AL2(7655,2637,5096,4675,3877,1999,1707,3061,1791)                
         DC    AL2(0388,0388)                                                   
*                                                                               
         DC    AL1(142),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(8056,3605,8206,1824,2684,5129,4690,3952,2514)                
         DC    AL2(7594,2690,5090,4617,3789,1966,1676,3036,1776)                
         DC    AL2(0390,0391)                                                   
*                                                                               
         DC    AL1(142),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(8003,3515,8131,1808,2707,5077,4612,3846,2516)                
         DC    AL2(7549,2734,5071,4559,3698,1969,1641,2971,1743)                
         DC    AL2(0385,0398)                                                   
*                                                                               
         DC    AL1(142),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(7898,3447,8052,1804,2734,5025,4538,3757,2504)                
         DC    AL2(7444,2762,5017,4487,3602,1929,1619,2917,1732)                
         DC    AL2(0406,0410)                                                   
*                                                                               
         DC    AL1(142),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(7962,3578,8124,1784,2751,5022,4536,3765,2584)                
         DC    AL2(7422,2794,5019,4493,3568,1919,1585,2858,1707)                
         DC    AL2(0410,0405)                                                   
*                                                                               
         DC    AL1(142),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* CAR OWNERS - ANY                                                              
         DC    AL1(151),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(8071,4003,8490,1968,2810,5415,4968,4217,2454)                
         DC    AL2(7763,2735,5152,4662,3873,2029,1835,3136,1793)                
         DC    AL2(0415,0418)                                                   
*                                                                               
         DC    AL1(151),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(8068,3939,8442,1997,2915,5484,4973,4121,2370)                
         DC    AL2(7831,2858,5286,4742,3864,1976,1833,3175,1848)                
         DC    AL2(0424,0438)                                                   
*                                                                               
         DC    AL1(151),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(7897,3778,8261,1923,2901,5353,4835,3942,2349)                
         DC    AL2(7681,2855,5188,4622,3738,1971,1726,3103,1816)                
         DC    AL2(0422,0421)                                                   
*                                                                               
         DC    AL1(151),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(7921,3757,8321,1944,2952,5376,4846,3950,2375)                
         DC    AL2(7722,2892,5220,4646,3735,1986,1722,3102,1842)                
         DC    AL2(0454,0451)                                                   
*                                                                               
         DC    AL1(151),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(8035,3900,8404,1917,2930,5394,4885,4009,2460)                
         DC    AL2(7764,2961,5256,4662,3711,1996,1744,3082,1859)                
         DC    AL2(0450,0449)                                                   
*                                                                               
         DC    AL1(151),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* CAR OWNERS - 1 CAR                                                            
         DC    AL1(152),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(4684,1978,4497,0859,1388,2638,2506,2065,1574)                
         DC    AL2(3829,1314,2504,2304,1798,1104,0902,1891,1062)                
         DC    AL2(0146,0158)                                                   
*                                                                               
         DC    AL1(152),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(4618,1969,4437,0891,1432,2662,2476,1978,1521)                
         DC    AL2(3776,1300,2487,2329,1795,1044,0920,1856,1091)                
         DC    AL2(0146,0143)                                                   
*                                                                               
         DC    AL1(152),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(4591,1932,4417,0846,1439,2639,2474,1932,1518)                
         DC    AL2(3802,1315,2471,2311,1764,1101,0859,1796,1071)                
         DC    AL2(0142,0157)                                                   
*                                                                               
         DC    AL1(152),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(4513,1821,4313,0825,1455,2562,2383,1832,1519)                
         DC    AL2(3671,1307,2380,2209,1634,1088,0844,1772,1068)                
         DC    AL2(0135,0151)                                                   
*                                                                               
         DC    AL1(152),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(4534,1809,4323,0800,1416,2524,2371,1851,1567)                
         DC    AL2(3716,1393,2439,2203,1632,1095,0842,1759,1070)                
         DC    AL2(0142,0150)                                                   
*                                                                               
         DC    AL1(152),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* CAR OWNERS - 2+CAR                                                            
         DC    AL1(153),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3387,2025,3993,1109,1423,2777,2462,2152,0880)                
         DC    AL2(3935,1421,2648,2358,2075,0925,0934,1245,0731)                
         DC    AL2(0269,0260)                                                   
*                                                                               
         DC    AL1(153),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(3450,1970,4006,1107,1482,2822,2497,2143,0849)                
         DC    AL2(4055,1558,2799,2413,2069,0932,0913,1319,0757)                
         DC    AL2(0278,0295)                                                   
*                                                                               
         DC    AL1(153),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3306,1846,3843,1077,1461,2714,2360,2010,0830)                
         DC    AL2(3879,1541,2717,2311,1974,0871,0867,1307,0745)                
         DC    AL2(0280,0264)                                                   
*                                                                               
         DC    AL1(153),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(3408,1967,4008,1119,1497,2813,2463,2117,0856)                
         DC    AL2(4050,1585,2840,2437,2101,0898,0878,1330,0774)                
         DC    AL2(0319,0300)                                                   
*                                                                               
         DC    AL1(153),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3501,2092,4081,1117,1514,2870,2514,2158,0893)                
         DC    AL2(4049,1567,2817,2458,2079,0900,0902,1324,0789)                
         DC    AL2(0308,0299)                                                   
*                                                                               
         DC    AL1(153),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* CAR OWNERS - NEW                                                              
         DC    AL1(154),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(1612,1014,1842,0453,0633,1228,1071,0934,0477)                
         DC    AL2(1590,0554,1029,0934,0800,0426,0323,0401,0234)                
         DC    AL2(0105,0072)                                                   
*                                                                               
         DC    AL1(154),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(1793,1021,1904,0411,0697,1261,1163,0971,0512)                
         DC    AL2(1830,0670,1232,1090,0893,0486,0299,0484,0279)                
         DC    AL2(0098,0090)                                                   
*                                                                               
         DC    AL1(154),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1986,1139,2201,0516,0823,1469,1290,1098,0554)                
         DC    AL2(1987,0756,1323,1183,0963,0533,0325,0581,0312)                
         DC    AL2(0130,0089)                                                   
*                                                                               
         DC    AL1(154),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(1953,1115,2212,0535,0814,1446,1250,1062,0607)                
         DC    AL2(1999,0777,1318,1166,0941,0540,0364,0556,0345)                
         DC    AL2(0138,0119)                                                   
*                                                                               
         DC    AL1(154),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2104,1216,2340,0505,0832,1482,1336,1121,0690)                
         DC    AL2(2087,0781,1367,1226,1006,0569,0389,0586,0333)                
         DC    AL2(0114,0105)                                                   
*                                                                               
         DC    AL1(154),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* TRUCK OWNERS - ANY                                                            
         DC    AL1(156),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3482,1669,3493,0833,1197,2416,2394,1908,0759)                
         DC    AL2(3941,1351,2833,2643,2183,0852,1006,1879,1122)                
         DC    AL2(0149,0192)                                                   
*                                                                               
         DC    AL1(156),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(3391,1601,3422,0807,1180,2367,2261,1842,0789)                
         DC    AL2(3756,1257,2619,2488,2072,0861,0888,1774,1029)                
         DC    AL2(0139,0176)                                                   
*                                                                               
         DC    AL1(156),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3352,1627,3438,0787,1164,2349,2261,1830,0822)                
         DC    AL2(3717,1244,2591,2417,2034,0859,0883,1656,1015)                
         DC    AL2(0144,0191)                                                   
*                                                                               
         DC    AL1(156),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(3113,1460,3170,0780,1122,2230,2101,1656,0728)                
         DC    AL2(3515,1245,2512,2345,1901,0750,0895,1545,0976)                
         DC    AL2(0158,0183)                                                   
*                                                                               
         DC    AL1(156),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3125,1449,3148,0826,1139,2229,2054,1653,0707)                
         DC    AL2(3525,1310,2521,2328,1860,0749,0893,1545,0963)                
         DC    AL2(0161,0171)                                                   
*                                                                               
         DC    AL1(156),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* TRUCK OWNERS - 1 TRUCK                                                        
         DC    AL1(157),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(2795,1327,2816,0666,0994,1942,1860,1470,0664)                
         DC    AL2(3073,1040,2166,2042,1678,0712,0762,1440,0837)                
         DC    AL2(0121,0122)                                                   
*                                                                               
         DC    AL1(157),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2835,1321,2858,0656,1020,1969,1856,1475,0680)                
         DC    AL2(3085,1042,2144,2023,1663,0736,0682,1424,0826)                
         DC    AL2(0123,0134)                                                   
*                                                                               
         DC    AL1(157),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(2784,1327,2839,0635,0975,1925,1833,1476,0707)                
         DC    AL2(3019,1007,2085,1956,1634,0729,0687,1317,0795)                
         DC    AL2(0110,0125)                                                   
*                                                                               
         DC    AL1(157),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(2579,1209,2604,0624,0924,1811,1705,1336,0616)                
         DC    AL2(2884,1018,2049,1926,1549,0625,0697,1206,0755)                
         DC    AL2(0124,0139)                                                   
*                                                                               
         DC    AL1(157),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2655,1243,2671,0703,0978,1887,1720,1382,0609)                
         DC    AL2(2981,1124,2129,1950,1545,0639,0734,1252,0764)                
         DC    AL2(0142,0149)                                                   
*                                                                               
         DC    AL1(157),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* TRUCK OWNERS - 2+TRUCK                                                        
         DC    AL1(158),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(0687,0341,0677,0167,0203,0519,0534,0438,0095)                
         DC    AL2(0867,0311,0667,0601,0505,0140,0244,0439,0285)                
         DC    AL2(0028,0070)                                                   
*                                                                               
         DC    AL1(158),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(0556,0280,0563,0151,0160,0398,0405,0368,0109)                
         DC    AL2(0671,0215,0475,0465,0409,0125,0206,0350,0203)                
         DC    AL2(0016,0042)                                                   
*                                                                               
         DC    AL1(158),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(0568,0300,0599,0151,0190,0424,0428,0354,0116)                
         DC    AL2(0698,0237,0506,0461,0400,0130,0196,0340,0220)                
         DC    AL2(0034,0065)                                                   
*                                                                               
         DC    AL1(158),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(0534,0251,0567,0156,0198,0419,0397,0320,0111)                
         DC    AL2(0631,0226,0463,0418,0352,0125,0198,0338,0221)                
         DC    AL2(0034,0044)                                                   
*                                                                               
         DC    AL1(158),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(0470,0206,0477,0124,0161,0342,0334,0271,0098)                
         DC    AL2(0544,0186,0392,0378,0314,0110,0159,0293,0199)                
         DC    AL2(0020,0023)                                                   
*                                                                               
         DC    AL1(158),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* TRUCK OWNERS - NEW                                                            
         DC    AL1(159),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(1135,0628,1175,0269,0416,0889,0859,0665,0206)                
         DC    AL2(1279,0441,0967,0880,0745,0241,0323,0642,0384)                
         DC    AL2(0050,0082)                                                   
*                                                                               
         DC    AL1(159),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(1083,0575,1126,0278,0411,0824,0787,0611,0216)                
         DC    AL2(1218,0406,0883,0884,0702,0246,0315,0606,0340)                
         DC    AL2(0052,0054)                                                   
*                                                                               
         DC    AL1(159),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(1127,0623,1184,0298,0420,0879,0825,0649,0224)                
         DC    AL2(1258,0431,0930,0866,0728,0231,0333,0575,0345)                
         DC    AL2(0050,0081)                                                   
*                                                                               
         DC    AL1(159),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(1151,0601,1198,0300,0415,0882,0844,0676,0231)                
         DC    AL2(1300,0456,0955,0897,0747,0241,0360,0567,0349)                
         DC    AL2(0060,0070)                                                   
*                                                                               
         DC    AL1(159),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(1279,0673,1320,0352,0496,0985,0921,0719,0235)                
         DC    AL2(1433,0563,1068,0994,0772,0256,0383,0639,0413)                
         DC    AL2(0059,0059)                                                   
*                                                                               
         DC    AL1(159),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* PET OWNERS - DOG                                                              
         DC    AL1(161),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(3444,1860,3813,1026,1231,2689,2512,2101,0832)                
         DC    AL2(3607,1268,2588,2380,1999,0713,1136,1648,1054)                
         DC    AL2(0219,0248)                                                   
*                                                                               
         DC    AL1(161),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(3388,1790,3778,0974,1217,2568,2436,2061,0897)                
         DC    AL2(3470,1201,2464,2283,1934,0718,1081,1625,1008)                
         DC    AL2(0195,0229)                                                   
*                                                                               
         DC    AL1(161),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(3315,1662,3674,0942,1234,2480,2324,1939,0914)                
         DC    AL2(3466,1229,2454,2231,1876,0739,1033,1604,1015)                
         DC    AL2(0202,0222)                                                   
*                                                                               
         DC    AL1(161),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(3196,1586,3570,0944,1214,2494,2283,1914,0829)                
         DC    AL2(3389,1221,2393,2222,1832,0706,0990,1489,0950)                
         DC    AL2(0240,0215)                                                   
*                                                                               
         DC    AL1(161),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(3315,1764,3759,0977,1308,2608,2405,2017,0880)                
         DC    AL2(3454,1261,2432,2245,1864,0742,1023,1529,0973)                
         DC    AL2(0227,0205)                                                   
*                                                                               
         DC    AL1(161),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* PET OWNERS - CAT                                                              
         DC    AL1(162),AL1(4+20*2),AL1(94,09)                                  
         DC    AL2(2709,1496,2981,0774,1018,2103,1960,1593,0647)                
         DC    AL2(2590,0853,1851,1783,1494,0516,0817,1161,0733)                
         DC    AL2(0164,0137)                                                   
*                                                                               
         DC    AL1(162),AL1(4+20*2),AL1(93,09)                                  
         DC    AL2(2672,1431,2964,0803,1040,2105,1925,1580,0640)                
         DC    AL2(2595,0914,1861,1718,1429,0527,0824,1135,0721)                
         DC    AL2(0179,0156)                                                   
*                                                                               
         DC    AL1(162),AL1(4+20*2),AL1(92,09)                                  
         DC    AL2(2672,1413,2951,0794,1101,2144,1946,1532,0610)                
         DC    AL2(2618,0975,1905,1737,1396,0510,0813,1160,0756)                
         DC    AL2(0177,0170)                                                   
*                                                                               
         DC    AL1(162),AL1(4+20*2),AL1(91,09)                                  
         DC    AL2(2754,1447,3020,0798,1133,2186,1948,1535,0662)                
         DC    AL2(2704,1036,2019,1826,1454,0493,0792,1216,0802)                
         DC    AL2(0195,0170)                                                   
*                                                                               
         DC    AL1(162),AL1(4+20*2),AL1(90,09)                                  
         DC    AL2(2653,1532,2989,0764,1101,2142,1949,1530,0653)                
         DC    AL2(2591,0982,1939,1716,1411,0467,0769,1145,0751)                
         DC    AL2(0183,0156)                                                   
*                                                                               
         DC    AL1(159),AL1(4+20*2),AL1(84,01)                                  
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0000,0000,0000,0000,0000,0000,0000,0000,0000)                
         DC    AL2(0,0)                                                         
*                                                                               
* END OF TABLE                                                                  
         DC    X'FF'                                                            
