*          DATA SET DENNHPTD   AT LEVEL 002 AS OF 09/22/88                      
HPTD     DSECT                                                                  
HPTFLAG  DS    C                   FLAGS - BIT 0 = OPTIONAL DATA                
HPTDY    DS    C                                                                
HPTQHR   DS    C                                                                
         DS    C                                                                
HPTAVEI  DS    CL4                                                              
HPTAVER  DS    CL4                                                              
HPTQH1I  DS    CL4                                                              
HPTQH1R  DS    CL4                                                              
HPTQH2I  DS    CL4                                                              
HPTQH2R  DS    CL4                                                              
HPTPUT   DS    CL(NUMCATS*4)                                                    
HPTDEND  DS    0C                                                               
HPTLN    EQU   *-HPTFLAG                                                        
