*          DATA SET DENSICBQS  AT LEVEL 053 AS OF 01/02/07                      
*---------------------------------------------------------------------*         
* TABLE THAT EQUATES NSI CABLE CALL LETTERS TO NUMERIC FUSION STATIONS*         
*                                                                     *         
*       DS    CL4       NSI CABLE CALL LETTERS                        *         
*       DS    AL2       FUSION NUMERIC STATION                        *         
*---------------------------------------------------------------------*         
                                                                                
NSICBLQ  DS    0CL(NSICBLQX-NSICBLQL)                                           
                                                                                
         DC    CL4'AEN ',AL2(6218)                                              
         DC    CL4'AEN',AL2(6218)                                               
         DC    CL4'AMC',AL2(6593)                                               
         DC    CL4'APL',AL2(6605)                                               
         DC    CL4'BBCA',AL2(8250)                                              
         DC    CL4'BET',AL2(6200)                                               
         DC    CL4'BIO',AL2(8338)                                               
         DC    CL4'BOOM',AL2(9304)                                              
         DC    CL4'BRVO',AL2(6526)                                              
         DC    CL4'CMD',AL2(7133)                                               
         DC    CL4'CMT',AL2(6647)                                               
         DC    CL4'CN8N',AL2(8005)                                              
         DC    CL4'CNB',AL2(6521)                                               
         DC    CL4'CNN',AL2(6202)                                               
         DC    CL4'CPA',AL2(6203)                                               
         DC    CL4'CRT',AL2(7183)                                               
         DC    CL4'CSNC',AL2(4734)                                              
         DC    CL4'CSS',AL2(9408)                                               
         DC    CL4'DHLT',AL2(8255)                                              
         DC    CL4'DIY',AL2(7742)                                               
         DC    CL4'DSC',AL2(6530)   NIELSON CHANGED CALL LETTER                 
         DC    CL4'DISC',AL2(6530)  TO DISC                                     
         DC    CL4'DSCI',AL2(8253)                                              
         DC    CL4'DSNY',AL2(6522)                                              
         DC    CL4'DTMS',AL2(8252)                                              
         DC    CL4'ENCX',AL2(9133)                                              
         DC    CL4'ENCY',AL2(9130)                                              
         DC    CL4'ENN',AL2(7474)                                               
         DC    CL4'ENT',AL2(6384)                                               
         DC    CL4'ESCL',AL2(7002)                                              
         DC    CL4'ESPN',AL2(6204)                                              
         DC    CL4'ESX',AL2(7287)                                               
         DC    CL4'EWN',AL2(6655)                                               
         DC    CL4'FAM',AL2(6201)                                               
         DC    CL4'FIT',AL2(7180)                                               
         DC    CL4'FMC',AL2(6109)                                               
         DC    CL4'FOOD',AL2(7304)                                              
         DC    CL4'FSCH',AL2(6609)                                              
         DC    CL4'FSE',AL2(7300)                                               
         DC    CL4'FSMW',AL2(7052)                                              
         DC    CL4'FSNY',AL2(6607)                                              
         DC    CL4'FSSO',AL2(7067)                                              
         DC    CL4'FSW',AL2(6527)                                               
         DC    CL4'FSW2',AL2(7498)                                              
         DC    CL4'FSWI',AL2(7837)                                              
         DC    CL4'FUSE',AL2(7652)                                              
         DC    CL4'FUSE',AL2(7652)                                              
         DC    CL4'FX',AL2(7328)                                                
         DC    CL4'FXNC',AL2(7401)                                              
         DC    CL4'G4',AL2(8333)                                                
         DC    CL4'GAC',AL2(7651)                                               
         DC    CL4'GALA',AL2(6517)                                              
         DC    CL4'GOLF',AL2(6560)                                              
         DC    CL4'GSN',AL2(7099)                                               
         DC    CL4'HALL',AL2(6485)                                              
         DC    CL4'HBOM',AL2(9100)                                              
         DC    CL4'HGTV',AL2(8920)                                              
         DC    CL4'HIS',AL2(8908)                                               
         DC    CL4'HLN',AL2(6199)                                               
         DC    CL4'HSN',AL2(6534)                                               
         DC    CL4'HSTI',AL2(8339)                                              
         DC    CL4'IFC',AL2(6111)                                               
         DC    CL4'LCLT',AL2(7255)                                              
         DC    CL4'LIF',AL2(6196)                                               
         DC    CL4'LMN',AL2(8336)                                               
         DC    CL4'LNWT',AL2(7514)                                              
         DC    CL4'MAXP',AL2(9118)                                              
         DC    CL4'MC',AL2(9811)                                                
         DC    CL4'MIL',AL2(8256)                                               
         DC    CL4'MNBC',AL2(7801)                                              
         DC    CL4'MRTV',AL2(8297)                                              
         DC    CL4'MSG',AL2(6207)                                               
         DC    CL4'MTV',AL2(6198)                                               
         DC    CL4'MTV2',AL2(8466)                                              
         DC    CL4'MTVH',AL2(9606)                                              
         DC    CL4'NAN',AL2(9043)                                               
         DC    CL4'NGC',AL2(9258)                                               
         DC    CL4'NICK',AL2(6212)                                              
**       DC    CL4'NIK',AL2(6212)                                               
         DC    CL4'NIKT',AL2(8523)                                              
         DC    CL4'NKT',AL2(9963)                                               
         DC    CL4'NOGT',AL2(8331)                                              
         DC    CL4'NWNJ',AL2(6134)                                              
         DC    CL4'OLN',AL2(6275)                                               
         DC    CL4'OXYG',AL2(8444)                                              
         DC    CL4'PBSK',AL2(9303)                                              
         DC    CL4'QVC',AL2(6951)                                               
         DC    CL4'SC',AL2(7443)                                                
         DC    CL4'SFI',AL2(7235)                                               
         DC    CL4'SHO1',AL2(9521)                                              
         DC    CL4'SOAP',AL2(8443)                                              
         DC    CL4'SPK',AL2(6221)                                               
         DC    CL4'SPK',AL2(6221)                                               
         DC    CL4'STYL',AL2(8151)                                              
         DC    CL4'STZP',AL2(9157)                                              
         DC    CL4'TBSC',AL2(7237)                                              
         DC    CL4'TCM',AL2(7325)                                               
         DC    CL4'TDSY',AL2(7611)                                              
         DC    CL4'TLC',AL2(6635)                                               
         DC    CL4'TMC1',AL2(9527)                                              
         DC    CL4'TMD',AL2(6536)                                               
         DC    CL4'TNT',AL2(6390)                                               
         DC    CL4'TOON',AL2(7241)                                              
         DC    CL4'TRAV',AL2(6678)                                              
         DC    CL4'TSOU',AL2(8533)                                              
         DC    CL4'TVGC',AL2(6477)                                              
         DC    CL4'TVGC',AL2(6477)                                              
         DC    CL4'TVL',AL2(7838)                                               
         DC    CL4'TWC',AL2(6523)                                               
         DC    CL4'UNV',AL2(6209)                                               
         DC    CL4'USA',AL2(6217)                                               
         DC    CL4'VHI',AL2(6546)                                               
         DC    CL4'WE',AL2(7516)                                                
         DC    CL4'XWGN',AL2(6788)                                              
         DC    CL4'YES',AL2(9543)                                               
         DC    CL4'ZMTW',AL2(8299)                                              
NSICBLQL DC    CL4'ZNY1',AL2(7238)     LAST ENTRY                               
                                                                                
NSICBLQX DC    X'FF'                                                            
