*          DATA SET DENTIBKEQU AT LEVEL 007 AS OF 07/22/97                      
YRINDX   DC    AL1(84),AL2(T1984-YRINDX)                                        
         DC    AL1(85),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(86),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(87),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(88),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(89),AL2(T1989-YRINDX)                                        
         DC    AL1(90),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(91),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(92),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(93),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(94),AL2(DEFAULT-YRINDX)                                      
         DC    AL1(95),AL2(T1996-YRINDX)                                        
         DC    AL1(96),AL2(T1996-YRINDX)                                        
         DC    AL1(255),AL2(T1996-YRINDX)    CHANGE TO FLAT FILE                
         SPACE 2                                                                
DEFAULT  DC    AL1(01,02,03,04,05,06,07,08,09,10)      1-10                     
         DC    AL1(11,12,13,14,15,16,49,17,18,19)     11-20                     
         DC    AL1(20,21,22,23,24,50,25,26,27,28)     21-30                     
         DC    AL1(29,30,31,32,51,33,34,35,36,37)     31-40                     
         DC    AL1(38,39,40,41,42,43,44,45,46,47)     41-50                     
         DC    AL1(48,52,52,52,00,00,00,00,00,00)     51-60                     
*                                                                               
T1984    DC    AL1(01,02,03,04,05,06,07,08,09,10)      1-10                     
         DC    AL1(11,12,13,14,15,16,49,17,18,19)     11-20                     
         DC    AL1(20,21,22,23,24,50,25,26,27,28)     21-30                     
         DC    AL1(29,30,31,32,51,53,33,34,35,36)     31-40                     
         DC    AL1(37,38,39,40,41,42,43,44,45,46)     41-50                     
         DC    AL1(47,48,52,52,00,00,00,00,00,00)     51-60                     
*                                                                               
T1989    DC    AL1(01,02,03,04,05,06,07,08,09,10)      1-10                     
         DC    AL1(11,12,13,14,15,16,49,17,18,19)     11-20                     
         DC    AL1(20,21,22,23,24,50,25,26,27,28)     21-30                     
         DC    AL1(29,30,31,32,51,53,33,34,35,36)     31-40                     
         DC    AL1(37,38,39,40,41,42,43,44,45,46)     41-50                     
         DC    AL1(47,48,52,53,00,00,00,00,00,00)     51-60                     
*                                                                               
T1996    DC    AL1(01,02,03,04,05,06,07,08,09,10)      1-10                     
         DC    AL1(11,12,13,14,15,16,17,18,19,20)     11-20                     
         DC    AL1(21,22,23,24,25,26,27,28,29,30)     21-30                     
         DC    AL1(31,32,33,34,35,36,37,38,39,40)     31-40                     
         DC    AL1(41,42,43,44,45,46,47,48,49,50)     41-50                     
         DC    AL1(51,52,53,00,00,00,00,00,00,00)     51-60                     
*                                                                               
