*          DATA SET DENTIDEMS  AT LEVEL 006 AS OF 03/04/20                      
*---------------------------------------------------------------------*         
*                       ALL PERMUTATIONS OF                           *         
*                  DEMO CATEGORIES AND THEIR CODES                    *         
*---------------------------------------------------------------------*         
                                                                                
* DSECT IS IN DEDEMTABD - SEE DSECT NTIDTD                                      
                                                                                
* TABLE FORMAT:                                                                 
* CL10 - DEMO NAME                                                              
* CL7  - PERSON TYPE (SEX)                                                      
* CL5  - AGE BRACKET                                                            
* AL2  - TYPE 4 DEMO NUMBER  (USED BY NATION DEMO ESTIMATE FOR                  
*                             DEMO ENGINE.  REFER TO DEDEMTABOF,                
*                             SEARCH FOR DFORM AND THIS NUMBER)                 
* AL1  - TYPE 3 DEMO NUMBER                                                     
*                                                                               
                                                                                
NTIDEMS  DC    CL10'HOMES',CL7'',CL5'',AL2(1),AL1(1)                            
         DC    CL10'USA',CL7'',CL5'',AL2(19),AL1(19)                            
         DC    CL10'G2-5',CL7'Women',CL5'2-5',AL2(325),AL1(197)                 
         DC    CL10'G6-8',CL7'Women',CL5'6-8',AL2(326),AL1(198)                 
         DC    CL10'G2-8',CL7'Women',CL5'2-8',AL2(770),AL1(0)                   
         DC    CL10'G9-11',CL7'Women',CL5'9-11',AL2(327),AL1(199)               
         DC    CL10'G2-11',CL7'Women',CL5'2-11',AL2(119),AL1(119)               
         DC    CL10'G6-11',CL7'Women',CL5'6-11',AL2(21),AL1(21)                 
         DC    CL10'W12-14',CL7'Women',CL5'12-14',AL2(24),AL1(24)               
         DC    CL10'G2-14',CL7'Women',CL5'2-14',AL2(772),AL1(0)                 
         DC    CL10'G6-14',CL7'Women',CL5'6-14',AL2(786),AL1(0)                 
         DC    CL10'G9-14',CL7'Women',CL5'9-14',AL2(61),AL1(61)                 
         DC    CL10'W15-17',CL7'Women',CL5'15-17',AL2(26),AL1(26)               
         DC    CL10'FE2-17',CL7'Women',CL5'2-17',AL2(773),AL1(0)                
         DC    CL10'FE6-17',CL7'Women',CL5'6-17',AL2(787),AL1(0)                
         DC    CL10'FE9-17',CL7'Women',CL5'9-17',AL2(800),AL1(0)                
         DC    CL10'W12-17',CL7'Women',CL5'12-17',AL2(25),AL1(25)               
         DC    CL10'W18-20',CL7'Women',CL5'18-20',AL2(68),AL1(68)               
         DC    CL10'FE2-20',CL7'Women',CL5'2-20',AL2(774),AL1(0)                
         DC    CL10'FE6-20',CL7'Women',CL5'6-20',AL2(788),AL1(0)                
         DC    CL10'FE9-20',CL7'Women',CL5'9-20',AL2(801),AL1(0)                
         DC    CL10'W12-20',CL7'Women',CL5'12-20',AL2(23),AL1(23)               
         DC    CL10'W15-20',CL7'Women',CL5'15-20',AL2(824),AL1(0)               
         DC    CL10'W21-24',CL7'Women',CL5'21-24',AL2(69),AL1(69)               
         DC    CL10'FE2-24',CL7'Women',CL5'2-24',AL2(775),AL1(0)                
         DC    CL10'FE6-24',CL7'Women',CL5'6-24',AL2(789),AL1(0)                
         DC    CL10'FE9-24',CL7'Women',CL5'9-24',AL2(802),AL1(0)                
         DC    CL10'W12-24',CL7'Women',CL5'12-24',AL2(28),AL1(28)               
         DC    CL10'W15-24',CL7'Women',CL5'15-24',AL2(34),AL1(34)               
         DC    CL10'W18-24',CL7'Women',CL5'18-24',AL2(40),AL1(40)               
         DC    CL10'W25-29',CL7'Women',CL5'25-29',AL2(324),AL1(196)             
         DC    CL10'FE2-29',CL7'Women',CL5'2-29',AL2(776),AL1(0)                
         DC    CL10'FE6-29',CL7'Women',CL5'6-29',AL2(790),AL1(0)                
         DC    CL10'FE9-29',CL7'Women',CL5'9-29',AL2(803),AL1(0)                
         DC    CL10'W12-29',CL7'Women',CL5'12-29',AL2(815),AL1(0)               
         DC    CL10'W15-29',CL7'Women',CL5'15-29',AL2(826),AL1(0)               
         DC    CL10'W18-29',CL7'Women',CL5'18-29',AL2(836),AL1(0)               
         DC    CL10'W21-29',CL7'Women',CL5'21-29',AL2(845),AL1(0)               
         DC    CL10'W30-34',CL7'Women',CL5'30-34',AL2(335),AL1(207)             
         DC    CL10'FE2-34',CL7'Women',CL5'2-34',AL2(777),AL1(0)                
         DC    CL10'FE6-34',CL7'Women',CL5'6-34',AL2(791),AL1(0)                
         DC    CL10'FE9-34',CL7'Women',CL5'9-34',AL2(804),AL1(0)                
         DC    CL10'W12-34',CL7'Women',CL5'12-34',AL2(29),AL1(29)               
         DC    CL10'W15-34',CL7'Women',CL5'15-34',AL2(35),AL1(35)               
         DC    CL10'W18-34',CL7'Women',CL5'18-34',AL2(41),AL1(41)               
         DC    CL10'W21-34',CL7'Women',CL5'21-34',AL2(70),AL1(70)               
         DC    CL10'W25-34',CL7'Women',CL5'25-34',AL2(46),AL1(46)               
         DC    CL10'W35-39',CL7'Women',CL5'35-39',AL2(336),AL1(208)             
         DC    CL10'FE2-39',CL7'Women',CL5'2-39',AL2(778),AL1(0)                
         DC    CL10'FE6-39',CL7'Women',CL5'6-39',AL2(792),AL1(0)                
         DC    CL10'FE9-39',CL7'Women',CL5'9-39',AL2(805),AL1(0)                
         DC    CL10'W12-39',CL7'Women',CL5'12-39',AL2(817),AL1(0)               
         DC    CL10'W15-39',CL7'Women',CL5'15-39',AL2(828),AL1(0)               
         DC    CL10'W18-39',CL7'Women',CL5'18-39',AL2(838),AL1(0)               
         DC    CL10'W21-39',CL7'Women',CL5'21-39',AL2(847),AL1(0)               
         DC    CL10'W25-39',CL7'Women',CL5'25-39',AL2(855),AL1(0)               
         DC    CL10'W30-39',CL7'Women',CL5'30-39',AL2(862),AL1(0)               
         DC    CL10'W40-44',CL7'Women',CL5'40-44',AL2(337),AL1(209)             
         DC    CL10'FE2-44',CL7'Women',CL5'2-44',AL2(779),AL1(0)                
         DC    CL10'FE6-44',CL7'Women',CL5'6-44',AL2(793),AL1(0)                
         DC    CL10'FE9-44',CL7'Women',CL5'9-44',AL2(806),AL1(0)                
         DC    CL10'W12-44',CL7'Women',CL5'12-44',AL2(818),AL1(0)               
         DC    CL10'W15-44',CL7'Women',CL5'15-44',AL2(829),AL1(0)               
         DC    CL10'W18-44',CL7'Women',CL5'18-44',AL2(328),AL1(200)             
         DC    CL10'W21-44',CL7'Women',CL5'21-44',AL2(848),AL1(253)             
         DC    CL10'W25-44',CL7'Women',CL5'25-44',AL2(329),AL1(201)             
         DC    CL10'W30-44',CL7'Women',CL5'30-44',AL2(863),AL1(0)               
         DC    CL10'W35-44',CL7'Women',CL5'35-44',AL2(330),AL1(202)             
         DC    CL10'W45-49',CL7'Women',CL5'45-49',AL2(331),AL1(203)             
         DC    CL10'FE2-49',CL7'Women',CL5'2-49',AL2(780),AL1(0)                
         DC    CL10'FE6-49',CL7'Women',CL5'6-49',AL2(794),AL1(0)                
         DC    CL10'FE9-49',CL7'Women',CL5'9-49',AL2(807),AL1(0)                
         DC    CL10'W12-49',CL7'Women',CL5'12-49',AL2(30),AL1(30)               
         DC    CL10'W15-49',CL7'Women',CL5'15-49',AL2(36),AL1(36)               
         DC    CL10'W18-49',CL7'Women',CL5'18-49',AL2(42),AL1(42)               
         DC    CL10'W21-49',CL7'Women',CL5'21-49',AL2(71),AL1(71)               
         DC    CL10'W25-49',CL7'Women',CL5'25-49',AL2(47),AL1(47)               
         DC    CL10'W30-49',CL7'Women',CL5'30-49',AL2(864),AL1(0)               
         DC    CL10'W35-49',CL7'Women',CL5'35-49',AL2(51),AL1(51)               
         DC    CL10'W40-49',CL7'Women',CL5'40-49',AL2(875),AL1(0)               
         DC    CL10'W50-54',CL7'Women',CL5'50-54',AL2(55),AL1(55)               
         DC    CL10'FE2-54',CL7'Women',CL5'2-54',AL2(781),AL1(0)                
         DC    CL10'FE6-54',CL7'Women',CL5'6-54',AL2(795),AL1(0)                
         DC    CL10'FE9-54',CL7'Women',CL5'9-54',AL2(808),AL1(0)                
         DC    CL10'W12-54',CL7'Women',CL5'12-54',AL2(31),AL1(31)               
         DC    CL10'W15-54',CL7'Women',CL5'15-54',AL2(37),AL1(37)               
         DC    CL10'W18-54',CL7'Women',CL5'18-54',AL2(43),AL1(43)               
         DC    CL10'W21-54',CL7'Women',CL5'21-54',AL2(72),AL1(72)               
         DC    CL10'W25-54',CL7'Women',CL5'25-54',AL2(48),AL1(48)               
         DC    CL10'W30-54',CL7'Women',CL5'30-54',AL2(865),AL1(169)             
         DC    CL10'W35-54',CL7'Women',CL5'35-54',AL2(52),AL1(52)               
         DC    CL10'W40-54',CL7'Women',CL5'40-54',AL2(876),AL1(0)               
         DC    CL10'W45-54',CL7'Women',CL5'45-54',AL2(332),AL1(204)             
         DC    CL10'W55-64',CL7'Women',CL5'55-64',AL2(58),AL1(58)               
         DC    CL10'FE2-64',CL7'Women',CL5'2-64',AL2(782),AL1(0)                
         DC    CL10'FE6-64',CL7'Women',CL5'6-64',AL2(796),AL1(0)                
         DC    CL10'FE9-64',CL7'Women',CL5'9-64',AL2(809),AL1(0)                
         DC    CL10'W12-64',CL7'Women',CL5'12-64',AL2(32),AL1(32)               
         DC    CL10'W15-64',CL7'Women',CL5'15-64',AL2(38),AL1(38)               
         DC    CL10'W18-64',CL7'Women',CL5'18-64',AL2(44),AL1(44)               
         DC    CL10'W21-64',CL7'Women',CL5'21-64',AL2(73),AL1(73)               
         DC    CL10'W25-64',CL7'Women',CL5'25-64',AL2(49),AL1(49)               
         DC    CL10'W30-64',CL7'Women',CL5'30-64',AL2(866),AL1(0)               
         DC    CL10'W35-64',CL7'Women',CL5'35-64',AL2(53),AL1(53)               
         DC    CL10'W40-64',CL7'Women',CL5'40-64',AL2(877),AL1(0)               
         DC    CL10'W45-64',CL7'Women',CL5'45-64',AL2(333),AL1(205)             
         DC    CL10'W50-64',CL7'Women',CL5'50-64',AL2(56),AL1(56)               
         DC    CL10'W65+',CL7'Women',CL5'65+',AL2(60),AL1(60)                   
         DC    CL10'FE2+',CL7'Women',CL5'2+',AL2(783),AL1(27)                   
         DC    CL10'FE6+',CL7'Women',CL5'6+',AL2(797),AL1(0)                    
         DC    CL10'FE9+',CL7'Women',CL5'9+',AL2(810),AL1(0)                    
         DC    CL10'W12+',CL7'Women',CL5'12+',AL2(33),AL1(33)                   
         DC    CL10'W15+',CL7'Women',CL5'15+',AL2(39),AL1(39)                   
         DC    CL10'W18+',CL7'Women',CL5'18+',AL2(45),AL1(45)                   
         DC    CL10'W21+',CL7'Women',CL5'21+',AL2(67),AL1(67)                   
         DC    CL10'W25+',CL7'Women',CL5'25+',AL2(50),AL1(50)                   
         DC    CL10'W30+',CL7'Women',CL5'30+',AL2(867),AL1(0)                   
         DC    CL10'W35+',CL7'Women',CL5'35+',AL2(54),AL1(54)                   
         DC    CL10'W40+',CL7'Women',CL5'40+',AL2(878),AL1(0)                   
         DC    CL10'W45+',CL7'Women',CL5'45+',AL2(334),AL1(206)                 
         DC    CL10'W50+',CL7'Women',CL5'50+',AL2(57),AL1(57)                   
         DC    CL10'W55+',CL7'Women',CL5'55+',AL2(59),AL1(59)                   
         DC    CL10'B2-5',CL7'Men',CL5'2-5',AL2(345),AL1(217)                   
         DC    CL10'B6-8',CL7'Men',CL5'6-8',AL2(346),AL1(218)                   
         DC    CL10'B2-8',CL7'Men',CL5'2-8',AL2(1026),AL1(0)                    
         DC    CL10'B9-11',CL7'Men',CL5'9-11',AL2(347),AL1(219)                 
         DC    CL10'B2-11',CL7'Men',CL5'2-11',AL2(20),AL1(20)                   
         DC    CL10'B6-11',CL7'Men',CL5'6-11',AL2(22),AL1(22)                   
         DC    CL10'M12-14',CL7'Men',CL5'12-14',AL2(74),AL1(74)                 
         DC    CL10'B2-14',CL7'Men',CL5'2-14',AL2(1028),AL1(0)                  
         DC    CL10'B6-14',CL7'Men',CL5'6-14',AL2(1042),AL1(18)                 
         DC    CL10'B9-14',CL7'Men',CL5'9-14',AL2(62),AL1(62)                   
         DC    CL10'M15-17',CL7'Men',CL5'15-17',AL2(76),AL1(76)                 
         DC    CL10'MA2-17',CL7'Men',CL5'2-17',AL2(1029),AL1(0)                 
         DC    CL10'MA6-17',CL7'Men',CL5'6-17',AL2(314),AL1(186)                
         DC    CL10'MA9-17',CL7'Men',CL5'9-17',AL2(1056),AL1(0)                 
         DC    CL10'M12-17',CL7'Men',CL5'12-17',AL2(75),AL1(75)                 
         DC    CL10'M18-20',CL7'Men',CL5'18-20',AL2(112),AL1(112)               
         DC    CL10'MA2-20',CL7'Men',CL5'2-20',AL2(1030),AL1(0)                 
         DC    CL10'MA6-20',CL7'Men',CL5'6-20',AL2(1044),AL1(0)                 
         DC    CL10'MA9-20',CL7'Men',CL5'9-20',AL2(1057),AL1(0)                 
         DC    CL10'M12-20',CL7'Men',CL5'12-20',AL2(111),AL1(111)               
         DC    CL10'M15-20',CL7'Men',CL5'15-20',AL2(1080),AL1(0)                
         DC    CL10'M21-24',CL7'Men',CL5'21-24',AL2(113),AL1(113)               
         DC    CL10'MA2-24',CL7'Men',CL5'2-24',AL2(1031),AL1(0)                 
         DC    CL10'MA6-24',CL7'Men',CL5'6-24',AL2(1045),AL1(0)                 
         DC    CL10'MA9-24',CL7'Men',CL5'9-24',AL2(1058),AL1(0)                 
         DC    CL10'M12-24',CL7'Men',CL5'12-24',AL2(78),AL1(78)                 
         DC    CL10'M15-24',CL7'Men',CL5'15-24',AL2(84),AL1(84)                 
         DC    CL10'M18-24',CL7'Men',CL5'18-24',AL2(90),AL1(90)                 
         DC    CL10'M25-29',CL7'Men',CL5'25-29',AL2(355),AL1(227)               
         DC    CL10'MA2-29',CL7'Men',CL5'2-29',AL2(1032),AL1(0)                 
         DC    CL10'MA6-29',CL7'Men',CL5'6-29',AL2(1046),AL1(0)                 
         DC    CL10'MA9-29',CL7'Men',CL5'9-29',AL2(1059),AL1(0)                 
         DC    CL10'M12-29',CL7'Men',CL5'12-29',AL2(1071),AL1(0)                
         DC    CL10'M15-29',CL7'Men',CL5'15-29',AL2(1082),AL1(0)                
         DC    CL10'M18-29',CL7'Men',CL5'18-29',AL2(1092),AL1(0)                
         DC    CL10'M21-29',CL7'Men',CL5'21-29',AL2(1101),AL1(0)                
         DC    CL10'M30-34',CL7'Men',CL5'30-34',AL2(356),AL1(228)               
         DC    CL10'MA2-34',CL7'Men',CL5'2-34',AL2(1033),AL1(0)                 
         DC    CL10'MA6-34',CL7'Men',CL5'6-34',AL2(1047),AL1(0)                 
         DC    CL10'MA9-34',CL7'Men',CL5'9-34',AL2(1060),AL1(0)                 
         DC    CL10'M12-34',CL7'Men',CL5'12-34',AL2(79),AL1(79)                 
         DC    CL10'M15-34',CL7'Men',CL5'15-34',AL2(85),AL1(85)                 
         DC    CL10'M18-34',CL7'Men',CL5'18-34',AL2(91),AL1(91)                 
         DC    CL10'M21-34',CL7'Men',CL5'21-34',AL2(114),AL1(114)               
         DC    CL10'M25-34',CL7'Men',CL5'25-34',AL2(96),AL1(96)                 
         DC    CL10'M35-39',CL7'Men',CL5'35-39',AL2(357),AL1(229)               
         DC    CL10'MA2-39',CL7'Men',CL5'2-39',AL2(1034),AL1(0)                 
         DC    CL10'MA6-39',CL7'Men',CL5'6-39',AL2(1048),AL1(0)                 
         DC    CL10'MA9-39',CL7'Men',CL5'9-39',AL2(1061),AL1(0)                 
         DC    CL10'M12-39',CL7'Men',CL5'12-39',AL2(1073),AL1(0)                
         DC    CL10'M15-39',CL7'Men',CL5'15-39',AL2(1084),AL1(0)                
         DC    CL10'M18-39',CL7'Men',CL5'18-39',AL2(1094),AL1(0)                
         DC    CL10'M21-39',CL7'Men',CL5'21-39',AL2(1103),AL1(0)                
         DC    CL10'M25-39',CL7'Men',CL5'25-39',AL2(1111),AL1(0)                
         DC    CL10'M30-39',CL7'Men',CL5'30-39',AL2(1118),AL1(0)                
         DC    CL10'M40-44',CL7'Men',CL5'40-44',AL2(323),AL1(195)               
         DC    CL10'MA2-44',CL7'Men',CL5'2-44',AL2(1035),AL1(0)                 
         DC    CL10'MA6-44',CL7'Men',CL5'6-44',AL2(1049),AL1(0)                 
         DC    CL10'MA9-44',CL7'Men',CL5'9-44',AL2(1062),AL1(0)                 
         DC    CL10'M12-44',CL7'Men',CL5'12-44',AL2(1074),AL1(0)                
         DC    CL10'M15-44',CL7'Men',CL5'15-44',AL2(1085),AL1(0)                
         DC    CL10'M18-44',CL7'Men',CL5'18-44',AL2(338),AL1(210)               
         DC    CL10'M21-44',CL7'Men',CL5'21-44',AL2(1104),AL1(0)                
         DC    CL10'M25-44',CL7'Men',CL5'25-44',AL2(339),AL1(211)               
         DC    CL10'M30-44',CL7'Men',CL5'30-44',AL2(1119),AL1(0)                
         DC    CL10'M35-44',CL7'Men',CL5'35-44',AL2(340),AL1(212)               
         DC    CL10'M45-49',CL7'Men',CL5'45-49',AL2(341),AL1(213)               
         DC    CL10'MA2-49',CL7'Men',CL5'2-49',AL2(1036),AL1(0)                 
         DC    CL10'MA6-49',CL7'Men',CL5'6-49',AL2(1050),AL1(0)                 
         DC    CL10'MA9-49',CL7'Men',CL5'9-49',AL2(1063),AL1(0)                 
         DC    CL10'M12-49',CL7'Men',CL5'12-49',AL2(80),AL1(80)                 
         DC    CL10'M15-49',CL7'Men',CL5'15-49',AL2(86),AL1(86)                 
         DC    CL10'M18-49',CL7'Men',CL5'18-49',AL2(92),AL1(92)                 
         DC    CL10'M21-49',CL7'Men',CL5'21-49',AL2(115),AL1(115)               
         DC    CL10'M25-49',CL7'Men',CL5'25-49',AL2(97),AL1(97)                 
         DC    CL10'M30-49',CL7'Men',CL5'30-49',AL2(1120),AL1(0)                
         DC    CL10'M35-49',CL7'Men',CL5'35-49',AL2(101),AL1(101)               
         DC    CL10'M40-49',CL7'Men',CL5'40-49',AL2(1131),AL1(0)                
         DC    CL10'M50-54',CL7'Men',CL5'50-54',AL2(105),AL1(105)               
         DC    CL10'MA2-54',CL7'Men',CL5'2-54',AL2(1037),AL1(0)                 
         DC    CL10'MA6-54',CL7'Men',CL5'6-54',AL2(1051),AL1(0)                 
         DC    CL10'MA9-54',CL7'Men',CL5'9-54',AL2(1064),AL1(0)                 
         DC    CL10'M12-54',CL7'Men',CL5'12-54',AL2(81),AL1(81)                 
         DC    CL10'M15-54',CL7'Men',CL5'15-54',AL2(87),AL1(87)                 
         DC    CL10'M18-54',CL7'Men',CL5'18-54',AL2(93),AL1(93)                 
         DC    CL10'M21-54',CL7'Men',CL5'21-54',AL2(116),AL1(116)               
         DC    CL10'M25-54',CL7'Men',CL5'25-54',AL2(98),AL1(98)                 
         DC    CL10'M30-54',CL7'Men',CL5'30-54',AL2(1121),AL1(170)              
         DC    CL10'M35-54',CL7'Men',CL5'35-54',AL2(102),AL1(102)               
         DC    CL10'M40-54',CL7'Men',CL5'40-54',AL2(1132),AL1(0)                
         DC    CL10'M45-54',CL7'Men',CL5'45-54',AL2(342),AL1(214)               
         DC    CL10'M55-64',CL7'Men',CL5'55-64',AL2(108),AL1(108)               
         DC    CL10'MA2-64',CL7'Men',CL5'2-64',AL2(1038),AL1(0)                 
         DC    CL10'MA6-64',CL7'Men',CL5'6-64',AL2(1052),AL1(0)                 
         DC    CL10'MA9-64',CL7'Men',CL5'9-64',AL2(1065),AL1(0)                 
         DC    CL10'M12-64',CL7'Men',CL5'12-64',AL2(82),AL1(82)                 
         DC    CL10'M15-64',CL7'Men',CL5'15-64',AL2(88),AL1(88)                 
         DC    CL10'M18-64',CL7'Men',CL5'18-64',AL2(94),AL1(94)                 
         DC    CL10'M21-64',CL7'Men',CL5'21-64',AL2(117),AL1(117)               
         DC    CL10'M25-64',CL7'Men',CL5'25-64',AL2(99),AL1(99)                 
         DC    CL10'M30-64',CL7'Men',CL5'30-64',AL2(1122),AL1(0)                
         DC    CL10'M35-64',CL7'Men',CL5'35-64',AL2(103),AL1(103)               
         DC    CL10'M40-64',CL7'Men',CL5'40-64',AL2(1133),AL1(0)                
         DC    CL10'M45-64',CL7'Men',CL5'45-64',AL2(343),AL1(215)               
         DC    CL10'M50-64',CL7'Men',CL5'50-64',AL2(106),AL1(106)               
         DC    CL10'M65+',CL7'Men',CL5'65+',AL2(110),AL1(110)                   
         DC    CL10'MA2+',CL7'Men',CL5'2+',AL2(1039),AL1(77)                    
         DC    CL10'MA6+',CL7'Men',CL5'6+',AL2(1053),AL1(0)                     
         DC    CL10'MA9+',CL7'Men',CL5'9+',AL2(1066),AL1(0)                     
         DC    CL10'M12+',CL7'Men',CL5'12+',AL2(83),AL1(83)                     
         DC    CL10'M15+',CL7'Men',CL5'15+',AL2(89),AL1(89)                     
         DC    CL10'M18+',CL7'Men',CL5'18+',AL2(95),AL1(95)                     
         DC    CL10'M21+',CL7'Men',CL5'21+',AL2(118),AL1(118)                   
         DC    CL10'M25+',CL7'Men',CL5'25+',AL2(100),AL1(100)                   
         DC    CL10'M30+',CL7'Men',CL5'30+',AL2(1123),AL1(0)                    
         DC    CL10'M35+',CL7'Men',CL5'35+',AL2(104),AL1(104)                   
         DC    CL10'M40+',CL7'Men',CL5'40+',AL2(1134),AL1(0)                    
         DC    CL10'M45+',CL7'Men',CL5'45+',AL2(344),AL1(216)                   
         DC    CL10'M50+',CL7'Men',CL5'50+',AL2(107),AL1(107)                   
         DC    CL10'M55+',CL7'Men',CL5'55+',AL2(109),AL1(109)                   
         DC    CL10'V2-5',CL7'Viewers',CL5'2-5',AL2(121),AL1(121)               
         DC    CL10'V6-8',CL7'Viewers',CL5'6-8',AL2(289),AL1(161)               
         DC    CL10'V2-8',CL7'Viewers',CL5'2-8',AL2(1282),AL1(0)                
         DC    CL10'V9-11',CL7'Viewers',CL5'9-11',AL2(290),AL1(162)             
         DC    CL10'V2-11',CL7'Viewers',CL5'2-11',AL2(122),AL1(122)             
         DC    CL10'V6-11',CL7'Viewers',CL5'6-11',AL2(123),AL1(123)             
         DC    CL10'V12-14',CL7'Viewers',CL5'12-14',AL2(124),AL1(124)           
         DC    CL10'V2-14',CL7'Viewers',CL5'2-14',AL2(299),AL1(0)               
         DC    CL10'V6-14',CL7'Viewers',CL5'6-14',AL2(306),AL1(178)             
         DC    CL10'V9-14',CL7'Viewers',CL5'9-14',AL2(380),AL1(252)             
         DC    CL10'V15-17',CL7'Viewers',CL5'15-17',AL2(126),AL1(126)           
         DC    CL10'V2-17',CL7'Viewers',CL5'2-17',AL2(300),AL1(172)             
         DC    CL10'V6-17',CL7'Viewers',CL5'6-17',AL2(307),AL1(179)             
         DC    CL10'V9-17',CL7'Viewers',CL5'9-17',AL2(1312),AL1(0)              
         DC    CL10'V12-17',CL7'Viewers',CL5'12-17',AL2(125),AL1(125)           
         DC    CL10'V18-20',CL7'Viewers',CL5'18-20',AL2(316),AL1(188)           
         DC    CL10'V2-20',CL7'Viewers',CL5'2-20',AL2(1286),AL1(0)              
         DC    CL10'V6-20',CL7'Viewers',CL5'6-20',AL2(1300),AL1(0)              
         DC    CL10'V9-20',CL7'Viewers',CL5'9-20',AL2(1313),AL1(0)              
         DC    CL10'V12-20',CL7'Viewers',CL5'12-20',AL2(315),AL1(187)           
         DC    CL10'V15-20',CL7'Viewers',CL5'15-20',AL2(1336),AL1(0)            
         DC    CL10'V21-24',CL7'Viewers',CL5'21-24',AL2(317),AL1(189)           
         DC    CL10'V2-24',CL7'Viewers',CL5'2-24',AL2(301),AL1(173)             
         DC    CL10'V6-24',CL7'Viewers',CL5'6-24',AL2(308),AL1(180)             
         DC    CL10'V9-24',CL7'Viewers',CL5'9-24',AL2(1314),AL1(0)              
         DC    CL10'V12-24',CL7'Viewers',CL5'12-24',AL2(256),AL1(128)           
         DC    CL10'V15-24',CL7'Viewers',CL5'15-24',AL2(262),AL1(134)           
         DC    CL10'V18-24',CL7'Viewers',CL5'18-24',AL2(268),AL1(140)           
         DC    CL10'V25-29',CL7'Viewers',CL5'25-29',AL2(291),AL1(163)           
         DC    CL10'V2-29',CL7'Viewers',CL5'2-29',AL2(1288),AL1(0)              
         DC    CL10'V6-29',CL7'Viewers',CL5'6-29',AL2(1302),AL1(0)              
         DC    CL10'V9-29',CL7'Viewers',CL5'9-29',AL2(1315),AL1(0)              
         DC    CL10'V12-29',CL7'Viewers',CL5'12-29',AL2(1327),AL1(0)            
         DC    CL10'V15-29',CL7'Viewers',CL5'15-29',AL2(1338),AL1(0)            
         DC    CL10'V18-29',CL7'Viewers',CL5'18-29',AL2(1348),AL1(0)            
         DC    CL10'V21-29',CL7'Viewers',CL5'21-29',AL2(1357),AL1(0)            
         DC    CL10'V30-34',CL7'Viewers',CL5'30-34',AL2(292),AL1(164)           
         DC    CL10'V2-34',CL7'Viewers',CL5'2-34',AL2(302),AL1(174)             
         DC    CL10'V6-34',CL7'Viewers',CL5'6-34',AL2(309),AL1(181)             
         DC    CL10'V9-34',CL7'Viewers',CL5'9-34',AL2(1316),AL1(0)              
         DC    CL10'V12-34',CL7'Viewers',CL5'12-34',AL2(257),AL1(129)           
         DC    CL10'V15-34',CL7'Viewers',CL5'15-34',AL2(263),AL1(135)           
         DC    CL10'V18-34',CL7'Viewers',CL5'18-34',AL2(269),AL1(141)           
         DC    CL10'V21-34',CL7'Viewers',CL5'21-34',AL2(318),AL1(190)           
         DC    CL10'V25-34',CL7'Viewers',CL5'25-34',AL2(274),AL1(146)           
         DC    CL10'V35-39',CL7'Viewers',CL5'35-39',AL2(293),AL1(165)           
         DC    CL10'V2-39',CL7'Viewers',CL5'2-39',AL2(1290),AL1(0)              
         DC    CL10'V6-39',CL7'Viewers',CL5'6-39',AL2(1304),AL1(0)              
         DC    CL10'V9-39',CL7'Viewers',CL5'9-39',AL2(1317),AL1(0)              
         DC    CL10'V12-39',CL7'Viewers',CL5'12-39',AL2(1329),AL1(0)            
         DC    CL10'V15-39',CL7'Viewers',CL5'15-39',AL2(1340),AL1(0)            
         DC    CL10'V18-39',CL7'Viewers',CL5'18-39',AL2(1350),AL1(0)            
         DC    CL10'V21-39',CL7'Viewers',CL5'21-39',AL2(1359),AL1(0)            
         DC    CL10'V25-39',CL7'Viewers',CL5'25-39',AL2(1367),AL1(0)            
         DC    CL10'V30-39',CL7'Viewers',CL5'30-39',AL2(1374),AL1(0)            
         DC    CL10'V40-44',CL7'Viewers',CL5'40-44',AL2(294),AL1(166)           
         DC    CL10'V2-44',CL7'Viewers',CL5'2-44',AL2(1291),AL1(0)              
         DC    CL10'V6-44',CL7'Viewers',CL5'6-44',AL2(1305),AL1(0)              
         DC    CL10'V9-44',CL7'Viewers',CL5'9-44',AL2(1318),AL1(0)              
         DC    CL10'V12-44',CL7'Viewers',CL5'12-44',AL2(1330),AL1(0)            
         DC    CL10'V15-44',CL7'Viewers',CL5'15-44',AL2(1341),AL1(0)            
         DC    CL10'V18-44',CL7'Viewers',CL5'18-44',AL2(348),AL1(220)           
         DC    CL10'V21-44',CL7'Viewers',CL5'21-44',AL2(1360),AL1(0)            
         DC    CL10'V25-44',CL7'Viewers',CL5'25-44',AL2(349),AL1(221)           
         DC    CL10'V30-44',CL7'Viewers',CL5'30-44',AL2(1375),AL1(0)            
         DC    CL10'V35-44',CL7'Viewers',CL5'35-44',AL2(350),AL1(222)           
         DC    CL10'V45-49',CL7'Viewers',CL5'45-49',AL2(351),AL1(223)           
         DC    CL10'V2-49',CL7'Viewers',CL5'2-49',AL2(303),AL1(175)             
         DC    CL10'V6-49',CL7'Viewers',CL5'6-49',AL2(310),AL1(182)             
         DC    CL10'V9-49',CL7'Viewers',CL5'9-49',AL2(1319),AL1(0)              
         DC    CL10'V12-49',CL7'Viewers',CL5'12-49',AL2(258),AL1(130)           
         DC    CL10'V15-49',CL7'Viewers',CL5'15-49',AL2(264),AL1(136)           
         DC    CL10'V18-49',CL7'Viewers',CL5'18-49',AL2(270),AL1(142)           
         DC    CL10'V21-49',CL7'Viewers',CL5'21-49',AL2(319),AL1(191)           
         DC    CL10'V25-49',CL7'Viewers',CL5'25-49',AL2(275),AL1(147)           
         DC    CL10'V30-49',CL7'Viewers',CL5'30-49',AL2(1376),AL1(0)            
         DC    CL10'V35-49',CL7'Viewers',CL5'35-49',AL2(279),AL1(151)           
         DC    CL10'V40-49',CL7'Viewers',CL5'40-49',AL2(1387),AL1(0)            
         DC    CL10'V50-54',CL7'Viewers',CL5'50-54',AL2(283),AL1(155)           
         DC    CL10'V2-54',CL7'Viewers',CL5'2-54',AL2(304),AL1(176)             
         DC    CL10'V6-54',CL7'Viewers',CL5'6-54',AL2(311),AL1(183)             
         DC    CL10'V9-54',CL7'Viewers',CL5'9-54',AL2(1320),AL1(0)              
         DC    CL10'V12-54',CL7'Viewers',CL5'12-54',AL2(259),AL1(131)           
         DC    CL10'V15-54',CL7'Viewers',CL5'15-54',AL2(265),AL1(137)           
         DC    CL10'V18-54',CL7'Viewers',CL5'18-54',AL2(271),AL1(143)           
         DC    CL10'V21-54',CL7'Viewers',CL5'21-54',AL2(320),AL1(192)           
         DC    CL10'V25-54',CL7'Viewers',CL5'25-54',AL2(276),AL1(148)           
         DC    CL10'V30-54',CL7'Viewers',CL5'30-54',AL2(1377),AL1(250)          
         DC    CL10'V35-54',CL7'Viewers',CL5'35-54',AL2(280),AL1(152)           
         DC    CL10'V40-54',CL7'Viewers',CL5'40-54',AL2(1388),AL1(0)            
         DC    CL10'V45-54',CL7'Viewers',CL5'45-54',AL2(352),AL1(224)           
         DC    CL10'V55-64',CL7'Viewers',CL5'55-64',AL2(286),AL1(158)           
         DC    CL10'V2-64',CL7'Viewers',CL5'2-64',AL2(305),AL1(177)             
         DC    CL10'V6-64',CL7'Viewers',CL5'6-64',AL2(312),AL1(184)             
         DC    CL10'V9-64',CL7'Viewers',CL5'9-64',AL2(1321),AL1(0)              
         DC    CL10'V12-64',CL7'Viewers',CL5'12-64',AL2(260),AL1(132)           
         DC    CL10'V15-64',CL7'Viewers',CL5'15-64',AL2(266),AL1(138)           
         DC    CL10'V18-64',CL7'Viewers',CL5'18-64',AL2(272),AL1(144)           
         DC    CL10'V21-64',CL7'Viewers',CL5'21-64',AL2(321),AL1(193)           
         DC    CL10'V25-64',CL7'Viewers',CL5'25-64',AL2(277),AL1(149)           
         DC    CL10'V30-64',CL7'Viewers',CL5'30-64',AL2(1378),AL1(0)            
         DC    CL10'V35-64',CL7'Viewers',CL5'35-64',AL2(281),AL1(153)           
         DC    CL10'V40-64',CL7'Viewers',CL5'40-64',AL2(1389),AL1(0)            
         DC    CL10'V45-64',CL7'Viewers',CL5'45-64',AL2(353),AL1(225)           
         DC    CL10'V50-64',CL7'Viewers',CL5'50-64',AL2(284),AL1(156)           
         DC    CL10'V65+',CL7'Viewers',CL5'65+',AL2(288),AL1(160)               
         DC    CL10'V2+',CL7'Viewers',CL5'2+',AL2(127),AL1(127)                 
         DC    CL10'V6+',CL7'Viewers',CL5'6+',AL2(313),AL1(185)                 
         DC    CL10'V9+',CL7'Viewers',CL5'9+',AL2(1322),AL1(0)                  
         DC    CL10'V12+',CL7'Viewers',CL5'12+',AL2(261),AL1(133)               
         DC    CL10'V15+',CL7'Viewers',CL5'15+',AL2(267),AL1(139)               
         DC    CL10'V18+',CL7'Viewers',CL5'18+',AL2(273),AL1(145)               
         DC    CL10'V21+',CL7'Viewers',CL5'21+',AL2(322),AL1(194)               
         DC    CL10'V25+',CL7'Viewers',CL5'25+',AL2(278),AL1(150)               
         DC    CL10'V30+',CL7'Viewers',CL5'30+',AL2(1379),AL1(0)                
         DC    CL10'V35+',CL7'Viewers',CL5'35+',AL2(282),AL1(154)               
         DC    CL10'V40+',CL7'Viewers',CL5'40+',AL2(1390),AL1(0)                
         DC    CL10'V45+',CL7'Viewers',CL5'45+',AL2(354),AL1(226)               
         DC    CL10'V50+',CL7'Viewers',CL5'50+',AL2(285),AL1(157)               
         DC    CL10'V55+',CL7'Viewers',CL5'55+',AL2(287),AL1(159)               
         DC    CL10'WW18-20',CL7'Women',CL5'18-20',AL2(358),AL1(230)            
         DC    CL10'WW21-24',CL7'Women',CL5'21-24',AL2(359),AL1(231)            
         DC    CL10'WW18-24',CL7'Women',CL5'18-24',AL2(1859),AL1(0)             
         DC    CL10'WW25-34',CL7'Women',CL5'25-34',AL2(360),AL1(232)            
         DC    CL10'WW18-34',CL7'Women',CL5'18-34',AL2(1861),AL1(0)             
         DC    CL10'WW21-34',CL7'Women',CL5'21-34',AL2(1870),AL1(0)             
         DC    CL10'WW35-44',CL7'Women',CL5'35-44',AL2(361),AL1(233)            
         DC    CL10'WW18-44',CL7'Women',CL5'18-44',AL2(1863),AL1(0)             
         DC    CL10'WW21-44',CL7'Women',CL5'21-44',AL2(1872),AL1(0)             
         DC    CL10'WW25-44',CL7'Women',CL5'25-44',AL2(1880),AL1(0)             
         DC    CL10'WW45-49',CL7'Women',CL5'45-49',AL2(362),AL1(234)            
         DC    CL10'WW18-49',CL7'Women',CL5'18-49',AL2(365),AL1(237)            
         DC    CL10'WW21-49',CL7'Women',CL5'21-49',AL2(1873),AL1(0)             
         DC    CL10'WW25-49',CL7'Women',CL5'25-49',AL2(1881),AL1(0)             
         DC    CL10'WW35-49',CL7'Women',CL5'35-49',AL2(1894),AL1(0)             
         DC    CL10'WW50-54',CL7'Women',CL5'50-54',AL2(363),AL1(235)            
         DC    CL10'WW18-54',CL7'Women',CL5'18-54',AL2(1865),AL1(0)             
         DC    CL10'WW21-54',CL7'Women',CL5'21-54',AL2(1874),AL1(0)             
         DC    CL10'WW25-54',CL7'Women',CL5'25-54',AL2(366),AL1(238)            
         DC    CL10'WW35-54',CL7'Women',CL5'35-54',AL2(1895),AL1(0)             
         DC    CL10'WW45-54',CL7'Women',CL5'45-54',AL2(1904),AL1(0)             
         DC    CL10'WW55+',CL7'Women',CL5'55+',AL2(364),AL1(236)                
         DC    CL10'WW18+',CL7'Women',CL5'18+',AL2(65),AL1(65)                  
         DC    CL10'WW21+',CL7'Women',CL5'21+',AL2(1876),AL1(0)                 
         DC    CL10'WW25+',CL7'Women',CL5'25+',AL2(1884),AL1(0)                 
         DC    CL10'WW35+',CL7'Women',CL5'35+',AL2(1897),AL1(0)                 
         DC    CL10'WW45+',CL7'Women',CL5'45+',AL2(1906),AL1(0)                 
         DC    CL10'WW50+',CL7'Women',CL5'50+',AL2(367),AL1(0)                  
         DC    CL10'MOMS',CL7'',CL5'',AL2(120),AL1(120)                         
         DC    CL10'NONWW',CL7'',CL5'',AL2(66),AL1(66)                          
         DC    CL10'HWC6',CL7'',CL5'',AL2(240),AL1(240)                         
         DC    CL10'HWC12',CL7'',CL5'',AL2(241),AL1(241)                        
         DC    CL10'HWC18',CL7'',CL5'',AL2(242),AL1(242)                        
         DC    X'FF'                                                            
