*          DATA SET DEPROGDEMS AT LEVEL 002 AS OF 11/30/05                      
*                                                                               
* ! !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!         
* !                                                                             
* !                                                                             
* !                                                                             
* ! THIS MEMBER IS NO LONGER USED                                               
* ! HAS BEEN REPLACED BY NEPROGDEMS                                             
* !                                                                             
* !                                                                             
* !                                                                             
* !                                                                             
* ! !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!         
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
*---------------------------------------------------------------------*         
*                    TABLE OF DEMO CATEGORIES                         *         
*              AVAILABLE ON THE NET SFM PROGRAM RECORD                *         
*---------------------------------------------------------------------*         
                                                                                
                                                                                
*SEE DSECT PGDEMD IN DEDEMFORMD FOR FORMAT                                      
PROGDEMS DS    0X                                                               
                                                                                
EVN1488  DC    C'EVN1488',AL2(EVNEND-EVN1488)                                   
         DC    AL2(45)             W18+                                         
         DC    AL2(95)             M18+                                         
         DC    AL2(273)            V18+                                         
         DC    AL2(41)             W1834                                        
         DC    AL2(91)             M1834                                        
         DC    AL2(269)            A1834                                        
         DC    AL2(42)             W1849                                        
         DC    AL2(92)             M1849                                        
         DC    AL2(270)            A1849                                        
         DC    AL2(47)             W2549                                        
         DC    AL2(97)             M2549                                        
         DC    AL2(275)            A2549                                        
         DC    AL2(48)             W2554                                        
         DC    AL2(98)             M2554                                        
         DC    AL2(276)            A2554                                        
         DC    AL2(59)             W55+                                         
         DC    AL2(109)            M55+                                         
         DC    AL2(287)            A55+                                         
         DC    AL2(25)             WTEEN                                        
         DC    AL2(75)             MTEEN                                        
         DC    AL2(125)            TEENS                                        
         DC    AL2(123)            CH611                                        
         DC    AL2(122)            CH211                                        
         DC    AL2(65)             WW18+                                        
         DC    AL2(127)            V2+                                          
         DC    AL2(53)             W3564                                        
         DC    AL2(103)            M3564                                        
         DC    AL2(281)            A3564                                        
         DC    AL2(119)            G2-11                                        
         DC    AL2(20)             B2-11                                        
         DC    AL2(21)             G6-11                                        
         DC    AL2(22)             B6-11                                        
         DC    AL2(34)             W1524                                        
         DC    AL2(84)             M1524                                        
         DC    AL2(262)            V1524                                        
         DC    AL2(242)            HWC18                                        
         DC    AL2(241)            HWC12                                        
         DC    AL2(240)            HWC06                                        
         DC    AL2(71)             W2149                                        
         DC    AL2(115)            M2149                                        
         DC    AL2(319)            V2149                                        
         DC    AL2(334)            W45+                                         
         DC    AL2(344)            M45+                                         
         DC    AL2(354)            V45+                                         
         DC    AL2(67)             W21+                                         
         DC    AL2(118)            M21+                                         
         DC    AL2(322)            V21+                                         
         DC    AL2(290)            V9-11                                        
         DC    AL2(380)            V9-14                                        
         DC    AL2(365)            WW1849                                       
         DC    AL2(366)            WW2554                                       
         DC    AL2(120)            MOMS                                         
         DC    X'FF'                                                            
                                                                                
EVNEND   DC    X'FF'               END OF ALL TABLES                            
