*          DATA SET DERADCATS  AT LEVEL 001 AS OF 09/15/86                      
* TABLE OF PREFIXES USED TO DEFINE RADIO CATAGORIES                             
* CATAGORY NAME FOLLOWED BY CATAGORY NUMBER                                     
*                                                                               
PFXRAD   DS    0CL8                                                             
         DC    AL1(01),C'MSA    '                                               
         DC    AL1(01),C'M      '                                               
         DC    AL1(02),C'TSA    '                                               
         DC    AL1(02),C'T      '                                               
         DC    AL1(03),C'ADI    '                                               
         DC    AL1(03),C'A      '                                               
PRERADES EQU   (*-PFXRAD)/L'PFXRAD                                              
