*          DATA SET DERDAYPRT  AT LEVEL 009 AS OF 09/26/86                      
RDPTAB   DS    0C                                                               
* MONDAY FRIDAY DAYPARTS                                                        
         DC    AL1(01,(2+1*3)),X'95',AL1(QX6A,QX10A) MF 6-10A                   
         DC    AL1(02,(2+1*3)),X'95',AL1(QX10A,QX3P) MF 10A-3P                  
         DC    AL1(03,(2+1*3)),X'95',AL1(QX3P,QX7P)  MF 3-7P                    
         DC    AL1(04,(2+1*3)),X'95',AL1(QX7P,QX12M) MF 7P-12M                  
         DC    AL1(05,(2+1*3)),X'95',AL1(QX6A,QX7P)  MF 6A-7P                   
         DC    AL1(06,(2+1*3)),X'95',AL1(QX6A,QX12M) MF 6A-12M                  
         DC    AL1(07,(2+2*3)),X'95',AL1(QX6A,QX10A) MF 6-10A/3-7P              
         DC                    X'95',AL1(QX3P,QX7P)                             
         DC    AL1(08,(2+1*3)),X'95',AL1(QX1A,QX5E)  MF 1A-5A                   
         DC    AL1(09,(2+1*3)),X'95',AL1(QX10A,QX7P) MF 10A-7P                  
         DC    AL1(10,(2+1*3)),X'95',AL1(QX10A,QX12M) MF 10A-12M                
         DC    AL1(11,(2+1*3)),X'95',AL1(QX3P,QX12M) MF 3P-12M                  
         DC    AL1(12,(2+1*3)),X'95',AL1(QX5A,QX10A) MF 5-10A                   
         DC    AL1(13,(2+2*3)),X'95',AL1(QX6A,QX10A) MF 6-10A/3P-12M            
         DC                    X'95',AL1(QX3P,QX12M)                            
         DC    AL1(14,(2+2*3)),X'95',AL1(QX6A,QX10A) MF 6-10A/7P-12M            
         DC                    X'95',AL1(QX7P,QX12M)                            
         DC    AL1(15,(2+2*3)),X'95',AL1(QX6A,QX3P)  MF 6A-3P/7P-12M            
         DC                    X'95',AL1(QX7P,QX12M)                            
         DC    AL1(16,(2+4*3)),X'95',AL1(QX6A,QX10A) MF 6-10/7-12M/WK           
         DC                    X'95',AL1(QX7P,QX12M)                            
         DC                    X'60',AL1(QX6A,QX12M)                            
         DC                    X'70',AL1(QX6A,QX12M)                            
         DC    AL1(17,(2+2*3)),X'95',AL1(QX10A,QX3P) MF 10A-3P/7P-12M           
         DC                    X'95',AL1(QX7P,QX12M) MF 10A-3P/7P-12M           
         DC    AL1(18,(2+1*3)),X'95',AL1(QX6A,QX3P)  MF 6A-3P                   
*                                                                               
* SATURDAY DAYPARTS                                                             
         DC    AL1(01,(2+1*3)),X'60',AL1(QX6A,QX10A) SA 6-10A                   
         DC    AL1(02,(2+1*3)),X'60',AL1(QX10A,QX3P) SA 10A-3P                  
         DC    AL1(03,(2+1*3)),X'60',AL1(QX3P,QX7P)  SA 3-7P                    
         DC    AL1(04,(2+1*3)),X'60',AL1(QX7P,QX12M) SA 7P-12M                  
         DC    AL1(08,(2+1*3)),X'60',AL1(QX1A,QX5E)  SA 1A-5A                   
*                                                                               
* SUNDAY DAYPARTS                                                               
         DC    AL1(01,(2+1*3)),X'70',AL1(QX6A,QX10A) SU 6-10A                   
         DC    AL1(02,(2+1*3)),X'70',AL1(QX10A,QX3P) SU 10A-3P                  
         DC    AL1(03,(2+1*3)),X'70',AL1(QX3P,QX7P)  SU 3-7P                    
         DC    AL1(04,(2+1*3)),X'70',AL1(QX7P,QX12M) SU 7P-12M                  
         DC    AL1(08,(2+1*3)),X'70',AL1(QX1A,QX5E)  SU 1A-5A                   
         DC    AL1(05,(2+1*3)),X'70',AL1(QX1A,QX5E)  BUG FIX                    
*                                                                               
* WEEKEND DAYPARTS                                                              
         DC    AL1(06,(2+1*3)),X'E7',AL1(QX6A,QX12M) SS 6A-12M                  
*                                                                               
* MONDAY SATURDAY DAYPARTS                                                      
         DC    AL1(01,(2+1*3)),X'96',AL1(QX6A,QX10A) MSA 6-10A                  
         DC    AL1(02,(2+1*3)),X'96',AL1(QX10A,QX3P) MSA 10A-3P                 
         DC    AL1(03,(2+1*3)),X'96',AL1(QX3P,QX7P)  MSA 3-7P                   
         DC    AL1(04,(2+1*3)),X'96',AL1(QX7P,QX12M) MSA 7P-12M                 
         DC    AL1(07,(2+2*3)),X'96',AL1(QX6A,QX10A) MSA 6-10A/3-7P             
         DC                    X'96',AL1(QX3P,QX7P)                             
*                                                                               
* MONDAY SUNDAY DAYPARTS                                                        
         DC    AL1(02,(2+1*3)),X'97',AL1(QX10A,QX3P) MS 10A-3P                  
         DC    AL1(04,(2+1*3)),X'97',AL1(QX7P,QX12M) MS 7P-12M                  
         DC    AL1(06,(2+1*3)),X'97',AL1(QX6A,QX12M) MS 6A-12M                  
         DC    AL1(11,(2+1*3)),X'97',AL1(QX3P,QX12M) MS 3P-12M                  
         DC    AL1(17,(2+2*3)),X'97',AL1(QX10A,QX3P) MS 10A-3P/7P-12M           
         DC                    X'97',AL1(QX7P,QX12M) MS 10A-3P/7P-12M           
         DC    X'00'               END OF TABLE                                 
         SPACE 2                                                                
QX5E     EQU   96                                                               
QX5A     EQU   0                                                                
QX6A     EQU   QX5A+4*1                                                         
QX10A    EQU   QX6A+4*4                                                         
QX3P     EQU   QX10A+4*5                                                        
QX7P     EQU   QX3P+4*4                                                         
QX12M    EQU   QX7P+4*5                                                         
QX1A     EQU   QX12M+4*1                                                        
         SPACE 2                                                                
RDPTABD  DSECT                                                                  
RDPDPT   DS    C                   DAYPART NUMBER                               
RDPLEN   DS    C                   ENTRY LENGTH                                 
RDPDAY   DS    C                   DEMO FILE DAY CODE                           
RDPQXS   DS    C                   START QUARTER HOUR                           
RDPQXE   DS    C                   END QUARTER HOUR                             
