*          DATA SET DERENTABD  AT LEVEL 004 AS OF 05/31/19                      
***********************************************************************         
* COMSCORE LOCAL / NATIONAL DEMOS TABLE (BY CODE)                               
***********************************************************************         
RENTABD  DSECT                                                                  
RENCODE  DS    CL8                 CODE                                         
RENNAME  DS    CL80                NAME                                         
RENDESC  DS    CL12                COMSCORE NUMBER (C'1234        ')            
*                                                                               
         DS    CL28                SPARE                                        
RENLNQ   EQU   *-RENTABD                                                        
                                                                                
***********************************************************************         
* COMSCORE LOCAL / NATIONAL DEMOS TABLE (BY NUMBER/DESC)                        
***********************************************************************         
CSDTABD  DSECT                                                                  
CSDDESC  DS    CL12                COMSCORE NUMBER (C'000000001234')            
CSDCODE  DS    CL8                 CODE                                         
         DS    CL4                 SPARE                                        
CSDLNQ   EQU   *-CSDTABD                                                        
                                                                                
***********************************************************************         
* RENTRAK NETWORK TABLE                                                         
***********************************************************************         
RTKNETD  DSECT                                                                  
RTKNET   DS    CL6                 NCC NETWORK                                  
RTKNET#  DS    CL6                 NCC NETWORK NUMBER                           
RTKNCA#  DS    CL9                 COMSCORE AFFILIATE NUMBER                    
         DS    CL11                SPARE                                        
RTKNLNQ  EQU   *-RTKNETD                                                        
*                                                                               
