*          DATA SET DESQADRGT  AT LEVEL 035 AS OF 01/10/03                      
*                                                                               
*                                                                               
SQADTGT  DC    AL2(0),CL8'TVHH'                                                 
         DC    AL2(1),CL8'W18+'                                                 
         DC    AL2(2),CL8'W1834'                                                
         DC    AL2(3),CL8'W1849'                                                
         DC    AL2(4),CL8'W2549'                                                
         DC    AL2(5),CL8'W2554'                                                
         DC    AL2(6),CL8'M18+'                                                 
         DC    AL2(7),CL8'M1834'                                                
         DC    AL2(8),CL8'M1849'                                                
         DC    AL2(9),CL8'M2549'                                                
         DC    AL2(10),CL8'M2554'                                               
         DC    AL2(11),CL8'TEENS'                                               
         DC    AL2(12),CL8'K211'                                                
         DC    AL2(13),CL8'W35+'                                                
         DC    AL2(14),CL8'W50+'                                                
         DC    AL2(15),CL8'M35+'                                                
         DC    AL2(16),CL8'M50+'                                                
         DC    AL2(17),CL8'A18+'                                                
         DC    AL2(18),CL8'A1834'                                               
         DC    AL2(19),CL8'A1849'                                               
         DC    AL2(20),CL8'A2549'                                               
         DC    AL2(21),CL8'A2554'                                               
         DC    AL2(22),CL8'A35+'                                                
         DC    AL2(23),CL8'A50+'                                                
         DC    AL2(24),CL8'W1824'                                               
         DC    AL2(25),CL8'M1824'                                               
         DC    AL2(26),CL8'A1824'                                               
         DC    AL2(27),CL8'W3549'                                               
         DC    AL2(28),CL8'M3549'                                               
         DC    AL2(29),CL8'A3549'                                               
         DC    AL2(30),CL8'W5054'                                               
         DC    AL2(31),CL8'M5054'                                               
         DC    AL2(32),CL8'A5054'                                               
         DC    AL2(33),CL8'W55+'                                                
         DC    AL2(34),CL8'M55+'                                                
         DC    AL2(35),CL8'A55+'                                                
         DC    AL2(36),CL8'W25+'                                                
         DC    AL2(37),CL8'M25+'                                                
         DC    AL2(38),CL8'A25+'                                                
         DC    AL2(39),CL8'W1850'                                               
         DC    AL2(40),CL8'M1850'                                               
         DC    AL2(41),CL8'A1850'                                               
         DC    AL2(42),CL8'W2534'                                               
         DC    AL2(43),CL8'M2534'                                               
         DC    AL2(44),CL8'A2534'                                               
         DC    AL2(45),CL8'P12+'                                                
         DC    AL2(46),CL8'P1224'                                               
         DC    AL2(47),CL8'P1234'                                               
         DC    AL2(48),CL8'P1249'                                               
         DC    AL2(49),CL8'P1254'                                               
         DC    AL2(50),CL8'W1854'                                               
         DC    AL2(51),CL8'M1854'                                               
         DC    AL2(52),CL8'A1854'                                               
         DC    AL2(53),CL8'W3554'                                               
         DC    AL2(54),CL8'M3554'                                               
         DC    AL2(55),CL8'A3554'                                               
         DC    AL2(65),CL8'A65+'                                                
         DC    AL2(69),CL8'W3564'                                               
         DC    AL2(70),CL8'M3564'                                               
         DC    AL2(71),CL8'A3564'                                               
SQADTGTX DC    X'FF'                                                            
         EJECT                                                                  
SQADDPTR DC    AL2(1),CL8'AM'                                                   
         DC    AL2(2),CL8'DA'                                                   
         DC    AL2(3),CL8'PM'                                                   
         DC    AL2(4),CL8'EV'                                                   
         DC    AL2(5),CL8'AV'                                                   
         DC    AL2(6),CL8'WE'                                                   
         DC    AL2(7),CL8'AP'                                                   
SQADDPRX DC    X'FF'                                                            
*                                                                               
SQADDPTH DC    AL2(0),CL8'PR'                                                   
         DC    AL2(1),CL8'LF'                                                   
         DC    AL2(2),CL8'EF'                                                   
         DC    AL2(3),CL8'EN'                                                   
         DC    AL2(4),CL8'LN'                                                   
         DC    AL2(5),CL8'DAY'                                                  
         DC    AL2(6),CL8'PA'                                                   
         DC    AL2(7),CL8'CF'                                                   
         DC    AL2(8),CL8'EM'                                                   
         DC    AL2(9),CL8'KD'                                                   
         DC    AL2(10),CL8'SP'                                                  
         DC    AL2(11),CL8'WKND'                                                
         DC    AL2(12),CL8'PRE'                                                 
SQADDPHX DC    X'FF'                                                            
         EJECT                                                                  
SQADLV   DC    AL2(0),CL8'AVG'                                                  
         DC    AL2(1),CL8'LOW'                                                  
         DC    AL2(2),CL8'HIGH'                                                 
SQADLVX  DC    X'FF'                                                            
         EJECT                                                                  
