*          DATA SET DESQADTGT  AT LEVEL 040 AS OF 11/27/07                      
*                                                                               
*                                                                               
SQADTGT  DC    AL2(0),CL8'TVHH'                                                 
         DC    AL2(1),CL8'W18+'                                                 
         DC    AL2(2),CL8'W1834'                                                
         DC    AL2(3),CL8'W1849'                                                
         DC    AL2(4),CL8'W2549'                                                
         DC    AL2(5),CL8'W2554'                                                
         DC    AL2(6),CL8'M18+'                                                 
         DC    AL2(7),CL8'M1834'                                                
         DC    AL2(8),CL8'M1849'                                                
         DC    AL2(9),CL8'M2549'                                                
         DC    AL2(10),CL8'M2554'                                               
         DC    AL2(11),CL8'TEENS'                                               
         DC    AL2(12),CL8'K211'                                                
         DC    AL2(13),CL8'W35+'                                                
         DC    AL2(14),CL8'W50+'                                                
         DC    AL2(15),CL8'M35+'                                                
         DC    AL2(16),CL8'M50+'                                                
         DC    AL2(17),CL8'A18+'                                                
         DC    AL2(18),CL8'A1834'                                               
         DC    AL2(19),CL8'A1849'                                               
         DC    AL2(20),CL8'A2549'                                               
         DC    AL2(21),CL8'A2554'                                               
         DC    AL2(22),CL8'A35+'                                                
         DC    AL2(23),CL8'A50+'                                                
         DC    AL2(24),CL8'W1824'                                               
         DC    AL2(25),CL8'M1824'                                               
         DC    AL2(26),CL8'A1824'                                               
         DC    AL2(27),CL8'W3549'                                               
         DC    AL2(28),CL8'M3549'                                               
         DC    AL2(29),CL8'A3549'                                               
         DC    AL2(30),CL8'W5054'                                               
         DC    AL2(31),CL8'M5054'                                               
         DC    AL2(32),CL8'A5054'                                               
         DC    AL2(33),CL8'W55+'                                                
         DC    AL2(34),CL8'M55+'                                                
         DC    AL2(35),CL8'A55+'                                                
         DC    AL2(36),CL8'W25+'                                                
         DC    AL2(37),CL8'M25+'                                                
         DC    AL2(38),CL8'A25+'                                                
         DC    AL2(39),CL8'W1850'                                               
         DC    AL2(40),CL8'M1850'                                               
         DC    AL2(41),CL8'A1850'                                               
         DC    AL2(42),CL8'W2534'                                               
         DC    AL2(43),CL8'M2534'                                               
         DC    AL2(44),CL8'A2534'                                               
         DC    AL2(45),CL8'P12+'                                                
         DC    AL2(46),CL8'P1224'                                               
         DC    AL2(47),CL8'P1234'                                               
         DC    AL2(48),CL8'P1249'                                               
         DC    AL2(49),CL8'P1254'                                               
         DC    AL2(50),CL8'W1854'                                               
         DC    AL2(51),CL8'M1854'                                               
         DC    AL2(52),CL8'A1854'                                               
         DC    AL2(53),CL8'W3554'                                               
         DC    AL2(54),CL8'M3554'                                               
         DC    AL2(55),CL8'A3554'                                               
         DC    AL2(65),CL8'A65+'                                                
         DC    AL2(69),CL8'W3564'                                               
         DC    AL2(70),CL8'M3564'                                               
         DC    AL2(71),CL8'A3564'                                               
         DC    AL2(85),CL8'A21+'                                                
         DC    AL2(86),CL8'A2134'                                               
         DC    AL2(87),CL8'A2149'                                               
         DC    AL2(88),CL8'A2154'                                               
         DC    AL2(89),CL8'M21+'                                                
         DC    AL2(90),CL8'M2134'                                               
         DC    AL2(91),CL8'M2149'                                               
         DC    AL2(92),CL8'M2154'                                               
         DC    AL2(93),CL8'W21+'                                                
         DC    AL2(94),CL8'W2134'                                               
         DC    AL2(95),CL8'W2149'                                               
         DC    AL2(96),CL8'W2154'                                               
SQADTGTX DC    X'FF'                                                            
*                                                                               
SQADTGTR DC    AL2(1),CL8'A18+'                                                 
         DC    AL2(2),CL8'A1834'                                                
         DC    AL2(3),CL8'A1849'                                                
         DC    AL2(4),CL8'A2554'                                                
         DC    AL2(5),CL8'M18+'                                                 
         DC    AL2(6),CL8'M1834'                                                
         DC    AL2(7),CL8'M1849'                                                
         DC    AL2(8),CL8'M2554'                                                
         DC    AL2(9),CL8'W18+'                                                 
         DC    AL2(10),CL8'W1834'                                               
         DC    AL2(11),CL8'W1849'                                               
         DC    AL2(12),CL8'W2554'                                               
         DC    AL2(13),CL8'WKGWM'                                               
         DC    AL2(14),CL8'P1234'                                               
         DC    AL2(15),CL8'TEENS'                                               
         DC    AL2(16),CL8'A2549'                                               
         DC    AL2(17),CL8'M2549'                                               
         DC    AL2(18),CL8'W2549'                                               
         DC    AL2(19),CL8'A3564'                                               
         DC    AL2(20),CL8'M3564'                                               
         DC    AL2(21),CL8'W3564'                                               
         DC    AL2(22),CL8'A1824'                                               
         DC    AL2(23),CL8'M1824'                                               
         DC    AL2(24),CL8'W1824'                                               
         DC    AL2(25),CL8'P1224'                                               
         DC    AL2(26),CL8'M1224'                                               
         DC    AL2(27),CL8'W1224'                                               
         DC    AL2(85),CL8'A21+'                                                
         DC    AL2(86),CL8'A2134'                                               
         DC    AL2(87),CL8'A2149'                                               
         DC    AL2(88),CL8'A2154'                                               
         DC    AL2(89),CL8'M21+'                                                
         DC    AL2(90),CL8'M2134'                                               
         DC    AL2(91),CL8'M2149'                                               
         DC    AL2(92),CL8'M2154'                                               
         DC    AL2(93),CL8'W21+'                                                
         DC    AL2(94),CL8'W2134'                                               
         DC    AL2(95),CL8'W2149'                                               
         DC    AL2(96),CL8'W2154'                                               
SQADRGTX DC    X'FF'                                                            
         EJECT                                                                  
SQADDPTR DS    0CL6                                                             
         DC    CL4'AM  ',AL1(0),AL1(1)                                          
         DC    CL4'DA  ',AL1(1),AL1(2)                                          
         DC    CL4'PM  ',AL1(2),AL1(3)                                          
         DC    CL4'EV  ',AL1(3),AL1(4)                                          
         DC    CL4'AV  ',AL1(4),AL1(5)                                          
         DC    CL4'WE  ',AL1(5),AL1(6)                                          
         DC    CL4'AP  ',AL1(6),AL1(7)                                          
         DC    CL4'MS  ',AL1(10),AL1(11)                                        
SQADDPRX DC    X'FF'                                                            
*                                                                               
SQADDPTH DC    AL2(0),CL8'PR'                                                   
         DC    AL2(1),CL8'LF'                                                   
         DC    AL2(2),CL8'EF'                                                   
         DC    AL2(3),CL8'EN'                                                   
         DC    AL2(4),CL8'LN'                                                   
         DC    AL2(5),CL8'DAY'                                                  
         DC    AL2(6),CL8'PA'                                                   
         DC    AL2(7),CL8'CF'                                                   
         DC    AL2(8),CL8'EM'                                                   
         DC    AL2(9),CL8'KD'                                                   
         DC    AL2(10),CL8'SP'                                                  
         DC    AL2(11),CL8'WKND'                                                
         DC    AL2(12),CL8'PRE'                                                 
SQADDPHX DC    X'FF'                                                            
         EJECT                                                                  
SQADLV   DC    AL2(0),CL8'AVG'                                                  
         DC    AL2(1),CL8'LOW'                                                  
         DC    AL2(2),CL8'HIGH'                                                 
SQADLVX  DC    X'FF'                                                            
         EJECT                                                                  
SQADMKT  DS    0AL4                                                             
         DC    AL2(1),AL2(101)                                                  
         DC    AL2(2),AL2(403)                                                  
         DC    AL2(3),AL2(202)                                                  
         DC    AL2(4),AL2(104)                                                  
         DC    AL2(5),AL2(407)                                                  
         DC    AL2(6),AL2(106)                                                  
         DC    AL2(7),AL2(105)                                                  
         DC    AL2(8),AL2(111)                                                  
         DC    AL2(9),AL2(110)                                                  
         DC    AL2(10),AL2(108)                                                 
         DC    AL2(11),AL2(223)                                                 
         DC    AL2(12),AL2(218)                                                 
         DC    AL2(13),AL2(209)                                                 
         DC    AL2(14),AL2(213)                                                 
         DC    AL2(15),AL2(128)                                                 
         DC    AL2(16),AL2(419)                                                 
         DC    AL2(17),AL2(168)                                                 
         DC    AL2(18),AL2(139)                                                 
         DC    AL2(19),AL2(112)                                                 
         DC    AL2(20),AL2(127)                                                 
         DC    AL2(21),AL2(351)                                                 
         DC    AL2(22),AL2(133)                                                 
         DC    AL2(23),AL2(420)                                                 
         DC    AL2(24),AL2(462)                                                 
         DC    AL2(25),AL2(115)                                                 
         DC    AL2(26),AL2(217)                                                 
         DC    AL2(27),AL2(216)                                                 
         DC    AL2(28),AL2(114)                                                 
         DC    AL2(29),AL2(425)                                                 
         DC    AL2(30),AL2(259)                                                 
         DC    AL2(31),AL2(121)                                                 
         DC    AL2(32),AL2(353)                                                 
         DC    AL2(33),AL2(117)                                                 
         DC    AL2(34),AL2(135)                                                 
         DC    AL2(35),AL2(240)                                                 
         DC    AL2(36),AL2(222)                                                 
         DC    AL2(37),AL2(167)                                                 
         DC    AL2(38),AL2(230)                                                 
         DC    AL2(39),AL2(250)                                                 
         DC    AL2(40),AL2(163)                                                 
         DC    AL2(41),AL2(129)                                                 
         DC    AL2(42),AL2(134)                                                 
         DC    AL2(43),AL2(177)                                                 
         DC    AL2(44),AL2(132)                                                 
         DC    AL2(45),AL2(166)                                                 
         DC    AL2(46),AL2(142)                                                 
         DC    AL2(47),AL2(241)                                                 
         DC    AL2(48),AL2(155)                                                 
         DC    AL2(49),AL2(370)                                                 
         DC    AL2(50),AL2(144)                                                 
         DC    AL2(51),AL2(164)                                                 
         DC    AL2(52),AL2(160)                                                 
         DC    AL2(53),AL2(113)                                                 
         DC    AL2(54),AL2(118)                                                 
         DC    AL2(55),AL2(271)                                                 
         DC    AL2(56),AL2(156)                                                 
         DC    AL2(57),AL2(278)                                                 
         DC    AL2(58),AL2(147)                                                 
         DC    AL2(59),AL2(212)                                                 
         DC    AL2(60),AL2(293)                                                 
         DC    AL2(61),AL2(157)                                                 
         DC    AL2(62),AL2(286)                                                 
         DC    AL2(63),AL2(161)                                                 
         DC    AL2(64),AL2(173)                                                 
         DC    AL2(65),AL2(252)                                                 
         DC    AL2(66),AL2(138)                                                 
         DC    AL2(67),AL2(258)                                                 
         DC    AL2(68),AL2(279)                                                 
         DC    AL2(69),AL2(466)                                                 
         DC    AL2(70),AL2(282)                                                 
         DC    AL2(71),AL2(481)                                                 
         DC    AL2(72),AL2(237)                                                 
         DC    AL2(73),AL2(248)                                                 
         DC    AL2(74),AL2(390)                                                 
         DC    AL2(75),AL2(232)                                                 
         DC    AL2(76),AL2(174)                                                 
         DC    AL2(77),AL2(100)                                                 
         DC    AL2(78),AL2(188)                                                 
         DC    AL2(79),AL2(175)                                                 
         DC    AL2(80),AL2(344)                                                 
         DC    AL2(81),AL2(318)                                                 
         DC    AL2(82),AL2(148)                                                 
         DC    AL2(83),AL2(322)                                                 
         DC    AL2(84),AL2(131)                                                 
         DC    AL2(85),AL2(219)                                                 
         DC    AL2(86),AL2(145)                                                 
         DC    AL2(87),AL2(143)                                                 
         DC    AL2(88),AL2(136)                                                 
         DC    AL2(89),AL2(275)                                                 
         DC    AL2(90),AL2(141)                                                 
         DC    AL2(91),AL2(249)                                                 
         DC    AL2(92),AL2(123)                                                 
         DC    AL2(93),AL2(291)                                                 
         DC    AL2(94),AL2(325)                                                 
         DC    AL2(95),AL2(389)                                                 
         DC    AL2(96),AL2(151)                                                 
         DC    AL2(97),AL2(324)                                                 
         DC    AL2(98),AL2(316)                                                 
         DC    AL2(99),AL2(146)                                                 
         DC    AL2(100),AL2(109)                                                
         DC    AL2(101),AL2(352)                                                
         DC    AL2(102),AL2(225)                                                
         DC    AL2(103),AL2(365)                                                
         DC    AL2(104),AL2(235)                                                
         DC    AL2(105),AL2(154)                                                
         DC    AL2(106),AL2(210)                                                
         DC    AL2(107),AL2(269)                                                
         DC    AL2(108),AL2(276)                                                
         DC    AL2(109),AL2(120)                                                
         DC    AL2(110),AL2(298)                                                
         DC    AL2(111),AL2(181)                                                
         DC    AL2(112),AL2(234)                                                
         DC    AL2(113),AL2(228)                                                
         DC    AL2(114),AL2(227)                                                
         DC    AL2(115),AL2(102)                                                
         DC    AL2(116),AL2(428)                                                
         DC    AL2(117),AL2(203)                                                
         DC    AL2(118),AL2(302)                                                
         DC    AL2(119),AL2(455)                                                
         DC    AL2(120),AL2(242)                                                
         DC    AL2(121),AL2(122)                                                
         DC    AL2(122),AL2(224)                                                
         DC    AL2(123),AL2(292)                                                
         DC    AL2(124),AL2(119)                                                
         DC    AL2(125),AL2(107)                                                
         DC    AL2(126),AL2(140)                                                
         DC    AL2(127),AL2(401)                                                
         DC    AL2(128),AL2(211)                                                
         DC    AL2(129),AL2(410)                                                
         DC    AL2(130),AL2(251)                                                
         DC    AL2(131),AL2(204)                                                
         DC    AL2(132),AL2(150)                                                
         DC    AL2(133),AL2(159)                                                
         DC    AL2(134),AL2(116)                                                
         DC    AL2(135),AL2(200)                                                
         DC    AL2(136),AL2(273)                                                
         DC    AL2(137),AL2(439)                                                
         DC    AL2(138),AL2(317)                                                
         DC    AL2(139),AL2(130)                                                
         DC    AL2(140),AL2(236)                                                
         DC    AL2(141),AL2(103)                                                
         DC    AL2(142),AL2(357)                                                
         DC    AL2(143),AL2(287)                                                
         DC    AL2(144),AL2(305)                                                
         DC    AL2(145),AL2(171)                                                
         DC    AL2(146),AL2(137)                                                
         DC    AL2(147),AL2(205)                                                
         DC    AL2(148),AL2(468)                                                
         DC    AL2(149),AL2(233)                                                
         DC    AL2(150),AL2(125)                                                
         DC    AL2(151),AL2(400)                                                
         DC    AL2(152),AL2(262)                                                
         DC    AL2(153),AL2(411)                                                
         DC    AL2(154),AL2(413)                                                
         DC    AL2(155),AL2(126)                                                
         DC    AL2(157),AL2(364)                                                
         DC    AL2(158),AL2(170)                                                
         DC    AL2(159),AL2(206)                                                
         DC    AL2(160),AL2(270)                                                
         DC    AL2(161),AL2(309)                                                
         DC    AL2(162),AL2(358)                                                
         DC    AL2(163),AL2(310)                                                
         DC    AL2(164),AL2(198)                                                
         DC    AL2(165),AL2(176)                                                
         DC    AL2(166),AL2(355)                                                
         DC    AL2(167),AL2(356)                                                
         DC    AL2(168),AL2(244)                                                
         DC    AL2(169),AL2(311)                                                
         DC    AL2(170),AL2(149)                                                
         DC    AL2(171),AL2(334)                                                
         DC    AL2(172),AL2(243)                                                
         DC    AL2(173),AL2(238)                                                
         DC    AL2(174),AL2(257)                                                
         DC    AL2(175),AL2(337)                                                
         DC    AL2(176),AL2(354)                                                
         DC    AL2(177),AL2(359)                                                
         DC    AL2(178),AL2(256)                                                
         DC    AL2(179),AL2(153)                                                
         DC    AL2(180),AL2(362)                                                
         DC    AL2(181),AL2(192)                                                
         DC    AL2(182),AL2(197)                                                
         DC    AL2(183),AL2(371)                                                
         DC    AL2(185),AL2(402)                                                
         DC    AL2(186),AL2(346)                                                
         DC    AL2(187),AL2(231)                                                
         DC    AL2(188),AL2(367)                                                
         DC    AL2(189),AL2(373)                                                
         DC    AL2(190),AL2(247)                                                
         DC    AL2(191),AL2(360)                                                
         DC    AL2(192),AL2(239)                                                
         DC    AL2(193),AL2(158)                                                
         DC    AL2(194),AL2(261)                                                
         DC    AL2(195),AL2(152)                                                
         DC    AL2(196),AL2(169)                                                
         DC    AL2(197),AL2(196)                                                
         DC    AL2(198),AL2(349)                                                
         DC    AL2(199),AL2(340)                                                
         DC    AL2(200),AL2(183)                                                
         DC    AL2(201),AL2(398)                                                
         DC    AL2(206),AL2(165)                                                
         DC    AL2(209),AL2(343)                                                
         DC    AL2(210),AL2(404)                                                
         DC    AL2(213),AL2(182)                                                
         DC    AL2(214),AL2(184)                                                
         DC    AL2(216),AL2(336)                                                
         DC    AL2(218),AL2(421)                                                
         DC    AL2(220),AL2(226)                                                
         DC    AL2(222),AL2(366)                                                
         DC    AL2(223),AL2(345)                                                
         DC    AL2(230),AL2(347)                                                
         DC    X'FF'                                                            
