*          DATA SET DESQADTABS AT LEVEL 001 AS OF 02/03/17                      
QTRTAB   DS    0CL2                                                             
         DC    CL1'1',AL1(2)                                                    
         DC    CL1'2',AL1(5)                                                    
         DC    CL1'3',AL1(7)                                                    
         DC    CL1'4',AL1(11)                                                   
         DC    AL1(0)                                                           
*                                                                               
DYPTAB   DC    CL4'PR  ',AL1(0),AL1(5),CL15'PRIME TIME'                         
DYPTABQ  EQU   *-DYPTAB                                                         
         DC    CL4'LF  ',AL1(1),AL1(6),CL15'LATE FRINGE'                        
         DC    CL4'EF  ',AL1(2),AL1(3),CL15'EARLY FRINGE'                       
         DC    CL4'EN  ',AL1(3),AL1(7),CL15'EARLY NEWS'                         
         DC    CL4'LN  ',AL1(4),AL1(8),CL15'LATE NEWS'                          
         DC    CL4'DA  ',AL1(5),AL1(2),CL15'DAYTIME'                            
         DC    CL4'PA  ',AL1(6),AL1(4),CL15'PRIME ACCESS'                       
         DC    CL4'EM  ',AL1(8),AL1(1),CL15'EARLY MORNING'                      
         DC    CL2'ZZ'                                                          
*                                                                               
DYPTABR  DC    CL4'AM  ',AL1(0),AL1(1),CL15'MORNING DRIVE'                      
DYPTABRQ EQU   *-DYPTABR                                                        
         DC    CL4'DA  ',AL1(1),AL1(2),CL15'DAYTIME'                            
         DC    CL4'PM  ',AL1(2),AL1(3),CL15'AFTERNOON DRIVE'                    
         DC    CL4'EV  ',AL1(3),AL1(4),CL15'EVENING'                            
         DC    CL4'AV  ',AL1(4),AL1(5),CL15'AVERAGE'                            
         DC    CL4'WE  ',AL1(5),AL1(6),CL15'WEEKEND'                            
         DC    CL4'AP  ',AL1(6),AL1(7),CL15''                                   
         DC    CL4'MS  ',AL1(10),AL1(11),CL15'MON-SUN AVERAGE'                  
         DC    CL4'MF  ',AL1(12),AL1(13),CL15'MON-FRI AVERAGE'                  
         DC    CL4'WD  ',AL1(14),AL1(15),CL15'WEEKEND DAY'                      
         DC    CL2'ZZ'                                                          
*                                                                               
DEMOTAB  DS    0CL9                                                             
         DC    CL8'M18+',AL1(6)                                                 
         DC    CL8'M1834',AL1(8)                                                
         DC    CL8'M1849',AL1(8)                                                
         DC    CL8'M2549',AL1(8)                                                
         DC    CL8'M2554',AL1(8)                                                
         DC    CL8'M35+',AL1(6)                                                 
         DC    CL8'M50+',AL1(6)                                                 
         DC    CL8'M1824',AL1(8)                                                
         DC    CL8'M2534',AL1(8)                                                
         DC    CL8'M3554',AL1(8)                                                
         DC    CL8'W18+',AL1(6)                                                 
         DC    CL8'W1834',AL1(8)                                                
         DC    CL8'W1849',AL1(8)                                                
         DC    CL8'W2549',AL1(8)                                                
         DC    CL8'W2554',AL1(8)                                                
         DC    CL8'W35+',AL1(6)                                                 
         DC    CL8'W50+',AL1(6)                                                 
         DC    CL8'W1824',AL1(8)                                                
         DC    CL8'W2534',AL1(8)                                                
         DC    CL8'W3554',AL1(8)                                                
         DC    CL8'A18+',AL1(6)                                                 
         DC    CL8'A1834',AL1(8)                                                
         DC    CL8'A1849',AL1(8)                                                
         DC    CL8'A2549',AL1(8)                                                
         DC    CL8'A2554',AL1(8)                                                
         DC    CL8'A35+',AL1(6)                                                 
         DC    CL8'A50+',AL1(6)                                                 
         DC    CL8'A1824',AL1(8)                                                
         DC    CL8'A25+',AL1(6)                                                 
         DC    CL8'A3554',AL1(8)                                                
         DC    CL8'A3564',AL1(8)                                                
         DC    CL8'P1224',AL1(8)                                                
         DC    CL8'P1234',AL1(8)                                                
         DC    CL8'P1249',AL1(8)                                                
         DC    CL8'K211',AL1(7)                                                 
         DC    CL8'TEENS',AL1(7)                                                
         DC    CL8'HH',AL1(7)                                                   
         DC    CL8'W3549',AL1(8)                                                
         DC    CL8'M3549',AL1(8)                                                
         DC    CL8'A3549',AL1(8)                                                
         DC    CL8'W1850',AL1(8)                                                
         DC    CL8'M1850',AL1(8)                                                
         DC    CL8'A1850',AL1(8)                                                
         DC    CL8'W1854',AL1(8)                                                
         DC    CL8'M1854',AL1(8)                                                
         DC    CL8'A1854',AL1(8)                                                
         DC    CL8'A2534',AL1(8)                                                
         DC    CL8'W5054',AL1(8)                                                
         DC    CL8'M5054',AL1(8)                                                
         DC    CL8'A5054',AL1(8)                                                
         DC    CL8'W55+',AL1(6)                                                 
         DC    CL8'M55+',AL1(6)                                                 
         DC    CL8'A55+',AL1(6)                                                 
         DC    CL8'A65+',AL1(6)                                                 
         DC    CL8'W3564',AL1(8)                                                
         DC    CL8'M3564',AL1(8)                                                
         DC    CL8'W25+',AL1(6)                                                 
         DC    CL8'M25+',AL1(6)                                                 
         DC    CL8'M2134',AL1(8)                                                
         DC    CL8'P12+',AL1(6)                                                 
         DC    CL8'P1254',AL1(8)                                                
         DC    CL8'W1224',AL1(8)                                                
         DC    CL8'M1224',AL1(8)                                                
         DC    CL8'WKGWM',AL1(8)                                                
         DC    CL8'A21+',AL1(6)                                                 
         DC    CL8'A2134',AL1(8)                                                
         DC    CL8'A2149',AL1(8)                                                
         DC    CL8'A2154',AL1(8)                                                
         DC    CL8'M21+',AL1(6)                                                 
         DC    CL8'M2149',AL1(8)                                                
         DC    CL8'M2154',AL1(8)                                                
         DC    CL8'W21+',AL1(6)                                                 
         DC    CL8'W2134',AL1(8)                                                
         DC    CL8'W2149',AL1(8)                                                
         DC    CL8'W2154',AL1(8)                                                
DEMTABEN EQU   *                                                                
         DC    XL2'0000'                                                        
*                                                                               
L_CELQ   EQU   X'41'               LOW_CPP                                      
A_CELQ   EQU   X'43'               AVG_CPP                                      
H_CELQ   EQU   X'45'               HIGH_CPP                                     
L_D_CELQ EQU   X'47'               LOW_DMA_CPM                                  
L_T_CELQ EQU   X'49'               LOW_TSA_CPM                                  
A_D_CELQ EQU   X'51'               AVG_DMA_CPM                                  
A_T_CELQ EQU   X'53'               AVG_TSA_CPM                                  
H_D_CELQ EQU   X'55'               HIGH_DMA_CPM                                 
H_T_CELQ EQU   X'57'               HIGH_TSA_CPM                                 
