*          DATA SET DESQADMKTT AT LEVEL 001 AS OF 02/28/17                      
SQADMKT  DS    0XL42                                                            
         DC    AL2(1),CL40'NETWORK'                                             
         DC    AL2(2),CL40'BIRMINGHAM MERTO'                                    
         DC    AL2(4),CL40'MANCHESTER, NH TSA'                                  
         DC    AL2(10),CL40'NHSI SANTA CLARA SP RPT'                            
         DC    AL2(12),CL40'NHSI FRESNO KTFF SP RPT'                            
         DC    AL2(18),CL40'BROWARD CTY SPCL'                                   
         DC    AL2(19),CL40'LONGVIEW-TYLER TAR'                                 
         DC    AL2(20),CL40'TN/KY TAR'                                          
         DC    AL2(21),CL40'E+SE KY TRADE REPORT'                               
         DC    AL2(22),CL40'KFYR SATELLITE RPT'                                 
         DC    AL2(24),CL40'LUFKIN/NACOGDOCHES TAR'                             
         DC    AL2(25),CL40'FLORIDA TAR'                                        
         DC    AL2(37),CL40'SPECIAL FOXNET'                                     
         DC    AL2(40),CL40'FORT SMITH TAR'                                     
         DC    AL2(41),CL40'N.W. ARKANSAS TAR'                                  
         DC    AL2(42),CL40'FLAGSTAFF,AZ TAR'                                   
         DC    AL2(43),CL40'SANTA CLARA SPCL/METRO'                             
         DC    AL2(52),CL40'YAKIMA SPECIAL/TA'                                  
         DC    AL2(53),CL40'TRI-CITIES SPECIAL/TA'                              
         DC    AL2(58),CL40'SOUTHERN NEW HAMPSHIRE TAR'                         
         DC    AL2(61),CL40'DADE COUNTY SPCL'                                   
         DC    AL2(71),CL40'SPECIAL WVII REPORT FEB/95'                         
         DC    AL2(72),CL40'NHI LA CABLE DMA(LPM)'                              
         DC    AL2(73),CL40'NHI LA CABLE WIRED(LPM)'                            
         DC    AL2(78),CL40'LAKERS EXCLUSION REPORT'                            
         DC    AL2(100),CL40'PORTLAND-AUBURN'                                   
         DC    AL2(101),CL40'NEW YORK, NY'                                      
         DC    AL2(102),CL40'BINGHAMTON, NY'                                    
         DC    AL2(103),CL40'MACON, GA'                                         
         DC    AL2(104),CL40'PHILADELPHIA, PA'                                  
         DC    AL2(105),CL40'DETROIT, MI'                                       
         DC    AL2(106),CL40'BOSTON (MANCHESTER)'                               
         DC    AL2(107),CL40'SAVANNAH, GA'                                      
         DC    AL2(108),CL40'PITTSBURGH, PA'                                    
         DC    AL2(109),CL40'FT. WAYNE, IN'                                     
         DC    AL2(110),CL40'CLEVELAND, OH'                                     
         DC    AL2(111),CL40'WASHINGTON, DC (HAGRSTWN)'                         
         DC    AL2(112),CL40'BALTIMORE, MD'                                     
         DC    AL2(113),CL40'FLINT-SAGINAW-BAY CITY'                            
         DC    AL2(114),CL40'BUFFALO'                                           
         DC    AL2(115),CL40'CINCINNATI, OH'                                    
         DC    AL2(116),CL40'ERIE, PA'                                          
         DC    AL2(117),CL40'CHARLOTTE'                                         
         DC    AL2(118),CL40'GREENSBORO-H.POINT-W.SALEM'                        
         DC    AL2(119),CL40'CHARLESTON, SC'                                    
         DC    AL2(120),CL40'AUGUSTA, GA'                                       
         DC    AL2(121),CL40'PROVIDENCE-NEW BEDFORD'                            
         DC    AL2(122),CL40'COLUMBUS, GA'                                      
         DC    AL2(123),CL40'BURLINGTON-PLATTSBURGH, VT-NY'                     
         DC    AL2(124),CL40'ATLANTA -EXTENDED'                                 
         DC    AL2(125),CL40'ALBANY, GA'                                        
         DC    AL2(126),CL40'UTICA'                                             
         DC    AL2(127),CL40'INDIANAPOLIS, IN'                                  
         DC    AL2(128),CL40'MIAMI-FT. LAUDERDALE'                              
         DC    AL2(129),CL40'LOUISVILLE, KY'                                    
         DC    AL2(130),CL40'TALLAHASSEE-THOMASVILLE'                           
         DC    AL2(131),CL40'TRI-CITIES, TN-VA'                                 
         DC    AL2(132),CL40'ALBANY-SCHENECTADY-TROY, NY'                       
         DC    AL2(133),CL40'HARTFORD && NEW HAVEN'                             
         DC    AL2(134),CL40'ORLANDO-DAYTONA BCH-MELBRN'                        
         DC    AL2(135),CL40'COLUMBUS, OH'                                      
         DC    AL2(136),CL40'YOUNGSTOWN'                                        
         DC    AL2(137),CL40'BANGOR, ME'                                        
         DC    AL2(138),CL40'ROCHESTER, NY'                                     
         DC    AL2(139),CL40'TAMPA-ST. PETE (SARASOTA)'                         
         DC    AL2(140),CL40'TRAVERSE CITY-CADILLAC'                            
         DC    AL2(141),CL40'LEXINGTON'                                         
         DC    AL2(142),CL40'DAYTON, OH'                                        
         DC    AL2(143),CL40'SPRINGFIELD-HOLYOKE'                               
         DC    AL2(144),CL40'NORFOLK-PORTSMTH-NEWPT NWS'                        
         DC    AL2(145),CL40'GREENVILLE-N.BERN-WASHNGTN'                        
         DC    AL2(146),CL40'COLUMBIA, SC'                                      
         DC    AL2(147),CL40'TOLEDO, OH'                                        
         DC    AL2(148),CL40'WEST PALM BEACH-FT. PIERCE'                        
         DC    AL2(149),CL40'WATERTOWN, NY'                                     
         DC    AL2(150),CL40'WILMINGTON, NC'                                    
         DC    AL2(151),CL40'LANSING'                                           
         DC    AL2(152),CL40'PRESQUE ISLE'                                      
         DC    AL2(153),CL40'MARQUETTE'                                         
         DC    AL2(154),CL40'WHEELING-STEUBENVILLE'                             
         DC    AL2(155),CL40'SYRACUSE, NY'                                      
         DC    AL2(156),CL40'RICHMOND-PETERSBURG'                               
         DC    AL2(157),CL40'KNOXVILLE, TN'                                     
         DC    AL2(158),CL40'LIMA, OH'                                          
         DC    AL2(159),CL40'BLUEFIELD-BECKLEY-OAK HILL'                        
         DC    AL2(160),CL40'RALEIGH-DURHAM (FAYETVLLE)'                        
         DC    AL2(161),CL40'JACKSONVILLE, FL'                                  
         DC    AL2(162),CL40'SARASOTA'                                          
         DC    AL2(163),CL40'GRAND RAPIDS-KALMZOO-B.CRK'                        
         DC    AL2(164),CL40'CHARLESTON-HUNTINGTON'                             
         DC    AL2(165),CL40'ELMIRA'                                            
         DC    AL2(166),CL40'HARRISBURG-LNCSTR-LEB-YORK'                        
         DC    AL2(167),CL40'GREENVLL-SPART-ASHEVLL-AND'                        
         DC    AL2(168),CL40'ATLANTA, GA'                                       
         DC    AL2(169),CL40'HARRISONBURG, VA'                                  
*****    DC    AL2(170),CL40'FLORENCE-MYRTLE BEACH'                             
         DC    AL2(170),CL40'MYRTLE BEACH-FLORENCE'                             
         DC    AL2(171),CL40'FT. MYERS-NAPLES'                                  
         DC    AL2(172),CL40'MANCHESTER'                                        
         DC    AL2(173),CL40'ROANOKE-LYNCHBURG, VA'                             
         DC    AL2(174),CL40'JOHNSTOWN-ALTOONA'                                 
         DC    AL2(175),CL40'CHATTANOOGA, TN'                                   
         DC    AL2(176),CL40'SALISBURY'                                         
         DC    AL2(177),CL40'WILKES BARRE-SCRANTON, PA'                         
         DC    AL2(178),CL40'NEW HAVEN(METRO)'                                  
         DC    AL2(179),CL40'BRUNSWICK, GA SMA'                                 
         DC    AL2(181),CL40'TERRE HAUTE, IN'                                   
         DC    AL2(182),CL40'LAFAYETTE, IN'                                     
         DC    AL2(183),CL40'ALPENA'                                            
         DC    AL2(184),CL40'CHARLOTTESVILLE, VA'                               
         DC    AL2(185),CL40'AKRON'                                             
         DC    AL2(188),CL40'SOUTH BEND-ELKHART'                                
         DC    AL2(189),CL40'HARTFORD METRO'                                    
         DC    AL2(191),CL40'BURLINGTON/PLATTSBRUG METRO'                       
         DC    AL2(192),CL40'GAINESVILLE'                                       
         DC    AL2(193),CL40'WORCESTER'                                         
         DC    AL2(194),CL40'HAGERSTOWN'                                        
         DC    AL2(195),CL40'AKRON'                                             
         DC    AL2(196),CL40'ZANESVILLE'                                        
         DC    AL2(197),CL40'PARKERSBURG'                                       
         DC    AL2(198),CL40'CLARKSBURG-WESTON'                                 
         DC    AL2(199),CL40'SARASOTA SMA'                                      
         DC    AL2(200),CL40'CORPUS CHRISTI, TX'                                
         DC    AL2(201),CL40'WASHINGTON D.C. METRO'                             
         DC    AL2(202),CL40'CHICAGO, IL'                                       
         DC    AL2(203),CL40'JOPLIN-PITTSBURG'                                  
         DC    AL2(204),CL40'COLUMBIA-JEFFERSON CITY, MO (III'                  
         DC    AL2(205),CL40'TOPEKA, KS'                                        
         DC    AL2(206),CL40'DOTHAN, AL'                                        
         DC    AL2(207),CL40'TRAVERSE CITY-CADILLAC'                            
         DC    AL2(208),CL40'HARTFORD, VT. TA'                                  
         DC    AL2(209),CL40'ST. LOUIS, MO'                                     
         DC    AL2(210),CL40'ROCKFORD, IL'                                      
         DC    AL2(211),CL40'ROCHESTR-MASON CITY-AUSTIN'                        
         DC    AL2(212),CL40'SHREVEPORT, LA'                                    
         DC    AL2(213),CL40'MINNEAPOLIS-ST. PAUL, MN'                          
*        DC    AL2(215),CL40'LAFAYETTE'                                         
         DC    AL2(216),CL40'KANSAS CITY, KS-MO'                                
         DC    AL2(217),CL40'MILWAUKEE'                                         
         DC    AL2(218),CL40'HOUSTON'                                           
         DC    AL2(219),CL40'SPRINGFIELD, MO'                                   
         DC    AL2(220),CL40'TUSCALOOSA, AL.'                                   
         DC    AL2(222),CL40'NEW ORLEANS, LA'                                   
         DC    AL2(223),CL40'DALLAS-FT. WORTH, TX'                              
         DC    AL2(224),CL40'SIOUX CITY, IA'                                    
         DC    AL2(225),CL40'WACO-TEMPLE-BRYAN'                                 
         DC    AL2(226),CL40'VICTORIA'                                          
         DC    AL2(227),CL40'WICHITA FALLS && LAWTON'                           
         DC    AL2(228),CL40'MONROE-EL DORADO'                                  
         DC    AL2(229),CL40'LAWTON(METRO)'                                     
         DC    AL2(230),CL40'BIRMINGHAM (ANN AND TUSC)'                         
         DC    AL2(231),CL40'OTTUMWA-KIRKSVILLE'                                
         DC    AL2(232),CL40'PADUCAH-C.GIRD-HARBG-MT VN'                        
         DC    AL2(233),CL40'ODESSA-MIDLAND, TX'                                
         DC    AL2(234),CL40'AMARILLO, TX'                                      
         DC    AL2(235),CL40'AUSTIN, TX'                                        
         DC    AL2(236),CL40'HARLINGEN-WSLCO-BRNSVL-MCA'                        
         DC    AL2(237),CL40'CEDAR RAPIDS-WTRLO-IWC&&DUB'                       
         DC    AL2(238),CL40'ST. JOSEPH'                                        
         DC    AL2(239),CL40'JACKSON, TN'                                       
         DC    AL2(240),CL40'MEMPHIS, TN'                                       
         DC    AL2(241),CL40'SAN ANTONIO, TX'                                   
         DC    AL2(242),CL40'LAFAYETTE, LA'                                     
         DC    AL2(243),CL40'LAKE CHARLES, LA'                                  
         DC    AL2(244),CL40'ALEXANDRIA, LA'                                    
         DC    AL2(246),CL40'ANNISTON'                                          
         DC    AL2(247),CL40'GREENWOOD-GREENVILLE'                              
         DC    AL2(248),CL40'CHAMPAIGN&&SPRNGFLD-DECATUR'                       
         DC    AL2(249),CL40'EVANSVILLE, IN'                                    
         DC    AL2(250),CL40'OKLAHOMA CITY, OK'                                 
         DC    AL2(251),CL40'LUBBOCK, TX'                                       
         DC    AL2(252),CL40'OMAHA'                                             
         DC    AL2(253),CL40'SPRNFLD-DECATUR(METRO)'                            
         DC    AL2(254),CL40'HASTINGS-KEARNEY(METRO)'                           
         DC    AL2(255),CL40'DUBUQUE'                                           
         DC    AL2(256),CL40'PANAMA CITY, FL'                                   
         DC    AL2(257),CL40'SHERMAN-ADA'                                       
         DC    AL2(258),CL40'GREEN BAY-APPLETON'                                
         DC    AL2(259),CL40'NASHVILLE, TN'                                     
         DC    AL2(260),CL40'ANNISTON PRIOR NOV89'                              
         DC    AL2(261),CL40'SAN ANGELO, TX'                                    
         DC    AL2(262),CL40'ABILENE-SWEETWATER'                                
         DC    AL2(269),CL40'MADISON, WI'                                       
         DC    AL2(270),CL40'FT. SMITH-FAY-SPRNGDL-RGRS'                        
         DC    AL2(271),CL40'TULSA, OK'                                         
         DC    AL2(273),CL40'COLUMBUS-TUPELO-WEST POINT'                        
         DC    AL2(275),CL40'PEORIA-BLOOMINGTON'                                
         DC    AL2(276),CL40'DULUTH-SUPERIOR, MN-WI'                            
         DC    AL2(278),CL40'WICHITA-HUTCHINSON PLUS'                           
         DC    AL2(279),CL40'DES MOINES-AMES'                                   
         DC    AL2(280),CL40'FLORENCE, AL SMA'                                  
         DC    AL2(282),CL40'DAVENPORT-R.ISLAND-MOLINE'                         
         DC    AL2(286),CL40'MOBILE-PENSACOLA (FT WALT)'                        
         DC    AL2(287),CL40'MINOT-BISMARCK-DICKINSON'                          
         DC    AL2(288),CL40'NEW HAVEN METRO'                                   
         DC    AL2(290),CL40'GREAT BEND'                                        
         DC    AL2(291),CL40'HUNTSVILLE-DECATUR (FLOR)'                         
         DC    AL2(292),CL40'BEAUMONT-PORT ARTHUR, TX'                          
         DC    AL2(293),CL40'LITTLE ROCK-PINE BLUFF'                            
         DC    AL2(297),CL40'ALEXANDRIA,MN'                                     
         DC    AL2(298),CL40'MONTGOMERY (SELMA)'                                
         DC    AL2(299),CL40'COLORADO SPRINGS TA'                               
         DC    AL2(302),CL40'LA CROSSE-EAU CLAIRE'                              
         DC    AL2(303),CL40'EAU CLAIRE'                                        
         DC    AL2(304),CL40'LA CROSSE'                                         
         DC    AL2(305),CL40'WAUSAU-RHINELANDER'                                
         DC    AL2(306),CL40'RHINELANDER'                                       
         DC    AL2(309),CL40'TYLER-LONGVIEW(LFKN&&NCGD)'                        
         DC    AL2(310),CL40'HATTIESBURG-LAUREL'                                
         DC    AL2(311),CL40'MERIDIAN, MS'                                      
         DC    AL2(316),CL40'BATON ROUGE, LA'                                   
         DC    AL2(317),CL40'QUINCY-HANNIBAL-KEOKUK'                            
         DC    AL2(318),CL40'JACKSON, MS'                                       
         DC    AL2(322),CL40'LINCOLN && HASTINGS-KRNY'                          
         DC    AL2(324),CL40'FARGO-VALLEY CITY'                                 
         DC    AL2(325),CL40'SIOUX FALLS(MITCHELL)'                             
         DC    AL2(333),CL40'FLORENCE,AL'                                       
         DC    AL2(334),CL40'JONESBORO, AR'                                     
         DC    AL2(335),CL40'HAGERSTOWN SMA'                                    
         DC    AL2(336),CL40'BOWLING GREEN, KY'                                 
         DC    AL2(337),CL40'MANKATO'                                           
         DC    AL2(338),CL40'BOWLING GREEN'                                     
         DC    AL2(339),CL40'FT. DODGE'                                         
         DC    AL2(340),CL40'NORTH PLATTE'                                      
         DC    AL2(341),CL40'HAYS-GOODLAND'                                     
         DC    AL2(342),CL40'ENSIGN-GARDEN CITY'                                
         DC    AL2(343),CL40'ANCHORAGE, AK'                                     
         DC    AL2(344),CL40'HONOLULU, HI'                                      
         DC    AL2(345),CL40'FAIRBANKS'                                         
         DC    AL2(346),CL40'BILOXI-GULFPORT'                                   
         DC    AL2(347),CL40'JUNEAU'                                            
         DC    AL2(349),CL40'LAREDO, TX'                                        
         DC    AL2(350),CL40'FLAGSTAFF'                                         
         DC    AL2(351),CL40'DENVER'                                            
         DC    AL2(352),CL40'COLORADO SPRINGS-PUEBLO'                           
         DC    AL2(353),CL40'PHOENIX, AZ'                                       
         DC    AL2(354),CL40'BUTTE-BOZEMAN'                                     
         DC    AL2(355),CL40'GREAT FALLS, MT'                                   
         DC    AL2(356),CL40'BILLINGS, MT'                                      
         DC    AL2(357),CL40'BOISE, ID'                                         
         DC    AL2(358),CL40'IDAHO FALLS-POCATELLO'                             
         DC    AL2(359),CL40'CHEYENNE-SCOTTSBLUF'                               
         DC    AL2(360),CL40'TWIN FALLS'                                        
         DC    AL2(361),CL40'ROSWELL'                                           
         DC    AL2(362),CL40'MISSOULA'                                          
         DC    AL2(363),CL40'FLAGSTAFF'                                         
         DC    AL2(364),CL40'RAPID CITY, SD'                                    
         DC    AL2(365),CL40'EL PASO, TX'                                       
         DC    AL2(366),CL40'HELENA'                                            
         DC    AL2(367),CL40'CASPER-RIVERTON'                                   
         DC    AL2(370),CL40'SALT LAKE CITY'                                    
         DC    AL2(371),CL40'YUMA-EL CENTRO'                                    
         DC    AL2(373),CL40'GRAND JUNCTION-MONTROSE'                           
         DC    AL2(374),CL40'THE ALABAMA REPORT'                                
         DC    AL2(375),CL40'GRAND RAPIDS (METRO)'                              
         DC    AL2(376),CL40'OKLAHOMA CITY(METRO)'                              
         DC    AL2(377),CL40'NORTHWEST ARKANSAS TAR'                            
         DC    AL2(379),CL40'ALBUQUERQUE (METRO)'                               
         DC    AL2(382),CL40'HARTFORD && NEW HAVEN'                             
         DC    AL2(384),CL40'EUGENE METRO'                                      
         DC    AL2(385),CL40'CHICAGO EXTENDED'                                  
         DC    AL2(387),CL40'DICKINSON'                                         
         DC    AL2(389),CL40'TUCSON (SIERRA VISTA)'                             
         DC    AL2(390),CL40'ALBUQUERQUE-SANTA FE'                              
         DC    AL2(391),CL40'FARMINGTON'                                        
         DC    AL2(392),CL40'FARMINGTON'                                        
         DC    AL2(398),CL40'GLENDIVE'                                          
         DC    AL2(400),CL40'BAKERSFIELD, CA'                                   
         DC    AL2(401),CL40'EUGENE'                                            
         DC    AL2(402),CL40'EUREKA, CA'                                        
         DC    AL2(403),CL40'LOS ANGELES, CA'                                   
         DC    AL2(404),CL40'PALM SPRINGS, CA'                                  
*        DC    AL2(405),CL40'PALM SPRINGS'                                      
         DC    AL2(406),CL40'SANTA ROSA, CA. TAR'                               
         DC    AL2(407),CL40'SAN FRANCISCO-OAK-SAN JOSE'                        
         DC    AL2(410),CL40'YAKIMA-PASCO-RCHLND-KNNWCK'                        
         DC    AL2(411),CL40'RENO, NV'                                          
         DC    AL2(413),CL40'MEDFORD-KLAMATH FALLS'                             
         DC    AL2(419),CL40'SEATTLE-TACOMA, WA'                                
         DC    AL2(420),CL40'PORTLAND, OR'                                      
         DC    AL2(421),CL40'BEND, OR'                                          
         DC    AL2(425),CL40'SAN DIEGO, CA'                                     
         DC    AL2(428),CL40'MONTEREY-SALINAS'                                  
         DC    AL2(439),CL40'LAS VEGAS, NV'                                     
         DC    AL2(455),CL40'SANTABARBRA-SANMAR-SANLUOB'                        
         DC    AL2(462),CL40'SACRAMNTO-STKTON-MODESTO'                          
         DC    AL2(466),CL40'FRESNO-VISALIA'                                    
         DC    AL2(468),CL40'CHICO-REDDING'                                     
         DC    AL2(469),CL40'BRYAN/COLLEGE (TA)'                                
         DC    AL2(480),CL40'SANTA CLARA (METRO)'                               
         DC    AL2(481),CL40'SPOKANE, WA'                                       
         DC    AL2(498),CL40'BELLINGHAM'                                        
         DC    AL2(499),CL40'WICHITA (METRO)'                                   
         DC    AL2(514),CL40'NHI BOSTON DMA'                                    
         DC    AL2(515),CL40'NHI BOSTON CBL'                                    
         DC    AL2(546),CL40'ABILENE, TX'                                       
         DC    AL2(565),CL40'DMA FOR WPTZ/WNNE'                                 
         DC    AL2(588),CL40'HOUSTON WS EXCLUSION'                              
         DC    AL2(589),CL40'NORTH BAY SPECIAL REPORT'                          
         DC    AL2(615),CL40'PHOENIX SUN EXCLUSION'                             
         DC    AL2(653),CL40'JUNEAU SPECIAL'                                    
         DC    AL2(669),CL40'SPCL RPT WDSU'                                     
         DC    AL2(670),CL40'SPCL RPT KGWN'                                     
         DC    AL2(901),CL40'GREENVILLE-NB-WASHNC 3W'                           
         DC    AL2(906),CL40'WFMZ SPECIAL REPORT'                               
         DC    AL2(909),CL40'SP RPT WRNN'                                       
         DC    AL2(911),CL40'WPMI-TV MOBILE/PENSA. SPC'                         
         DC    AL2(912),CL40'FL TRADING AREA SUPP RPT'                          
         DC    AL2(923),CL40'SEATTLE METRO SPCL X RPT'                          
         DC    AL2(926),CL40'WNEG SPECIAL REPORT'                               
         DC    AL2(943),CL40'SF DMA ASIAN REPORT'                               
         DC    AL2(949),CL40'CHICAGO WS EXCLUSION'                              
         DC    AL2(961),CL40'BINGHAMTON SPCL RPT'                               
         DC    AL2(966),CL40'SIOUX FALLS SPCL RPT'                              
         DC    AL2(967),CL40'KOAA SPCL RPT'                                     
         DC    AL2(969),CL40'WBMG SPCL RPT (METRO)'                             
         DC    AL2(970),CL40'WNEG SPCL RPT (METRO)'                             
         DC    AL2(979),CL40'WPDE SPCL RPT'                                     
         DC    AL2(991),CL40'WESTERN NC SPCL'                                   
         DC    AL2(992),CL40'SE SONICS/MARINERS EXCL'                           
         DC    AL2(993),CL40'SLC JAZZ EXCLUSION'                                
         DC    X'FF'                                                            
