*          DATA SET DETVQCDAT  AT LEVEL 015 AS OF 09/30/08                      
*---------------------------------------------------------------------*         
*                                                                     *         
* TVQ/FORETEL CABLE CALENDAR TABLE.                                   *         
*                                                                     *         
*---------------------------------------------------------------------*         
TVQCDATE DC    AL1(99,03),AL1(99,14),AL1(99,02)  01/11/99-04/04/99              
         DC    AL1(99,15),AL1(99,32),AL1(99,05)  04/05/99-08/08/99              
         DC    AL1(99,33),AL1(99,42),AL1(99,09)  08/09/99-10/17/99              
         DC    AL1(99,43),AL1(100,02),AL1(99,11)  10/18/99-01/09/00             
         DC    AL1(100,03),AL1(100,14),AL1(100,02)  01/10/00-04/02/00           
         DC    AL1(100,15),AL1(100,32),AL1(100,05)  04/03/00-08/06/00           
         DC    AL1(100,33),AL1(100,42),AL1(100,09)  08/07/00-10/15/00           
         DC    AL1(100,43),AL1(101,01),AL1(100,11)  10/16/00-01/07/01           
         DC    AL1(101,03),AL1(101,13),AL1(101,02)  01/08/01-04/01/01           
         DC    AL1(101,14),AL1(101,32),AL1(101,05) ?04/03/00-08/06/00           
         DC    AL1(255,255,255,255,255,255)                                     
