*          DATA SET DMDMGRTAB  AT LEVEL 015 AS OF 09/09/20                      
***********************************************************************         
* TABLE OF VALID DMGR ACTION NAMES                                    *         
* CL7    ACTION NAME                                                  *         
* XL1    ACTION INTERNAL NUMBER                                       *         
* XL1    ACTION NAME LENGTH                                           *         
***********************************************************************         
QDMADD   EQU   X'01'                                                            
QDMREAD  EQU   X'02'                                                            
QDMRSEQ  EQU   X'03'                                                            
QDMRDHI  EQU   X'04'                                                            
QDMDEL   EQU   X'05'                                                            
QDMRDIR  EQU   X'06'                                                            
QDMWRT   EQU   X'08'                                                            
QDMPRINT EQU   X'09'                                                            
QDMFAST  EQU   X'0A'                                                            
QGETREC  EQU   X'0B'                                                            
QPUTREC  EQU   X'0C'                                                            
QADDREC  EQU   X'0D'                                                            
QDMRSRV  EQU   X'0E'                                                            
QDMRLSE  EQU   X'0F'                                                            
QADFREC  EQU   X'10'                                                            
                                                                                
         CNOP  2,4                                                              
DMACTS   DC    H'9'                                                             
         DC    A(DMACTSX)                                                       
DMRDHI   DC    CL7'DMRDHI ',AL1(QDMRDHI),X'06'                                  
DMRSEQ   DC    CL7'DMRSEQ ',AL1(QDMRSEQ),X'06'                                  
GETREC   DC    CL7'GETREC ',AL1(QGETREC),X'06'                                  
DMADD    DC    CL7'DMADD  ',AL1(QDMADD),X'05'                                   
DMREAD   DC    CL7'DMREAD ',AL1(QDMREAD),X'06'                                  
DMDEL    DC    CL7'DMDEL  ',AL1(QDMDEL),X'05'                                   
DMRDIR   DC    CL7'DMRDIR ',AL1(QDMRDIR),X'06'                                  
         DC    CL7'       ',X'0701'                                             
DMWRT    DC    CL7'DMWRT  ',AL1(QDMWRT),X'05'                                   
DMPRINT  DC    CL7'DMPRINT',AL1(QDMPRINT),X'07'                                 
DMFAST   DC    CL7'DMFAST ',AL1(QDMFAST),X'06'                                  
PUTREC   DC    CL7'PUTREC ',AL1(QPUTREC),X'06'                                  
ADDREC   DC    CL7'ADDREC ',AL1(QADDREC),X'06'                                  
DMRSRV   DC    CL7'DMRSRV ',AL1(QDMRSRV),X'06'                                  
DMRLSE   DC    CL7'DMRLSE ',AL1(QDMRLSE),X'06'                                  
ADFREC   DC    CL7'ADFREC ',AL1(QADFREC),X'06'                                  
         DC    CL7'DMKEY  ',X'1105'    DMKEY LABEL REMOVED - DEDEMFILE          
QDMKEY   EQU   X'11'                                                            
DMGCI    DC    CL7'DMGCI  ',X'1205'                                             
QDMGCI   EQU   X'12'                                                            
*&&US*&& DC    CL7'GETDSK ',X'0B06'    SAME AS GETREC                           
*                                                                               
DMACTSX  EQU   *-1                                                              
         EJECT                                                                  
***********************************************************************         
* EACH ENTRY IN THIS TABLE CORRESPONDS TO A LOGICAL SYSTEM NUMBER     *         
* CONTAINS ADDRESS OF START LOCATION IN FILE NAME TABLE               *         
***********************************************************************         
*&&UK                                                                           
DMSYSTS  DC    A(0)                ..                                           
         DC    A(SRVFLES)          01                                           
         DC    A(0)                ..                                           
         DC    A(0)                ..                                           
         DC    A(MEDFLES)          04                                           
         DC    A(MPLFLES)          05                                           
         DC    A(ACCFLES)          06                                           
         DC    A(FEEFLES)          07                                           
         DC    A(0)                ..                                           
         DC    A(MBAFLES)          09                                           
         DC    A(CONFLES)          0A                                           
         DC    A(0)                ..                                           
         DC    A(0)                ..                                           
         DC    A(0)                ..                                           
         DC    A(PERFLES)          0E                                           
         DC    A(0)                ..                                           
*&&                                                                             
*&&US                                                                           
DMSYSTS  DC    A(0)                ..                                           
         DC    A(SRVFLES)          01                                           
         DC    A(SPTFLES)          02                                           
         DC    A(0)                ..                                           
         DC    A(PRTFLES)          04                                           
         DC    A(0)                                                             
         DC    A(ACCFLES)          06                                           
         DC    A(TALFLES)          07                                           
         DC    A(REPFLES)          08                                           
         DC    A(MBAFLES)          09                                           
         DC    A(CONFLES)          0A                                           
         DC    A(0)                ..                                           
         DC    A(DEMFLES)          0C                                           
         DC    A(TRFFLES)          0D                                           
         DC    A(PERFLES)          0E                                           
         DC    A(0)                ..                                           
*&&                                                                             
         EJECT                                                                  
***********************************************************************         
* TABLE OF VALID DMGR FILE NAMES                                      *         
* CL7    FILE NAME                                                    *         
* XL1    FILE INTERNAL NUMBER                                         *         
* XL1    FILE EXTERNAL NUMBER (USED TO IDENTIFY FILE IN RECOVERY)     *         
* XL1    FILE LOGICAL DELETE FIELD LENGTH                             *         
* XL1    FILE LOGICAL DELETE FIELD DISPLACEMENT                       *         
* XL1    FLAG X'01'=RECOVERY,X'02'=6CHR CLC,X'80'=WORKFILE,X'40'=PRTQ *         
*             X'20'=WRKF                                              *         
***********************************************************************         
         CNOP  2,4                                                              
DMGRFLES DS    0C                                                               
DMFILES  DC    H'12'                                                            
         DC    A(DMFILESX)                                                      
                                                                                
*&&SPT                                                                          
SPTFLES  DC    XL7'00',X'02',AL4(0)                                             
DSPTDIR  DC    C'SPTDIR ',X'2323',X'000000'                                     
DXSPDIR  DC    C'XSPDIR ',X'3636',X'000000'                                     
DSPTFILE DC    C'SPTFILE',X'2121',X'031000'                                     
DXSPFILE DC    C'XSPFILE',X'3737',X'031000'                                     
DSTATION DC    C'STATION',X'2222',X'000000'                                     
         DC    C'STAFILE',X'2222',X'000000'                                     
DUNTDIR  DC    C'UNTDIR ',X'2727',X'000000'                                     
DUNTFIL  DC    C'UNTFIL ',X'2A2A',X'031700'                                     
DREQUEST DC    C'REQUEST',X'2525',X'014000'                                     
DRECOVER DC    C'RECOVER',X'2424',X'010401'                                     
*                                                                               
DDEMDRN  DC    C'DEMDIR ',X'2D2D',X'000000' DEMDIR MASTER DIRECTORY             
         DC    C'NDEMDIR',X'2D2D',X'000000' DEMDIR - FORCE READ                 
DDEMDRA  DC    C'DEMDIR ',X'2D2F',X'000000' DEMDIRA                             
DDEMDRR  DC    C'DEMDIR ',X'3030',X'000000' DEMDIRR  (RADIO)                    
*                                                                               
DDEMFLN  DC    C'DEMFIL ',X'2626',X'000000' DEMFILN                             
         DC    C'NDEMFIL',X'2626',X'000000' DEMFILN                             
         DC    C'DEMFIL ',X'2628',X'000000' EXTFIL = DEMFILN + 2                
DDEMFLW  DC    C'DEMFIL ',X'262B',X'000000' DEMFILW                             
         DC    C'WDEMFIL',X'262B',X'000000' DEMFILW - FORCE READ                
DDEMFLO  DC    C'DEMFIL ',X'263B',X'000000' DEMFILO                             
         DC    C'ODEMFIL',X'263B',X'000000' DEMFILO - FORCE READ                
DDEMFLP  DC    C'DEMFIL ',X'263D',X'000000' DEMFILP                             
         DC    C'PDEMFIL',X'263D',X'000000' DEMFILP - FORCE READ                
DDEMFLQ  DC    C'DEMFIL ',X'263F',X'000000' DEMFILQ                             
         DC    C'QDEMFIL',X'263F',X'000000' DEMFILQ - FORCE READ                
DDEMFLU  DC    C'DEMFIL ',X'2648',X'000000' DEMFILU                             
         DC    C'UDEMFIL',X'2648',X'000000' DEMFILU - FORCE READ                
DDEMFLV  DC    C'DEMFIL ',X'2649',X'000000' DEMFILV                             
         DC    C'VDEMFIL',X'2649',X'000000' DEMFILV - FORCE READ                
DDEMFLY  DC    C'DEMFIL ',X'264A',X'000000' DEMFILY                             
         DC    C'YDEMFIL',X'264A',X'000000' DEMFILY - FORCE READ                
DDEMFLB  DC    C'DEMFIL ',X'264B',X'000000' DEMFILB                             
         DC    C'BDEMFIL',X'264B',X'000000' DEMFILB - FORCE READ                
DDEMFLC  DC    C'DEMFIL ',X'264C',X'000000' DEMFILC                             
         DC    C'CDEMFIL',X'264C',X'000000' DEMFILC - FORCE READ                
DDEMFLD  DC    C'DEMFIL ',X'264D',X'000000' DEMFILD                             
         DC    C'DDEMFIL',X'264D',X'000000' DEMFILD - FORCE READ                
DDEMFLE  DC    C'DEMFIL ',X'264E',X'000000' DEMFILE                             
         DC    C'EDEMFIL',X'264E',X'000000' DEMFILE - FORCE READ                
DDEMFL7  DC    C'DEMFIL ',X'2657',X'000000' DEMFIL7                             
         DC    C'7DEMFIL',X'2657',X'000000' DEMFIL7 - FORCE READ                
DDEMFL9  DC    C'DEMFIL ',X'2659',X'000000' DEMFIL9                             
         DC    C'9DEMFIL',X'2659',X'000000' DEMFIL9 - FORCE READ                
DDEMFL3  DC    C'DEMFIL ',X'26C3',X'000000' DEMFIL3                             
         DC    C'3DEMFIL',X'26C3',X'000000' DEMFIL3 - FORCE READ                
DDEMFL4  DC    C'DEMFIL ',X'265F',X'000000' DEMFIL4                             
         DC    C'4DEMFIL',X'265F',X'000000' DEMFIL4 - FORCE READ                
DDEMFL5  DC    C'DEMFIL ',X'26C4',X'000000' DEMFIL5                             
         DC    C'5DEMFIL',X'26C4',X'000000' DEMFIL5 - FORCE READ                
DDEMFLF  DC    C'DEMFIL ',X'26C6',X'000000' DEMFILF                             
         DC    C'FDEMFIL',X'26C6',X'000000' DEMFILF - FORCE READ                
DDEMFLG  DC    C'DEMFIL ',X'26C7',X'000000' DEMFILG                             
         DC    C'GDEMFIL',X'26C7',X'000000' DEMFILG - FORCE READ                
DDEMFLH  DC    C'DEMFIL ',X'26C8',X'000000' DEMFILH                             
         DC    C'HDEMFIL',X'26C8',X'000000' DEMFILH - FORCE READ                
DDEMFLI  DC    C'DEMFIL ',X'26C9',X'000000' DEMFILI                             
         DC    C'IDEMFIL',X'26C9',X'000000' DEMFILI - FORCE READ                
DDEMFLJ  DC    C'DEMFIL ',X'26CA',X'000000' DEMFILJ                             
         DC    C'JDEMFIL',X'26CA',X'000000' DEMFILJ - FORCE READ                
DDEMFLK  DC    C'DEMFIL ',X'26CB',X'000000' DEMFILK                             
         DC    C'KDEMFIL',X'26CB',X'000000' DEMFILK - FORCE READ                
DDEMFLL  DC    C'DEMFIL ',X'26CC',X'000000' DEMFILL                             
         DC    C'LDEMFIL',X'26CC',X'000000' DEMFILL - FORCE READ                
DDEMFLM  DC    C'DEMFIL ',X'26CD',X'000000' DEMFILM                             
         DC    C'MDEMFIL',X'26CD',X'000000' DEMFILM - FORCE READ                
DDEMFLS  DC    C'DEMFIL ',X'26CE',X'000000' DEMFILS                             
         DC    C'SDEMFIL',X'26CE',X'000000' DEMFILS - FORCE READ                
DDEMFLT  DC    C'DEMFIL ',X'2679',X'000000' DEMFILT                             
         DC    C'TDEMFIL',X'2679',X'000000' DEMFILT - FORCE READ                
DDEMFL$  DC    C'DEMFIL ',X'267A',X'000000' DEMFIL$                             
         DC    C'$DEMFIL',X'267A',X'000000' DEMFIL$ - FORCE READ                
DDEMFLNA DC    C'DEMFIL ',X'267B',X'000000' DEMFLNA                             
         DC    C'NADEMFL',X'267B',X'000000' DEMFLNA - FORCE READ                
DDEMFLNB DC    C'DEMFIL ',X'2698',X'000000' DEMFLNB                             
         DC    C'NBDEMFL',X'2698',X'000000' DEMFLNB - FORCE READ                
DDEMFLNC DC    C'DEMFIL ',X'2699',X'000000' DEMFLNC                             
         DC    C'NCDEMFL',X'2699',X'000000' DEMFLNC - FORCE READ                
DDEMFLND DC    C'DEMFIL ',X'269A',X'000000' DEMFLND                             
         DC    C'NDDEMFL',X'269A',X'000000' DEMFLND - FORCE READ                
DDEMFLNE DC    C'DEMFIL ',X'269B',X'000000' DEMFLNE                             
         DC    C'NEDEMFL',X'269B',X'000000' DEMFLNE - FORCE READ                
DDEMFLNF DC    C'DEMFIL ',X'269C',X'000000' DEMFLNF                             
         DC    C'NFDEMFL',X'269C',X'000000' DEMFLNF - FORCE READ                
DDEMFLNG DC    C'DEMFIL ',X'269D',X'000000' DEMFLNG                             
         DC    C'NGDEMFL',X'269D',X'000000' DEMFLNG - FORCE READ                
DDEMFLNH DC    C'DEMFIL ',X'26B7',X'000000' DEMFLNH                             
         DC    C'NHDEMFL',X'26B7',X'000000' DEMFLNH - FORCE READ                
DDEMFLNI DC    C'DEMFIL ',X'26B8',X'000000' DEMFLNI                             
         DC    C'NIDEMFL',X'26B8',X'000000' DEMFLNI - FORCE READ                
DDEMFLNJ DC    C'DEMFIL ',X'26B9',X'000000' DEMFLNJ                             
         DC    C'NJDEMFL',X'26B9',X'000000' DEMFLNJ - FORCE READ                
DDEMFLNK DC    C'DEMFIL ',X'26BA',X'000000' DEMFLNK                             
         DC    C'NKDEMFL',X'26BA',X'000000' DEMFLNK - FORCE READ                
DDEMFLNL DC    C'DEMFIL ',X'26BB',X'000000' DEMFLNL                             
         DC    C'NLDEMFL',X'26BB',X'000000' DEMFLNL - FORCE READ                
DDEMFLNM DC    C'DEMFIL ',X'26BC',X'000000' DEMFLNM                             
         DC    C'NMDEMFL',X'26BC',X'000000' DEMFLNM - FORCE READ                
DDEMFLZ  DC    C'DEMFIL ',X'26CF',X'000000' DEMFILZ                             
         DC    C'ZDEMFIL',X'26CF',X'000000' DEMFILZ - FORCE READ                
DDEMFLTN DC    C'DEMFIL ',X'2651',X'000000' DEMFLTN                             
         DC    C'TNDEMFL',X'2651',X'000000' DEMFLTN - FORCE READ                
DDEMFL1  DC    C'DEMFIL ',X'26C1',X'000000' DEMFIL1                             
         DC    C'1DEMFIL',X'26C1',X'000000' DEMFIL1 - FORCE READ                
DDEMFL6  DC    C'DEMFIL ',X'2656',X'000000' DEMFIL6                             
         DC    C'6DEMFIL',X'2656',X'000000' DEMFIL6 - FORCE READ                
DDEMFL8  DC    C'DEMFIL ',X'2658',X'000000' DEMFIL8                             
         DC    C'8DEMFIL',X'2658',X'000000' DEMFIL8 - FORCE READ                
*                                                                               
DDEMFLA  DC    C'DEMFIL ',X'2628',X'000000' DEMFILA                             
         DC    C'ADEMFIL',X'2628',X'000000' DEMFILA - FORCE READ                
DDEMFL2  DC    C'DEMFIL ',X'26C2',X'000000' DEMFIL2                             
         DC    C'2DEMFIL',X'26C2',X'000000' DEMFIL2 - FORCE READ                
DDEMFLTA DC    C'DEMFIL ',X'2652',X'000000' DEMFLTA                             
         DC    C'TADEMFL',X'2652',X'000000' DEMFLTA - FORCE READ                
*                                                                               
DDEMFLR  DC    C'DEMFIL ',X'3131',X'000000' DEMFILR   (RADIO)                   
         DC    C'RDEMFIL',X'3131',X'000000' DEMFILR - FORCE READ                
         DC    C'DEMFIL ',X'3153',X'000000' DEMFLTR                             
         DC    C'TRDEMFL',X'3153',X'000000' DEMFLTR - FORCE READ                
*                                                                               
DPAVDIR  DC    C'PAVDIR ',X'2C2C',X'000000' PAVFIL MASTER DIRECTORY             
         DC    C'PAVFIL ',X'2E2E',X'000000' PAVFIL                              
         DC    C'PAVFIL ',X'2EC0',X'000000' PAVFILB                             
         DC    C'BPAVFIL',X'2EC0',X'000000' PAVFILB - FORCE READ                
         DC    C'PAVFIL ',X'2E7E',X'000000' PAVFILC                             
         DC    C'CPAVFIL',X'2E7E',X'000000' PAVFILC - FORCE READ                
         DC    C'PAVFIL ',X'2EC5',X'000000' PAVFILA                             
         DC    C'APAVFIL',X'2EC5',X'000000' PAVFILA - FORCE READ                
         DC    C'PAVFIL ',X'2E55',X'000000' PAVFLTA                             
         DC    C'TAPAVFL',X'2E55',X'000000' PAVFLTA - FORCE READ                
*                                                                               
DNTIDIR  DC    C'NTIDIR ',X'3838',X'000000' NTIDIR                              
DNTIFIL  DC    C'NTIFILE',X'393C',X'000000' NTIFIL(N)                           
         DC    C'ONTIFIL',X'393C',X'000000' NTIFILO - FORCE READ                
         DC    C'NTIFILE',X'3939',X'000000' NTIFILN                             
         DC    C'NNTIFIL',X'3939',X'000000' NTIFILN - FORCE READ                
         DC    C'NTIFILE',X'393E',X'000000' NTIFILP                             
         DC    C'PNTIFIL',X'393E',X'000000' NTIFILP - FORCE READ                
         DC    C'NTIFIL ',X'3929',X'000000' NTIFILQ                             
         DC    C'QNTIFIL',X'3929',X'000000' NTIFILQ - FORCE READ                
         DC    C'NTIFIL ',X'393A',X'000000' NTIFILW                             
         DC    C'WNTIFIL',X'393A',X'000000' NTIFILW - FORCE READ                
         DC    C'NTIFIL ',X'3947',X'000000' NTIFILY                             
         DC    C'YNTIFIL',X'3947',X'000000' NTIFILY - FORCE READ                
         DC    C'NTIFIL ',X'394F',X'000000' NTIFILZ                             
         DC    C'ZNTIFIL',X'394F',X'000000' NTIFILZ - FORCE READ                
         DC    C'NTIFIL ',X'395A',X'000000' NTIFILA                             
         DC    C'ANTIFIL',X'395A',X'000000' NTIFILA - FORCE READ                
         DC    C'NTIFIL ',X'395B',X'000000' NTIFILB                             
         DC    C'BNTIFIL',X'395B',X'000000' NTIFILB - FORCE READ                
         DC    C'NTIFIL ',X'395C',X'000000' NTIFILC                             
         DC    C'CNTIFIL',X'395C',X'000000' NTIFILC - FORCE READ                
         DC    C'NTIFIL ',X'395D',X'000000' NTIFILD                             
         DC    C'DNTIFIL',X'395D',X'000000' NTIFILD - FORCE READ                
         DC    C'NTIFIL ',X'395E',X'000000' NTIFILE                             
         DC    C'ENTIFIL',X'395E',X'000000' NTIFILE - FORCE READ                
         DC    C'NTIFIL ',X'3977',X'000000' NTIFILF                             
         DC    C'FNTIFIL',X'3977',X'000000' NTIFILF - FORCE READ                
         DC    C'NTIFIL ',X'3978',X'000000' NTIFILG                             
         DC    C'GNTIFIL',X'3978',X'000000' NTIFILG - FORCE READ                
         DC    C'NTIFIL ',X'397C',X'000000' NTIFILH                             
         DC    C'HNTIFIL',X'397C',X'000000' NTIFILH - FORCE READ                
         DC    C'NTIFIL ',X'397D',X'000000' NTIFILI                             
         DC    C'INTIFIL',X'397D',X'000000' NTIFILI - FORCE READ                
         DC    C'NTIFIL ',X'39BD',X'000000' NTIFILJ                             
         DC    C'JNTIFIL',X'39BD',X'000000' NTIFILJ - FORCE READ                
         DC    C'NTIFIL ',X'39BE',X'000000' NTIFILK                             
         DC    C'KNTIFIL',X'39BE',X'000000' NTIFILK - FORCE READ                
         DC    C'NTIFIL ',X'398B',X'000000' NTIFILL                             
         DC    C'LNTIFIL',X'398B',X'000000' NTIFILL - FORCE READ                
         DC    C'NTIFIL ',X'398C',X'000000' NTIFILM                             
         DC    C'MNTIFIL',X'398C',X'000000' NTIFILM - FORCE READ                
         DC    C'NTIFIL ',X'398D',X'000000' NTIFILR                             
         DC    C'RNTIFIL',X'398D',X'000000' NTIFILR - FORCE READ                
         DC    C'NTIFIL ',X'3954',X'000000' NTIFLTA                             
         DC    C'TANTIFL',X'3954',X'000000' NTIFLTA - FORCE READ                
                                                                                
DSTRFDIR DC    C'TRFDIR ',X'3333',X'000000'                                     
DSTRFFIL DC    C'TRFFILE',X'3232',X'031000'                                     
QSPTFILE EQU   X'21'                                                            
QXSPFILE EQU   X'37'                                                            
QSPTDIR  EQU   X'23'                                                            
QXSPDIR  EQU   X'36'                                                            
QSTAFILE EQU   X'22'                                                            
*&&                                                                             
                                                                                
*&&PRT                                                                          
PRTFLES  DC    XL7'00',X'04',AL4(0)                                             
DPRTDIR  DC    C'PRTDIR ',X'4040',X'000000'                                     
DPUBDIR  DC    C'PUBDIR ',X'4141',X'000000'                                     
DPRTFILE DC    C'PRTFILE',X'4242',X'031D00'                                     
DPUBFILE DC    C'PUBFILE',X'4343',X'031D00'                                     
DPRECOVE DC    C'PRECOVE',X'4444',X'010401'                                     
         DC    C'RECOVER',X'4444',X'010401'                                     
DPREQUES DC    C'PREQUES',X'4545',X'014000'                                     
         DC    C'REQUEST',X'4545',X'014000'                                     
*&&                                                                             
                                                                                
*&&MED                                                                          
MEDFLES  DC    XL7'00',X'04',AL4(0)                                             
DMEDIR   DC    C'MEDIR  ',X'4141',X'000000'                                     
DMEDFILE DC    C'MEDFILE',X'4242',X'031E00'                                     
DREQUEST DC    C'REQUEST',X'4343',X'014000'                                     
DRECOVER DC    C'RECOVER',X'4444',X'010401'                                     
DMEDDIR  DC    C'MEDDIR ',X'4141',X'000000'                                     
DMEDFIL  DC    C'MEDFIL ',X'4242',X'031E00'                                     
DMEDREQ  DC    C'MEDREQ ',X'4343',X'014000'                                     
DMEDRCV  DC    C'MEDRCV ',X'4444',X'010401'                                     
DMEDWRK  DC    C'MEDWRK ',X'4545',X'000080'                                     
DDMGDIR  DC    C'DMGDIR ',X'4646',X'000000'                                     
DDMGFIL  DC    C'DMGFIL ',X'4747',X'031100'                                     
DDMNDIR  DC    C'DMNDIR ',X'4848',X'000000'                                     
DDMNNEW  DC    C'DMNNEW ',X'4949',X'031100'                                     
DDMNOLD  DC    C'DMNOLD ',X'4A4A',X'031100'                                     
DDMODIR  DC    C'DMODIR ',X'4B4B',X'000000'                                     
DDMO1FL  DC    C'DMO1FL ',X'4C4C',X'031100'                                     
DDMO2FL  DC    C'DMO2FL ',X'4D4D',X'031100'                                     
DDMO3FL  DC    C'DMO3FL ',X'4E4E',X'031100'                                     
DDMO4FL  DC    C'DMO4FL ',X'4F4F',X'031100'                                     
*&&                                                                             
                                                                                
*&&MPL                                                                          
MPLFLES  DC    XL7'00',X'05',AL4(0)                                             
DMPLDIR  DC    C'MPLDIR ',X'5151',X'000000'                                     
DMPLFIL  DC    C'MPLFIL ',X'5252',X'032600'                                     
DMPLREQ  DC    C'MPLREQ ',X'5353',X'014000'                                     
         DC    C'REQUEST',X'5353',X'014000'                                     
DMPLRCV  DC    C'MPLRCV ',X'5454',X'010401'                                     
         DC    C'RECOVER',X'5454',X'010401'                                     
DMPCDRS  DC    C'MPCDRS ',X'5858',X'000002'                                     
DMPCFLS  DC    C'MPCFLS ',X'5959',X'071202'                                     
*&&DO                                                                           
DBUDDIR  DC    C'BUDDIR ',X'5A5A',X'000000' BUDDIR GONE FROM US SYSTEM          
DBUDFIL  DC    C'BUDFIL ',X'5B5B',X'032600' BUDFIL GONE FROM US SYSTEM          
*&&                                                                             
DMPRDRB  DC    C'MPRDRB ',X'5C5C',X'000002'                                     
DMPRFLB  DC    C'MPRFLB ',X'5D5D',X'031E02'                                     
DMPCDRC  DC    C'MPCDRC ',X'5E5E',X'000002'                                     
DMPCFLC  DC    C'MPCFLC ',X'5F5F',X'071202'                                     
*&&                                                                             
                                                                                
*&&ACC                                                                          
ACCFLES  DC    XL7'00',X'06',AL4(0)                                             
DACCOUNT DC    C'ACCOUNT',X'6161',X'000000'                                     
         DC    C'ACCFIL ',X'6161',X'000000'                                     
DACCREQ  DC    C'ACCREQ ',X'6363',X'014000'                                     
         DC    C'REQUEST',X'6363',X'014000'                                     
DACCRCVR DC    C'ACCRCVR',X'6464',X'010401'                                     
         DC    C'ACCRCV ',X'6464',X'010401'                                     
         DC    C'RECOVER',X'6464',X'010401'                                     
DACCDAY  DC    C'ACCDAY ',X'6666',X'010200'                                     
DACCWRK  DC    C'ACCWRK ',X'6767',X'000080'                                     
DACCDIR  DC    C'ACCDIR ',X'6969',X'000000'                                     
DACCMST  DC    C'ACCMST ',X'6A6A',X'033400'                                     
DACCARC  DC    C'ACCARC ',X'6B6B',X'033400'                                     
DACCHST  DC    C'ACCHST ',X'6C6C',X'000000'                                     
*&&                                                                             
                                                                                
*&&TAL                                                                          
TALFLES  DC    XL7'00',X'07',AL4(0)                                             
DTALDIR  DC    C'TALDIR ',X'7171',X'000000'                                     
DTALFIL  DC    C'TALFIL ',X'7272',X'032400'                                     
DCHKDIR  DC    C'CHKDIR ',X'7575',X'000000'                                     
DCHKFIL  DC    C'CHKFIL ',X'7676',X'032400'                                     
DTALREQ  DC    C'TALREQ ',X'7373',X'014000'                                     
         DC    C'REQUEST',X'7373',X'014000'                                     
DTALRCV  DC    C'TALRCV ',X'7474',X'010401'                                     
         DC    C'RECOVER',X'7474',X'010401'                                     
*&&                                                                             
                                                                                
*&&FEE                                                                          
FEEFLES  DC    XL7'00',X'07',AL4(0)                                             
DFEEDIR  DC    C'FEEDIR ',X'7171',X'000000'                                     
DFEEFIL  DC    C'FEEFIL ',X'7272',X'032600'                                     
DFEEREQ  DC    C'FEEREQ ',X'7373',X'014000'                                     
         DC    C'REQUEST',X'7373',X'014000'                                     
DFEERCV  DC    C'FEERCV ',X'7474',X'010401'                                     
         DC    C'RECOVER',X'7474',X'010401'                                     
*&&                                                                             
                                                                                
*&&REP                                                                          
REPFLES  DC    XL7'00',X'08',AL4(0)                                             
DREPDIR  DC    C'REPDIR ',X'8181',X'000000'                                     
DREPFILE DC    C'REPFILE',X'8282',X'031E00'                                     
DREPREQ  DC    C'REPREQ ',X'8383',X'014000'                                     
         DC    C'REQUEST',X'8383',X'014000'                                     
DREPRCVR DC    C'REPRCVR',X'8484',X'010401'                                     
         DC    C'RECOVER',X'8484',X'010401'                                     
DREPWRK  DC    C'REPWRK ',X'8585',X'000080'                                     
DRRGON   DC    C'RRGON  ',X'8686',X'000000'                                     
DROIDIR  DC    C'ROIDIR ',X'8787',X'000000'                                     
DROIFIL  DC    C'ROIFIL ',X'8888',X'032200'                                     
DRRGNEW  DC    C'RRGNEW ',X'8989',X'000000'                                     
DREVIEW  DC    C'REVIEW ',X'8A8A',X'000000'                                     
*                                                                               
DDEMDRNR DC    C'DEMDIR ',X'2D2D',X'000000'                                     
         DC    C'NDEMDIR',X'2D2D',X'000000' DEMDIRN FORCE READ                  
DDEMDRAR DC    C'DEMDIR ',X'2D2F',X'000000' DEMDIRA                             
*NOP*    DC    C'DEMDIR ',X'2D00',X'000000' DEMDIRNR SPLIT (FUTURE)             
*NOP*    DC    C'DEMDIR ',X'2D00',X'000000' DEMDIRNR SPLIT (FUTURE)             
*                                                                               
DDEMFLNR DC    C'DEMFIL ',X'2626',X'000000'                                     
         DC    C'NDEMFIL',X'2626',X'000000' MAKE IT READ DEMFILN                
         DC    C'DEMFIL ',X'262B',X'000000'                                     
         DC    C'WDEMFIL',X'262B',X'000000' FORCE READ DEMFILW                  
DDEMFLOR DC    C'DEMFIL ',X'263B',X'000000'                                     
         DC    C'ODEMFIL',X'263B',X'000000' FORCE READ DEMFILO                  
         DC    C'DEMFIL ',X'263D',X'000000'                                     
         DC    C'PDEMFIL',X'263D',X'000000' FORCE READ DEMFILP                  
         DC    C'DEMFIL ',X'263F',X'000000'                                     
         DC    C'QDEMFIL',X'263F',X'000000' FORCE READ DEMFILQ                  
         DC    C'DEMFIL ',X'2648',X'000000'                                     
         DC    C'UDEMFIL',X'2648',X'000000' FORCE READ DEMFILU                  
         DC    C'DEMFIL ',X'2649',X'000000'                                     
         DC    C'VDEMFIL',X'2649',X'000000' FORCE READ DEMFILV                  
         DC    C'DEMFIL ',X'264A',X'000000'                                     
         DC    C'YDEMFIL',X'264A',X'000000' FORCE READ DEMFILY                  
         DC    C'DEMFIL ',X'264B',X'000000'                                     
         DC    C'BDEMFIL',X'264B',X'000000' FORCE READ DEMFILB                  
         DC    C'DEMFIL ',X'264C',X'000000'                                     
         DC    C'CDEMFIL',X'264C',X'000000' FORCE READ DEMFILC                  
         DC    C'DEMFIL ',X'264D',X'000000'                                     
         DC    C'DDEMFIL',X'264D',X'000000' FORCE READ DEMFILD                  
         DC    C'DEMFIL ',X'264E',X'000000'                                     
         DC    C'EDEMFIL',X'264E',X'000000' FORCE READ DEMFILE                  
         DC    C'DEMFIL ',X'2657',X'000000'                                     
         DC    C'7DEMFIL',X'2657',X'000000' FORCE READ DEMFIL7                  
         DC    C'DEMFIL ',X'2659',X'000000'                                     
         DC    C'9DEMFIL',X'2659',X'000000' FORCE READ DEMFIL9                  
         DC    C'DEMFIL ',X'26C3',X'000000'                                     
         DC    C'3DEMFIL',X'26C3',X'000000' FORCE READ DEMFIL3                  
         DC    C'DEMFIL ',X'265F',X'000000'                                     
         DC    C'4DEMFIL',X'265F',X'000000' FORCE READ DEMFIL4                  
         DC    C'DEMFIL ',X'26C4',X'000000'                                     
         DC    C'5DEMFIL',X'26C4',X'000000' FORCE READ DEMFIL5                  
         DC    C'DEMFIL ',X'26C6',X'000000'                                     
         DC    C'FDEMFIL',X'26C6',X'000000' FORCE READ DEMFILF                  
         DC    C'DEMFIL ',X'26C7',X'000000'                                     
         DC    C'GDEMFIL',X'26C7',X'000000' FORCE READ DEMFILG                  
         DC    C'DEMFIL ',X'26C8',X'000000'                                     
         DC    C'HDEMFIL',X'26C8',X'000000' FORCE READ DEMFILH                  
         DC    C'DEMFIL ',X'26C9',X'000000'                                     
         DC    C'IDEMFIL',X'26C9',X'000000' FORCE READ DEMFILI                  
         DC    C'DEMFIL ',X'26CA',X'000000'                                     
         DC    C'JDEMFIL',X'26CA',X'000000' FORCE READ DEMFILJ                  
         DC    C'DEMFIL ',X'26CB',X'000000'                                     
         DC    C'KDEMFIL',X'26CB',X'000000' FORCE READ DEMFILK                  
         DC    C'DEMFIL ',X'26CC',X'000000'                                     
         DC    C'LDEMFIL',X'26CC',X'000000' FORCE READ DEMFILL                  
         DC    C'DEMFIL ',X'26CD',X'000000'                                     
         DC    C'MDEMFIL',X'26CD',X'000000' FORCE READ DEMFILM                  
         DC    C'DEMFIL ',X'26CE',X'000000'                                     
         DC    C'SDEMFIL',X'26CE',X'000000' FORCE READ DEMFILS                  
         DC    C'DEMFIL ',X'2679',X'000000'                                     
         DC    C'TDEMFIL',X'2679',X'000000' FORCE READ DEMFILT                  
         DC    C'DEMFIL ',X'267A',X'000000'                                     
         DC    C'$DEMFIL',X'267A',X'000000' FORCE READ DEMFIL$                  
         DC    C'DEMFIL ',X'267B',X'000000'                                     
         DC    C'NADEMFL',X'267B',X'000000' FORCE READ DEMFLNA                  
         DC    C'DEMFIL ',X'2698',X'000000'                                     
         DC    C'NBDEMFL',X'2698',X'000000' FORCE READ DEMFLNB                  
         DC    C'DEMFIL ',X'2699',X'000000'                                     
         DC    C'NCDEMFL',X'2699',X'000000' FORCE READ DEMFLNC                  
         DC    C'DEMFIL ',X'269A',X'000000'                                     
         DC    C'NDDEMFL',X'269A',X'000000' FORCE READ DEMFLND                  
         DC    C'DEMFIL ',X'269B',X'000000'                                     
         DC    C'NEDEMFL',X'269B',X'000000' FORCE READ DEMFLNE                  
         DC    C'DEMFIL ',X'269C',X'000000'                                     
         DC    C'NFDEMFL',X'269C',X'000000' FORCE READ DEMFLNF                  
         DC    C'DEMFIL ',X'269D',X'000000'                                     
         DC    C'NGDEMFL',X'269D',X'000000' FORCE READ DEMFLNG                  
         DC    C'DEMFIL ',X'26B7',X'000000'                                     
         DC    C'NHDEMFL',X'26B7',X'000000' FORCE READ DEMFLNH                  
         DC    C'DEMFIL ',X'26B8',X'000000'                                     
         DC    C'NIDEMFL',X'26B8',X'000000' FORCE READ DEMFLNI                  
         DC    C'DEMFIL ',X'26B9',X'000000'                                     
         DC    C'NJDEMFL',X'26B9',X'000000' FORCE READ DEMFLNJ                  
         DC    C'DEMFIL ',X'26BA',X'000000'                                     
         DC    C'NKDEMFL',X'26BA',X'000000' FORCE READ DEMFLNL                  
         DC    C'DEMFIL ',X'26BB',X'000000'                                     
         DC    C'NLDEMFL',X'26BB',X'000000' FORCE READ DEMFLNK                  
         DC    C'DEMFIL ',X'26BC',X'000000'                                     
         DC    C'NMDEMFL',X'26BC',X'000000' FORCE READ DEMFLNM                  
         DC    C'DEMFIL ',X'26CF',X'000000'                                     
         DC    C'ZDEMFIL',X'26CF',X'000000' FORCE READ DEMFILZ                  
         DC    C'DEMFIL ',X'2651',X'000000'                                     
         DC    C'TNDEMFL',X'2651',X'000000' FORCE READ DEMFLTN                  
         DC    C'DEMFIL ',X'26C1',X'000000'                                     
         DC    C'1DEMFIL',X'26C1',X'000000' FORCE READ DEMFIL1                  
         DC    C'DEMFIL ',X'2656',X'000000'                                     
         DC    C'6DEMFIL',X'2656',X'000000' FORCE READ DEMFIL6                  
         DC    C'DEMFIL ',X'2658',X'000000'                                     
         DC    C'8DEMFIL',X'2658',X'000000' FORCE READ DEMFIL8                  
*                                                                               
DDEMFLAR DC    C'DEMFIL ',X'2628',X'000000'                                     
         DC    C'ADEMFIL',X'2628',X'000000' FORCE READ DEMFILA                  
         DC    C'DEMFIL ',X'26C2',X'000000'                                     
         DC    C'2DEMFIL',X'26C2',X'000000' FORCE READ DEMFIL2                  
         DC    C'DEMFIL ',X'2652',X'000000'                                     
         DC    C'TADEMFL',X'2652',X'000000' FORCE READ DEMFLTA                  
*                                                                               
         DC    C'DEMFIL ',X'3131',X'000000' DEMFILR   (RADIO)                   
         DC    C'RDEMFIL',X'3131',X'000000' DEMFILR - FORCE READ                
         DC    C'DEMFIL ',X'3153',X'000000' DEMFLTR                             
         DC    C'TRDEMFL',X'3153',X'000000' DEMFLTR - FORCE READ                
*                                                                               
         DC    C'PAVDIR ',X'2C2C',X'000000' PAVFIL MASTER DIRECTORY             
         DC    C'PAVFIL ',X'2E2E',X'000000'                                     
         DC    C'PAVFILB',X'2EC0',X'000000'                                     
         DC    C'BPAVFIL',X'2EC0',X'000000' IF YOU WANT PAVFILB                 
         DC    C'PAVFILC',X'2E7E',X'000000'                                     
         DC    C'CPAVFIL',X'2E7E',X'000000' IF YOU WANT PAVFILC                 
         DC    C'PAVFILA',X'2EC5',X'000000'                                     
         DC    C'APAVFIL',X'2EC5',X'000000' IF YOU WANT PAVFILA                 
         DC    C'PAVFLTA',X'2E55',X'000000'                                     
         DC    C'TAPAVFL',X'2E55',X'000000' PAVFLTA - FORCE READ                
*                                                                               
DNTIDIRR DC    C'NTIDIR ',X'3838',X'000000' NTIDIR                              
DNTIFILR DC    C'NTIFILE',X'393C',X'000000' NTIFIL MASTER DIRECTORY             
         DC    C'ONTIFIL',X'393C',X'000000' NTIFILO - FORCE READ                
         DC    C'NTIFILE',X'3939',X'000000' NTIFILN                             
         DC    C'NNTIFIL',X'3939',X'000000' NTIFILN - FORCE READ                
         DC    C'NTIFILE',X'393E',X'000000' NTIFILP                             
         DC    C'PNTIFIL',X'393E',X'000000' NTIFILP - FORCE READ                
         DC    C'NTIFILE',X'3929',X'000000' NTIFILQ                             
         DC    C'QNTIFIL',X'3929',X'000000' NTIFILQ - FORCE READ                
         DC    C'NTIFILE',X'393A',X'000000' NTIFILW                             
         DC    C'WNTIFIL',X'393A',X'000000' NTIFILW - FORCE READ                
         DC    C'NTIFILE',X'3947',X'000000' NTIFILY                             
         DC    C'YNTIFIL',X'3947',X'000000' NTIFILY - FORCE READ                
         DC    C'NTIFILE',X'394F',X'000000' NTIFILZ                             
         DC    C'ZNTIFIL',X'394F',X'000000' NTIFILZ - FORCE READ                
         DC    C'NTIFILE',X'395A',X'000000' NTIFILA                             
         DC    C'ANTIFIL',X'395A',X'000000' NTIFILA - FORCE READ                
         DC    C'NTIFILE',X'395B',X'000000' NTIFILB                             
         DC    C'BNTIFIL',X'395B',X'000000' NTIFILB - FORCE READ                
         DC    C'NTIFILE',X'395C',X'000000' NTIFILC                             
         DC    C'CNTIFIL',X'395C',X'000000' NTIFILC - FORCE READ                
         DC    C'NTIFILE',X'395D',X'000000' NTIFILD                             
         DC    C'DNTIFIL',X'395D',X'000000' NTIFILD - FORCE READ                
         DC    C'NTIFILE',X'395E',X'000000' NTIFILE                             
         DC    C'ENTIFIL',X'395E',X'000000' NTIFILE - FORCE READ                
         DC    C'NTIFILF',X'3977',X'000000' NTIFILF                             
         DC    C'FNTIFIL',X'3977',X'000000' NTIFILF - FORCE READ                
         DC    C'NTIFILG',X'3978',X'000000' NTIFILG                             
         DC    C'GNTIFIL',X'3978',X'000000' NTIFILG - FORCE READ                
         DC    C'NTIFILH',X'397C',X'000000' NTIFILH                             
         DC    C'HNTIFIL',X'397C',X'000000' NTIFILH - FORCE READ                
         DC    C'NTIFILI',X'397D',X'000000' NTIFILI                             
         DC    C'INTIFIL',X'397D',X'000000' NTIFILI - FORCE READ                
         DC    C'NTIFILJ',X'39BD',X'000000' NTIFILJ                             
         DC    C'JNTIFIL',X'39BD',X'000000' NTIFILJ - FORCE READ                
         DC    C'NTIFILK',X'39BE',X'000000' NTIFILK                             
         DC    C'KNTIFIL',X'39BE',X'000000' NTIFILK - FORCE READ                
         DC    C'NTIFILL',X'398B',X'000000' NTIFILL                             
         DC    C'LNTIFIL',X'398B',X'000000' NTIFILL - FORCE READ                
         DC    C'NTIFILM',X'398C',X'000000' NTIFILM                             
         DC    C'MNTIFIL',X'398C',X'000000' NTIFILM - FORCE READ                
         DC    C'NTIFILR',X'398D',X'000000' NTIFILR                             
         DC    C'RNTIFIL',X'398D',X'000000' NTIFILR - FORCE READ                
         DC    C'NTIFIL ',X'3954',X'000000' NTIFLTA                             
         DC    C'TANTIFL',X'3954',X'000000' NTIFLTA - FORCE READ                
*&&                                                                             
                                                                                
*&&MBA                                                                          
MBAFLES  DC    XL7'00',X'09',AL4(0)                                             
DMBADIR  DC    C'MBADIR ',X'9191',X'000000'                                     
DMBAFIL  DC    C'MBAFIL ',X'9292',X'032E00'                                     
DMBAREQ  DC    C'MBAREQ ',X'9393',X'014000'                                     
         DC    C'REQUEST',X'9393',X'014000'                                     
DMBARCV  DC    C'MBARCV ',X'9494',X'010401'                                     
         DC    C'RECOVER',X'9494',X'010401'                                     
DMBANDX  DC    C'MBANDX ',X'9595',X'000000'                                     
DMBUDIR  DC    C'MBUDIR ',X'9696',X'000000'                                     
DMBUFIL  DC    C'MBUFIL ',X'9797',X'032E00'                                     
*&&                                                                             
                                                                                
*&&DEM                                                                          
***********************************************************************         
* NOTE: IN THE USA WE HAVE TOO MANY DEMFIL(S)                         *         
* IN ORDER TO ACCOMODATE THEM FILE NUMBERS 48 AND UP HAVE BEEN TAKEN  *         
* IF YOU TRY TO REUSE THEM YOU WILL ENCOUNTER DIFFICULTIES            *         
***********************************************************************         
DEMFLES  DC    XL7'00',X'0C',AL4(0)                                             
* DEMO FILES ARE COMPARED ON FIRST 5 CHARACTERS                                 
* SO ANY DEMDIR/DEMFIL WILL MATCH ONE OF THE FIRST TWO ENTRIES                  
         DC    C'DEMDIR ',X'2D2D',X'000000'                                     
         DC    C'DEMFIL ',X'2626',X'000000'                                     
*                                                                               
* LOOKS LIKE THESE ARE NOT NEEDED ANYMORE                                       
* THEY WERE PROBABLY SOME SPECIAL COMMANDS THAT ARE NOT USED BY DEMOS           
* THAT IS WHY "NUMBERED" DEMO FILES ARE MISSING FROM HERE, AND                  
* THIS IS NOT CAUSING ANY ISSUES                                                
         DC    C'WDEMFIL',X'262B',X'000000' FILES UNDER DEMDIRN                 
         DC    C'ODEMFIL',X'263B',X'000000'                                     
         DC    C'PDEMFIL',X'263D',X'000000'                                     
         DC    C'QDEMFIL',X'263F',X'000000'                                     
         DC    C'UDEMFIL',X'2648',X'000000'                                     
         DC    C'VDEMFIL',X'2649',X'000000'                                     
         DC    C'YDEMFIL',X'264A',X'000000'                                     
         DC    C'BDEMFIL',X'264B',X'000000'                                     
         DC    C'CDEMFIL',X'264C',X'000000'                                     
         DC    C'GDEMFIL',X'26C7',X'000000'                                     
         DC    C'HDEMFIL',X'26C8',X'000000'                                     
         DC    C'IDEMFIL',X'26C9',X'000000'                                     
         DC    C'JDEMFIL',X'26CA',X'000000'                                     
         DC    C'KDEMFIL',X'26CB',X'000000'                                     
         DC    C'LDEMFIL',X'26CC',X'000000'                                     
         DC    C'MDEMFIL',X'26CD',X'000000'                                     
         DC    C'SDEMFIL',X'26CE',X'000000'                                     
*                                                                               
         DC    C'TNDEMFL',X'2651',X'000000'                                     
         DC    C'TADEMFL',X'2652',X'000000'                                     
         DC    C'TRDEMFL',X'2653',X'000000'                                     
*                                                                               
         DC    C'PAVDIR ',X'2C2C',X'000000'                                     
         DC    C'PAVFIL ',X'2E2E',X'000000'                                     
         DC    C'BPAVFIL',X'2EC0',X'000000'                                     
         DC    C'APAVFIL',X'2EC5',X'000000'                                     
         DC    C'TAPAVFL',X'2E55',X'000000'                                     
*                                                                               
         DC    C'NTIDIR ',X'3838',X'000000' NTIDIR                              
         DC    C'NTIFIL ',X'3939',X'000000' NTIFIL(N)                           
         DC    C'NNTIFIL',X'3939',X'000000' NTIFILN                             
         DC    C'ONTIFIL',X'393C',X'000000' NTIFILO                             
         DC    C'PNTIFIL',X'393E',X'000000' NTIFILP                             
         DC    C'QNTIFIL',X'3929',X'000000' NTIFILQ                             
         DC    C'WNTIFIL',X'393A',X'000000' NTIFILW                             
         DC    C'YNTIFIL',X'3947',X'000000' NTIFILY                             
         DC    C'ZNTIFIL',X'394F',X'000000' NTIFILZ                             
         DC    C'ANTIFIL',X'395A',X'000000' NTIFILA                             
         DC    C'BNTIFIL',X'395B',X'000000' NTIFILB                             
         DC    C'TANTIFL',X'3954',X'000000' NTIFLTA                             
*&&                                                                             
                                                                                
*&&CPP                                                                          
CPPFLES  DC    XL7'00',X'0C',AL4(0)                                             
DCPFILE  DC    C'CPFILE ',X'C1C1',X'000000'                                     
DCPREQ   DC    C'CPREQ  ',X'C3C3',X'014000'                                     
         DC    C'REQUEST',X'C3C3',X'014000'                                     
DCPRCVR  DC    C'CPRCVR ',X'C4C4',X'010401'                                     
         DC    C'RECOVER',X'C4C4',X'010401'                                     
*&&                                                                             
                                                                                
*&&PER                                                                          
PERFLES  DC    XL7'00',X'0E',AL4(0)                                             
DPERDIR  DC    C'PERDIR ',X'E1E1',X'000000'                                     
DPERFIL  DC    C'PERFIL ',X'E2E2',X'032800'                                     
DPERREQ  DC    C'PERREQ ',X'E3E3',X'014000'                                     
         DC    C'REQUEST',X'E3E3',X'014000'                                     
DPERRCV  DC    C'PERRCV ',X'E4E4',X'010401'                                     
         DC    C'RECOVER',X'E4E4',X'010401'                                     
*&&                                                                             
                                                                                
COMFLES  DS    0C                  COMMON FILES START HERE                      
                                                                                
*&&CON                                                                          
CONFLES  DC    XL7'00',X'0A',AL4(0)                                             
DCTFILE  DC    C'CTFILE ',X'A1A1',X'000000'                                     
DCTREQ   DC    C'CTREQ  ',X'A3A3',X'014000'                                     
         DC    C'REQUEST',X'A3A3',X'014000'                                     
DCTRCVR  DC    C'CTRCVR ',X'A4A4',X'010401'                                     
         DC    C'CONRCV ',X'A4A4',X'010401'                                     
         DC    C'RECOVER',X'A4A4',X'010401'                                     
DGENDIR  DC    C'GENDIR ',X'AEAE',X'000000'                                     
DGENFIL  DC    C'GENFIL ',X'AFAF',X'032600'                                     
*&&UK                                                                           
DCRADIR  DC    C'CRADIR ',X'A6A6',X'000000'                                     
DCRAFIL  DC    C'CRAFIL ',X'A7A7',X'030F00'                                     
*&&                                                                             
*&&                                                                             
                                                                                
*&&TRF                                                                          
TRFFLES  DC    XL7'00',X'0D',AL4(0)                                             
DTRFSPTD DC    C'SPTDIR ',X'2323',X'000000'                                     
DTRFSPTF DC    C'SPTFILE',X'2121',X'031000'                                     
DTRFSTA  DC    C'STATION',X'2222',X'000000'                                     
         DC    C'STAFILE',X'2222',X'000000'                                     
DTRFDIR  DC    C'TRFDIR ',X'3333',X'000000'                                     
DTRFFILE DC    C'TRFFILE',X'3232',X'031000'                                     
DTRFREQ  DC    C'TRFREQ ',X'3535',X'014000'                                     
         DC    C'REQUEST',X'3535',X'014000'                                     
DTRFRCV  DC    C'TRFRCV ',X'3434',X'010401'                                     
         DC    C'RECOVER',X'3434',X'010401'                                     
QTRFDIR  EQU   X'33'                                                            
QTRFFILE EQU   X'32'                                                            
*&&                                                                             
                                                                                
SRVFLES  DC    XL7'00',X'01',AL4(0)                                             
         DC    C'CTFILE ',X'A1A1',X'000000'                                     
         DC    C'GENDIR ',X'AEAE',X'000000'                                     
         DC    C'GENFIL ',X'AFAF',X'032600'                                     
DSYSFLES DC    C'SYSFLES',X'F0F0',X'000000'                                     
*&&SRV                                                                          
DEDCTZ   DC    C'EDCTZ  ',X'E7E7',X'000000'                                     
DPRGMS   DC    C'PRGMS  ',X'F1F1',X'000000'                                     
DTEMPSTR DC    C'TEMPSTR',X'F2F2',X'000000'                                     
DADRFILE DC    C'ADRFILE',X'F3F3',X'000000'                                     
DWKFILE  DC    C'WKFILE ',X'F4F4',X'000080'                                     
DSTATS   DC    C'STATS  ',X'F7F7',X'000000'                                     
DDMPFILE DC    C'DMPFILE',X'F8F8',X'000000'                                     
DTSTRCVR DC    C'TSTRCVR',X'F9F9',X'000000'                                     
DFACWRK  DC    C'FACWRK ',X'FAFA',X'000080'                                     
DKWXFILE DC    C'KWXFILE',X'FBFB',X'000000'                                     
DEDCTA   DC    C'EDCTA  ',X'FCFC',X'000000'                                     
DEDCTR   DC    C'EDCTR  ',X'FDFD',X'000000'                                     
DTEMPEST DC    C'TEMPEST',X'FEFE',X'000000'                                     
DPRTQUE  DC    C'PRTQUE ',X'0101',X'000040'                                     
DPRTQ1   DC    C'PRTQ1  ',X'0101',X'000040'                                     
DPRTQ2   DC    C'PRTQ2  ',X'0202',X'000040'                                     
DPRTQ3   DC    C'PRTQ3  ',X'0303',X'000040'                                     
DPRTQ4   DC    C'PRTQ4  ',X'0404',X'000040'                                     
DPRTQ5   DC    C'PRTQ5  ',X'0505',X'000040'                                     
DPRTQ6   DC    C'PRTQ6  ',X'0606',X'000040'                                     
DPRTQ7   DC    C'PRTQ7  ',X'0707',X'000040'                                     
DPRTQ8   DC    C'PRTQ8  ',X'0808',X'000040'                                     
DPRTQ9   DC    C'PRTQ9  ',X'0A0A',X'000040'                                     
DPRTQA   DC    C'PRTQA  ',X'0B0B',X'000040'                                     
DPRTQB   DC    C'PRTQB  ',X'0C0C',X'000040'                                     
DPRTQC   DC    C'PRTQC  ',X'0D0D',X'000040'                                     
DPRTQD   DC    C'PRTQD  ',X'0E0E',X'000040'                                     
DPRTQE   DC    C'PRTQE  ',X'0F0F',X'000040'                                     
DPRTQF   DC    C'PRTQF  ',X'1010',X'000040'                                     
DPRTQG   DC    C'PRTQG  ',X'1F1F',X'000040'                                     
DEASIWK  DC    C'EASIWK ',X'0909',X'000080'                                     
DWRKFIL  DC    C'WRKFIL ',X'1111',X'000020'                                     
DWRKF1   DC    C'WRKF1  ',X'1111',X'000020'                                     
DWRKF2   DC    C'WRKF2  ',X'1212',X'000020'                                     
DWRKF3   DC    C'WRKF3  ',X'1313',X'000020'                                     
DWRKF4   DC    C'WRKF4  ',X'1414',X'000020'                                     
DWRKF5   DC    C'WRKF5  ',X'1515',X'000020'                                     
DWRKF6   DC    C'WRKF6  ',X'1616',X'000020'                                     
DWRKF7   DC    C'WRKF7  ',X'1717',X'000020'                                     
DWRKF8   DC    C'WRKF8  ',X'1818',X'000020'                                     
DWRKF9   DC    C'WRKF9  ',X'1919',X'000020'                                     
DWRKFA   DC    C'WRKFA  ',X'E8E8',X'000020'                                     
DWRKFB   DC    C'WRKFB  ',X'E9E9',X'000020'                                     
DWRKFC   DC    C'WRKFC  ',X'EAEA',X'000020'                                     
DWRKFD   DC    C'WRKFD  ',X'EBEB',X'000020'                                     
DWRKFE   DC    C'WRKFE  ',X'ECEC',X'000020'                                     
DWRKFF   DC    C'WRKFF  ',X'EDED',X'000020'                                     
DWRKFG   DC    C'WRKFG  ',X'EEEE',X'000020'                                     
*&&US                                                                           
DWRKZIL  DC    C'WRKZIL ',X'D1D1',X'000020'                                     
DWRKZ1   DC    C'WRKZ1  ',X'D1D1',X'000020'                                     
DWRKZ2   DC    C'WRKZ2  ',X'D2D2',X'000020'                                     
DWRKZ3   DC    C'WRKZ3  ',X'D3D3',X'000020'                                     
DWRKZ4   DC    C'WRKZ4  ',X'D4D4',X'000020'                                     
DWRKZ5   DC    C'WRKZ5  ',X'D5D5',X'000020'                                     
DWRKZ6   DC    C'WRKZ6  ',X'D6D6',X'000020'                                     
DWRKZ7   DC    C'WRKZ7  ',X'D7D7',X'000020'                                     
DWRKZ8   DC    C'WRKZ8  ',X'D8D8',X'000020'                                     
DWRKZ9   DC    C'WRKZ9  ',X'D9D9',X'000020'                                     
DWRKZA   DC    C'WRKZA  ',X'DADA',X'000020'                                     
DWRKZB   DC    C'WRKZB  ',X'DBDB',X'000020'                                     
DWRKZC   DC    C'WRKZC  ',X'DCDC',X'000020'                                     
DWRKZD   DC    C'WRKZD  ',X'DDDD',X'000020'                                     
DWRKZE   DC    C'WRKZE  ',X'DEDE',X'000020'                                     
DWRKZF   DC    C'WRKZF  ',X'DFDF',X'000020'                                     
         DC    C'NPRTQUE',X'0101',X'000040'                                     
*&&                                                                             
*&&                                                                             
                                                                                
DMFILESX EQU   *-1                                                              
         EJECT                                                                  
DMCMDS#  EQU   (DMCMDSX-DMCMDS)/(L'DMCMDS)                                      
*******************************************************************             
* W A R N I N G    ****    W A R N I N G ****    W A R N I N G    *             
*                                                                               
*   THIS IS A BIN SEARCH TABLE BASE ON THE FIRST 2 BYTES          *             
*                                                                               
* W A R N I N G    ****    W A R N I N G ****    W A R N I N G    *             
*******************************************************************             
DMCMDS   DS    0XL6                                                             
*&&US*&& DC    X'0121',AL4(DMOD121)     DMADD     SPTFILE                       
*&&US*&& DC    X'0122',AL4(DMOD1IV)     DMADD     STATION                       
*&&US*&& DC    X'0123',AL4(DMOD1IS)     DMADD     SPTDIR                        
*&&US*&& DC    X'0125',AL4(DMOD1RQ)     DMADD     REQUEST                       
*&&US*&& DC    X'0127',AL4(DMOD1IS)     DMADD     UNTDIR                        
*                                                                               
*&&US*&& DC    X'0132',AL4(DMOD132)     DMADD     TRFFILE                       
*&&US*&& DC    X'0133',AL4(DMOD1IS)     DMADD     TRFDIR                        
*&&US*&& DC    X'0135',AL4(DMOD1RQ)     DMADD     TRFREQ                        
*&&US*&& DC    X'0136',AL4(DMOD1IS)     DMADD     XSPDIR                        
*                                                                               
*&&US*&& DC    X'0140',AL4(DMOD1IS)     DMADD     PRTDIR                        
*&&US*&& DC    X'0141',AL4(DMOD1IS)     DMADD     PUBDIR                        
*&&US*&& DC    X'0145',AL4(DMOD1RQ)     DMADD     PREQUES                       
*                                                                               
*&&UK*&& DC    X'0141',AL4(DMOD1IS)     DMADD     MEDIR                         
*&&UK*&& DC    X'0143',AL4(DMOD1RQ)     DMADD     MEDREQ                        
*&&UK*&& DC    X'0146',AL4(DMOD1IS)     DMADD     DMGDIR                        
*&&UK*&& DC    X'0148',AL4(DMOD1IS)     DMADD     DMNDIR                        
*&&UK*&& DC    X'014B',AL4(DMOD1IS)     DMADD     DMODIR                        
*                                                                               
         DC    X'0151',AL4(DMOD1IS)     DMADD     MPLDIR                        
         DC    X'0153',AL4(DMOD1RQ)     DMADD     MPLREQ                        
*&&UK*&& DC    X'0158',AL4(DMOD1IS)     DMADD     MPCDRS                        
*&&DO*&& DC    X'015A',AL4(DMOD1IS)     DMADD     BUDDIR                        
*&&UK*&& DC    X'015C',AL4(DMOD1IS)     DMADD     MPRDRB                        
*&&UK*&& DC    X'015E',AL4(DMOD1IS)     DMADD     MPCDRC                        
*                                                                               
         DC    X'0161',AL4(DMOD1AC)     DMADD     ACCOUNT                       
         DC    X'0163',AL4(DMOD1RQ)     DMADD     ACCREQ                        
         DC    X'0166',AL4(DMOD166)     DMADD     ACCDAY                        
         DC    X'0169',AL4(DMOD1IS)     DMADD     ACCDIR                        
         DC    X'016C',AL4(DMOD1AC)     DMADD     ACCHST                        
*                                                                               
*&&US*&& DC    X'0171',AL4(DMOD1IS)     DMADD     TALDIR                        
*&&US*&& DC    X'0173',AL4(DMOD1RQ)     DMADD     TALREQ                        
*&&US*&& DC    X'0175',AL4(DMOD1IS)     DMADD     CHKDIR                        
*                                                                               
*&&UK*&& DC    X'0171',AL4(DMOD1IS)     DMADD     FEEDIR                        
*&&UK*&& DC    X'0173',AL4(DMOD1RQ)     DMADD     FEEREQ                        
*                                                                               
*&&US*&& DC    X'0181',AL4(DMOD1IS)     DMADD     REPDIR                        
*&&US*&& DC    X'0183',AL4(DMOD1RQ)     DMADD     REPREQ                        
*&&US*&& DC    X'0186',AL4(DMOD1IS)     DMADD     RRGON                         
*&&US*&& DC    X'0187',AL4(DMOD1IS)     DMADD     ROIDIR                        
*&&US*&& DC    X'0189',AL4(DMOD1IS)     DMADD     RRGNEW                        
*                                                                               
         DC    X'0191',AL4(DMOD1IS)     DMADD     MBADIR                        
         DC    X'0193',AL4(DMOD1RQ)     DMADD     MBAREQ                        
         DC    X'0195',AL4(DMOD1IS)     DMADD     MBANDX                        
         DC    X'0196',AL4(DMOD1IS)     DMADD     MBUDIR                        
*                                                                               
         DC    X'01A1',AL4(DMOD1CT)     DMADD     CTFILE                        
         DC    X'01A3',AL4(DMOD1RQ)     DMADD     CTREQ                         
*&&UK*&& DC    X'01A6',AL4(DMOD1IS)     DMADD     CRADIR                        
*&&US*&& DC    X'01AA',AL4(DMOD1IS)     DMADD     DEMDIR                        
         DC    X'01AE',AL4(DMOD1IS)     DMADD     GENDIR                        
*                                                                               
*&&UK*&& DC    X'01C1',AL4(DMOD1IV)     DMADD     CPFILE                        
*&&UK*&& DC    X'01C3',AL4(DMOD1RQ)     DMADD     CPREQ                         
*                                                                               
         DC    X'01E1',AL4(DMOD1IS)     DMADD     PERDIR                        
         DC    X'01E3',AL4(DMOD1RQ)     DMADD     PERREQ                        
*                                                                               
         DC    X'01F9',AL4(DMOD1F9)     DMADD     TSTRCVR                       
         DC    X'01FB',AL4(DMOD1FB)     DMADD     KWXFILE                       
*                                                                               
         DC    X'0201',AL4(DMOD2PQ)     DMREAD    PRTQ1                         
         DC    X'0202',AL4(DMOD2PQ)     DMREAD    PRTQ2                         
         DC    X'0203',AL4(DMOD2PQ)     DMREAD    PRTQ3                         
         DC    X'0204',AL4(DMOD2PQ)     DMREAD    PRTQ4                         
         DC    X'0205',AL4(DMOD2PQ)     DMREAD    PRTQ5                         
         DC    X'0206',AL4(DMOD2PQ)     DMREAD    PRTQ6                         
         DC    X'0207',AL4(DMOD2PQ)     DMREAD    PRTQ7                         
         DC    X'0208',AL4(DMOD2PQ)     DMREAD    PRTQ8                         
*&&US*&& DC    X'0209',AL4(DMOD2WK)     DMREAD    EASIWK                        
         DC    X'020A',AL4(DMOD2PQ)     DMREAD    PRTQ9                         
         DC    X'020B',AL4(DMOD2PQ)     DMREAD    PRTQA                         
         DC    X'020C',AL4(DMOD2PQ)     DMREAD    PRTQB                         
         DC    X'020D',AL4(DMOD2PQ)     DMREAD    PRTQC                         
         DC    X'020E',AL4(DMOD2PQ)     DMREAD    PRTQD                         
         DC    X'020F',AL4(DMOD2PQ)     DMREAD    PRTQE                         
*                                                                               
         DC    X'0210',AL4(DMOD2PQ)     DMREAD    PRTQF                         
         DC    X'0211',AL4(DMOD2WF)     DMREAD    WRKF1                         
         DC    X'0212',AL4(DMOD2WF)     DMREAD    WRKF2                         
         DC    X'0213',AL4(DMOD2WF)     DMREAD    WRKF3                         
         DC    X'0214',AL4(DMOD2WF)     DMREAD    WRKF4                         
         DC    X'0215',AL4(DMOD2WF)     DMREAD    WRKF5                         
         DC    X'0216',AL4(DMOD2WF)     DMREAD    WRKF6                         
         DC    X'0217',AL4(DMOD2WF)     DMREAD    WRKF7                         
         DC    X'0218',AL4(DMOD2WF)     DMREAD    WRKF8                         
         DC    X'0219',AL4(DMOD2WF)     DMREAD    WRKF9                         
         DC    X'021F',AL4(DMOD2PQ)     DMREAD    PRTQG                         
*                                                                               
*&&US*&& DC    X'0221',AL4(DMOD221)     DMREAD    SPTFILE                       
*&&US*&& DC    X'0222',AL4(DMOD222)     DMREAD    STATION                       
*&&US*&& DC    X'0223',AL4(DMOD2IS)     DMREAD    SPTDIR                        
*&&US*&& DC    X'0227',AL4(DMOD2IS)     DMREAD    UNTDIR                        
*&&US*&& DC    X'022A',AL4(DMOD22A)     DMREAD    UNTFIL                        
*&&US*&& DC    X'022C',AL4(DMOD22C)     DMREAD    PAVDIR                        
*&&US*&& DC    X'022D',AL4(DMOD22D)     DMREAD    DEMDIR                        
*                                                                               
*&&US*&& DC    X'0232',AL4(DMOD233)     DMREAD    TRFFILE                       
*&&US*&& DC    X'0233',AL4(DMOD2IS)     DMREAD    TRFDIR                        
*&&US*&& DC    X'0236',AL4(DMOD2IS)     DMREAD    XSPDIR                        
*&&US*&& DC    X'0237',AL4(DMOD237)     DMREAD    XSPFILE                       
*&&US*&& DC    X'0238',AL4(DMOD238)     DMREAD    NTIDIR                        
*                                                                               
*&&US*&& DC    X'0240',AL4(DMOD2IS)     DMREAD    PRTDIR                        
*&&US*&& DC    X'0241',AL4(DMOD2IS)     DMREAD    PUBDIR                        
*&&US*&& DC    X'0242',AL4(DMOD242)     DMREAD    PRTFILE                       
*&&US*&& DC    X'0243',AL4(DMOD243)     DMREAD    PUBFILE                       
*                                                                               
*&&UK*&& DC    X'0241',AL4(DMOD2IS)     DMREAD    MEDIR                         
*&&UK*&& DC    X'0242',AL4(DMOD242)     DMREAD    MEDFILE                       
*&&UK*&& DC    X'0245',AL4(DMOD2WK)     DMREAD    MEDWRK                        
*&&UK*&& DC    X'0246',AL4(DMOD2IS)     DMREAD    DMGDIR                        
*&&UK*&& DC    X'0247',AL4(DMOD247)     DMREAD    DMGFIL                        
*&&UK*&& DC    X'0248',AL4(DMOD2IS)     DMREAD    DMNDIR                        
*&&UK*&& DC    X'0249',AL4(DMOD249)     DMREAD    DMNNEW                        
*&&UK*&& DC    X'024A',AL4(DMOD249)     DMREAD    DMNOLD                        
*&&UK*&& DC    X'024B',AL4(DMOD2IS)     DMREAD    DMODIR                        
*&&UK*&& DC    X'024C',AL4(DMOD24C)     DMREAD    DMO1FL                        
*&&UK*&& DC    X'024D',AL4(DMOD24C)     DMREAD    DMO2FL                        
*&&UK*&& DC    X'024E',AL4(DMOD24C)     DMREAD    DMO3FL                        
*&&UK*&& DC    X'024F',AL4(DMOD24C)     DMREAD    DMO4FL                        
*                                                                               
         DC    X'0251',AL4(DMOD2IS)     DMREAD    MPLDIR                        
         DC    X'0252',AL4(DMOD252)     DMREAD    MPLFIL                        
*&&UK*&& DC    X'0258',AL4(DMOD2IS)     DMREAD    MPCDRS                        
*&&UK*&& DC    X'0259',AL4(DMOD259)     DMREAD    MPCFLS                        
*&&DO*&& DC    X'025A',AL4(DMOD2IS)     DMREAD    BUDDIR                        
*&&DO*&& DC    X'025B',AL4(DMOD25B)     DMREAD    BUDFIL                        
*&&UK*&& DC    X'025C',AL4(DMOD2IS)     DMREAD    MPRDRB                        
*&&UK*&& DC    X'025D',AL4(DMOD25D)     DMREAD    MPRFLB                        
*&&UK*&& DC    X'025E',AL4(DMOD2IS)     DMREAD    MPCDRC                        
*&&UK*&& DC    X'025F',AL4(DMOD25F)     DMREAD    MPCFLC                        
*                                                                               
         DC    X'0261',AL4(DMOD2AC)     DMREAD    ACCOUNT                       
         DC    X'0267',AL4(DMOD2WK)     DMREAD    ACCWRK                        
         DC    X'0269',AL4(DMOD2IS)     DMREAD    ACCDIR                        
         DC    X'026A',AL4(DMOD26A)     DMREAD    ACCMST                        
         DC    X'026B',AL4(DMOD26B)     DMREAD    ACCARC                        
         DC    X'026C',AL4(DMOD2AC)     DMREAD    ACCHST                        
*                                                                               
*&&US*&& DC    X'0271',AL4(DMOD2IS)     DMREAD    TALDIR                        
*&&US*&& DC    X'0272',AL4(DMOD272)     DMREAD    TALFIL                        
*&&US*&& DC    X'0275',AL4(DMOD2IS)     DMREAD    CHKDIR                        
*&&US*&& DC    X'0276',AL4(DMOD276)     DMREAD    CHKFIL                        
*                                                                               
*&&UK*&& DC    X'0271',AL4(DMOD2IS)     DMREAD    FEEDIR                        
*&&UK*&& DC    X'0272',AL4(DMOD272)     DMREAD    FEEFIL                        
*                                                                               
*&&US*&& DC    X'0281',AL4(DMOD281)     DMREAD    REPDIR (INTEREP)              
*&&US*&& DC    X'0282',AL4(DMOD282)     DMREAD    REPFILE                       
*&&US*&& DC    X'0285',AL4(DMOD2WK)     DMREAD    REPWRK                        
*&&US*&& DC    X'0286',AL4(DMOD2IS)     DMREAD    RRGON                         
*&&US*&& DC    X'0287',AL4(DMOD2IS)     DMREAD    ROIDIR                        
*&&US*&& DC    X'0289',AL4(DMOD2IS)     DMREAD    RRGNEW                        
*&&US*&& DC    X'028A',AL4(DMOD2IS)     DMREAD    REVIEW                        
*                                                                               
         DC    X'0291',AL4(DMOD2IS)     DMREAD    MBADIR                        
         DC    X'0292',AL4(DMOD292)     DMREAD    MBAFIL                        
         DC    X'0295',AL4(DMOD2IS)     DMREAD    MBANDX                        
         DC    X'0296',AL4(DMOD2IS)     DMREAD    MBUDIR                        
         DC    X'0297',AL4(DMOD297)     DMREAD    MBUFIL                        
*                                                                               
         DC    X'02A1',AL4(DMOD2CT)     DMREAD    CTFILE                        
*&&UK*&& DC    X'02A6',AL4(DMOD2IS)     DMREAD    CRADIR                        
*&&UK*&& DC    X'02A7',AL4(DMOD2A7)     DMREAD    CRAFIL                        
*&&US*&& DC    X'02AA',AL4(DMOD2IS)     DMREAD    DEMDIR                        
         DC    X'02AE',AL4(DMOD2IS)     DMREAD    GENDIR                        
         DC    X'02AF',AL4(DMOD2AF)     DMREAD    GENFIL                        
*                                                                               
*&&UK*&& DC    X'02C1',AL4(DMOD2IS)     DMREAD    CPFILE                        
*                                                                               
*&&US                                                                           
         DC    X'02D1',AL4(DMOD2WZ)     DMREAD    WRKZ1                         
         DC    X'02D2',AL4(DMOD2WZ)     DMREAD    WRKZ2                         
         DC    X'02D3',AL4(DMOD2WZ)     DMREAD    WRKZ3                         
         DC    X'02D4',AL4(DMOD2WZ)     DMREAD    WRKZ4                         
         DC    X'02D5',AL4(DMOD2WZ)     DMREAD    WRKZ5                         
         DC    X'02D6',AL4(DMOD2WZ)     DMREAD    WRKZ6                         
         DC    X'02D7',AL4(DMOD2WZ)     DMREAD    WRKZ7                         
         DC    X'02D8',AL4(DMOD2WZ)     DMREAD    WRKZ8                         
         DC    X'02D9',AL4(DMOD2WZ)     DMREAD    WRKZ9                         
         DC    X'02DA',AL4(DMOD2WZ)     DMREAD    WRKZA                         
         DC    X'02DB',AL4(DMOD2WZ)     DMREAD    WRKZB                         
         DC    X'02DC',AL4(DMOD2WZ)     DMREAD    WRKZC                         
         DC    X'02DD',AL4(DMOD2WZ)     DMREAD    WRKZD                         
         DC    X'02DE',AL4(DMOD2WZ)     DMREAD    WRKZE                         
         DC    X'02DF',AL4(DMOD2WZ)     DMREAD    WRKZF                         
*&&                                                                             
         DC    X'02E1',AL4(DMOD2IS)     DMREAD    PERDIR                        
         DC    X'02E2',AL4(DMOD2E2)     DMREAD    PERFIL                        
         DC    X'02E8',AL4(DMOD2WF)     DMREAD    WRKFA                         
         DC    X'02E9',AL4(DMOD2WF)     DMREAD    WRKFB                         
         DC    X'02EA',AL4(DMOD2WF)     DMREAD    WRKFC                         
         DC    X'02EB',AL4(DMOD2WF)     DMREAD    WRKFD                         
         DC    X'02EC',AL4(DMOD2WF)     DMREAD    WRKFE                         
         DC    X'02ED',AL4(DMOD2WF)     DMREAD    WRKFF                         
         DC    X'02EE',AL4(DMOD2WF)     DMREAD    WRKFG                         
*                                                                               
         DC    X'02F0',AL4(DMOD2F0)     DMREAD    SYSFLES                       
         DC    X'02F2',AL4(DMOD2F2)     DMREAD    TEMPSTR                       
         DC    X'02F4',AL4(DMOD2WK)     DMREAD    WKFILE                        
         DC    X'02FA',AL4(DMOD2WK)     DMREAD    FACWRK                        
         DC    X'02FE',AL4(DMOD2FE)     DMREAD    TEMPEST                       
*                                                                               
         DC    X'0301',AL4(DMOD3PQ)     DMRSEQ    PRTQ1                         
         DC    X'0302',AL4(DMOD3PQ)     DMRSEQ    PRTQ2                         
         DC    X'0303',AL4(DMOD3PQ)     DMRSEQ    PRTQ3                         
         DC    X'0304',AL4(DMOD3PQ)     DMRSEQ    PRTQ4                         
         DC    X'0305',AL4(DMOD3PQ)     DMRSEQ    PRTQ5                         
         DC    X'0306',AL4(DMOD3PQ)     DMRSEQ    PRTQ6                         
         DC    X'0307',AL4(DMOD3PQ)     DMRSEQ    PRTQ7                         
         DC    X'0308',AL4(DMOD3PQ)     DMRSEQ    PRTQ8                         
         DC    X'030A',AL4(DMOD3PQ)     DMRSEQ    PRTQ9                         
         DC    X'030B',AL4(DMOD3PQ)     DMRSEQ    PRTQA                         
         DC    X'030C',AL4(DMOD3PQ)     DMRSEQ    PRTQB                         
         DC    X'030D',AL4(DMOD3PQ)     DMRSEQ    PRTQC                         
         DC    X'030E',AL4(DMOD3PQ)     DMRSEQ    PRTQD                         
         DC    X'030F',AL4(DMOD3PQ)     DMRSEQ    PRTQE                         
*                                                                               
         DC    X'0310',AL4(DMOD3PQ)     DMRSEQ    PRTQF                         
         DC    X'031F',AL4(DMOD3PQ)     DMRSEQ    PRTQG                         
*                                                                               
*&&US*&& DC    X'0321',AL4(DMOD3DA)     DMRSEQ    SPTFILE                       
*&&US*&& DC    X'0322',AL4(DMOD3IS)     DMRSEQ    STATION                       
*&&US*&& DC    X'0323',AL4(DMOD3IS)     DMRSEQ    SPTDIR                        
*&&US*&& DC    X'0324',AL4(DMOD3DB)     DMRSEQ    RECOVER                       
*&&US*&& DC    X'0325',AL4(DMOD3RQ)     DMRSEQ    REQUEST                       
*&&US*&& DC    X'0326',AL4(DMOD326)     DMRSEQ    DEMFIL                        
*&&US*&& DC    X'0327',AL4(DMOD3IS)     DMRSEQ    UNTDIR                        
*&&US*&& DC    X'032C',AL4(DMOD32C)     DMRSEQ    PAVDIR                        
*&&US*&& DC    X'032D',AL4(DMOD32D)     DMRSEQ    DEMDIR                        
*&&US*&& DC    X'032E',AL4(DMOD3DI)     DMRSEQ    PAVFIL                        
*                                                                               
*&&US*&& DC    X'0332',AL4(DMOD3DA)     DMRSEQ    TRFFILE                       
*&&US*&& DC    X'0333',AL4(DMOD3IS)     DMRSEQ    TRFDIR                        
*&&US*&& DC    X'0334',AL4(DMOD3DB)     DMRSEQ    TRFRCV                        
*&&US*&& DC    X'0335',AL4(DMOD3RQ)     DMRSEQ    TRFREQ                        
*&&US*&& DC    X'0336',AL4(DMOD3IS)     DMRSEQ    XSPDIR                        
*&&US*&& DC    X'0337',AL4(DMOD3DA)     DMRSEQ    XSPFILE                       
*&&US*&& DC    X'0338',AL4(DMOD338)     DMRSEQ    NTIDIR                        
*&&US*&& DC    X'0339',AL4(DMOD339)     DMRSEQ    NTIFIL                        
*                                                                               
*&&US*&& DC    X'0340',AL4(DMOD3IS)     DMRSEQ    PRTDIR                        
*&&US*&& DC    X'0341',AL4(DMOD3IS)     DMRSEQ    PUBDIR                        
*&&US*&& DC    X'0342',AL4(DMOD3DA)     DMRSEQ    PRTFILE                       
*&&US*&& DC    X'0344',AL4(DMOD3DB)     DMRSEQ    PRECOVE                       
*&&US*&& DC    X'0345',AL4(DMOD3RQ)     DMRSEQ    PREQUES                       
*                                                                               
*&&UK*&& DC    X'0341',AL4(DMOD3IS)     DMRSEQ    MEDIR                         
*&&UK*&& DC    X'0342',AL4(DMOD3DA)     DMRSEQ    MEDFILE                       
*&&UK*&& DC    X'0343',AL4(DMOD3RQ)     DMRSEQ    MEDREQ                        
*&&UK*&& DC    X'0344',AL4(DMOD3DB)     DMRSEQ    MEDRCV                        
*&&UK*&& DC    X'0346',AL4(DMOD3IS)     DMRSEQ    DMGDIR                        
*&&UK*&& DC    X'0347',AL4(DMOD3DA)     DMRSEQ    DMGFIL                        
*&&UK*&& DC    X'0348',AL4(DMOD3IS)     DMRSEQ    DMNDIR                        
*&&UK*&& DC    X'0349',AL4(DMOD3DA)     DMRSEQ    DMNNEW                        
*&&UK*&& DC    X'034A',AL4(DMOD3DA)     DMRSEQ    DMNOLD                        
*&&UK*&& DC    X'034B',AL4(DMOD3IS)     DMRSEQ    DMODIR                        
*&&UK*&& DC    X'034C',AL4(DMOD3DA)     DMRSEQ    DMOF1                         
*&&UK*&& DC    X'034D',AL4(DMOD3DA)     DMRSEQ    DMOF2                         
*&&UK*&& DC    X'034E',AL4(DMOD3DA)     DMRSEQ    DMOF3                         
*&&UK*&& DC    X'034F',AL4(DMOD3DA)     DMRSEQ    DMOF4                         
*                                                                               
         DC    X'0351',AL4(DMOD3IS)     DMRSEQ    MPLDIR                        
         DC    X'0352',AL4(DMOD3DA)     DMRSEQ    MPLFIL                        
         DC    X'0353',AL4(DMOD3RQ)     DMRSEQ    MPLREQ                        
         DC    X'0354',AL4(DMOD3DB)     DMRSEQ    MPLRCV                        
*&&UK*&& DC    X'0358',AL4(DMOD3IS)     DMRSEQ    MPCDRS                        
*&&UK*&& DC    X'0359',AL4(DMOD3DA)     DMRSEQ    MPCFLS                        
*&&DO*&& DC    X'035A',AL4(DMOD3IS)     DMRSEQ    BUDDIR                        
*&&UK*&& DC    X'035C',AL4(DMOD3IS)     DMRSEQ    MPRDRB                        
*&&UK*&& DC    X'035D',AL4(DMOD3DA)     DMRSEQ    MPRFLB                        
*&&UK*&& DC    X'035E',AL4(DMOD3IS)     DMRSEQ    MPCDRC                        
*&&UK*&& DC    X'035F',AL4(DMOD3DA)     DMRSEQ    MPCFLC                        
*                                                                               
         DC    X'0361',AL4(DMOD3AC)     DMRSEQ    ACCOUNT                       
         DC    X'0363',AL4(DMOD3RQ)     DMRSEQ    ACCREQ                        
         DC    X'0364',AL4(DMOD3DB)     DMRSEQ    ACCRCVR                       
         DC    X'0366',AL4(DMOD3DA)     DMRSEQ    ACCDAY                        
         DC    X'0369',AL4(DMOD3IS)     DMRSEQ    ACCDIR                        
         DC    X'036C',AL4(DMOD3AC)     DMRSEQ    ACCHST                        
*                                                                               
*&&US*&& DC    X'0371',AL4(DMOD3IS)     DMRSEQ    TALDIR                        
*&&US*&& DC    X'0372',AL4(DMOD3DA)     DMRSEQ    TALFIL                        
*&&US*&& DC    X'0373',AL4(DMOD3RQ)     DMRSEQ    TALREQ                        
*&&US*&& DC    X'0374',AL4(DMOD3DB)     DMRSEQ    TALRCV                        
*&&US*&& DC    X'0375',AL4(DMOD3IS)     DMRSEQ    CHKDIR                        
*&&US*&& DC    X'0376',AL4(DMOD3DA)     DMRSEQ    CHKFIL                        
*                                                                               
*&&UK*&& DC    X'0371',AL4(DMOD3IS)     DMRSEQ    FEEDIR                        
*&&UK*&& DC    X'0372',AL4(DMOD3DA)     DMRSEQ    FEEFIL                        
*&&UK*&& DC    X'0373',AL4(DMOD3RQ)     DMRSEQ    FEEREQ                        
*&&UK*&& DC    X'0374',AL4(DMOD3DB)     DMRSEQ    FEERCV                        
*                                                                               
*&&US*&& DC    X'0381',AL4(DMOD381)     DMRSEQ    REPDIR (INTEREP)              
*&&US*&& DC    X'0383',AL4(DMOD3RQ)     DMRSEQ    REPREQ                        
*&&US*&& DC    X'0384',AL4(DMOD3DB)     DMRSEQ    REPRCVR                       
*&&US*&& DC    X'0386',AL4(DMOD3IS)     DMRSEQ    RRGON                         
*&&US*&& DC    X'0387',AL4(DMOD3IS)     DMRSEQ    ROIDIR                        
*&&US*&& DC    X'0389',AL4(DMOD3IS)     DMRSEQ    RRGNEW                        
*&&US*&& DC    X'038A',AL4(DMOD3IS)     DMRSEQ    REVIEW                        
*                                                                               
         DC    X'0391',AL4(DMOD3IS)     DMRSEQ    MBADIR                        
         DC    X'0392',AL4(DMOD3DA)     DMRSEQ    MBAFIL                        
         DC    X'0393',AL4(DMOD3RQ)     DMRSEQ    MBAREQ                        
         DC    X'0394',AL4(DMOD3DB)     DMRSEQ    MBARCV                        
         DC    X'0395',AL4(DMOD3IS)     DMRSEQ    MBANDX                        
         DC    X'0396',AL4(DMOD3IS)     DMRSEQ    MBUDIR                        
         DC    X'0397',AL4(DMOD3DA)     DMRSEQ    MBUFIL                        
*                                                                               
         DC    X'03A1',AL4(DMOD3CT)     DMRSEQ    CTFILE                        
         DC    X'03A3',AL4(DMOD3RQ)     DMRSEQ    CTREQ                         
         DC    X'03A4',AL4(DMOD3DB)     DMRSEQ    CTRCVR                        
*&&UK*&& DC    X'03A6',AL4(DMOD3IS)     DMRSEQ    CRADIR                        
*&&UK*&& DC    X'03A7',AL4(DMOD3DA)     DMRSEQ    CRAFIL                        
*&&US*&& DC    X'03AA',AL4(DMOD3IS)     DMRSEQ    DEMDIR                        
         DC    X'03AE',AL4(DMOD3IS)     DMRSEQ    GENDIR                        
         DC    X'03AF',AL4(DMOD3DA)     DMRSEQ    GENFIL                        
*                                                                               
*&&UK*&& DC    X'03C1',AL4(DMOD3IS)     DMRSEQ    CPFILE                        
*&&UK*&& DC    X'03C3',AL4(DMOD3RQ)     DMRSEQ    CPREQ                         
*&&UK*&& DC    X'03C4',AL4(DMOD3DB)     DMRSEQ    CPRCVR                        
*                                                                               
*&&US*&& DC    X'03C5',AL4(DMOD3DI)     DMRSEQ    PAVFIL                        
*                                                                               
         DC    X'03E1',AL4(DMOD3IS)     DMRSEQ    PERDIR                        
         DC    X'03E2',AL4(DMOD3DA)     DMRSEQ    PERFIL                        
         DC    X'03E3',AL4(DMOD3RQ)     DMRSEQ    PERREQ                        
         DC    X'03E4',AL4(DMOD3DB)     DMRSEQ    PERRCV                        
*                                                                               
         DC    X'03F3',AL4(DMOD3DA)     DMRSEQ    ADRFILE                       
         DC    X'03F7',AL4(DMOD3DA)     DMRSEQ    STATS                         
         DC    X'03F9',AL4(DMOD3DA)     DMRSEQ    TSTRCVR                       
         DC    X'03FB',AL4(DMOD3DA)     DMRSEQ    KWXFILE                       
*                                                                               
*&&US*&& DC    X'0422',AL4(DMOD4IS)     DMRDHI    STATION                       
*&&US*&& DC    X'0423',AL4(DMOD4IS)     DMRDHI    SPTDIR                        
*&&US*&& DC    X'0426',AL4(DMOD426)     DMRDHI    DEMFIL                        
*&&US*&& DC    X'0427',AL4(DMOD4IS)     DMRDHI    UNTDIR                        
*&&US*&& DC    X'042C',AL4(DMOD42C)     DMRDHI    PAVDIR                        
*&&US*&& DC    X'042D',AL4(DMOD42D)     DMRDHI    DEMDIR                        
*&&US*&& DC    X'042E',AL4(DMOD4DI)     DMRDHI    PAVFIL                        
*                                                                               
*&&US*&& DC    X'0433',AL4(DMOD4IS)     DMRDHI    TRFDIR                        
*&&US*&& DC    X'0436',AL4(DMOD4IS)     DMRDHI    XSPDIR                        
*&&US*&& DC    X'0438',AL4(DMOD438)     DMRDHI    NTIDIR                        
*&&US*&& DC    X'0439',AL4(DMOD439)     DMRDHI    NTIFIL                        
*                                                                               
*&&US*&& DC    X'0440',AL4(DMOD4IS)     DMRDHI    PRTDIR                        
*&&US*&& DC    X'0441',AL4(DMOD4IS)     DMRDHI    PUBDIR                        
*                                                                               
*&&UK*&& DC    X'0441',AL4(DMOD4IS)     DMRDHI    MEDIRR                        
*&&UK*&& DC    X'0446',AL4(DMOD4IS)     DMRDHI    DMGDIR                        
*&&UK*&& DC    X'0448',AL4(DMOD4IS)     DMRDHI    DMNDIR                        
*&&UK*&& DC    X'044B',AL4(DMOD4IS)     DMRDHI    DMODIR                        
*                                                                               
         DC    X'0451',AL4(DMOD4IS)     DMRDHI    MPLDIR                        
*&&UK*&& DC    X'0458',AL4(DMOD4IS)     DMRDHI    MPCDRS                        
*&&DO*&& DC    X'045A',AL4(DMOD4IS)     DMRDHI    BUDDIR                        
*&&UK*&& DC    X'045C',AL4(DMOD4IS)     DMRDHI    MPRDRB                        
*&&UK*&& DC    X'045E',AL4(DMOD4IS)     DMRDHI    MPCDRC                        
*                                                                               
         DC    X'0461',AL4(DMOD4AC)     DMRDHI    ACCOUNT                       
         DC    X'0469',AL4(DMOD4IS)     DMRDHI    ACCDIR                        
         DC    X'046C',AL4(DMOD4AC)     DMRDHI    ACCHST                        
*                                                                               
*&&UK*&& DC    X'0471',AL4(DMOD4IS)     DMRDHI    FEEDIR                        
*                                                                               
*&&US*&& DC    X'0471',AL4(DMOD4IS)     DMRDHI    TALDIR                        
*&&US*&& DC    X'0475',AL4(DMOD4IS)     DMRDHI    CHKDIR                        
*                                                                               
*&&US*&& DC    X'0481',AL4(DMOD481)     DMRDHI    REPDIR (INTEREP)              
*&&US*&& DC    X'0486',AL4(DMOD4IS)     DMRDHI    RRGONR                        
*&&US*&& DC    X'0487',AL4(DMOD4IS)     DMRDHI    ROIDIR                        
*&&US*&& DC    X'0489',AL4(DMOD4IS)     DMRDHI    RRGNEW                        
*&&US*&& DC    X'048A',AL4(DMOD4IS)     DMRDHI    REVIEW                        
*                                                                               
         DC    X'0491',AL4(DMOD4IS)     DMRDHI    MBADIR                        
         DC    X'0495',AL4(DMOD4IS)     DMRDHI    MBANDX                        
         DC    X'0496',AL4(DMOD4IS)     DMRDHI    MBUDIR                        
*                                                                               
         DC    X'04A1',AL4(DMOD4CT)     DMRDHI    CTFILE                        
*&&UK*&& DC    X'04A6',AL4(DMOD4IS)     DMRDHI    CRADIR                        
         DC    X'04AE',AL4(DMOD4IS)     DMRDHI    GENDIR                        
*                                                                               
*&&UK*&& DC    X'04C1',AL4(DMOD4IS)     DMRDHI    CPFILE                        
*                                                                               
         DC    X'04E1',AL4(DMOD4IS)     DMRDHI    PERDIR                        
*                                                                               
*&&US*&& DC    X'0521',AL4(DMOD521)     DMDEL     SPTFILE                       
*&&US*&& DC    X'0532',AL4(DMOD532)     DMDEL     TRFFILE                       
*                                                                               
         DC    X'0601',AL4(DMOD6DA)     DMRDIR    PRTQ1                         
         DC    X'0602',AL4(DMOD6DA)     DMRDIR    PRTQ2                         
         DC    X'0603',AL4(DMOD6DA)     DMRDIR    PRTQ3                         
         DC    X'0604',AL4(DMOD6DA)     DMRDIR    PRTQ4                         
         DC    X'0605',AL4(DMOD6DA)     DMRDIR    PRTQ5                         
         DC    X'0606',AL4(DMOD6DA)     DMRDIR    PRTQ6                         
         DC    X'0607',AL4(DMOD6DA)     DMRDIR    PRTQ7                         
         DC    X'0608',AL4(DMOD6DA)     DMRDIR    PRTQ8                         
         DC    X'060A',AL4(DMOD6DA)     DMRDIR    PRTQ9                         
         DC    X'060B',AL4(DMOD6DA)     DMRDIR    PRTQA                         
         DC    X'060C',AL4(DMOD6DA)     DMRDIR    PRTQB                         
         DC    X'060D',AL4(DMOD6DA)     DMRDIR    PRTQC                         
         DC    X'060E',AL4(DMOD6DA)     DMRDIR    PRTQD                         
         DC    X'060F',AL4(DMOD6DA)     DMRDIR    PRTQE                         
*                                                                               
         DC    X'0610',AL4(DMOD6DA)     DMRDIR    PRTQF                         
         DC    X'061F',AL4(DMOD6DA)     DMRDIR    PRTQG                         
*                                                                               
*&&US*&& DC    X'0621',AL4(DMODB21)     DMRDIR    SPTFILE                       
*&&US*&& DC    X'0624',AL4(DMOD6DB)     DMRDIR    RECOVER                       
*&&US*&& DC    X'0625',AL4(DMOD6RQ)     DMRDIR    REQUEST                       
*                                                                               
*&&US*&& DC    X'0632',AL4(DMODB21)     DMRDIR    TRFFILE                       
*&&US*&& DC    X'0634',AL4(DMOD6DB)     DMRDIR    TRFRCV                        
*&&US*&& DC    X'0635',AL4(DMOD6RQ)     DMRDIR    TRFREQ                        
*                                                                               
*&&US*&& DC    X'0644',AL4(DMOD6DB)     DMRDIR    PRECOVE                       
*&&US*&& DC    X'0645',AL4(DMOD6RQ)     DMRDIR    PREQUES                       
*                                                                               
*&&UK*&& DC    X'0643',AL4(DMOD6RQ)     DMRDIR    MEDREQ                        
*&&UK*&& DC    X'0644',AL4(DMOD6DB)     DMRDIR    MEDRCV                        
*                                                                               
         DC    X'0653',AL4(DMOD6RQ)     DMRDIR    MPLREQ                        
         DC    X'0654',AL4(DMOD6DB)     DMRDIR    MPLRCV                        
*                                                                               
         DC    X'0663',AL4(DMOD6RQ)     DMRDIR    ACCREQ                        
         DC    X'0664',AL4(DMOD6DB)     DMRDIR    ACCRCVR                       
         DC    X'0666',AL4(DMOD6DA)     DMRDIR    ACCDAY                        
*                                                                               
*&&US*&& DC    X'0673',AL4(DMOD6RQ)     DMRDIR    TALREQ                        
*&&US*&& DC    X'0674',AL4(DMOD6DB)     DMRDIR    TALRCV                        
*                                                                               
*&&UK*&& DC    X'0673',AL4(DMOD6RQ)     DMRDIR    FEEREQ                        
*&&UK*&& DC    X'0674',AL4(DMOD6DB)     DMRDIR    FEERCV                        
*                                                                               
*&&US*&& DC    X'0683',AL4(DMOD6RQ)     DMRDIR    REPREQ                        
*&&US*&& DC    X'0684',AL4(DMOD6DB)     DMRDIR    REPRCVR                       
*                                                                               
         DC    X'0693',AL4(DMOD6RQ)     DMRDIR    MBAREQ                        
         DC    X'0694',AL4(DMOD6DB)     DMRDIR    MBARCV                        
*                                                                               
         DC    X'06A3',AL4(DMOD6RQ)     DMRDIR    CTREQ                         
         DC    X'06A4',AL4(DMOD6DB)     DMRDIR    CTRCVR                        
*                                                                               
*&&UK*&& DC    X'06C3',AL4(DMOD6RQ)     DMRDIR    CPREQ                         
*&&UK*&& DC    X'06C4',AL4(DMOD6DB)     DMRDIR    CPRCVR                        
*                                                                               
         DC    X'06E3',AL4(DMOD6RQ)     DMRDIR    PERREQ                        
         DC    X'06E4',AL4(DMOD6DB)     DMRDIR    PERRCV                        
*                                                                               
         DC    X'06E7',AL4(DMOD6DA)     DMRDIR    EDCTZ                         
         DC    X'06F1',AL4(DMOD6DA)     DMRDIR    PRGMS                         
         DC    X'06F2',AL4(DMOD6F2)     DMRDIR    TEMPSTR                       
         DC    X'06F3',AL4(DMOD6DA)     DMRDIR    ADRFILE                       
         DC    X'06F7',AL4(DMOD6DA)     DMRDIR    STATS                         
         DC    X'06F8',AL4(DMOD6DA)     DMRDIR    DMPFILE                       
         DC    X'06F9',AL4(DMOD6DA)     DMRDIR    TSTRCVR                       
         DC    X'06FB',AL4(DMOD6DA)     DMRDIR    KWXFILE                       
         DC    X'06FC',AL4(DMOD6DA)     DMRDIR    EDCTA                         
         DC    X'06FD',AL4(DMOD6DA)     DMRDIR    EDCTR                         
         DC    X'06FE',AL4(DMOD6DA)     DMRDIR    TEMPEST                       
*                                                                               
         DC    X'0801',AL4(DMOD8PQ)     DMWRT     PRTQ1                         
         DC    X'0802',AL4(DMOD8PQ)     DMWRT     PRTQ2                         
         DC    X'0803',AL4(DMOD8PQ)     DMWRT     PRTQ3                         
         DC    X'0804',AL4(DMOD8PQ)     DMWRT     PRTQ4                         
         DC    X'0805',AL4(DMOD8PQ)     DMWRT     PRTQ5                         
         DC    X'0806',AL4(DMOD8PQ)     DMWRT     PRTQ6                         
         DC    X'0807',AL4(DMOD8PQ)     DMWRT     PRTQ7                         
         DC    X'0808',AL4(DMOD8PQ)     DMWRT     PRTQ8                         
         DC    X'0809',AL4(DMOD8WK)     DMWRT     EASIWK                        
         DC    X'080A',AL4(DMOD8PQ)     DMWRT     PRTQ9                         
         DC    X'080B',AL4(DMOD8PQ)     DMWRT     PRTQA                         
         DC    X'080C',AL4(DMOD8PQ)     DMWRT     PRTQB                         
         DC    X'080D',AL4(DMOD8PQ)     DMWRT     PRTQC                         
         DC    X'080E',AL4(DMOD8PQ)     DMWRT     PRTQD                         
         DC    X'080F',AL4(DMOD8PQ)     DMWRT     PRTQE                         
*                                                                               
         DC    X'0810',AL4(DMOD8PQ)     DMWRT     PRTQF                         
         DC    X'0811',AL4(DMOD8WF)     DMWRT     WRKF1                         
         DC    X'0812',AL4(DMOD8WF)     DMWRT     WRKF2                         
         DC    X'0813',AL4(DMOD8WF)     DMWRT     WRKF3                         
         DC    X'0814',AL4(DMOD8WF)     DMWRT     WRKF4                         
         DC    X'0815',AL4(DMOD8WF)     DMWRT     WRKF5                         
         DC    X'0816',AL4(DMOD8WF)     DMWRT     WRKF6                         
         DC    X'0817',AL4(DMOD8WF)     DMWRT     WRKF7                         
         DC    X'0818',AL4(DMOD8WF)     DMWRT     WRKF8                         
         DC    X'0819',AL4(DMOD8WF)     DMWRT     WRKF9                         
         DC    X'081F',AL4(DMOD8PQ)     DMWRT     PRTQG                         
*                                                                               
*&&US*&& DC    X'0821',AL4(DMOD821)     DMWRT     SPTFILE                       
*&&US*&& DC    X'0822',AL4(DMOD8IV)     DMWRT     STATION                       
*&&US*&& DC    X'0823',AL4(DMOD8IS)     DMWRT     SPTDIR                        
*&&US*&& DC    X'0825',AL4(DMOD8RQ)     DMWRT     REQUEST                       
*&&US*&& DC    X'0827',AL4(DMOD8IS)     DMWRT     UNTDIR                        
*&&US*&& DC    X'082C',AL4(DMOD8IS)     DMWRT     PAVDIR                        
*&&US*&& DC    X'082D',AL4(DMOD8IS)     DMWRT     DEMDIR                        
*                                                                               
*&&US*&& DC    X'0832',AL4(DMOD821)     DMWRT     TRFFILE                       
*&&US*&& DC    X'0833',AL4(DMOD8IS)     DMWRT     TRFDIR                        
*&&US*&& DC    X'0835',AL4(DMOD8RQ)     DMWRT     TRFREQ                        
*&&US*&& DC    X'0836',AL4(DMOD8IS)     DMWRT     XSPDIR                        
*&&US*&& DC    X'0838',AL4(DMOD8IS)     DMWRT     NTIDIR                        
*                                                                               
*&&US*&& DC    X'0840',AL4(DMOD8IS)     DMWRT     PRTDIR                        
*&&US*&& DC    X'0841',AL4(DMOD8IS)     DMWRT     PUBDIR                        
*&&US*&& DC    X'0845',AL4(DMOD8RQ)     DMWRT     PREQUES                       
*                                                                               
*&&UK*&& DC    X'0841',AL4(DMOD8IS)     DMWRT     MEDIR                         
*&&UK*&& DC    X'0843',AL4(DMOD8RQ)     DMWRT     MEDREQ                        
*&&UK*&& DC    X'0845',AL4(DMOD8WK)     DMWRT     MEDWRK                        
*&&UK*&& DC    X'0846',AL4(DMOD8IS)     DMWRT     DMGDIR                        
*&&UK*&& DC    X'0848',AL4(DMOD8IS)     DMWRT     DMNDIR                        
*&&UK*&& DC    X'084B',AL4(DMOD8IS)     DMWRT     DMODIR                        
*                                                                               
         DC    X'0851',AL4(DMOD8IS)     DMWRT     MPLDIR                        
         DC    X'0853',AL4(DMOD8RQ)     DMWRT     MPLREQ                        
*&&UK*&& DC    X'0858',AL4(DMOD8IS)     DMWRT     MPCDRS                        
*&&DO*&& DC    X'085A',AL4(DMOD8IS)     DMWRT     BUDDIR                        
*&&UK*&& DC    X'085C',AL4(DMOD8IS)     DMWRT     MPRDRB                        
*&&UK*&& DC    X'085E',AL4(DMOD8IS)     DMWRT     MPCDRC                        
*                                                                               
         DC    X'0861',AL4(DMOD8AC)     DMWRT     ACCOUNT                       
         DC    X'0863',AL4(DMOD8RQ)     DMWRT     ACCREQ                        
         DC    X'0866',AL4(DMOD866)     DMWRT     ACCDAY                        
         DC    X'0867',AL4(DMOD8WK)     DMWRT     ACCWRK                        
         DC    X'0869',AL4(DMOD8IS)     DMWRT     ACCDIR                        
         DC    X'086C',AL4(DMOD8AC)     DMWRT     ACCHST                        
*                                                                               
*&&US*&& DC    X'0871',AL4(DMOD8IS)     DMWRT     TALDIR                        
*&&US*&& DC    X'0873',AL4(DMOD8RQ)     DMWRT     TALREQ                        
*&&US*&& DC    X'0875',AL4(DMOD8IS)     DMWRT     CHKDIR                        
*                                                                               
*&&UK*&& DC    X'0871',AL4(DMOD8IS)     DMWRT     FEEDIR                        
*&&UK*&& DC    X'0873',AL4(DMOD8RQ)     DMWRT     FEEREQ                        
*                                                                               
*&&US*&& DC    X'0881',AL4(DMOD8IS)     DMWRT     REPDIR                        
*&&US*&& DC    X'0883',AL4(DMOD8RQ)     DMWRT     REPREQ                        
*&&US*&& DC    X'0885',AL4(DMOD8WK)     DMWRT     REPWRK                        
*&&US*&& DC    X'0886',AL4(DMOD8IS)     DMWRT     RRGON                         
*&&US*&& DC    X'0887',AL4(DMOD8IS)     DMWRT     ROIDIR                        
*&&US*&& DC    X'0889',AL4(DMOD8IS)     DMWRT     RRGNEW                        
*&&US*&& DC    X'088A',AL4(DMOD8IS)     DMWRT     REVIEW                        
*                                                                               
         DC    X'0891',AL4(DMOD8IS)     DMWRT     MBADIR                        
         DC    X'0893',AL4(DMOD8RQ)     DMWRT     MBAREQ                        
         DC    X'0895',AL4(DMOD8IS)     DMWRT     MBANDX                        
         DC    X'0896',AL4(DMOD8IS)     DMWRT     MBUDIR                        
*                                                                               
         DC    X'08A1',AL4(DMOD8CT)     DMWRT     CTFILE                        
         DC    X'08A3',AL4(DMOD8RQ)     DMWRT     CTREQ                         
*&&UK*&& DC    X'08A6',AL4(DMOD8IS)     DMWRT     CRADIR                        
         DC    X'08AE',AL4(DMOD8IS)     DMWRT     GENDIR                        
*                                                                               
*&&UK*&& DC    X'08C1',AL4(DMOD8IV)     DMWRT     CPFILE                        
*&&UK*&& DC    X'08C3',AL4(DMOD8RQ)     DMWRT     CPREQ                         
*&&US                                                                           
         DC    X'08D1',AL4(DMOD8WZ)     DMWRT     WRKZ1                         
         DC    X'08D2',AL4(DMOD8WZ)     DMWRT     WRKZ2                         
         DC    X'08D3',AL4(DMOD8WZ)     DMWRT     WRKZ3                         
         DC    X'08D4',AL4(DMOD8WZ)     DMWRT     WRKZ4                         
         DC    X'08D5',AL4(DMOD8WZ)     DMWRT     WRKZ5                         
         DC    X'08D6',AL4(DMOD8WZ)     DMWRT     WRKZ6                         
         DC    X'08D7',AL4(DMOD8WZ)     DMWRT     WRKZ7                         
         DC    X'08D8',AL4(DMOD8WZ)     DMWRT     WRKZ8                         
         DC    X'08D9',AL4(DMOD8WZ)     DMWRT     WRKZ9                         
         DC    X'08DA',AL4(DMOD8WZ)     DMWRT     WRKZA                         
         DC    X'08DB',AL4(DMOD8WZ)     DMWRT     WRKZB                         
         DC    X'08DC',AL4(DMOD8WZ)     DMWRT     WRKZC                         
         DC    X'08DD',AL4(DMOD8WZ)     DMWRT     WRKZD                         
         DC    X'08DE',AL4(DMOD8WZ)     DMWRT     WRKZE                         
         DC    X'08DF',AL4(DMOD8WZ)     DMWRT     WRKZF                         
*&&                                                                             
         DC    X'08E1',AL4(DMOD8IS)     DMWRT     PERDIR                        
         DC    X'08E3',AL4(DMOD8RQ)     DMWRT     PERREQ                        
         DC    X'08E7',AL4(DMOD8ED)     DMWRT     EDCTZ                         
         DC    X'08E8',AL4(DMOD8WF)     DMWRT     WRKFA                         
         DC    X'08E9',AL4(DMOD8WF)     DMWRT     WRKFB                         
         DC    X'08EA',AL4(DMOD8WF)     DMWRT     WRKFC                         
         DC    X'08EB',AL4(DMOD8WF)     DMWRT     WRKFD                         
         DC    X'08EC',AL4(DMOD8WF)     DMWRT     WRKFE                         
         DC    X'08ED',AL4(DMOD8WF)     DMWRT     WRKFF                         
         DC    X'08EE',AL4(DMOD8WF)     DMWRT     WRKFG                         
*                                                                               
         DC    X'08F2',AL4(DMOD8F2)     DMWRT     TEMPSTR                       
         DC    X'08F4',AL4(DMOD8WK)     DMWRT     WKFILE                        
         DC    X'08F7',AL4(DMOD8F7)     DMWRT     STATS                         
         DC    X'08FA',AL4(DMOD8WK)     DMWRT     FACWRK                        
         DC    X'08FB',AL4(DMOD8FB)     DMWRT     KWXFILE                       
         DC    X'08FC',AL4(DMOD8ED)     DMWRT     EDCTA                         
         DC    X'08FD',AL4(DMOD8ED)     DMWRT     EDCTR                         
         DC    X'08FE',AL4(DMOD8FE)     DMWRT     TEMPEST                       
*                                                                               
         DC    X'0901',AL4(DMOD9PQ)     DMPRINT   PRTQ1                         
         DC    X'0902',AL4(DMOD9PQ)     DMPRINT   PRTQ2                         
         DC    X'0903',AL4(DMOD9PQ)     DMPRINT   PRTQ3                         
         DC    X'0904',AL4(DMOD9PQ)     DMPRINT   PRTQ4                         
         DC    X'0905',AL4(DMOD9PQ)     DMPRINT   PRTQ5                         
         DC    X'0906',AL4(DMOD9PQ)     DMPRINT   PRTQ6                         
         DC    X'0907',AL4(DMOD9PQ)     DMPRINT   PRTQ7                         
         DC    X'0908',AL4(DMOD9PQ)     DMPRINT   PRTQ8                         
         DC    X'0909',AL4(DMOD9WK)     DMPRINT   EASIWK                        
         DC    X'090A',AL4(DMOD9PQ)     DMPRINT   PRTQ9                         
         DC    X'090B',AL4(DMOD9PQ)     DMPRINT   PRTQA                         
         DC    X'090C',AL4(DMOD9PQ)     DMPRINT   PRTQB                         
         DC    X'090D',AL4(DMOD9PQ)     DMPRINT   PRTQC                         
         DC    X'090E',AL4(DMOD9PQ)     DMPRINT   PRTQD                         
         DC    X'090F',AL4(DMOD9PQ)     DMPRINT   PRTQE                         
*                                                                               
         DC    X'0910',AL4(DMOD9PQ)     DMPRINT   PRTQF                         
         DC    X'0911',AL4(DMOD9WF)     DMPRINT   WRKF1                         
         DC    X'0912',AL4(DMOD9WF)     DMPRINT   WRKF2                         
         DC    X'0913',AL4(DMOD9WF)     DMPRINT   WRKF3                         
         DC    X'0914',AL4(DMOD9WF)     DMPRINT   WRKF4                         
         DC    X'0915',AL4(DMOD9WF)     DMPRINT   WRKF5                         
         DC    X'0916',AL4(DMOD9WF)     DMPRINT   WRKF6                         
         DC    X'0917',AL4(DMOD9WF)     DMPRINT   WRKF7                         
         DC    X'0918',AL4(DMOD9WF)     DMPRINT   WRKF8                         
         DC    X'0919',AL4(DMOD9WF)     DMPRINT   WRKF9                         
         DC    X'091F',AL4(DMOD9PQ)     DMPRINT   PRTQG                         
*                                                                               
*&&UK*&& DC    X'0945',AL4(DMOD9WK)     DMPRINT   MEDWRK                        
*                                                                               
         DC    X'0967',AL4(DMOD9WK)     DMPRINT   ACCWRK                        
*                                                                               
*&&US*&& DC    X'0985',AL4(DMOD9WK)     DMPRINT   REPWRK                        
*&&US                                                                           
         DC    X'09D1',AL4(DMOD9WZ)     DMPRINT   WRKZ1                         
         DC    X'09D2',AL4(DMOD9WZ)     DMPRINT   WRKZ2                         
         DC    X'09D3',AL4(DMOD9WZ)     DMPRINT   WRKZ3                         
         DC    X'09D4',AL4(DMOD9WZ)     DMPRINT   WRKZ4                         
         DC    X'09D5',AL4(DMOD9WZ)     DMPRINT   WRKZ5                         
         DC    X'09D6',AL4(DMOD9WZ)     DMPRINT   WRKZ6                         
         DC    X'09D7',AL4(DMOD9WZ)     DMPRINT   WRKZ7                         
         DC    X'09D8',AL4(DMOD9WZ)     DMPRINT   WRKZ8                         
         DC    X'09D9',AL4(DMOD9WZ)     DMPRINT   WRKZ9                         
         DC    X'09DA',AL4(DMOD9WZ)     DMPRINT   WRKZA                         
         DC    X'09DB',AL4(DMOD9WZ)     DMPRINT   WRKZB                         
         DC    X'09DC',AL4(DMOD9WZ)     DMPRINT   WRKZC                         
         DC    X'09DD',AL4(DMOD9WZ)     DMPRINT   WRKZD                         
         DC    X'09DE',AL4(DMOD9WZ)     DMPRINT   WRKZE                         
         DC    X'09DF',AL4(DMOD9WZ)     DMPRINT   WRKZF                         
*&&                                                                             
         DC    X'09E8',AL4(DMOD9WF)     DMPRINT   WRKFA                         
         DC    X'09E9',AL4(DMOD9WF)     DMPRINT   WRKFB                         
         DC    X'09EA',AL4(DMOD9WF)     DMPRINT   WRKFC                         
         DC    X'09EB',AL4(DMOD9WF)     DMPRINT   WRKFD                         
         DC    X'09EC',AL4(DMOD9WF)     DMPRINT   WRKFE                         
         DC    X'09ED',AL4(DMOD9WF)     DMPRINT   WRKFF                         
         DC    X'09EE',AL4(DMOD9WF)     DMPRINT   WRKFG                         
*                                                                               
         DC    X'09F4',AL4(DMOD9WK)     DMPRINT   WKFILE                        
         DC    X'09FA',AL4(DMOD9WK)     DMPRINT   FACWRK                        
*                                                                               
*&&UK*&& DC    X'0A41',AL4(DMODAIS)     DMFAST    MEDIRR                        
*&&UK*&& DC    X'0A42',AL4(DMODAGR)     DMFAST    MEDFILE                       
*&&UK*&& DC    X'0A46',AL4(DMODAIS)     DMFAST    DMGDIR                        
*&&UK*&& DC    X'0A47',AL4(DMODAGR)     DMFAST    DMGFIL                        
*&&UK*&& DC    X'0A48',AL4(DMODAIS)     DMFAST    DMNDIR                        
*&&UK*&& DC    X'0A49',AL4(DMODAGR)     DMFAST    DMNNEW                        
*&&UK*&& DC    X'0A4A',AL4(DMODAGR)     DMFAST    DMNOLD                        
*&&UK*&& DC    X'0A4B',AL4(DMODAIS)     DMFAST    DMODIR                        
*&&UK*&& DC    X'0A4C',AL4(DMODAGR)     DMFAST    DMO1FL                        
*&&UK*&& DC    X'0A4D',AL4(DMODAGR)     DMFAST    DMO2FL                        
*&&UK*&& DC    X'0A4E',AL4(DMODAGR)     DMFAST    DMO3FL                        
*&&UK*&& DC    X'0A4F',AL4(DMODAGR)     DMFAST    DMO4FL                        
*                                                                               
*&&UK*&& DC    X'0A58',AL4(DMODAIS)     DMFAST    MPCDRS                        
*&&UK*&& DC    X'0A59',AL4(DMODAGR)     DMFAST    MPCFLS                        
*&&UK*&& DC    X'0A5E',AL4(DMODAIS)     DMFAST    MPCDRC                        
*&&UK*&& DC    X'0A5F',AL4(DMODAGR)     DMFAST    MPCFLC                        
*                                                                               
         DC    X'0A69',AL4(DMODAIS)     DMFAST    ACCDIR                        
*                                                                               
*&&US*&& DC    X'0A71',AL4(DMODAIS)     DMFAST    TALDIR                        
*&&US*&& DC    X'0A72',AL4(DMODAGR)     DMFAST    TALFIL                        
*&&US*&& DC    X'0A75',AL4(DMODAIS)     DMFAST    CHKDIR                        
*&&US*&& DC    X'0A76',AL4(DMODAGR)     DMFAST    CHKFIL                        
*                                                                               
*&&UK*&& DC    X'0A71',AL4(DMODAIS)     DMFAST    FEEDIR                        
*&&UK*&& DC    X'0A72',AL4(DMODAGR)     DMFAST    FEEFIL                        
*                                                                               
*&&UK*&& DC    X'0AA6',AL4(DMODAIS)     DMFAST    CRADIR                        
*&&UK*&& DC    X'0AA7',AL4(DMODAGR)     DMFAST    CRAFIL                        
*                                                                               
*&&US*&& DC    X'0B21',AL4(DMODB21)     GETREC    SPTFILE                       
*&&US*&& DC    X'0B2A',AL4(DMODB2A)     GETREC    UNTFIL                        
*                                                                               
*&&US*&& DC    X'0B31',AL4(DMODB21)     GETREC    TRFFILE                       
*&&US*&& DC    X'0B32',AL4(DMODB21)     GETREC    TRFFILE                       
*&&US*&& DC    X'0B37',AL4(DMODBDA)     GETREC    XSPFILE                       
*                                                                               
*&&US*&& DC    X'0B42',AL4(DMODB42)     GETREC    PRTFILE                       
*&&US*&& DC    X'0B43',AL4(DMODB43)     GETREC    PUBFILE                       
*                                                                               
*&&UK*&& DC    X'0B42',AL4(DMODBDA)     GETREC    MEDFILE                       
*&&UK*&& DC    X'0B47',AL4(DMODBDA)     GETREC    DMGFIL                        
*&&UK*&& DC    X'0B49',AL4(DMODBDA)     GETREC    DMNNEW                        
*&&UK*&& DC    X'0B4A',AL4(DMODBDA)     GETREC    DMNOLD                        
*&&UK*&& DC    X'0B4C',AL4(DMODBDA)     GETREC    DMO1FL                        
*&&UK*&& DC    X'0B4D',AL4(DMODBDA)     GETREC    DMO2FL                        
*&&UK*&& DC    X'0B4E',AL4(DMODBDA)     GETREC    DMO3FL                        
*&&UK*&& DC    X'0B4F',AL4(DMODBDA)     GETREC    DMO4FL                        
*                                                                               
         DC    X'0B52',AL4(DMODBDA)     GETREC    MPLFIL                        
*&&UK*&& DC    X'0B59',AL4(DMODBDA)     GETREC    MPCFLS                        
*&&DO*&& DC    X'0B5B',AL4(DMODBDA)     GETREC    BUDFIL                        
*&&DO*&& DC    X'0B5D',AL4(DMODBDA)     GETREC    MPRFLB                        
*&&UK*&& DC    X'0B5F',AL4(DMODBDA)     GETREC    MPCFLC                        
*                                                                               
         DC    X'0B6A',AL4(DMODBDA)     GETREC    ACCMST                        
         DC    X'0B6B',AL4(DMODBDA)     GETREC    ACCARC                        
*                                                                               
*&&US*&& DC    X'0B72',AL4(DMODBDA)     GETREC    TALFIL                        
*&&US*&& DC    X'0B76',AL4(DMODBDA)     GETREC    CHKFIL                        
*                                                                               
*&&UK*&& DC    X'0B72',AL4(DMODBDA)     GETREC    FEEFIL                        
*                                                                               
*&&US*&& DC    X'0B82',AL4(DMODB82)     GETREC    REPFILE                       
*&&US*&& DC    X'0B88',AL4(DMODB88)     GETREC    ROIFIL                        
*                                                                               
         DC    X'0B92',AL4(DMODBDA)     GETREC    MBAFIL                        
         DC    X'0B97',AL4(DMODBDA)     GETREC    MBUFIL                        
*                                                                               
*&&UK*&& DC    X'0BA7',AL4(DMODBDA)     GETREC    CRAFIL                        
         DC    X'0BAF',AL4(DMODBDA)     GETREC    GENFIL                        
*                                                                               
         DC    X'0BE2',AL4(DMODBDA)     GETREC    PERFIL                        
*                                                                               
*&&US*&& DC    X'0C21',AL4(DMODCDA)     PUTREC    SPTFILE                       
*&&US*&& DC    X'0C2A',AL4(DMODCDA)     PUTREC    UNTFIL                        
*                                                                               
*&&US*&& DC    X'0C32',AL4(DMODCDA)     PUTREC    TRFFILE                       
*&&US*&& DC    X'0C37',AL4(DMODCDA)     PUTREC    XSPFILE                       
*                                                                               
*&&US*&& DC    X'0C42',AL4(DMODCDA)     PUTREC    PRTFILE                       
*&&US*&& DC    X'0C43',AL4(DMODCDA)     PUTREC    PUBFILE                       
*                                                                               
*&&UK*&& DC    X'0C42',AL4(DMODCDA)     PUTREC    MEDFILE                       
*&&UK*&& DC    X'0C47',AL4(DMODCDA)     PUTREC    DMGFIL                        
*&&UK*&& DC    X'0C49',AL4(DMODCDA)     PUTREC    DMNNEW                        
*&&UK*&& DC    X'0C4A',AL4(DMODCDA)     PUTREC    DMNOLD                        
*&&UK*&& DC    X'0C4C',AL4(DMODCDA)     PUTREC    DMO1FL                        
*&&UK*&& DC    X'0C4D',AL4(DMODCDA)     PUTREC    DMO2FL                        
*&&UK*&& DC    X'0C4E',AL4(DMODCDA)     PUTREC    DMO3FL                        
*&&UK*&& DC    X'0C4F',AL4(DMODCDA)     PUTREC    DMO4FL                        
*                                                                               
         DC    X'0C52',AL4(DMODCDA)     PUTREC    MPLFIL                        
*&&UK*&& DC    X'0C59',AL4(DMODCDA)     PUTREC    MPCFLS                        
*&&DO*&& DC    X'0C5B',AL4(DMODCDA)     GETREC    BUDFIL                        
*&&UK*&& DC    X'0C5D',AL4(DMODCDA)     PUTREC    MPRFLB                        
*&&UK*&& DC    X'0C5F',AL4(DMODCDA)     PUTREC    MPCFLC                        
*                                                                               
         DC    X'0C6A',AL4(DMODCDA)     PUTREC    ACCMST                        
         DC    X'0C6B',AL4(DMODCDA)     PUTREC    ACCARC                        
*                                                                               
*&&US*&& DC    X'0C72',AL4(DMODCDA)     PUTREC    TALFIL                        
*&&US*&& DC    X'0C76',AL4(DMODCDA)     PUTREC    CHKFIL                        
*                                                                               
*&&UK*&& DC    X'0C72',AL4(DMODCDA)     PUTREC    FEEFIL                        
*                                                                               
*&&US*&& DC    X'0C82',AL4(DMODCDA)     PUTREC    REPFILE                       
*&&US*&& DC    X'0C88',AL4(DMODCDA)     PUTREC    ROIFIL                        
*                                                                               
         DC    X'0C92',AL4(DMODCDA)     PUTREC    MBAFIL                        
         DC    X'0C97',AL4(DMODCDA)     PUTREC    MBUFIL                        
*                                                                               
*&&UK*&& DC    X'0CA7',AL4(DMODCDA)     PUTREC    CRAFIL                        
         DC    X'0CAF',AL4(DMODCDA)     PUTREC    GENFIL                        
*                                                                               
         DC    X'0CE2',AL4(DMODCDA)     PUTREC    PERFIL                        
*                                                                               
*&&US*&& DC    X'0D21',AL4(DMODDDA)     ADDREC    SPTFILE                       
*&&US*&& DC    X'0D2A',AL4(DMODDDA)     ADDREC    UNTFIL                        
*                                                                               
*&&US*&& DC    X'0D32',AL4(DMODDDA)     ADDREC    TRFFILE                       
*&&US*&& DC    X'0D37',AL4(DMODDDA)     ADDREC    XSPFILE                       
*                                                                               
*&&US*&& DC    X'0D42',AL4(DMODDDA)     ADDREC    PRTFILE                       
*&&US*&& DC    X'0D43',AL4(DMODDDA)     ADDREC    PUBFILE                       
*                                                                               
*&&UK*&& DC    X'0D42',AL4(DMODDDA)     ADDREC    MEDFILE                       
*&&UK*&& DC    X'0D47',AL4(DMODDDA)     ADDREC    DMGFIL                        
*&&UK*&& DC    X'0D49',AL4(DMODDDA)     ADDREC    DMNNEW                        
*&&UK*&& DC    X'0D4A',AL4(DMODDDA)     ADDREC    DMNOLD                        
*&&UK*&& DC    X'0D4C',AL4(DMODDDA)     ADDREC    DMO1FL                        
*&&UK*&& DC    X'0D4D',AL4(DMODDDA)     ADDREC    DMO2FL                        
*&&UK*&& DC    X'0D4E',AL4(DMODDDA)     ADDREC    DMO3FL                        
*&&UK*&& DC    X'0D4F',AL4(DMODDDA)     ADDREC    DMO4FL                        
*                                                                               
         DC    X'0D52',AL4(DMODDDA)     ADDREC    MPLFIL                        
*&&UK*&& DC    X'0D59',AL4(DMODDDA)     ADDREC    MPCFLS                        
*&&DO*&& DC    X'0D5B',AL4(DMODDDA)     ADDREC    BUDFIL                        
*&&UK*&& DC    X'0D5D',AL4(DMODDDA)     ADDREC    MPRFLB                        
*&&UK*&& DC    X'0D5F',AL4(DMODDDA)     ADDREC    MPCFLC                        
*                                                                               
         DC    X'0D6A',AL4(DMODDDA)     ADDREC    ACCMST                        
         DC    X'0D6B',AL4(DMODDDA)     ADDREC    ACCARC                        
*                                                                               
*&&US*&& DC    X'0D72',AL4(DMODDDA)     ADDREC    TALFIL                        
*&&US*&& DC    X'0D76',AL4(DMODDDA)     ADDREC    CHKFIL                        
*                                                                               
*&&UK*&& DC    X'0D72',AL4(DMODDDA)     ADDREC    FEEFIL                        
*                                                                               
*&&US*&& DC    X'0D82',AL4(DMODDDA)     ADDREC    REPFILE                       
*&&US*&& DC    X'0D88',AL4(DMODDDA)     ADDREC    ROIFIL                        
*                                                                               
         DC    X'0D92',AL4(DMODDDA)     ADDREC    MBAFIL                        
         DC    X'0D97',AL4(DMODDDA)     ADDREC    MBUFIL                        
*                                                                               
*&&UK*&& DC    X'0DA7',AL4(DMODDDA)     ADDREC    CRAFIL                        
         DC    X'0DAF',AL4(DMODDDA)     ADDREC    GENFIL                        
*                                                                               
         DC    X'0DE2',AL4(DMODDDA)     ADDREC    PERFIL                        
*                                                                               
         DC    X'0EFE',AL4(DMODEFE)     DMRSRV    TEMPEST                       
*                                                                               
         DC    X'0FFE',AL4(DMODFFE)     DMRLSE    TEMPEST                       
*                                                                               
         DC    X'106A',AL4(DMODGDA)     ADFREC    ACCMST                        
         DC    X'106B',AL4(DMODGDA)     ADFREC    ACCARC                        
*                                                                               
         DC    X'1101',AL4(DMODKDA)     DMKEY     PRTQ1                         
         DC    X'1102',AL4(DMODKDA)     DMKEY     PRTQ2                         
         DC    X'1103',AL4(DMODKDA)     DMKEY     PRTQ3                         
         DC    X'1104',AL4(DMODKDA)     DMKEY     PRTQ4                         
         DC    X'1105',AL4(DMODKDA)     DMKEY     PRTQ5                         
         DC    X'1106',AL4(DMODKDA)     DMKEY     PRTQ6                         
         DC    X'1107',AL4(DMODKDA)     DMKEY     PRTQ7                         
         DC    X'1108',AL4(DMODKDA)     DMKEY     PRTQ8                         
         DC    X'1109',AL4(DMODKDA)     DMKEY     EASIWK                        
         DC    X'110A',AL4(DMODKDA)     DMKEY     PRTQ9                         
         DC    X'110B',AL4(DMODKDA)     DMKEY     PRTQA                         
         DC    X'110C',AL4(DMODKDA)     DMKEY     PRTQC                         
         DC    X'110D',AL4(DMODKDA)     DMKEY     PRTQB                         
         DC    X'110E',AL4(DMODKDA)     DMKEY     PRTQD                         
         DC    X'110F',AL4(DMODKDA)     DMKEY     PRTQE                         
         DC    X'1110',AL4(DMODKDA)     DMKEY     PRTQF                         
         DC    X'1111',AL4(DMODKDA)     DMKEY     WRKF1                         
         DC    X'1112',AL4(DMODKDA)     DMKEY     WRKF2                         
         DC    X'1113',AL4(DMODKDA)     DMKEY     WRKF3                         
         DC    X'1114',AL4(DMODKDA)     DMKEY     WRKF4                         
         DC    X'1115',AL4(DMODKDA)     DMKEY     WRKF5                         
         DC    X'1116',AL4(DMODKDA)     DMKEY     WRKF6                         
         DC    X'1117',AL4(DMODKDA)     DMKEY     WRKF7                         
         DC    X'1118',AL4(DMODKDA)     DMKEY     WRKF8                         
         DC    X'1119',AL4(DMODKDA)     DMKEY     WRKF9                         
         DC    X'111F',AL4(DMODKDA)     DMKEY     PRTQG                         
*                                                                               
*&&US*&& DC    X'1121',AL4(DMODKDA)     DMKEY     SPTFIL                        
*&&US*&& DC    X'1122',AL4(DMODKIS)     DMKEY     STATION                       
*&&US*&& DC    X'1123',AL4(DMODKIS)     DMKEY     SPTDIR                        
*&&US*&& DC    X'1124',AL4(DMODKDA)     DMKEY     RECV                          
*&&US*&& DC    X'1125',AL4(DMODKDA)     DMKEY     REQ                           
*&&US*&& DC    X'1126',AL4(DMODKDA)     DMKEY     DEMFILN                       
*&&US*&& DC    X'1127',AL4(DMODKIS)     DMKEY     UNTDIR                        
*&&US*&& DC    X'1128',AL4(DMODKDA)     DMKEY     DEMFILA                       
*&&US*&& DC    X'1129',AL4(DMODKDA)     DMKEY     NTIFILQ                       
*&&US*&& DC    X'112A',AL4(DMODKDA)     DMKEY     UNTFIL                        
*&&US*&& DC    X'112B',AL4(DMODKDA)     DMKEY     DEMFILW                       
*&&US*&& DC    X'112C',AL4(DMODKIS)     DMKEY     PAVDIR                        
*&&US*&& DC    X'112D',AL4(DMODKIS)     DMKEY     DEMDIR                        
*&&US*&& DC    X'112E',AL4(DMODKDA)     DMKEY     PAVFIL                        
*&&US*&& DC    X'112F',AL4(DMODKIS)     DMKEY     DEMDIRA                       
*                                                                               
*&&US*&& DC    X'1130',AL4(DMODKIS)     DMKEY     DEMDIRR                       
*&&US*&& DC    X'1131',AL4(DMODKDA)     DMKEY     DEMFILR                       
*&&US*&& DC    X'1132',AL4(DMODKDA)     DMKEY     TRFFIL                        
*&&US*&& DC    X'1133',AL4(DMODKIS)     DMKEY     TRFDIR                        
*&&US*&& DC    X'1134',AL4(DMODKDA)     DMKEY     TRFRCV                        
*&&US*&& DC    X'1135',AL4(DMODKDA)     DMKEY     TRFREQ                        
*&&US*&& DC    X'1136',AL4(DMODKIS)     DMKEY     XSPDIR                        
*&&US*&& DC    X'1137',AL4(DMODKDA)     DMKEY     XSPFILE                       
*&&US*&& DC    X'1138',AL4(DMODKIS)     DMKEY     NTIDIR                        
*&&US*&& DC    X'1139',AL4(DMODKDA)     DMKEY     NTIFILN                       
*&&US*&& DC    X'113A',AL4(DMODKDA)     DMKEY     NTIFILW                       
*&&US*&& DC    X'113B',AL4(DMODKDA)     DMKEY     DEMFILO                       
*&&US*&& DC    X'113C',AL4(DMODKDA)     DMKEY     NTIFILO                       
*&&US*&& DC    X'113D',AL4(DMODKDA)     DMKEY     DEMFILP                       
*&&US*&& DC    X'113E',AL4(DMODKDA)     DMKEY     NTIFILP                       
*&&US*&& DC    X'113F',AL4(DMODKDA)     DMKEY     DEMFILQ                       
*                                                                               
*&&US*&& DC    X'1140',AL4(DMODKIS)     DMKEY     PRTDIR                        
*&&US*&& DC    X'1141',AL4(DMODKIS)     DMKEY     PUBDIR                        
*&&US*&& DC    X'1142',AL4(DMODKDA)     DMKEY     PRTFILE                       
*&&US*&& DC    X'1143',AL4(DMODKDA)     DMKEY     PUBFILE                       
*                                                                               
*&&US*&& DC    X'1147',AL4(DMODKDA)     DMKEY     NTIFILY                       
*&&US*&& DC    X'1148',AL4(DMODKDA)     DMKEY     DEMFILU                       
*&&US*&& DC    X'1149',AL4(DMODKDA)     DMKEY     DEMFILV                       
*&&US*&& DC    X'114A',AL4(DMODKDA)     DMKEY     DEMFILY                       
*&&US*&& DC    X'114B',AL4(DMODKDA)     DMKEY     DEMFILB                       
*&&US*&& DC    X'114C',AL4(DMODKDA)     DMKEY     DEMFILC                       
*&&US*&& DC    X'114D',AL4(DMODKDA)     DMKEY     DEMFILD                       
*&&US*&& DC    X'114E',AL4(DMODKDA)     DMKEY     DEMFILE                       
*&&US*&& DC    X'114F',AL4(DMODKDA)     DMKEY     NTIFILZ                       
*&&US*&& DC    X'1151',AL4(DMODKDA)     DMKEY     DEMFLTN                       
*&&US*&& DC    X'1152',AL4(DMODKDA)     DMKEY     DEMFLTA                       
*&&US*&& DC    X'1153',AL4(DMODKDA)     DMKEY     DEMFLTR                       
*&&US*&& DC    X'1154',AL4(DMODKDA)     DMKEY     NTIFLTA                       
*&&US*&& DC    X'1155',AL4(DMODKDA)     DMKEY     PAVFLTA                       
*                                                                               
*&&UK*&& DC    X'1141',AL4(DMODKIS)     DMKEY     MEDIR                         
*&&UK*&& DC    X'1142',AL4(DMODKDA)     DMKEY     MEDFILE                       
*&&UK*&& DC    X'1144',AL4(DMODKDA)     DMKEY     MEDRCV                        
*&&UK*&& DC    X'1146',AL4(DMODKIS)     DMKEY     DMGDIR                        
*&&UK*&& DC    X'1148',AL4(DMODKIS)     DMKEY     DMNDIR                        
*&&UK*&& DC    X'114B',AL4(DMODKIS)     DMKEY     DMODIR                        
*                                                                               
*&&UK*&& DC    X'1151',AL4(DMODKIS)     DMKEY     MPLDIR                        
*&&UK*&& DC    X'1152',AL4(DMODKDA)     DMKEY     MPLFIL                        
*&&UK*&& DC    X'1153',AL4(DMODKDA)     DMKEY     MPLREQ                        
*&&UK*&& DC    X'1154',AL4(DMODKDA)     DMKEY     MPLRCV                        
*&&UK*&& DC    X'1158',AL4(DMODKIS)     DMKEY     MPCDRS                        
*&&UK*&& DC    X'1159',AL4(DMODKDA)     DMKEY     MPCFLS                        
*&&UK*&& DC    X'115C',AL4(DMODKIS)     DMKEY     MPRDRB                        
*&&UK*&& DC    X'115E',AL4(DMODKIS)     DMKEY     MPCDRC                        
*&&UK*&& DC    X'115F',AL4(DMODKDA)     DMKEY     MPCFLC                        
*                                                                               
*&&US*&& DC    X'1157',AL4(DMODKDA)     DMKEY     DEMFIL7                       
*&&US*&& DC    X'1158',AL4(DMODKDA)     DMKEY     DEMFIL8                       
*&&US*&& DC    X'1159',AL4(DMODKDA)     DMKEY     DEMFIL9                       
*&&US*&& DC    X'115A',AL4(DMODKDA)     DMKEY     NTIFILA                       
**DEAD** DC    X'115A',AL4(DMODKIS)     DMKEY     BUDDIR                        
*&&US*&& DC    X'115B',AL4(DMODKDA)     DMKEY     NTIFILB                       
**DEAD** DC    X'115B',AL4(DMODKDA)     DMKEY     BUDFIL                        
*&&US*&& DC    X'115C',AL4(DMODKDA)     DMKEY     NTIFILC                       
*&&US*&& DC    X'115D',AL4(DMODKDA)     DMKEY     NTIFILD                       
*&&US*&& DC    X'115E',AL4(DMODKDA)     DMKEY     NTIFILE                       
*&&US*&& DC    X'115F',AL4(DMODKDA)     DMKEY     DEMFIL4                       
*                                                                               
         DC    X'1161',AL4(DMODKIS)     DMKEY     ACCOUNT                       
         DC    X'1163',AL4(DMODKDA)     DMKEY     ACCREQ                        
         DC    X'1164',AL4(DMODKDA)     DMKEY     ACCRCVR                       
         DC    X'1166',AL4(DMODKDA)     DMKEY     ACCDAY                        
         DC    X'1167',AL4(DMODKDA)     DMKEY     ACCWRK                        
         DC    X'1169',AL4(DMODKIS)     DMKEY     ACCDIR                        
         DC    X'116A',AL4(DMODKDA)     DMKEY     ACCMST                        
         DC    X'116B',AL4(DMODKDA)     DMKEY     ACCARC                        
         DC    X'116C',AL4(DMODKIS)     DMKEY     ACCHST                        
*                                                                               
*&&US*&& DC    X'1171',AL4(DMODKIS)     DMKEY     TALDIR                        
*&&US*&& DC    X'1172',AL4(DMODKDA)     DMKEY     TALFIL                        
*&&US*&& DC    X'1173',AL4(DMODKDA)     DMKEY     TALREQ                        
*&&US*&& DC    X'1174',AL4(DMODKDA)     DMKEY     TALRCV                        
*&&US*&& DC    X'1175',AL4(DMODKIS)     DMKEY     CHKDIR                        
*&&US*&& DC    X'1176',AL4(DMODKDA)     DMKEY     CHKFIL                        
*                                                                               
*&&US*&& DC    X'1177',AL4(DMODKDA)     DMKEY     NTIFILF                       
*&&US*&& DC    X'1178',AL4(DMODKDA)     DMKEY     NTIFILG                       
*&&US*&& DC    X'1179',AL4(DMODKDA)     DMKEY     DEMFILT                       
*&&US*&& DC    X'117C',AL4(DMODKDA)     DMKEY     NTIFILH                       
*&&US*&& DC    X'117D',AL4(DMODKDA)     DMKEY     NTIFILI                       
*&&US*&& DC    X'117E',AL4(DMODKDA)     DMKEY     PAVFILC                       
*                                                                               
*&&UK*&& DC    X'1171',AL4(DMODKIS)     DMKEY     FEEDIR                        
*                                                                               
*&&US*&& DC    X'1181',AL4(DMODKIS)     DMKEY     REPDIR                        
*&&US*&& DC    X'1182',AL4(DMODKDA)     DMKEY     REPFIL                        
*&&US*&& DC    X'1183',AL4(DMODKDA)     DMKEY     REPREQ                        
*&&US*&& DC    X'1184',AL4(DMODKDA)     DMKEY     REPRCV                        
*&&US*&& DC    X'1185',AL4(DMODKDA)     DMKEY     REPWRK                        
*&&US*&& DC    X'1186',AL4(DMODKIS)     DMKEY     RRGONE                        
*&&US*&& DC    X'1187',AL4(DMODKIS)     DMKEY     ROIDIR                        
*&&US*&& DC    X'1188',AL4(DMODKDA)     DMKEY     ROIFIL                        
*&&US*&& DC    X'1189',AL4(DMODKIS)     DMKEY     RRGNEW                        
*&&US*&& DC    X'118A',AL4(DMODKIS)     DMKEY     REVIEW                        
*                                                                               
         DC    X'1191',AL4(DMODKIS)     DMKEY     MBADIR                        
         DC    X'1192',AL4(DMODKDA)     DMKEY     MBAFIL                        
         DC    X'1193',AL4(DMODKDA)     DMKEY     MBAREQ                        
         DC    X'1194',AL4(DMODKDA)     DMKEY     MBARCV                        
         DC    X'1195',AL4(DMODKIS)     DMKEY     MBANDX                        
         DC    X'1196',AL4(DMODKIS)     DMKEY     MBUDIR                        
         DC    X'1197',AL4(DMODKDA)     DMKEY     MBUFIL                        
*                                                                               
         DC    X'11A1',AL4(DMODKIS)     DMKEY     CTFILE                        
         DC    X'11A3',AL4(DMODKDA)     DMKEY     CTREQ                         
         DC    X'11A4',AL4(DMODKDA)     DMKEY     CTRCVR                        
*&&UK*&& DC    X'11A6',AL4(DMODKIS)     DMKEY     CRADIR                        
         DC    X'11AE',AL4(DMODKIS)     DMKEY     GENDIR                        
         DC    X'11AF',AL4(DMODKDA)     DMKEY     GENFIL                        
*                                                                               
*&&UK*&& DC    X'11C1',AL4(DMODKIS)     DMKEY     CPFILE                        
*&&UK*&& DC    X'11C3',AL4(DMODKDA)     DMKEY     CPREQ                         
*&&UK*&& DC    X'11C4',AL4(DMODKDA)     DMKEY     CPRCVR                        
*                                                                               
*&&US*&& DC    X'11C0',AL4(DMODKDA)     DMKEY     PAVFILB                       
*&&US*&& DC    X'11C2',AL4(DMODKDA)     DMKEY     DEMFIL2                       
*&&US*&& DC    X'11C3',AL4(DMODKDA)     DMKEY     DEMFIL3                       
*&&US*&& DC    X'11C4',AL4(DMODKDA)     DMKEY     DEMFIL5                       
*&&US*&& DC    X'11C5',AL4(DMODKDA)     DMKEY     PAVFILA                       
*&&US*&& DC    X'11C6',AL4(DMODKDA)     DMKEY     DEMFILF                       
*&&US*&& DC    X'11C7',AL4(DMODKDA)     DMKEY     DEMFILG                       
*&&US*&& DC    X'11C8',AL4(DMODKDA)     DMKEY     DEMFILH                       
*&&US*&& DC    X'11C9',AL4(DMODKDA)     DMKEY     DEMFILI                       
*&&US*&& DC    X'11CA',AL4(DMODKDA)     DMKEY     DEMFILJ                       
*&&US*&& DC    X'11CB',AL4(DMODKDA)     DMKEY     DEMFILK                       
*&&US*&& DC    X'11CC',AL4(DMODKDA)     DMKEY     DEMFILL                       
*&&US*&& DC    X'11CD',AL4(DMODKDA)     DMKEY     DEMFILM                       
*&&US*&& DC    X'11CE',AL4(DMODKDA)     DMKEY     DEMFILS                       
*&&US*&& DC    X'11CF',AL4(DMODKDA)     DMKEY     DEMFILZ                       
*&&US                                                                           
         DC    X'11D1',AL4(DMODKDA)     DMKEY     WRKZ1                         
         DC    X'11D2',AL4(DMODKDA)     DMKEY     WRKZ2                         
         DC    X'11D3',AL4(DMODKDA)     DMKEY     WRKZ3                         
         DC    X'11D4',AL4(DMODKDA)     DMKEY     WRKZ4                         
         DC    X'11D5',AL4(DMODKDA)     DMKEY     WRKZ5                         
         DC    X'11D6',AL4(DMODKDA)     DMKEY     WRKZ6                         
         DC    X'11D7',AL4(DMODKDA)     DMKEY     WRKZ7                         
         DC    X'11D8',AL4(DMODKDA)     DMKEY     WRKZ8                         
         DC    X'11D9',AL4(DMODKDA)     DMKEY     WRKZ9                         
         DC    X'11DA',AL4(DMODKDA)     DMKEY     WRKZA                         
         DC    X'11DB',AL4(DMODKDA)     DMKEY     WRKZB                         
         DC    X'11DC',AL4(DMODKDA)     DMKEY     WRKZC                         
         DC    X'11DD',AL4(DMODKDA)     DMKEY     WRKZD                         
         DC    X'11DE',AL4(DMODKDA)     DMKEY     WRKZE                         
         DC    X'11DF',AL4(DMODKDA)     DMKEY     WRKZF                         
*&&                                                                             
         DC    X'11E1',AL4(DMODKIS)     DMKEY     PERDIR                        
         DC    X'11E2',AL4(DMODKDA)     DMKEY     PERFIL                        
         DC    X'11E3',AL4(DMODKDA)     DMKEY     PERRCV                        
         DC    X'11E4',AL4(DMODKDA)     DMKEY     PERREQ                        
*                                                                               
         DC    X'11E7',AL4(DMODKDA)     DMKEY     EDCTZ                         
         DC    X'11E8',AL4(DMODKDA)     DMKEY     WRKFA                         
         DC    X'11E9',AL4(DMODKDA)     DMKEY     WRKFB                         
         DC    X'11EA',AL4(DMODKDA)     DMKEY     WRKFC                         
         DC    X'11EB',AL4(DMODKDA)     DMKEY     WRKFD                         
         DC    X'11EC',AL4(DMODKDA)     DMKEY     WRKFE                         
         DC    X'11ED',AL4(DMODKDA)     DMKEY     WRKFF                         
         DC    X'11EE',AL4(DMODKDA)     DMKEY     WRKFG                         
*                                                                               
         DC    X'11F1',AL4(DMODKDA)     DMKEY     PRGMS                         
         DC    X'11F2',AL4(DMODKDA)     DMKEY     TEMPSTR                       
         DC    X'11F3',AL4(DMODKDA)     DMKEY     ADRFILE                       
         DC    X'11F4',AL4(DMODKDA)     DMKEY     WKFILE                        
         DC    X'11F7',AL4(DMODKDA)     DMKEY     STATS                         
         DC    X'11F8',AL4(DMODKDA)     DMKEY     DMPFILE                       
         DC    X'11F9',AL4(DMODKDA)     DMKEY     TSTRCVR                       
         DC    X'11FA',AL4(DMODKDA)     DMKEY     FACWRK                        
         DC    X'11FB',AL4(DMODKDA)     DMKEY     KWXFILE                       
         DC    X'11FC',AL4(DMODKDA)     DMKEY     EDCTZ                         
         DC    X'11FD',AL4(DMODKDA)     DMKEY     EDCTR                         
         DC    X'11FE',AL4(DMODKDA)     DMKEY     TEMPEST                       
*                                                                               
         DC    X'1201',AL4(DMOD12PQ)    DMGCI     PRTQ1                         
         DC    X'1202',AL4(DMOD12PQ)    DMGCI     PRTQ2                         
         DC    X'1203',AL4(DMOD12PQ)    DMGCI     PRTQ3                         
         DC    X'1204',AL4(DMOD12PQ)    DMGCI     PRTQ4                         
         DC    X'1205',AL4(DMOD12PQ)    DMGCI     PRTQ5                         
         DC    X'1206',AL4(DMOD12PQ)    DMGCI     PRTQ6                         
         DC    X'1207',AL4(DMOD12PQ)    DMGCI     PRTQ7                         
         DC    X'1208',AL4(DMOD12PQ)    DMGCI     PRTQ8                         
         DC    X'120A',AL4(DMOD12PQ)    DMGCI     PRTQ9                         
         DC    X'120B',AL4(DMOD12PQ)    DMGCI     PRTQA                         
         DC    X'120C',AL4(DMOD12PQ)    DMGCI     PRTQB                         
         DC    X'120D',AL4(DMOD12PQ)    DMGCI     PRTQC                         
         DC    X'120E',AL4(DMOD12PQ)    DMGCI     PRTQD                         
         DC    X'120F',AL4(DMOD12PQ)    DMGCI     PRTQE                         
         DC    X'1210',AL4(DMOD12PQ)    DMGCI     PRTQF                         
         DC    X'121F',AL4(DMOD12PQ)    DMGCI     PRTQG                         
*                                                                               
DMCMDSX  DC    X'FFFF',AL4(0)           TERMINATOR                              
         EJECT                                                                  
         DS    0D                                                               
         DC    CL8'DMFLINDX'                                                    
DMFLINDX DS    256A                                                             
                                                                                
***********************************************************************         
* TRANSLATE INVALID AUTONOTE CHARACTERS TO VALID ONES. THE INVALID    *         
* CHARACTERS ARE:                                                     *         
* THE "NOT" CHARACTER ("^"): TRANSLATE TO BLANK                       *         
* THE SINGLE-QUOTE    ("'"): TRANSLATE TO BLANK                       *         
* ANYTHING < X'40'    (" "): TRANSLATE TO A QUESTION MARK ("?")       *         
***********************************************************************         
         DS    0D                                                               
         DC    CL8'AUTONOTE'                                                    
AUTONOTE_TRTAB DS 0D                                                            
         DC    X'6F6F6F6F6F6F6F6F6F6F6F6F6F6F6F6F'                              
         DC    X'6F6F6F6F6F6F6F6F6F6F6F6F6F6F6F6F'                              
         DC    X'6F6F6F6F6F6F6F6F6F6F6F6F6F6F6F6F'                              
         DC    X'6F6F6F6F6F6F6F6F6F6F6F6F6F6F6F6F'                              
         DC    X'404142434445464748494A4B4C4D4E4F'                              
         DC    X'505152535455565758595A5B5C5D5E40'                              
         DC    X'606162636465666768696A6B6C6D6E6F'                              
         DC    X'707172737475767778797A7B7C407E7F'                              
         DC    X'808182838485868788898A8B8C8D8E8F'                              
         DC    X'909192939495969798999A9B9C9D9E9F'                              
         DC    X'A0A1A2A3A4A5A6A7A8A9AAABACADAEAF'                              
         DC    X'B0B1B2B3B4B5B6B7B8B9BABBBCBDBEBF'                              
         DC    X'C0C1C2C3C4C5C6C7C8C9CACBCCCDCECF'                              
         DC    X'D0D1D2D3D4D5D6D7D8D9DADBDCDDDEDF'                              
         DC    X'E0E1E2E3E4E5E6E7E8E9EAEBECEDEEEF'                              
         DC    X'F0F1F2F3F4F5F6F7F8F9FAFBFCFDFEFF'                              
