*          DATA SET DMLDPARMS  AT LEVEL 009 AS OF 03/09/18                      
* XL1    PARM VALUE                                                             
* XL1    PARM DEFAULT VALUE                                                     
* XL1    PARM FLAGS 80=REQUIRED,40=TABLE,20=ROUT,10=MODEDEP                     
*                   02=KEY/STRING,01=SINGLE                                     
* XL1    PARM MIN LEN                                                           
* CL8    PARM KEYWORD NAME                                                      
* AL4    PARM VALUE LIST                                                        
*                                                                               
PARMTBL  DS    0CL16                                                            
MODE     DC    X'0000C004',C'MODE    ',A(MODEL)                                 
INPUT    DC    X'0000C001',C'INPUT   ',A(INPUTL)                                
OUTPUT   DC    X'00004001',C'OUTPUT  ',A(OUTPUTL)                               
TCOPY    DC    X'00004001',C'COPY    ',A(TCOPYL)                                
DIR      DC    X'00004001',C'DIR     ',A(DIRL)                                  
TRACK    DC    X'00024001',C'TRACK   ',A(NOYESL)   YES                          
MSG      DC    X'00024001',C'MSG     ',A(NOYESL)   YES                          
CHECK    DC    X'00014001',C'RECCHECK',A(CHECKL)   NO                           
COUNT    DC    X'00014001',C'COUNT   ',A(COUNTL)   NO                           
BALCHECK DC    X'00014001',C'BALCHECK',A(BALCHKL)  NO                           
SEQCHECK DC    X'00024001',C'SEQCHECK',A(NOYESL)   YES                          
SIZE     DC    X'00014001',C'SIZE    ',A(NOYESL)   NO                           
XTRN     DC    X'00000004',C'EXTERNAL',A(XTRNNAME)                              
DAFILE   DC    X'00000001',C'DAFILE  ',A(DAFILEID)                              
D2FILE   DC    X'00000001',C'D2FILE  ',A(D2FILEID)                              
D3FILE   DC    X'00000001',C'D3FILE  ',A(D3FILEID)                              
D4FILE   DC    X'00000001',C'D4FILE  ',A(D4FILEID)                              
ISFILE   DC    X'00000001',C'ISFILE  ',A(ISFILEID)                              
PHFILE   DC    X'00000001',C'PHFILE  ',A(PHFILEID)                              
MAXRECS  DC    X'00002001',C'MAXRECS ',A(VALMAX)                                
WORKF    DC    X'00002001',C'WORKF   ',A(VALWORK)  NO LONGER USED               
UPSI     DC    X'00002001',C'UPSI    ',A(VALUPSI)                               
START    DC    X'00002102',C'START   ',A(VALK)                                  
END      DC    X'00002102',C'END     ',A(VALK)                                  
PARAM    DC    X'00002102',C'PARAM   ',A(VALP)                                  
LDWRITE  DC    X'00E84002',C'WRITE   ',A(WRITEL)   YES                          
XTRN1    DC    X'00000004',C'LOAD    ',A(XTRNNAME)                              
D1FILE   DC    X'00002001',C'D1FILE  ',A(VALD1F)                                
DBFILE   DC    X'00002001',C'DBFILE  ',A(VALDBF)                                
ABEND    DC    X'00014001',C'DUMP    ',A(ABENDL)   NO                           
PEEL     DC    X'00002001',C'PEEL    ',A(VALPEEL)                               
BALC     DC    X'00000005',C'BALCXT  ',A(BALCNAME)                              
CPTR     DC    X'00000005',C'CPTRXT  ',A(CPTRNAME)                              
DCNT     DC    X'00000005',C'DCNTXT  ',A(DCNTNAME)                              
SETL     DC    X'00000005',C'SETLXT  ',A(SETLNAME)                              
SIZEXT   DC    X'00000005',C'SIZEXT  ',A(SIZENAME)                              
SORT     DC    X'00000005',C'SORTXT  ',A(SORTNAME)                              
PRGE     DC    X'00000005',C'PRGEXT  ',A(PRGENAME)                              
TPTR     DC    X'00000005',C'TPTRXT  ',A(TPTRNAME)                              
DEFN     DC    X'00000005',C'DEFNXT  ',A(DEFNNAME)                              
RECT     DC    X'00000005',C'RECTXT  ',A(RECTNAME)                              
DISP     DC    X'00004003',C'DISP    ',A(DISPL)                                 
VERIFY   DC    X'00014001',C'VERIFY  ',A(VERIFYL)  NO                           
LOGO     DC    X'00024002',C'LOGO    ',A(NOYESL)   YES                          
DABIG    DC    X'00004001',C'DABIG   ',A(DABIGL)                                
DABLKSZE DC    X'00002004',C'DABLKSZE',A(VALDABLK)                              
DAKEYLEN DC    X'00002001',C'DAKEYLEN',A(VALDAKLN)                              
DACMPRS  DC    X'00004001',C'DACMPRS ',A(DACMPRSL)                              
ISBIG    DC    X'00004001',C'ISBIG   ',A(ISBIGL)                                
ISBLKSZE DC    X'00002004',C'ISBLKSZE',A(VALISBLK)                              
ISCMPRS  DC    X'00004001',C'ISCMPRS ',A(ISCMPRSL)                              
ISPDOV   DC    X'00004001',C'ISPDOV  ',A(ISPDOVL)                               
IXPDOV   DC    X'00004001',C'IXPDOV  ',A(ISPDOVL)                               
BLKSIZE  DC    X'00002004',C'BLKSIZE ',A(VALBLKSZ)                              
ISBLKIX  DC    X'00004001',C'ISBLKIX ',A(ISBLKIXL)                              
GLOBAL   DC    X'00002001',C'GLOBAL  ',A(VALGLOB)                               
EXTSORT  DC    X'00004001',C'EXTSORT ',A(EXTSORTL)                              
RECOVER  DC    X'00014001',C'RECOVER ',A(RECOVERL) NO                           
ACTIVITY DC    X'00004001',C'ACTIVITY',A(ACTIVITL)                              
EMAIL    DC    X'00014001',C'EMAIL   ',A(NOYESL)   NO                           
EID      DC    X'00000204',C'EID     ',A(EMAILID)                               
EXTISPTR DC    X'00004001',C'EXTISPTR',A(NOYESL)                                
EXTIHDR  DC    X'00004001',C'EXTIHDR ',A(NOYESL)                                
EXTITRL  DC    X'00004001',C'EXTITRL ',A(NOYESL)                                
REPLY    DC    X'00000003',C'REPLY   ',A(OPERREP)                               
ECHO     DC    X'00014001',C'ECHO    ',A(NOYESL)   NO                           
SMF      DC    X'00014001',C'SMF     ',A(NOYESTL)  NO                           
MAXDUPK  DC    X'00002001',C'MAXDUPK ',A(VALDUPK)                               
MAXSEQE  DC    X'00002001',C'MAXSEQE ',A(VALSEQE)                               
MAXBADA  DC    X'00002001',C'MAXBADA ',A(VALBADA)                               
MAXKEYN  DC    X'00002001',C'MAXKEYN ',A(VALKEYN)                               
MAXBADR  DC    X'00002001',C'MAXBADR ',A(VALBADR)                               
MAXTERR  DC    X'00002001',C'MAXTERR ',A(VALTERR)                               
MAXPERR  DC    X'00002001',C'MAXPERR ',A(VALPERR)                               
LENREC   DC    X'00014001',C'LENREC  ',A(NOYESL)   NO                           
FLASH    DC    X'00002001',C'FLASH   ',A(VALFLS)                                
AGEHOURS DC    X'00002001',C'AGEHOURS',A(VALAGE)                                
WARN     DC    X'00224001',C'WARN    ',A(WDELL)    DSNNEQ OLD-NOW WDEL          
WDEL     DC    X'00224001',C'WDELETE ',A(WDELL)    DSNNEQ                       
WNAME    DC    X'00104001',C'WNAME   ',A(WARNL)    ABEND                        
WMODE    DC    X'00104001',C'WMODE   ',A(WARNL)    ABEND                        
WAGE     DC    X'00104001',C'WAGE    ',A(WARNL)    ABEND                        
DFSMSG   DC    X'00014001',C'DFSMSG  ',A(NOYESL)   NO                           
STACHECK DC    X'00014001',C'STACHECK',A(NOYESL)   NO                           
FILSZ    DC    X'00002001',C'FILSZ   ',A(VALFSZ)                                
PRGISPTR DC    X'00004001',C'PRGISPTR',A(NOYESL)                                
PARMTBLX DC    X'FFFFFFFF'                                                      
