*          DATA SET DMLKTABA   AT LEVEL 004 AS OF 03/18/96                      
LKTABD   DSECT                     *** LOCKOUT TABLE ENTRY ***                  
*                                                                               
LKDATA   DS    0CL8                                                             
LKFILE   DS    XL1                 EXTERNAL DATAMGR FILE NUMBER                 
LKJOB    DS    0XL2                JOB NUMBER                                   
LKSYS    DS    XL1                 ADV SYSTEM NUMBER                            
LKTASK   DS    XL1                 TASK ID                                      
LKFLAG   DS    XL1                 FLAGS                                        
         DS    XL1                                                              
LKTTB    DS    XL3                 DISK ADDRESS                                 
