*          DATA SET DMSPTNETD  AT LEVEL 001 AS OF 05/15/08                      
***********************************************************************         
* SPOT TO NET TABLE DSECT                                             *         
***********************************************************************         
SPTNETD  DSECT                                                                  
SPTSE#   DS    XL1                 SPOT SYSTEMS NUMBER                          
SPTSSUBS DS    CL2                 SPOT SUB SYSTEM                              
SPTNSUBS DS    CL2                 NET  SUB SYSTEM                              
SPTLNQ   EQU   *-SPTNETD                                                        
