*          DATA SET DMSYSTABD  AT LEVEL 001 AS OF 03/08/12                      
SYSTABD  DSECT                     DSECT TO COVER DMSYSTAB                      
DMSYNTRY DS    0CL16               SYSTEM ENTRY LENGTH IS 16 FOR SHIFTS         
DMSYNAM  DS    CL5                 SYSTEM NAME 5-CHR VERSION EG ACC1            
DMSYNAM1 DS    CL3                 SYSTEM NAME 3-CHR VERSION EG A1              
DMSYOVNO DS    X                   SYSTEM OVERLAY NUMBER                        
DMSYAFNO DS    AL3                 SYSTEM FILE NUMBER TABLE ADDRESS             
DMSYASYF DS    AL4                 SYSTEM V(SYSFLES) ENTRY ADDRESS              
DMSYLEN  EQU   *-SYSTABD                                                        
