*          DATA SET DMSYSTABUS AT LEVEL 036 AS OF 09/09/20                      
***********************************************************************         
* CL5    SYSTEM 5-CHR NAME                                            *         
* CL3    SYSTEM 3-CHR NAME                                            *         
* XL1    SYSTEM OVERLAY NUMBER                                        *         
* AL3    A(SYSTEM FILE NUMBER TABLE)                                  *         
* VL4    V(SYSTEM LIST) IN DMFILES SYSFLES                            *         
***********************************************************************         
         TITLE 'TABLE OF SYSTEMS AND POINTERS TO SYSFLES'                       
         CNOP  0,4                                                              
SYSTAB   DS    0XL16                                                            
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=00         
         DC    C'SER  ',C'   ',X'01',AL3(SYSSER),V(SYSL01)        SE=01         
         DC    C'SPT1 ',C'S1 ',X'02',AL3(SYSSPT),V(SYSL02)        SE=02         
         DC    C'SPT2 ',C'S2 ',X'02',AL3(SYSSPT),V(SYSL03)        SE=03         
         DC    C'PRT1 ',C'P1 ',X'04',AL3(SYSPRT),V(SYSL04)        SE=04         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=05         
         DC    C'ACC1 ',C'A1 ',X'06',AL3(SYSACC),V(SYSL06)        SE=06         
         DC    C'SPT3 ',C'S3 ',X'02',AL3(SYSSPT),V(SYSL07)        SE=07         
         DC    C'REP1 ',C'R1 ',X'08',AL3(SYSREP),V(SYSL08)        SE=08         
         DC    C'MBA1 ',C'M1 ',X'09',AL3(SYSMBA),V(SYSL09)        SE=09         
         DC    C'CON  ',C'C1 ',X'0A',AL3(SYSCON),V(SYSL0A)        SE=0A         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=0B         
         DC    C'DEM  ',C'D1 ',X'0C',AL3(SYSDEM),V(SYSL0C)        SE=0C         
         DC    C'SPT4 ',C'S4 ',X'02',AL3(SYSSPT),V(SYSL0D)        SE=0D         
         DC    C'PER1 ',C'E1 ',X'0E',AL3(SYSPER),V(SYSL0E)        SE=0E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=0F         
         DC    C'TAL1 ',C'T1 ',X'07',AL3(SYSTAL),V(SYSL10)        SE=10         
         DC    C'SPT5 ',C'S5 ',X'02',AL3(SYSSPT),V(SYSL11)        SE=11         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=12         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=13         
         DC    C'PRT2 ',C'P2 ',X'04',AL3(SYSPRT),V(SYSL14)        SE=14         
         DC    C'SPT6 ',C'S6 ',X'02',AL3(SYSSPT),V(SYSL15)        SE=15         
         DC    C'ACC2 ',C'A2 ',X'06',AL3(SYSACC),V(SYSL16)        SE=16         
         DC    C'ACC3 ',C'A3 ',X'06',AL3(SYSACC),V(SYSL17)        SE=17         
         DC    C'ACC4 ',C'A4 ',X'06',AL3(SYSACC),V(SYSL18)        SE=18         
         DC    C'ACC5 ',C'A5 ',X'06',AL3(SYSACC),V(SYSL19)        SE=19         
         DC    C'ACCY ',C'AY ',X'06',AL3(SYSACC),V(SYSL1A)        SE=1A         
         DC    C'ACCD ',C'AD ',X'06',AL3(SYSACC),V(SYSL1B)        SE=1B         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=1C         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=1D         
         DC    C'PER2 ',C'E2 ',X'0E',AL3(SYSPER),V(SYSL1E)        SE=1E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=1F         
         DC    C'TAL2 ',C'T2 ',X'07',AL3(SYSTAL),V(SYSL20)        SE=20         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=21         
         DC    C'SPT7 ',C'S7 ',X'02',AL3(SYSSPT),V(SYSL22)        SE=22         
         DC    C'SPT8 ',C'N1 ',X'02',AL3(SYSNET),V(SYSL23)        SE=23         
         DC    C'PRT3 ',C'P3 ',X'04',AL3(SYSPRT),V(SYSL24)        SE=24         
         DC    C'SPT9 ',C'N2 ',X'02',AL3(SYSNET),V(SYSL25)        SE=25         
         DC    C'SPTA ',C'N3 ',X'02',AL3(SYSNET),V(SYSL26)        SE=26         
         DC    C'SPTB ',C'SB ',X'02',AL3(SYSSPT),V(SYSL27)        SE=27         
         DC    C'SPTC ',C'N4 ',X'02',AL3(SYSNET),V(SYSL28)        SE=28         
         DC    C'SPTJ ',C'N5 ',X'02',AL3(SYSNET),V(SYSL29)        SE=29         
         DC    C'SPTK ',C'N6 ',X'02',AL3(SYSNET),V(SYSL2A)        SE=2A         
         DC    C'SPTW ',C'NW ',X'02',AL3(SYSNET),V(SYSL2B)        SE=2B         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=2C         
         DC    C'SPTD ',C'NZ ',X'02',AL3(SYSNET),V(SYSL2D)        SE=2D         
         DC    C'SPTT ',C'NT ',X'02',AL3(SYSNET),V(SYSL2E)        SE=2E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=2F         
         DC    C'TAL3 ',C'T3 ',X'07',AL3(SYSTAL),V(SYSL30)        SE=30         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=31         
         DC    C'SPTQ ',C'SQ ',X'02',AL3(SYSSPT),V(SYSL32)        SE=32         
         DC    C'SPTS ',C'SS ',X'02',AL3(SYSSPT),V(SYSL33)        SE=33         
         DC    C'PRT4 ',C'P4 ',X'04',AL3(SYSPRT),V(SYSL34)        SE=34         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=35         
         DC    C'SPTU ',C'SU ',X'02',AL3(SYSSPT),V(SYSL36)        SE=36         
         DC    C'ACCV ',C'AV ',X'06',AL3(SYSACC),V(SYSL37)        SE=37         
         DC    C'REP2 ',C'R2 ',X'08',AL3(SYSREP),V(SYSL38)        SE=38         
         DC    C'ACC0 ',C'A0 ',X'06',AL3(SYSACC),V(SYSL39)        SE=39         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=3A         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=3B         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=3C         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=3D         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=3E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=3F         
         DC    C'TAL4 ',C'T4 ',X'07',AL3(SYSTAL),V(SYSL40)        SE=40         
         DC    C'STR1 ',C'F1 ',X'02',AL3(SYSSTR),V(SYSL41)        SE=41         
         DC    C'STR2 ',C'F2 ',X'02',AL3(SYSSTR),V(SYSL42)        SE=42         
         DC    C'STR3 ',C'F3 ',X'02',AL3(SYSSTR),V(SYSL43)        SE=43         
         DC    C'PRT5 ',C'P5 ',X'04',AL3(SYSPRT),V(SYSL44)        SE=44         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=45         
         DC    C'STR4 ',C'F4 ',X'02',AL3(SYSSTR),V(SYSL46)        SE=46         
         DC    C'STR5 ',C'F5 ',X'02',AL3(SYSSTR),V(SYSL47)        SE=47         
         DC    C'STR6 ',C'F6 ',X'02',AL3(SYSSTR),V(SYSL48)        SE=48         
         DC    C'STR7 ',C'F7 ',X'02',AL3(SYSSTR),V(SYSL49)        SE=49         
         DC    C'STRB ',C'FB ',X'02',AL3(SYSSTR),V(SYSL4A)        SE=4A         
         DC    C'STRE ',C'FE ',X'02',AL3(SYSSTR),V(SYSL4B)        SE=4B         
         DC    C'STRF ',C'FF ',X'02',AL3(SYSSTR),V(SYSL4C)        SE=4C         
         DC    C'STRG ',C'FG ',X'02',AL3(SYSSTR),V(SYSL4D)        SE=4D         
         DC    C'STRH ',C'FH ',X'02',AL3(SYSSTR),V(SYSL4E)        SE=4E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=4F         
         DC    C'SPTOV',C'SOV',X'02',AL3(SYSSPT),V(SYSL50)        SE=50         
         DC    C'STRL ',C'FL ',X'02',AL3(SYSSTR),V(SYSL51)        SE=51         
         DC    C'STRM ',C'FM ',X'02',AL3(SYSSTR),V(SYSL52)        SE=52         
         DC    C'STRN ',C'FN ',X'02',AL3(SYSSTR),V(SYSL53)        SE=53         
         DC    C'PRT6 ',C'P6 ',X'04',AL3(SYSPRT),V(SYSL54)        SE=54         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=55         
         DC    C'STRQ ',C'FQ ',X'02',AL3(SYSSTR),V(SYSL56)        SE=56         
         DC    C'STRS ',C'FS ',X'02',AL3(SYSSTR),V(SYSL57)        SE=57         
         DC    C'REP3 ',C'R3 ',X'08',AL3(SYSREP),V(SYSL58)        SE=58         
         DC    C'STRU ',C'FU ',X'02',AL3(SYSSTR),V(SYSL59)        SE=59         
         DC    C'STRV ',C'FV ',X'02',AL3(SYSSTR),V(SYSL5A)        SE=5A         
         DC    C'STRY ',C'FY ',X'02',AL3(SYSSTR),V(SYSL5B)        SE=5B         
         DC    C'STR0 ',C'F0 ',X'02',AL3(SYSSTR),V(SYSL5C)        SE=5C         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=5D         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=5E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=5F         
         DC    C'SPTOW',C'NOV',X'02',AL3(SYSNET),V(SYSL60)        SE=60         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=61         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=62         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=63         
         DC    C'PRT7 ',C'P7 ',X'04',AL3(SYSPRT),V(SYSL64)        SE=64         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=65         
         DC    C'ACC6 ',C'A6 ',X'06',AL3(SYSACC),V(SYSL66)        SE=66         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=67         
         DC    C'REP4 ',C'R4 ',X'08',AL3(SYSREP),V(SYSL68)        SE=68         
         DC    C'SPTUB',C'NU2',X'02',AL3(SYSNET),V(SYSL69)        SE=69         
         DC    C'SPTU2',C'SU2',X'02',AL3(SYSSPT),V(SYSL6A)        SE=6A         
         DC    C'ACCU2',C'AU2',X'06',AL3(SYSACC),V(SYSL6B)        SE=6B         
         DC    C'STRU2',C'FU2',X'02',AL3(SYSSTR),V(SYSL6C)        SE=6C         
         DC    C'PRTU2',C'PU2',X'04',AL3(SYSPRT),V(SYSL6D)        SE=6D         
         DC    C'ACCZ ',C'AZ ',X'06',AL3(SYSACC),V(SYSL6E)        SE=6E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=6F         
         DC    C'STROV',C'FOV',X'02',AL3(SYSSTR),V(SYSL70)        SE=70         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=71         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=72         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=73         
         DC    C'PRT8 ',C'P8 ',X'04',AL3(SYSPRT),V(SYSL74)        SE=74         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=75         
         DC    C'ACC7 ',C'A7 ',X'06',AL3(SYSACC),V(SYSL76)        SE=76         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=77         
         DC    C'REP5 ',C'R5 ',X'08',AL3(SYSREP),V(SYSL78)        SE=78         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=79         
         DC    C'SPTO1',C'SO1',X'02',AL3(SYSSPT),V(SYSL7A)        SE=7A         
         DC    C'SPTOA',C'NO1',X'02',AL3(SYSNET),V(SYSL7B)        SE=7B         
         DC    C'STRO1',C'FO1',X'02',AL3(SYSSTR),V(SYSL7C)        SE=7C         
         DC    C'PRTO1',C'PO1',X'04',AL3(SYSPRT),V(SYSL7D)        SE=7D         
         DC    C'ACCO1',C'AO1',X'06',AL3(SYSACC),V(SYSL7E)        SE=7E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=7F         
         DC    C'PRTOV',C'POV',X'04',AL3(SYSPRT),V(SYSL80)        SE=80         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=81         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=82         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=83         
         DC    C'PRT9 ',C'P9 ',X'04',AL3(SYSPRT),V(SYSL84)        SE=84         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=85         
         DC    C'ACC8 ',C'A8 ',X'06',AL3(SYSACC),V(SYSL86)        SE=86         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=87         
         DC    C'REP6 ',C'R6 ',X'08',AL3(SYSREP),V(SYSL88)        SE=88         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=89         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=8A         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=8B         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=8C         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=8D         
         DC    C'ACCI3',C'AI3',X'06',AL3(SYSACC),V(SYSL8E)        SE=8E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=8F         
         DC    C'ACCOV',C'AOV',X'06',AL3(SYSACC),V(SYSL90)        SE=90         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=91         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=92         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=93         
         DC    C'PRTT ',C'PT ',X'04',AL3(SYSPRT),V(SYSL94)        SE=94         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=95         
         DC    C'ACC9 ',C'A9 ',X'06',AL3(SYSACC),V(SYSL96)        SE=96         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=97         
         DC    C'REP7 ',C'R7 ',X'08',AL3(SYSREP),V(SYSL98)        SE=98         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=99         
         DC    C'SPTN1',C'SN1',X'02',AL3(SYSSPT),V(SYSL9A)        SE=9A         
         DC    C'SPTNA',C'NN1',X'02',AL3(SYSNET),V(SYSL9B)        SE=9B         
         DC    C'STRN1',C'FN1',X'02',AL3(SYSSTR),V(SYSL9C)        SE=9C         
         DC    C'PRTN1',C'PN1',X'04',AL3(SYSPRT),V(SYSL9D)        SE=9D         
         DC    C'ACCN1',C'AN1',X'06',AL3(SYSACC),V(SYSL9E)        SE=9E         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=9F         
         DC    C'SPTIT',C'SIT',X'02',AL3(SYSSPT),V(SYSLA0)        SE=A0         
         DC    C'SPTIN',C'NIT',X'02',AL3(SYSNET),V(SYSLA1)        SE=A1         
         DC    C'STRIT',C'FIT',X'02',AL3(SYSSTR),V(SYSLA2)        SE=A2         
         DC    C'PRTIT',C'PIT',X'04',AL3(SYSPRT),V(SYSLA3)        SE=A3         
         DC    C'ACCIT',C'AIT',X'06',AL3(SYSACC),V(SYSLA4)        SE=A4         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=A5         
         DC    C'ACCA ',C'AA ',X'06',AL3(SYSACC),V(SYSLA6)        SE=A6         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=A7         
         DC    C'REP8 ',C'R8 ',X'08',AL3(SYSREP),V(SYSLA8)        SE=A8         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=A9         
         DC    C'SPTI1',C'SI1',X'02',AL3(SYSSPT),V(SYSLAA)        SE=AA         
         DC    C'SPTIA',C'NI1',X'02',AL3(SYSNET),V(SYSLAB)        SE=AB         
         DC    C'STRI1',C'FI1',X'02',AL3(SYSSTR),V(SYSLAC)        SE=AC         
         DC    C'PRTI1',C'PI1',X'04',AL3(SYSPRT),V(SYSLAD)        SE=AD         
         DC    C'ACCI1',C'AI1',X'06',AL3(SYSACC),V(SYSLAE)        SE=AE         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=AF         
         DC    C'SPTTT',C'STT',X'02',AL3(SYSSPT),V(SYSLB0)        SE=B0         
         DC    C'SPTTN',C'NTT',X'02',AL3(SYSNET),V(SYSLB1)        SE=B1         
         DC    C'STRTT',C'FTT',X'02',AL3(SYSSTR),V(SYSLB2)        SE=B2         
         DC    C'PRTTT',C'PTT',X'04',AL3(SYSPRT),V(SYSLB3)        SE=B3         
         DC    C'ACCTT',C'ATT',X'06',AL3(SYSACC),V(SYSLB4)        SE=B4         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=B5         
         DC    C'ACCB ',C'AB ',X'06',AL3(SYSACC),V(SYSLB6)        SE=B6         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=B7         
         DC    C'REP9 ',C'R9 ',X'08',AL3(SYSREP),V(SYSLB8)        SE=B8         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=B9         
         DC    C'SPTTU',C'STU',X'02',AL3(SYSSPT),V(SYSLBA)        SE=BA         
         DC    C'SPTTV',C'NTU',X'02',AL3(SYSNET),V(SYSLBB)        SE=BB         
         DC    C'STRTU',C'FTU',X'02',AL3(SYSSTR),V(SYSLBC)        SE=BC         
         DC    C'PRTTU',C'PTU',X'04',AL3(SYSPRT),V(SYSLBD)        SE=BD         
         DC    C'ACCTU',C'ATU',X'06',AL3(SYSACC),V(SYSLBE)        SE=BE         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=BF         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=C0         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=C1         
         DC    C'SPTZ ',C'SZ ',X'02',AL3(SYSSPT),V(SYSLC2)        SE=C2         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=C3         
         DC    C'PRTZ ',C'PZ ',X'04',AL3(SYSPRT),V(SYSLC4)        SE=C4         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=C5         
         DC    C'ACCQ ',C'AQ ',X'06',AL3(SYSACC),V(SYSLC6)        SE=C6         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=C7         
         DC    C'REPY ',C'RY ',X'08',AL3(SYSREP),V(SYSLC8)        SE=C8         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=C9         
         DC    C'SPTY1',C'SY1',X'02',AL3(SYSSPT),V(SYSLCA)        SE=CA         
         DC    C'SPTYA',C'NY1',X'02',AL3(SYSNET),V(SYSLCB)        SE=CB         
         DC    C'STRY1',C'FY1',X'02',AL3(SYSSTR),V(SYSLCC)        SE=CC         
         DC    C'PRTY1',C'PY1',X'04',AL3(SYSPRT),V(SYSLCD)        SE=CD         
         DC    C'ACCY1',C'AY1',X'06',AL3(SYSACC),V(SYSLCE)        SE=CE         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=CF         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=D0         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=D1         
         DC    C'SPTP ',C'N7 ',X'02',AL3(SYSNET),V(SYSLD2)        SE=D2         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=D3         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=D4         
         DC    C'STRZ ',C'FZ ',X'02',AL3(SYSSTR),V(SYSLD5)        SE=D5         
         DC    C'ACCC ',C'AC ',X'06',AL3(SYSACC),V(SYSLD6)        SE=D6         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=D7         
         DC    C'REPK ',C'RK ',X'08',AL3(SYSREP),V(SYSLD8)        SE=D8         
         DC    C'SPTR ',C'NR ',X'02',AL3(SYSNET),V(SYSLD9)        SE=D9         
         DC    C'SPTN2',C'SN2',X'02',AL3(SYSSPT),V(SYSLDA)        SE=DA         
         DC    C'SPTNA',C'NN2',X'02',AL3(SYSNET),V(SYSLDB)        SE=DB         
         DC    C'STRN2',C'FN2',X'02',AL3(SYSSTR),V(SYSLDC)        SE=DC         
         DC    C'PRTN2',C'PN2',X'04',AL3(SYSPRT),V(SYSLDD)        SE=DD         
         DC    C'ACCN2',C'AN2',X'06',AL3(SYSACC),V(SYSLDE)        SE=DE         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=DF         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=E0         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=E1         
         DC    C'SPTE ',C'SE ',X'02',AL3(SYSSPT),V(SYSLE2)        SE=E2         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=E3         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=E4         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=E5         
         DC    C'ACCT ',C'AT ',X'06',AL3(SYSACC),V(SYSLE6)        SE=E6         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=E7         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=E8         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=E9         
         DC    C'SPTU1',C'SU1',X'02',AL3(SYSSPT),V(SYSLEA)        SE=EA         
         DC    C'SPTUA',C'NU1',X'02',AL3(SYSNET),V(SYSLEB)        SE=EB         
         DC    C'STRU1',C'FU1',X'02',AL3(SYSSTR),V(SYSLEC)        SE=EC         
         DC    C'PRTU1',C'PU1',X'04',AL3(SYSPRT),V(SYSLED)        SE=ED         
         DC    C'ACCU1',C'AU1',X'06',AL3(SYSACC),V(SYSLEE)        SE=EE         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=EF         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=F0         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=F1         
         DC    C'SPTF ',C'SF ',X'02',AL3(SYSSPT),V(SYSLF2)        SE=F2         
         DC    C'SPTG ',C'SG ',X'02',AL3(SYSSPT),V(SYSLF3)        SE=F3         
         DC    C'SPTH ',C'SH ',X'02',AL3(SYSSPT),V(SYSLF4)        SE=F4         
         DC    C'SPTL ',C'SL ',X'02',AL3(SYSSPT),V(SYSLF5)        SE=F5         
         DC    C'SPTM ',C'SM ',X'02',AL3(SYSSPT),V(SYSLF6)        SE=F6         
         DC    C'SPTN ',C'SN ',X'02',AL3(SYSSPT),V(SYSLF7)        SE=F7         
         DC    C'SPTV ',C'SV ',X'02',AL3(SYSSPT),V(SYSLF8)        SE=F8         
         DC    C'SPTY ',C'SY ',X'02',AL3(SYSSPT),V(SYSLF9)        SE=F9         
         DC    C'SPT0 ',C'S0 ',X'02',AL3(SYSSPT),V(SYSLFA)        SE=FA         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=FB         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=FC         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=FD         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=FE         
         DC    C'     ',C'   ',X'00',AL3(0),A(0)                  SE=FF         
SYSTABX  DC    XL16'00'                                                         
                                                                                
***********************************************************************         
* EACH TABLE IS INDEXED BY FILE NUMBER                                *         
* ENTRY IS POSITION OF FILE ENTRY IN SYSFLES LIST FOR THE SYSTEM      *         
***********************************************************************         
         CNOP  0,8                                                              
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSSER   DC    AL1(00,13,14,15,16,17,18,19,20,29,21,22,23,24,25,26) 0           
         DC    AL1(27,30,31,32,33,34,35,36,37,38,00,00,00,00,00,28) 1           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 2           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 3           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 4           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 9           
         DC    AL1(00,62,00,00,00,00,00,00,00,00,00,00,00,00,63,64) A           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) B           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) C           
         DC    AL1(00,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60) D           
         DC    AL1(00,00,00,00,00,00,00,10,39,40,41,42,43,44,45,00) E           
         DC    AL1(00,01,02,03,04,00,00,05,06,07,08,09,11,12,61,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSSPT   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,02,05,01,06,07,36,00,15,54,00,43,10,19,11,14) 2           
         DC    AL1(17,18,08,09,00,00,03,04,46,51,55,37,52,38,53,39) 3           
         DC    AL1(00,00,00,00,00,00,00,56,41,42,44,24,25,26,27,57) 4           
         DC    AL1(00,58,59,60,61,62,66,22,67,23,47,48,49,50,63,64) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,68,69,70,71,72,73,74,75,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,90,91,92,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,76,77,78,79,80,81,00,00) 9           
         DC    AL1(00,93,00,00,00,00,00,00,00,00,00,00,00,00,94,95) A           
         DC    AL1(00,00,00,00,00,00,00,82,83,84,85,86,87,88,89,00) B           
         DC    AL1(13,65,16,20,21,12,28,29,30,31,32,33,34,35,40,45) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSPRT   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 2           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 3           
         DC    AL1(01,02,03,04,05,06,00,00,00,00,00,00,00,00,00,00) 4           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 9           
         DC    AL1(00,07,00,00,00,00,00,00,00,00,00,00,00,00,08,09) A           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) B           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSACC   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 2           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 3           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 4           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 5           
         DC    AL1(00,01,00,06,07,00,08,09,00,02,03,04,05,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 9           
         DC    AL1(00,10,00,00,00,00,00,00,00,00,00,00,00,00,11,12) A           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) B           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSREP   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,00,00,00,00,00,36,00,15,54,00,43,10,19,11,14) 2           
         DC    AL1(17,18,00,00,00,00,00,00,46,51,55,37,52,38,53,39) 3           
         DC    AL1(00,00,00,00,00,00,00,56,41,42,44,24,25,26,27,57) 4           
         DC    AL1(00,58,59,60,61,62,66,22,67,23,47,48,49,50,63,64) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,68,69,70,71,72,73,74,75,00) 7           
         DC    AL1(00,01,02,03,04,05,00,06,07,08,09,90,91,92,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,76,77,78,79,80,81,00,00) 9           
         DC    AL1(00,93,00,00,00,00,00,00,00,00,00,00,00,00,94,95) A           
         DC    AL1(00,00,00,00,00,00,00,82,83,84,85,86,87,88,89,00) B           
         DC    AL1(13,65,16,20,21,12,28,29,30,31,32,33,34,35,40,45) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSMBA   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 2           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 3           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 4           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 8           
         DC    AL1(00,01,02,03,04,05,06,07,00,00,00,00,00,00,00,00) 9           
         DC    AL1(00,08,00,00,00,00,00,00,00,00,00,00,00,00,09,10) A           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) B           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSCON   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 2           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 3           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 4           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 9           
         DC    AL1(00,01,00,02,03,00,00,00,00,00,00,00,00,00,04,05) A           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) B           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSDEM   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,00,00,00,00,00,28,00,06,45,00,34,01,10,02,05) 2           
         DC    AL1(08,09,00,00,00,00,00,00,37,42,46,22,43,29,44,30) 3           
         DC    AL1(00,00,00,00,00,00,00,47,32,33,35,15,16,17,18,48) 4           
         DC    AL1(00,49,50,51,52,53,57,13,58,14,38,39,40,41,54,55) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,59,60,67,68,69,70,71,72,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,87,88,89,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,73,74,75,76,77,78,00,00) 9           
         DC    AL1(00,90,00,00,00,00,00,00,00,00,00,00,00,00,91,92) A           
         DC    AL1(00,61,62,63,65,66,64,79,80,81,82,83,84,85,86,00) B           
         DC    AL1(04,56,07,11,12,03,19,20,21,23,24,25,26,27,31,36) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSPER   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 2           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 3           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 4           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 9           
         DC    AL1(00,05,00,00,00,00,00,00,00,00,00,00,00,00,06,07) A           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) B           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,01,02,03,04,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSTAL   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 2           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 3           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 4           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,01,02,03,04,05,06,00,00,00,00,00,00,00,00,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 9           
         DC    AL1(00,07,00,00,00,00,00,00,00,00,00,00,00,00,08,09) A           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) B           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSSTR   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,06,07,05,00,00,00,00,00,00,00,00,00,00,00,00) 2           
         DC    AL1(00,00,02,01,03,04,00,00,00,00,00,00,00,00,00,00) 3           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 4           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 9           
         DC    AL1(00,08,00,00,00,00,00,00,00,00,00,00,00,00,09,10) A           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) B           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
*                   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F              
SYSNET   DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 0           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 1           
         DC    AL1(00,02,03,01,06,07,34,08,15,52,09,41,10,17,11,14) 2           
         DC    AL1(00,00,00,00,00,00,04,05,44,50,53,38,49,35,51,36) 3           
         DC    AL1(00,00,00,00,00,00,00,54,39,40,42,22,23,24,25,55) 4           
         DC    AL1(00,56,57,58,59,60,64,20,65,21,45,46,47,48,61,62) 5           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) 6           
         DC    AL1(00,00,00,00,00,00,00,66,67,68,69,70,71,72,73,00) 7           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,88,89,90,00,00) 8           
         DC    AL1(00,00,00,00,00,00,00,00,74,75,76,77,78,79,00,00) 9           
         DC    AL1(00,91,00,00,00,00,00,00,00,00,00,00,00,00,92,93) A           
         DC    AL1(00,00,00,00,00,00,00,80,81,82,83,84,85,86,87,00) B           
         DC    AL1(13,63,16,18,19,12,26,27,28,29,30,31,32,33,37,43) C           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) D           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) E           
         DC    AL1(00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00) F           
