*          DATA SET DMTMSHDR   AT LEVEL 003 AS OF 01/06/00                      
TMSHDR   DSECT                     TEMPEST INFORMATION                          
TMSEYE   DS    CL8                 *TEMPEST EYECATCHER                          
TMSFAC   DS    CL4                 FACPAK NAME                                  
TMSMAXCI DS    F                   MAXIMUM NUMBER OF ALLOCATIONS                
TMSUSECI DS    F                   CURRENT NUMBER OF ALLOCATIONS                
TMSRPTRK DS    H                   RECORDS PER TRACK                            
TMSTRKS  DS    H                   NUMBER OF TRACKS                             
TMSMAX   DS    H                   MAX PAGES ALLOWED TO ALLOCATE                
TMSRLEN  DS    H                   RECORD LENGTH                                
TMSCITRK DS    H                   NUMBER OF TRACKS PER ALLOCATION              
TMSHICI  DS    F                   HIGH WATER MARK FOR DAY                      
         ORG   TMSHDR+64                                                        
TMSHDRLQ EQU   *-TMSHDR                                                         
