*          DATA SET DMVSDEMCTD AT LEVEL 005 AS OF 03/22/19                      
***********************************************************************         
* TEMPORARY DEBUGGING COUNTERS                                        *         
***********************************************************************         
CTRVLNQ EQU    6                   COUNTER LENGTH                               
CTRFIRST DS    0X                                                               
CTRDREAD DS    PL(CTRVLNQ)         DIR - DMREAD                                 
CTRDRDHI DS    PL(CTRVLNQ)         DIR - DMRDHI                                 
CTRDRSEQ DS    PL(CTRVLNQ)         DIR - DMRSEQ                                 
CTRDRSHI DS    PL(CTRVLNQ)         DIR - DMRSEQ READ HI FOR NEXT MAJOR          
CTRDNRF  DS    PL(CTRVLNQ)         DIR - NO REC FOUND                           
CTRDDEL  DS    PL(CTRVLNQ)         DIR - DELETED REC                            
CTRDDSK  DS    PL(CTRVLNQ)         DIR - SKIPPED DELETES                        
CTRDPAOP DS    PL(CTRVLNQ)         DIR - NON-EXTENDED PASSIVES (PROD)           
CTRDPAOT DS    PL(CTRVLNQ)         DIR - NON-EXTENDED PASSIVES (TEST)           
CTRDPAEP DS    PL(CTRVLNQ)         DIR - EXTENDED PASSIVES RET (PROD)           
CTRDPAET DS    PL(CTRVLNQ)         DIR - EXTENDED PASSIVES     (TEST)           
CTRDPTRP DS    PL(CTRVLNQ)         DIR - FIL POINTERS RETURNED (PROD)           
CTRDPTRT DS    PL(CTRVLNQ)         DIR - FIL POINTERS RETURNED (TEST)           
CTRFRDHI DS    PL(CTRVLNQ)         FIL - DMRDHI                                 
CTRFRSEQ DS    PL(CTRVLNQ)         FIL - DMRSEQ                                 
CTRFRSHI DS    PL(CTRVLNQ)         FIL - DMRSEQ HAD TO READ HI                  
CTRFALRD DS    PL(CTRVLNQ)         FIL - RECORD ALREADY IN IO AREA              
CTRFEOF  DS    PL(CTRVLNQ)         FIL - EOF SET                                
CTRFPAS  DS    PL(CTRVLNQ)         FIL - PASSIVE READ                           
CTRFDSK  DS    PL(CTRVLNQ)         FIL - SKIPPED DELETED RECORDS                
CTRFOUTP DS    PL(CTRVLNQ)         FIL - RECORDS RETURNED (PRODUCTION)          
CTRFOUTT DS    PL(CTRVLNQ)         FIL - RECORDS RETURNED (TEST)                
CTRVERR  DS    PL(CTRVLNQ)         ALL - VSAM ERRORS                            
CTRVRAC  DS    PL(CTRVLNQ)         ALL - VSGET FOUND RPL STILL ACTIVE           
CTRVSHI  DS    PL(CTRVLNQ)         VSM - READ HI GETS ISSUED                    
CTRVSSK  DS    PL(CTRVLNQ)         VSM - READ SKP GETS ISSUED                   
CTRVSSQ  DS    PL(CTRVLNQ)         VSM - READ SEQ GETS ISSUED                   
CTRVSWT  DS    PL(CTRVLNQ)         VSM - READS THAT NEEDED A WAIT               
CTRVNUMQ EQU   (*-CTRFIRST)/CTRVLNQ   NUMBER OF COUNTERS                        
*                                                                               
*        VSAM ERROR DETAILS: XL4 COPY OF P7, XL4 COPY OF RPLFDBWD               
*                                                                               
VSERR1ST DS    XL8                 FIRST VSAM ERROR DETAILS                     
VSERRLST DS    XL8                 LATEST VSAM ERROR DETAILS                    
