*          DATA SET DMWRKRW    AT LEVEL 001 AS OF 12/22/80                      
CIDATA   DS    0CL40                                                            
CICINDX  DS    H                   INDEX NUMBER OF CI'S                         
CIPAGES  DS    H                   INDEX NUMBER OF PAGES                        
CIENTRYS DS    H                   INDEX NUMBER OF ENTRIES                      
CITRKS   DS    H                   PART1 TRACKS PER CI                          
CIHIREC  DS    H                   INDEX BLOCKS PER TRACK                       
CIBLKLN  DS    H                   INDEX BLOCK SIZE                             
CICITOT  DS    H                   PART1 TOTAL NUMBER OF CI'S                   
         DS    XL6                                                              
*                                                                               
CJCITOT  DS    H                   PART2 TOTAL NUMBER OF CI'S                   
CJTRKS   DS    H                   PART2 TRACKS PER CI                          
CJSTTRK  DS    H                   PART2 START TRACK                            
CJPAGE   DS    H                   PART2 INDEX PAGE                             
CJENTRY  DS    H                   PART2 INDEX ENTRY                            
CJNDXADR DS    XL4                 PART2 INDEX PAGE DISK ADDRESS                
         DS    XL6                                                              
*                                                                               
CINDXLN  DS    H                   INDEX ENTRY SIZE                             
CICJFLAG DS    H                   INDEX FLAGS                                  
*                                                                               
CXADDR   DS    F                   INDEX DISK ADDRESS                           
CXPAGE   DS    H                   INDEX PAGE NUMBER                            
CXENTRY  DS    H                   INDEX PAGE ENTRY                             
CIADDR   DS    F                   CI START DISK ADDRESS                        
CIADDRX  DS    F                   CI END DISK ADDRESS                          
CISAVRE  DS    A                   ROUTINE'S SAVE AREA                          
CIENQDEQ DS    A                   ENQDEQ ROUTINE ADDRESS                       
CIP1     DS    F                   ENQDEQ ROUTINE PARAM 1                       
CIP2     DS    F                   ENQDEQ ROUTINE PARAM 2                       
CIP3     DS    F                   ENQDEQ ROUTINE PARAM 3                       
