*          DATA SET DMXTNTD    AT LEVEL 001 AS OF 05/15/12                      
EXTENTD  DSECT                                                                  
EXTDEV#  DS    XL1                 1=3340,2=3350,3=3375,4=3380,5=3390           
EXTSEQ#  DS    XL1                 M IN MBBCCHHR IS EXTENT SEQUENCE NUM         
EXTCYLLO DS    H                   LOWEST  CYLINDER NUM FOR EXTENT              
EXTTRKLO DS    H                   LOWEST  TRACK NUM FOR EXTENT                 
EXTCYLHI DS    H                   HIGHEST CYLINDER NUM FOR EXTENT              
EXTTRKHI DS    H                   HIGHEST TRACK NUM FOR EXTENT                 
EXTCHU   DS    XL2                 CHANNEL/UNIT                                 
EXT#TRKS DS    H                   NUMBER OF TRACKS IN EXTENT                   
EXTLNQ   EQU   *-EXTENTD                                                        
