*          DATA SET DRKZEDIIND AT LEVEL 013 AS OF 01/25/96                      
* DSECT FOR THE RECORDS THAT WILL COME IN FROM KATZ THAT WILL BE                
* CONVERTED TO AGENCY HEADER, ACENCY DESCRIPTION, BUY HEADER, AND BUY           
* RECORDS ON THE PRINT QUE.                                                     
*                                                                               
*                                  HEADER ONE RECORD                            
*                                                                               
DKHEADR1 DSECT                                                                  
DKHDTYP  DS    CL1                 TYPE                                         
DKHDTYPQ EQU   C'1'                                                             
DKHDREF  DS    CL25                AGENCY REFERENCE NUMBER                      
DKHDNAME DS    CL30                AGENCY NAME                                  
DKHDADR1 DS    CL30                AGENCY ADDRESS 1                             
DKHDADR2 DS    CL30                AGENCY ADDRESS 2                             
DKHDADR3 DS    CL30                AGENCY ADDRESS 3                             
DKHDADNM DS    CL30                ADV NAME                                     
DKHDPRNM DS    CL30                PRD NAME                                     
DKHDESNO DS    CL8                 EST NUMBER                                   
DKHDOFF  DS    CL5                 OFFICE                                       
DKHDOFNM DS    CL20                OFFICE NAME                                  
DKHDMKT  DS    CL3                 (NUMERIC) MARKET                             
DKHDMKNM DS    CL30                MARKET NAME                                  
DKHDSTAT DS    CL5                 STATION                                      
DKHDBUYR DS    CL30                BUYER                                        
DKHDBUFN DS    CL14                BUYER PHONE                                  
DKHDSRVC DS    CL1                 SERVICE                                      
DKHDDEMO DS    CL6                 DEMO                                         
DKHDDATE DS    CL6                 DATE OF TRANSACTION                          
DKHDTIME DS    CL4                 TIME OF TRANSACTION                          
*                                                                               
DKHDST1  DS    CL6                 SCHEDULE ONE START                           
DKHDEND1 DS    CL6                 SCHEDULE ONE END                             
DKHDALT1 DS    CL1                 SCHEDULE ONE ALT                             
DKHDST2  DS    CL6                 SCHEDULE TWO START                           
DKHDEND2 DS    CL6                 SCHEDULE TWO END                             
DKHDALT2 DS    CL1                 SCHEDULE TWO ALT                             
DKHDST3  DS    CL6                 SCHEDULE THREE START                         
DKHDEND3 DS    CL6                 SCHEDULE THREE END                           
DKHDALT3 DS    CL1                 SCHEDULE THREE ALT                           
*                                                                               
DKHDPR2  DS    CL30                PR2 NAME                                     
DKHDPOB  DS    CL3                 (NUMERIC) PERCENT OF BUY                     
DKHDMOVI DS    CL1                 MOVIE IND                                    
DKHDFILL DS    CL39                FILLER                                       
*                                                                               
*             HEADER TWO RECORD                                                 
*                                                                               
DKHEADR2 DSECT                                                                  
DKH2TYP  DS    CL1                 TYPE                                         
DKH2TYPQ EQU   C'2'                                                             
DKH2REF  DS    CL25                AGENCY REFERENCE                             
DKH2AGCD DS    CL8                 AGENCY CODE                                  
DKH2ADCD DS    CL8                 ADV CODE                                     
DKH2PRCD DS    CL8                 PRODUCT CODE                                 
DKH2EST  DS    CL30                EST DESCRIPTION                              
DKH2FLNO DS    CL8                 FLIGHT NO                                    
DKH2RPCD DS    CL5                 REP XODE                                     
DKH2RPNM DS    CL30                REP NAME                                     
DKH2ACCT DS    CL30                ACCT EXEC                                    
DKH2SALE DS    CL30                SALES  ASST                                  
DKH2AEFN DS    CL14                AE PHONE                                     
DKH2AEFX DS    CL10                AE FAX                                       
DKH2ST2  DS    CL5                 STAT2                                        
DKH2ST3  DS    CL5                 STAT2                                        
DKH2ST4  DS    CL5                 STAT3                                        
DKH2ST5  DS    CL5                 STAT4                                        
DKH2ST6  DS    CL5                 STAT5                                        
DKH2ST7  DS    CL5                 STAT6                                        
DKH2ST8  DS    CL5                 STAT7                                        
DKH2RCD1 DS    CL2                 R CODE ONE                                   
DKH2RCD2 DS    CL2                 R CODE TWO                                   
DKH2VEND DS    CL6                 VENDOR CODE                                  
DKH2BUOF DS    CL5                 BUYING OFFICE                                
DKH2BFNM DS    CL20                BUYING OFFICE NAME                           
DKH2MED  DS    CL1                 MEDIA                                        
DKH2SWBK DS    CL5                 SWEEP BOOK                                   
DKH2GRPS DS    CL4                 (NUMERIC) GRPS                               
DKH2CPP  DS    CL7                 (NUMERIC)CPP-DIVIDE BY 100 TO PRINT          
DKH2STAT DS    CL1                 STATUS                                       
DKH2REV  DS    CL2                 REP REVISION                                 
DKH2CON  DS    CL7                 (NUMERIC)REP CONTRACT                        
DKH2REV2 DS    CL2                 REP REVISION TWO                             
DKH2CON2 DS    CL7                 (NUMERIC)REP CONTRACT TWO                    
DKH2LTDT DS    CL6                 LAST DATE                                    
DKH2CURR DS    CL2                 CURRENCY                                     
DKH2CSQL DS    CL1                 COST QUALITY                                 
DKH2CLCD DS    CL1                 CLASS CODE                                   
DKH2PR2  DS    CL8                 PR2 CODE                                     
DKH2FLN2 DS    CL8                 FLIGHT N2                                    
DKH2FLN3 DS    CL8                 FLIGHT N3                                    
DKH2CNAD DS    CL15                CONTRACT ADDRESS                             
DKH2INV  DS    CL15                INVOICE ADDRESS                              
DKH2TIND DS    CL1                 TEST INDICATOR                               
DKH2CTRY DS    CL2                 COUNTRY                                      
DKH2CTRL DS    CL9                 (NUMERIC)CONTROL NUMBER                      
DKH2DVCD DS    CL1                 DIV CODE                                     
DKH2FILL DS    CL23                FILLER                                       
*                                                                               
*        HEADER THREE RECORD                                                    
*                                                                               
DKHEADR3 DSECT                                                                  
DKH3TYP  DS    CL1                 TYPE                                         
DKH3TYPQ EQU   C'3'                                                             
DKH3REF  DS    CL25                AGENCY REFERENCE NUMBER                      
DKH3COM1 DS    CL75                COMMENT ONE                                  
DKH3COM2 DS    CL75                COMMENT TWO                                  
DKH3COM3 DS    CL75                COMMENT THREE                                
DKH3COM4 DS    CL75                COMMENT FOUR                                 
DKH3COM5 DS    CL75                COMMENT FIVE                                 
DKH3FILL DS    CL49                FILLER                                       
*                                                                               
*        DETAIL RECORD ---> BUY HEADER RECORD                                   
*                                                                               
DKDETAIL DSECT                                                                  
DKDETYP  DS    CL1                 TYPE                                         
DKDETYPQ EQU   C'4'                                                             
DKDREF   DS    CL25                REFERENCE                                    
DKDLINE  DS    CL4                 AGENCY LINE                                  
DKDDAYS  DS    CL7                 DAYS                                         
DKDQUAL  DS    CL1                 (NUMERIC) DAY QUAL-ROTATION??                
DKDSTRT  DS    CL4                 (NUMERIC) START HHMM CL2 FILLER?             
DKDEND   DS    CL4                 (NUMERIC) END TIME HHMM CL2 FILLER?          
DKDNAME  DS    CL20                PROGRAM NAME                                 
DKDCODE  DS    CL5                 PROGRAM CODE                                 
DKDLEN   DS    CL3                 SPOT LENGTH                                  
DKDLNQL  DS    CL1                 LENGTH UNITS                                 
DKDCOMNO DS    CL12                COMM-NUMBER                                  
DKDDYPT  DS    CL2                 DAYPART                                      
DKDSPGR  DS    CL28                SPOT GRID                                    
DKDSPTS  DS    CL5                 (NUMERIC) SPOTS                              
DKDMGTY  DS    CL1                 MG TYPE                                      
DKDUNCS  DS    CL9                 (NUMERIC) DIVIDE BY 100 UNIT COST            
DKDLNCS  DS    CL9                 (NUMERIC) DIVIDE BY 100 LINE COST            
DKDCOMM  DS    CL50                COMMENT                                      
DKDRTYP  DS    CL1                 RADIO TYPE                                   
DKDRPLN  DS    CL3                 REP LINE                                     
DKDNOLN  DS    CL2                 (NUMERIC) NUMBER OF LINES                    
DKDRTNG  DS    CL5                 (NUMERIC) DIVIDE BY10 RATING                 
DKDMGSFX DS    CL2                 MG SUFFIX                                    
DKDBLBRD DS    CL1                 BILLBD SW                                    
DKDBKEND DS    CL1                 BOODEND SW                                   
DKDTMEXC DS    CL1                 TIME EXCEPTION                               
DKDFILL  DS    CL157               FILLER                                       
*                                                                               
*        DETAIL COMMENT RECORD                                                  
*                                                                               
DKDTLCOM DSECT                                                                  
DKDCMTP  DS    CL1                 TYPE                                         
DKDCMTPQ EQU   C'4'                                                             
DKDCMREF DS    CL25                (NUMERIC)AGENCY REFERENCE NUMBER             
DKDCMLIN DC    C'9999'             (NUMERIC) AGENCY LINE                        
DKDCMCOM DS    CL50                COMMENT                                      
DKDCMCM2 DS    CL50                COMMENT TWO                                  
DKDCMCM3 DS    CL50                COMMENT THREE                                
DKDCMFIL DS    CL38                FILLER                                       
*                                                                               
*        TLRTLR RECORD??????????                                                
*                                                                               
DKTLRTLR DSECT                                                                  
DKTTYP   DS    CL1                 TYPE                                         
DKTTYPQ  EQU   C'5'                                                             
DKTREF   DS    CL25                AGENCY REFERENCE NUMBER                      
DKTLINE  DS    CL4                 (NUMERIC) LINES                              
DKTSPOT  DS    CL7                 (NUMERIC) SPOTS                              
DKTCOST  DS    CL11                (NUMERIC) DIVIDE BY 100 COST                 
DKTFILL  DS    CL402               FILLER                                       
