*          DATA SET DRLOCAL    AT LEVEL 031 AS OF 09/20/07                      
*              LOCAL WORKING STORAGE FOR DRIVER                                 
         SPACE 1                                                                
         ORG   GLOBALD+1000                                                     
         DS    D                   '*LOCAL**' IN DUMP                           
DUB      DS    D                                                                
WORK     DS    CL64                                                             
DMCB     DS    6F                                                               
         SPACE 3                                                                
ENDDRIVE DS    A                                                                
ARECPOOL DS    A                                                                
ARECNOW  DS    A                                                                
AMYP1    DS    A                                                                
AMYH1    DS    A                                                                
AMYM1    DS    A                                                                
AMYF1    DS    A                                                                
         DS    A                                                                
         DS    A                                                                
         DS    A                                                                
AOUTPDCB DS    A                                                                
AACTREC  DS    A                                                                
ALOCEND  DS    A                                                                
         SPACE 1                                                                
ANEEDTAB DS    A                                                                
NEEDMAX  DS    F                                                                
NEEDSOFA DS    F                                                                
WIDTH    DS    F                                                                
BGKEYLEN DS    H                                                                
BGRECLEN DS    H                                                                
MYWIDTH  DS    F                                                                
TRACOPT  DS    CL1                                                              
SPLATSW  DS    CL1                                                              
DLFIRST  DS    CL1                                                              
EQUSW    DS    CL1                                                              
RANKNO   DS    F                                                                
RANKEQU  DS    F                                                                
         DS    CL16                                                             
         EJECT                                                                  
*              EXTERNALS ADDRESSES                                              
         SPACE 3                                                                
ADDAY    DS    V                                                                
ABOX     DS    V                                                                
BUFFALO  DS    V                                                                
CENTER   DS    V                                                                
CHOPPER  DS    V                                                                
DATAMGR  DS    V                                                                
DATCON   DS    V                                                                
DEMOCON  DS    V                                                                
EDITOR   DS    V                                                                
GETDAY   DS    V                                                                
HEXIN    DS    V                                                                
HEXOUT   DS    V                                                                
LOADER   DS    V                                                                
PRINT    DS    V                                                                
REPORT   DS    V                                                                
RIGHT    DS    V                                                                
SQUASHER DS    V                                                                
SORTER   DS    V                                                                
UNDAY    DS    V                                                                
UNDERLIN DS    V                                                                
UNTIME   DS    V                                                                
UTL      DS    V                                                                
WORKER   DS    V                                                                
XSORT    DS    V                                                                
AREPWRKD DS    V                   REPORT WORKING STORAGE                       
AOCOND   DS    V                   A(OUT CONTROLLER STORAGE)                    
ATWADCON DS    V                                                                
         DS    V                                                                
         DS    V                                                                
         DS    V                                                                
         DS    V                                                                
         SPACE 1                                                                
LOCALCNT DS    CL16                LANGUAGE DEPENDANT EXPRESSIONS               
LOCALTOT DS    CL16                                                             
LOCALALL DS    CL3                                                              
DRIVLANG DS    XL1                 LANGUAGE CODE                                
DRIVCTRY DS    XL1                 COUNTRY CODE                                 
         SPACE 1                                                                
LOCALEND DS    D                                                                
