*          DATA SET DRMAILTYP  AT LEVEL 010 AS OF 02/16/01                      
*                                                                               
* IF NEW ENTRIES ARE ADDED, DDEDIDARR AND FAMONITOR NEED TO BE RELINKED         
* IN ADDITION, PC STEREO MUST BE NOTIFIED OF NEW ENTRIES                        
*                                                                               
* CL6 TRANSMISSION ID                                                           
* CL1 DARE MESSAGE MAIL TYPE                                                    
* CL4 MAIL TYPE SCREEN DISPLAY                                                  
DRMLTYPE DS    0CL11                                                            
         DC    C'AGYHDR',C'A',C'ORD '                                           
         DC    C'REVHDR',C'B',C'REV '                                           
         DC    C'VARHDR',C'C',C'VAR '                                           
         DC    C'ORDAPP',C'D',C'APP '                                           
         DC    C'ORDREJ',C'E',C'REJ '                                           
         DC    C'ORDCFM',C'F',C'CFM '                                           
         DC    C'ORDRCL',C'G',C'RCL '                                           
         DC    C'AGYRCL',C'H',C'RCL '                                           
         DC    C'AGYCAN',C'I',C'CAN '                                           
         DC    C'MKGHDR',C'J',C'MNEW'                                           
         DC    C'MKGAPP',C'K',C'MAPP'                                           
         DC    C'MKGREJ',C'L',C'MREJ'                                           
         DC    C'MKGROK',C'M',C'MGOK'                                           
         DC    C'MKGCAN',C'N',C'MCAN'                                           
         DC    C'DLNNOT',C'O',C'DLNT'                                           
         DC    C'ERRNOT',C'P',C'ERRN'                                           
         DC    C'MKGREC',C'Q',C'MREC'                                           
         DC    X'FF'                                                            
