*          DATA SET DRONEBLKHD AT LEVEL 001 AS OF 09/17/87                      
*                                                                               
DRHEADD  DSECT               COVERS EACH DRONE BLOCK HEADLINE                   
DRHDLEND DS    0XL64                                                            
DRHEAD   DS    XL1           X'80' = GENERATE HEAD STATEMENT                    
DRHRTN   DS    CL8           HEAD -- ROUTINE                                    
DRHARGS  DS    XL16          HEAD -- ARGS                                       
DRHNARG  DS    XL1           HEAD -- NO. OF ARGUMENTS                           
DRHOPTS  DS    XL1           HEAD -- MISC. OPTIONS                              
DRHLITL  DS    XL1           HEAD -- LENGTH OF LITERAL                          
DRHLIT   DS    CL24          HEAD -- LITERAL                                    
         DS    XL12          CURRENTLY UNUSED                                   
