*          DATA SET DROOLLOCAL AT LEVEL 063 AS OF 01/03/90                      
*              LOCAL WORKING STORAGE FOR DROOL                                  
*                                                                               
DRLLOCAL DS    D                   '*LOCAL**' IN DUMP                           
DUB      DS    D                                                                
DMCB     DS    6F                                                               
FULL     DS    F                                                                
DRRELO   DS    F                   RELOCATION FACTOR                            
ADRPARMS DS    A                   A(CALLING PARAMETER LIST)                    
ATSARD   DS    A                   A(TSAR PARAMETER BLOCK)                      
ATWAFLDH DS    A                   IF ON-SCREEN, A(TWA FIELD HEADER)            
AGOHOOK  DS    A                   A(DROOL HOOK ROUTINE)                        
WORK     DS    XL256                                                            
HALF     DS    H                                                                
BGKEYLEN DS    H                   TSAR KEY LENGTH                              
BYTE     DS    X                                                                
ELCODE   DS    X                                                                
*                                                                               
         DS    XL66                SPARE                                        
*                                                                               
DATCON   DS    V                                                                
HEXIN    DS    V                                                                
HEXOUT   DS    V                                                                
RIGHT    DS    V                                                                
         DS    6V                  SPARE                                        
*                                                                               
COREADDS DS    0V                  *** DON'T CHANGE THIS SEQUENCE ***           
TSAR     DS    V                                                                
CENTER   DS    V                                                                
CHOPPER  DS    V                                                                
UNDERLIN DS    V                                                                
REPORT   DS    V                                                                
EDITOR   DS    V                                                                
         DS    6V                  SPARE                                        
*                                                                               
LOCALEND DS    D                                                                
