*          DATA SET DRTTABD    AT LEVEL 001 AS OF 11/19/92                      
*----------------------------------------------------------------------         
*        TABLE OF BILLED DEBITS ON A JOB                                        
*----------------------------------------------------------------------         
DRTABD   DSECT                     TABLE OF DR AMOUNTS                          
DRTNUM   DS    CL6                 BILL NUMBER                                  
DRTWC    DS    CL2                 WORK CODE                                    
DRTDATE  DS    CL2                 PACKED BILL DATE                             
DRTNAME  DS    CL35                VENDOR NAME                                  
LDRTNAME EQU   L'DRTNAME                                                        
DRTSUB   DS    CL1                 SUB REF NO, TO KEEP UNIQUE                   
DRTKYLN  EQU   *-DRTABD                                                         
DRTSTAT  DS    CL1                 COMMISSIONABLE OR NOT                        
DRTNARR  DS    CL40                NARRITIVE, IF TYPE 46                        
DRTBUCK  EQU   *                                                                
DRTAMNT  DS    PL8                 BILLED                                       
DRTCOM   DS    PL8                 COMMISSION                                   
DRTCD    DS    PL8                 CASH DISC                                    
DRTABLN  EQU   *-DRTABD                                                         
