*          DATA SET DXCNVXD    AT LEVEL 002 AS OF 07/28/00                      
***********************************************************************         
* DXCNVX DSECTS                                                       *         
***********************************************************************         
         SPACE 1                                                                
*                                 COVERS DATA TYPE DEFINITON ENTRY              
DXCRECD  DSECT                    IN EXTRACT RECORD CONVERSION TABLE            
*                                                                               
DXCRLEN  DS    XL2                LENGTH OF UNCONVERTED DATA                    
DXCRDSP  DS    XL2                DISPLACEMENT TO UNCONVERTED DATA              
DXCRRN   DS    XL1                REQUIRED FOR NORMAL BUILD                     
DXCRRK   DS    XL1                REQUIRED FOR KILL BUILD                       
DXCRDT   DS    XL1                DATA TYPE FOR CONVERSION                      
DXCRVER  DS    XL1                VERSION LEVEL FOR DATA                        
         DS    XL1                SPARE                                         
DXCRECLQ EQU   *-DXCRECD                                                        
         SPACE 1                                                                
