*          DATA SET DXRECID    AT LEVEL 009 AS OF 12/29/03                      
***********************************************************************         
* GENERAL EXTRACT SYSTEM RECORD TYPE ID VALUES                        *         
***********************************************************************         
          SPACE 2                                                               
DXHDRDQ   DC   CL5'00000'          HEADER RECORD                                
DXSQLDQ   DC   CL5'00001'          SQL QUERY BEFORE                             
DXSQADQ   DC   CL5'99998'          SQL QUERY AFTER                              
DXTRLDQ   DC   CL5'99999'          TRAILER RECORD                               
