*          DATA SET DXSYSLEX   AT LEVEL 009 AS OF 01/02/04                      
*                                                                               
* EXTENDED ENTRIES TO FASYSLST FOR EXTRACT SYSTEM                               
*                                                                               
         CNOP  2,4                                                              
SYSLEX   DS    0CL16                                                            
         DC    AL2(L'SYSLEX),AL4(SYSLEXX-1)                                     
*&&US*&& DC    X'0302',C'NETWORKNET',C'NN',X'4000'                              
         DC    X'FFFF',C'PQ     PQ ',C'11',X'0000'                              
         DC    X'FEFE',C'WORKER WRK',C'22',X'0000'                              
SYSLEXX  EQU   *                                                                
         DC    X'00'               TABLE TERMINATOR                             
