*          DATA SET EZBILLD    AT LEVEL 120 AS OF 08/11/03                      
EZBILLD  DSECT                                                                  
EZBAGY   DS    CL8                                                              
EZBSRC   DS    CL4                                                              
EZBMEDIA DS    CL1                                                              
EZBCALL  DS    CL5                                                              
EZBNET   DS    CL4                                                              
EZBMOS   DS    CL4                                                              
EZBTODAY DS    CL6                                                              
EZBADVNM DS    CL25                                                             
EZBPRDNM DS    CL25                                                             
EZBINVNO DS    CL10                                                             
EZBNSPTS DS    CL5                                                              
EZBGDOL  DS    CL11                                                             
EZBNDOL  DS    CL11                                                             
EZBAGYNM DS    CL30                                                             
*                                                                               
EZBEST   DS    CL10                                                             
EZBREPOR DS    CL10                                                             
EZBSTAOR DS    CL10                                                             
EZBADVCD DS    CL8                                                              
EZBPRDCD DS    CL8                                                              
EZBLDATE DS    CL6                                                              
EZBHDATE DS    CL6                                                              
*                                                                               
SPARE    DS    CL61                                                             
