*          DATA SET EZBLOCKR   AT LEVEL 147 AS OF 09/27/07                      
         SPACE 2                                                                
*****************************************************************               
*                                                               *               
*            CONTROL DSECT FOR EZMOD                            *               
*                                                               *               
*****************************************************************               
*                                                               *               
* LEV 61    NOV19/91 ADD BILLBOARD, GST, Z5 PROF                *               
* LEV 62    DEC05/91 ADD EZSAVSYS                               *               
* LEV 63    FEB13/92 ADD MPL FILE NUMBER                        *               
* LEV 64    OCT16/92 ADD TRAFFIC LINKED CLIENT/PRODUCT CODES    *               
* LEV 65    OCT27/92 ADD EZITBGST FOR Z9 REPORT                 *               
* LEV 66    MAR24/93 ADD EZIHNET FOR LOCAL CABLE HEAD SUPPORT   *               
* LEV 67    APR29/93 ADD EZSRCE FOR EZADDINV                    *               
* LEV 68    MAY18/93 ADD SPOT LEN ERROR - BAD INVOICE           *               
* LEV 69    AUG02/93 AUTO Z9 REQ FOR CONVERTED INVOICES         *               
* LEV 70    SEP15/93 ADD INVALID STATION                        *               
* LEV 71    NOV23/93 ADD TRFUPD - TRAFFIC UPDATE FILE ADDR      *               
* LEV 73    DEC13/93 ADD EZPROPT - USE COMML PRODUCT IF POL INV *               
*                    ADD COMBINED INVOICE #                     *               
* LEV 74    JAN04/94 ADD EZIHCCMB COMBINED WITH ANOTHER-OVER 255*               
* LEV 75    FEB24/94 DEL TRFUPD - TRAFFIC UPDATE FILE ADDR      *               
* LEV 76    JUN13/94 UPDATE FOR NEW WRKF INDEX                  *               
* LEV 77    JAN26/95 ADD EZHDRSEQ, EZNIOPT                      *               
* LEV 78    MAY18/96 ADD EZHDRSEQ, EZNIOPT                      *               
* LEV 79    AUG20/96 ADD BAD TIME IN SPOT DETAIL                *               
* LEV 80    SEP04/96 SPOT DETAIL DATE OUT OF PERIOD             *               
* LEV 81    FEB06/97 ADD TRADING PARTNER - ACN NUMBER FOR COKE  *               
* LEV 82    JUN20/97 ADD COKE EST VALIDATION ERR CODES          *               
* LEV 83    MAR04/98 ADD EZSTAPK AND EZSPNETB FOR EZADDSNV      *               
*                    EZIHNET IS FROM 31 - INVOICE HEADER        *               
*                    EZSPNETC IS FROM 31 - INVOICE HDR (STAPACK)*               
*                    EZSPNET IS SOURCE FROM 51 SPOT DETAIL REC  *               
*                    EZSPNETB IS FROM 51 - (STAPACK)            *               
* LEV 84    APR27/98 ADD EZSPPRGN - PROGRAM NAME                *               
* LEV 85    FEB01/99 ADD EZERRTMH - TIME OUT OF RANGE HIGH      *               
* LEV 86    MAR09/99 ADD EZSPCNOM - INTERCEPT N- CMLS WITH NO   *               
*                    MATCH FLAG - TO BE SAME AS NEW INVOICE     *               
* LEV 87    APR05/99 ADD MID-FLT-CLEAR FLAG & REQUEST           *               
* LEV 88    MAY10/99 ADD BAD NUMERIC FIELD FLAG                 *               
*                    BAD DATE CHECKING                          *               
* LEV 89    JUN11/99 ADD EZSUBMED EZ PROF 10 - RUN BY SUB MEDIA *               
* LEV 90    AUG10/99 ADD EZSTYPE FROM STATION MASTER            *               
* LEV 91    AUG19/99 ADD FATAL ERR FOR BROADCAST MONTH          *               
*                    AND EZSPTIMT FOR TIME PRECEDED BY A 'T'    *               
* LEV 92    SEP09/99 ADD EZITPST/EZITBPST CANADIAN TAX          *               
*                    AND EZSPNINT - NETWORK INTEGRATION COST    *               
* LEV 93    OCT20/00 NEW Z5 PROFILE BYPASS DELETED INV REPORT   *               
* LEV 94    JAN12/01 NEW EZSOON FLAG S = RUNNING SOON/MAST ADR  *               
*                    SEND NOTES FOR RUN PROBLEMS                *               
* LEV 96    FEB16/01 ADD EZERDMGR DATA MGR ERROR                *               
* LEV 97    MAR19/01 ADD EZINVSIZ - STOP SOON Z5 DUMPS          *               
* LEV 99    JUN13/01 ADD EZEQVSTA - EQUIVALENT STA              *               
* LEV100    MAR25/02 ADD EZERRCON - REP CONTRACT # NOT FOUND    *               
*                    REFORMAT, ADD DEAL, PACKAGE, GST/QST       *               
*                                                               *               
*****************************************************************               
         SPACE 2                                                                
EZBLOCKD DSECT                                                                  
*                                  CONTROLS/DATA SET BY CALLER                  
*                                  ---------------------------                  
         SPACE 1                                                                
EZHOOK   DS    A                   A(USER'S PROCESSING ROUTINE)                 
         DS    1A                  SPARE                                        
EZWKRFIL DS    CL8                 WORKER FILE NAME                             
EZWKRIND DS    XL44                WORKER FILE INDEX                            
EZWKRBUF DS    A                   A(BUFFER FOR WORKER FILE)                    
EZWKRREC DS    A                   A(WORKER FILE RECORD AREA)                   
EZAREC   DS    A                   A(IO AREA)                                   
EZPRTAB  DS    A                   A(PRODUCT TABLE AREA)                        
EZCMTAB  DS    A                   A(CMML TABLE AREA)                           
EZPRTABL DS    H                   LENGTH OF PROD TABLE                         
EZCMTABL DS    H                   LENGTH OF CMML TABLE                         
EZCOMFCS DS    A                   A(COMFACS)                                   
EZARECTB DS    A                   A(EZRECTAB)                                  
EZPRINT  DS    A                   A(PRINT ROUTINE)                             
EZUTL    DS    A                   A(UTL)                                       
EZSTAPK  DS    A                   A(STAPACK)                                   
EZTRFTBL DS    A                   TRAFFIC TABLE OF CLIENT CML SEQ #'S          
EZMAST   DS    A                   DDMAST                                       
EZLSTATB DS    A                   LOCAL STATION TABLE                          
*                                                                               
*                                **PROCESSING CONTROLS (CAN BE CHANGED          
*                                **BY USER DURING HOOK ROUTINE)                 
*                                                                               
EZTRACE  DS    XL1                 X'80 = TRACE FIELDS                          
*                                  X'40'= TRACE CALLS                           
*                                  X'20'= TRACE ERRORS                          
*                                  X'10'= TRACE ADDED INVOICE RECS              
*                                                                               
EZLOOKSW DS    XL1                                                              
EZLNOADV EQU   X'80'               X'80' - NO ADV LOOKUP                        
EZLNOPRD EQU   X'40'               X'40' - NO PRD LOOKUP                        
EZLNOCML EQU   X'20'               X'20' - NO CMML LOOKUP                       
EZLRDCOV EQU   X'10'               X'10' - PASS 'COVER LETTER INVOICES'         
EZLCALEN EQU   X'01'               X'01' - THIS INVOICE IS CALENDAR             
EZLNOREP EQU   X'02'               X'02' - NO REP LOOKUP                        
EZLOC    EQU   X'04'               X'04' - RUNNING LOCAL                        
*                                                                               
EZTEST   DS    CL1                 Y= NO WORKER FILE MARKING                    
EZWRITE  DS    CL1                 N= NO FILE MARKING                           
EZCONVSW DS    XL1                 X'FF' - NO DATA CONVERSIONS                  
EZRPLOPT DS    CL1                 Y= OK TO REPLACE INVOICE (EZADDINV)          
*                                                                               
EZAGY    DS    CL2                 ALPHA AGENCY                                 
EZBAGYMD DS    XL1                 AGENCY/MEDIA BYTE                            
EZSELINV DS    CL10                INVOICE NUMBER FILTER                        
EZSRCE   DS    CL4                 SOURCE - JDS, ENT, BDS.....                  
EZSAVSYS DS    CL1                 SAVED UTL SYSTEM NUMBER IF MPL               
*                                  ALREADY OPEN                                 
EZMPLOPN DS    CL1                 MPL FILE OPEN SWITCH                         
EZCONSE  DS    XL1                 SENUM FOR MPL FILE                           
*                                                                               
EZSPTNET DS    CL1                 S=SPOT, N=NET                                
EZFCTRFU DS    CL1  (FCUPTRF)      IS TRAFFIC SYSTEM OPERATIONAL                
EZRCTRFU DS    XL1  (RCUTLTRF)     TRAFFIC SE NUMBER                            
EZSPOTSE DS    XL1  (SPOTSE)       SPOT SYSTEM SE NUMBER                        
EZRPLFND DS    CL1                 Y=WORKING ON REPLACE INVOICE                 
EZSTYPE  DS    CL1                 STATION TYPE FROM STATION MASTER             
EZSOON   DS    CL1                 RUNNING SOON FLAG S = SOON                   
EZREPSE  DS    X                                                                
         SPACE 2                                                                
*                                  CONTROLS/DATA RETURNED                       
*                                  ----------------------                       
         SPACE 1                                                                
EZMODE   DS    XL1                 MODE                                         
*                                                                               
EZERRP   EQU   200                 PROCESS ERROR                                
*                                                                               
EZINVP   EQU   25                  PROCESS INVOICE                              
EZICCOMP EQU   26                          INVOICE COMMENT (TOP)                
EZSCHP   EQU   27                          SCHEDULE LINE                        
EZSCOMP  EQU   28                          SCHEDULE LINE COMMENT                
EZSPTP   EQU   29                          SPOT DETAIL                          
EZRECP   EQU   30                          RECONCILIATION REMARK                
EZIBCOMP EQU   31                          INVOICE COMMENT (BOTTOM)             
*                                                                               
*                                                                               
EZSPTL   EQU   37                  END OF  SPOT                                 
EZSCHL   EQU   36                          SCHEDULE                             
EZINVL   EQU   35                          INVOICE                              
EZBATL   EQU   34                          BATCH                                
*                                                                               
EZCMLADD EQU   41                  ADDING A COMMERCIAL                          
*                                                                               
*        NOTE- USER CAN ALTER FLOW BY SETTING MODE BEFORE                       
*              RETURNING FROM HIS PROCESSING HOOK. E.G.-                        
*              SETTING MODE TO EZINVL WILL CAUSE A SKIP TO                      
*              START OF NEXT INVOICE.                                           
*                                                                               
         SPACE 2                                                                
EZRECSEQ DS    H                   SEQ NUMBER OF CURRENT REC                    
EZINVSEQ DS    H                   SEQ NUMBER OF CURRENT INV                    
*                                                                               
EZERRCD  DS    XL1                 ERROR CODE                                   
EZERRLEV DS    XL1                 ERROR LEVEL - THIS ERROR                     
EZERRLVR DS    XL1                 ERROR LEVEL - HIGHEST THIS REC               
EZERRLVI DS    XL1                 ERROR LEVEL - HIGHEST THIS INVOICE           
EZERRLVB DS    XL1                 ERROR LEVEL - HIGHEST THIS BATCH             
EZERRREC DS    CL20                NAME OF RECORD IN ERROR                      
EZERRFLD DS    CL20                NAME OF FIELD IN ERROR                       
EZERRMSG DS    CL40                ERROR MESSAGE                                
EZERRDTA DS    CL30                ERROR DATA                                   
*                                                                               
EZBTBRDT DS    XL3                 DATE RECEIVED- BINARY 3                      
EZBTBRTM DS    XL2                 TIME RECEIVED                                
EZBTSTN  DS    CL7                 STATION - XXXX-TV                            
*                                                                               
EZPROF   DS    XL16                MAIN PROFILE (EZ PROF)                       
         ORG   EZPROF                                                           
EZESTOPT DS    CL1   #1            Y=COPY ESTIMATE NUMBERS                      
EZCONOPT DS    CL1    2            Y=COPY CONTRACT NUMBERS                      
EZPRNOPT DS    CL1    3            Y=AUTO ADD OF PRODUCT NAME RECS              
EZCMLOPT DS    CL1    4            Y=USE EXISTING CMLS TO INVOICES              
*                       (DEFAULT)  N=DON'T USE CML'S AT ALL                     
*                                  A=ADD MISSING CMLS TO TRAF/INV               
*                                  I=ADD MISSING CMLS TO INVOICES,              
*                                    BUT NOT TO TRAFFIC CML FILE                
EZMGOPT  DS    CL1    5            Y=COPY MAKEGOOD STATUS                       
         DS    CL1    6              SUPPRESS RATE ON Z9                        
         DS    CL1    7              GEN INVOICE-FORCE ZERO COST                
EZPROPT  DS    CL1    8            Y=USE COMML PROD IF POL/VAR INVOICE          
*                                  F=FORCE PROD FROM COMML EACH SPOT            
*                                  N=LEAVE PRODUCT ALONE (DEFAULT)              
EZNIOPT  DS    CL1    9            Y=USE EZADDSNV (NEW INVOICING/MINIO)         
EZSUBMED DS    CL1   10            Y=PASS SUB MEDIA TO I2 (NETPAK ONLY)         
         DS    CL1   11                                                         
EZREPOPT DS    CL1   12            CONVERT SPECIAL REP CODE                     
EZPKGDET DS    CL1   13            PACKAGE IN INVOICE DETAILS                   
EZORDTYP DS    CL1   14            SHOW ORDER TYPE                              
*                                                                               
         ORG   EZPROF+16                                                        
EZPROF2  DS    XL16                SECOND PROFILE (Z5 PROF)                     
         ORG   EZPROF2                                                          
EZADNOPT DS    CL1                 Y=AUTO ADD OF ADVERTISER NAME RECS           
EZBYMGRP DS    CL1                 A-Z= BY MARKET GROUP AND MARKET              
EZI2DEMO DS    CL1                 Y-N= FILL IN DEMO FOR I2 REQ                 
*                                  * = NO MARKET GROUP SCHEME                   
EZZ9REQ  DS    CL1                 REQUEST Z9 INV FACSIMILE REPORT              
*                                   FOR ALL CONVERTED THIS RUN                  
EZ5NODEL DS    CL1                 BYPASS DELETED INVOICES REPORT               
EZSORTI2 DS    CL1                 SORT/SIFT AUTO I2 REQUESTS                   
EZI5REQ  DS    CL1                 AUTOMATIC I5 REQUESTS                        
         ORG   EZPROF2+16                                                       
*                                                                               
EZRNFRPT DS    CL1                 Y= REPEAT OF RECORD NOT FOUND                
EZERRFAD DS    XL4                 A(FIELD IN ERROR)                            
EZHDRSEQ DS    H                   SEQ NUMBER OF CURRENT REC                    
EZREPCT  DS    H                   CT OF TIMES A REP INV OVERWRITTEN            
EZMCTINV DS    C                   MCT (MID FLT CLEARANCE) INVOICE              
EZMCTREQ DS    C                   MCT (MID FLT CLEARANCE) REQUEST              
EZEQVSTA DS    CL5                 EQUIVALENT STATION FROM SPREPZ502            
EZREPCON DS    CL4                 REP CONTRACT PWOS                            
EZINVSIZ DS    CL2                 FOR SOON-ACCUMULATE INVOICE REC SIZE         
         DS    0D                                                               
         SPACE 2                                                                
*                      STATION HEADER - (AT MODE EZINVP)                        
*                      --------------                                           
*                                **RECEIVED**                                   
EZSNFRST DS    0C                                                               
EZSNSTA  DS    CL4                 STATION CALL LETTERS                         
EZSNMED  DS    CL2                 MEDIA TYPE -TV,RA,ETC.                       
EZSNBND  DS    CL2                 BAND - AM,FM                                 
EZSNNAME DS    CL30                STATION NAME                                 
EZSNLIN1 DS    CL30                ADDRESS LINE 1                               
EZSNLIN2 DS    CL30                        LINE 2                               
EZSNLIN3 DS    CL30                        LINE 3                               
EZSNLIN4 DS    CL30                        LINE 4                               
EZSNSYS  DS    CL15                STATION COMPUTER SYSTEM                      
EZSNGST  DS    CL20                CANADIAN GST REGISTRATION NUMBER             
EZSNQST  DS    CL20                CANADIAN QST REGISTRATION NUMBER             
*                                                                               
EZSNDLEN EQU   *-EZSNFRST                                                       
         SPACE 2                                                                
*                      PAYEE HEADER (AT MODE EZINVP)                            
*                      ------------                                             
*                                **RECEIVED**                                   
EZPYFRST DS    0C                                                               
EZPYNAM  DS    CL30                PAYEE NAME                                   
EZPYLIN1 DS    CL30                ADDRESS LINE 1                               
EZPYLIN2 DS    CL30                        LINE 2                               
EZPYLIN3 DS    CL30                        LINE 3                               
EZPYLIN4 DS    CL30                        LINE 4                               
EZPYDLEN EQU   *-EZPYFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      AGENCY IDENTIFICATION (AT MODE EZINVP)                   
*                      ---------------------                                    
*                                **RECEIVED**                                   
EZAGFRST DS    0C                                                               
EZAGISID DS    CL8                 INDUSTRY STANDARD AGENCY CODE                
EZAGNAM  DS    CL30                AGENCY NAME                                  
EZAGLIN1 DS    CL30                ADDRESS LINE 1                               
EZAGLIN2 DS    CL30                        LINE 2                               
EZAGLIN3 DS    CL30                        LINE 3                               
EZAGLIN4 DS    CL30                        LINE 3                               
*                                                                               
EZAGDLEN EQU   *-EZAGFRST                                                       
         SPACE 2                                                                
*                      STANDARD COMMENT (TOP) (AT MODE EZINVP)                  
*                      ----------------------                                   
*                                **RECEIVED**                                   
EZSTFRST DS    0C                                                               
EZSTCOM  DS    CL130                                                            
         DS    4CL130              5 ALLTOGETHER                                
*                                                                               
EZSTDLEN EQU   *-EZSTFRST                                                       
EZSTCMN  EQU   (*-EZSTFRST)/L'EZSTCOM                                           
         SPACE 2                                                                
*                      STANDARD COMMENT (BOTTOM) (AT MODE EZINVP)               
*                      ----------------------                                   
*                                **RECEIVED**                                   
EZSBFRST DS    0C                                                               
EZSBCOM  DS    CL130                                                            
         DS    4CL130              5 ALLTOGETHER                                
*                                                                               
EZSBDLEN EQU   *-EZSBFRST                                                       
EZSBCMN  EQU   (*-EZSBFRST)/L'EZSBCOM                                           
         SPACE 2                                                                
*                    INVOICE HEADER (AT MODE EZINVP)                            
*                    --------------                                             
*                                                                               
*                                **RECEIVED**                                   
EZIHFRST DS    0C                                                               
EZIHCNVS DS    0CL12               CONVERSION STATUS (ADDED ON LOAD)            
EZIHCVST DS    XL1                   STATUS BYTE                                
*              X'80'                   STOP LEADING BLANK ELIMINATION           
EZIHCVQ  EQU   X'40'                   CONVERTED                                
EZIHRCVQ EQU   X'20'                   RECONVERT                                
EZIHCOVR EQU   X'10'                   CLIENT/PROD OVERRIDE                     
EZIHCDEL EQU   X'08'                   INVOICE IS DELETED                       
EZIHCCMB EQU   X'04'                   INVOICE WAS COMBINED WITH                
*                                      ANOTHER (MORE THAN 255)                  
EZIHREPI EQU   X'02'                   INVOICE WAS CONVERTED AS REP             
*                                                                               
EZIHCVDT DS    XL3                   DATE CONVERTED                             
EZIHCVAD DS    XL2                   CLIENT (MAY BE SET BEFORE CONVERT          
*                                    AS OVERRIDE TO LOOKUP)                     
EZIHCVPR DS    XL1                   PRODUCT (AS ABOVE)                         
EZIHCVP2 DS    XL1                   PRODUCT 2 (AS ABOVE)                       
EZIHCVES DS    XL1                   ESTIMATE (AS ABOVE)                        
EZIHLKST DS    XL1                   LOOK-UP STATUS                             
EZIHLANF EQU   X'80'                   SPOTPAK ADVERTISER NOT FOUND             
EZIHLPNF EQU   X'40'                   SPOTPAK PRODUCT(S) NOT FOUND             
EZIHLENF EQU   X'20'                   SPOTPAK ESTIMATE NOT FOUND               
EZIHSTAC EQU   X'10'                   STATION CALL LETTERS INVALID             
EZIHBRDT EQU   X'04'                   INV BROADCAST MONTH BAD                  
EZIHBDDT EQU   X'02'                   INV DATES ARE BAD (GARBAGE)              
EZIHLEDT EQU   X'01'                   INV DATES OUTSIDE ESTIMATE               
         SPACE                                                                  
EZIHSPRT DS   0XL1                   SPECIAL RATE OVERRIDE - NOT USED           
EZIHCVNP DS    XL1                   BINARY NET PACKAGE #                       
         SPACE                                                                  
*ZIHSPRT DS    XL1                   SPECIAL RATE OVERRIDE                      
EZIHCVND DS    XL1                   STATUS-STOP TRAILING BLK DEL               
EZIHREP  DS    CL25                REPRESENTATIVE                               
EZIHSLSP DS    CL25                SALESPERSON                                  
EZIHADVN DS    CL25                ADVERTISER (CLIENT) NAME                     
EZIHPRDN DS    CL25                PRODUCT NAME                                 
EZIHIDAT DS    CL6                 INVOICE DATE                                 
EZIHORD  DS    CL15                ORDER TYPE                                   
EZIHEST  DS    CL10                AGENCY ESTIMATE CODE                         
EZIHINV  DS    CL10                INVOICE NUMBER                               
EZIHMON  DS    CL4                 BROADCAST MONTH                              
EZIHISDT DS    CL6                 INVOICE PERIOD START DATE                    
EZIHIEDT DS    CL6                 INVOICE PERIOD END DATE                      
EZIHSDT  DS    CL6                 SCHEDULE START DATE                          
EZIHEDT  DS    CL6                 SCHEDULE END DATE                            
EZIHCSDT DS    CL6                 CONTRACT START DATE                          
EZIHCEDT DS    CL6                 CONTRACT END DATE                            
EZIHINST DS    CL25                BILLING INSTRUCTIONS                         
EZIHRC   DS    CL10                RATE CARD NUMBER                             
EZIHACF  DS    CL1                 AGENCY COMMISSION FLAG (Y,N)                 
EZIHSTP  DS    CL10                SALES TAX PERCENT  99V9999                   
EZIHAUDP DS    CL10                AUDIENCE PCT FOR SLS TX  999V99999           
EZIHRORD DS    CL10                REP CONTRACT/ORDER NUMBER                    
EZIHSORD DS    CL10                STATION CONTRACT/ORDER NUMBER                
EZIHSAID DS    CL8                 STATION ADVERTISER CODE                      
EZIHAAID DS    CL8                 AGENCY ADVERTISER CODE                       
EZIHSPID DS    CL8                 STATION PRODUCT CODE                         
EZIHAPID DS    CL8                 AGENCY PRODUCT CODE                          
EZIHACON DS    CL25                AGENCY CONTACT                               
EZIHSCON DS    CL25                STATION CONTACT                              
EZIHDUDT DS    CL6                 INVOICE DUE DATE                             
EZIHNET  DS    CL4                 CABLE HEAD NETWORK                           
EZIHTPTR DS    CL8                 TRADING PARTNER - S/B 8                      
EZIHDEAL DS    CL10                DEAL NUMBER                                  
EZIHNPKG DS    CL3                 NETWORK PACKAGE NUMBER (1-255)               
*                                  USED FOR COKE ACN NUMBER - 5 DIGITS          
*                                                                               
*                                **LOOKED UP**                                  
EZIHLADT DS    XL2                 BINARY CLT CODE FOR TRAFFIC LINKING          
EZIHLPRT DS    XL1                 BINARY PRD CODE FOR TRAFFIC LINKING          
*                                                                               
EZIHLADN DS    CL20                ADVERTISER (CLIENT) NAME                     
EZIHLADC DS    CL3                 CODE                                         
EZIHLADB DS    XL2                 BINARY                                       
EZIHLPRN DS    CL20                PRODUCT NAME                                 
EZIHLPRC DS    CL3                 CODE                                         
EZIHLPRB DS    XL1                 BINARY                                       
EZIHLP2N DS    CL20                PRODUCT NAME                                 
EZIHLP2C DS    CL3                 CODE                                         
EZIHLP2B DS    XL1                 BINARY                                       
EZIHLEST DS    XL1                 BINARY                                       
*                                                                               
*                                **CONVERTED**                                  
EZIHDIDT DS    CL8                 INVOICE DATE - MMMDD/YY                      
EZIHBIDT DS    XL3                              - BINARY                        
EZIHDSDT DS    CL8                 SCHED START  - MMMDD/YY                      
EZIHDEDT DS    CL8                 SCHED END    - MMMDD/YY                      
EZIHDISD DS    CL8                 INVOICE START- MMMDD/YY                      
EZIHDIED DS    CL8                 INVOICE END  - MMMDD/YY                      
EZIHDCSD DS    CL8                 CONTRACT ST  - MMMDD/YY                      
EZIHDCED DS    CL8                 CONTRACT END - MMMDD/YY                      
EZIHDMOS DS    CL6                 MONTH OF SVC - MMM/YY                        
EZIHBMOS DS    XL2                              - BINARY YYMM                   
EZIHCMST DS    XL2                 START OF MOS - COMPRESSED                    
EZIHCMEN DS    XL2                 END OF MOS   - COMPRESSED                    
EZIHBEST DS    XL1                 AGENCY ESTIMATE                              
EZIHBSTP DS    XL4                 SALES TAX PERCENT                            
EZIHBAUD DS    XL4                 AUDIENCE PERCENT                             
*                                                                               
EZIHCINV DS    CL10                COMBINED INVOICE NUMBER                      
         SPACE                                                                  
*                                  SOURCE IS REP ORDER OR STATION ORDER         
EZIHTRAF DS    CL10                TRAFFIC NUMBER - FOR REP ONLY                
*                                  THIS WAS USED TO GET CONTRACT NUMBER         
*                                                                               
*                                **TOTALS**                                     
         DS    0F                                                               
EZIHTOTS DS    0XL24                                                            
EZIHTCR  DS    F                   RECON CR'S                                   
EZIHTDR  DS    F                   RECON DB'S                                   
EZIHTSPC DS    F                   SPOT COST                                    
EZIHTSPN DS    F                   SPOT COUNT                                   
EZIHTSLC DS    F                   SCHED LINE COST                              
EZIHTSLN DS    F                   SCHED LINE COUNT                             
EZIHDLEN EQU   *-EZIHFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      INVOICE COMMENT (TOP) (AT MODE EZICCOMP)                 
*                      ---------------------                                    
*                                **RECEIVED**                                   
EZICFRST DS    0C                                                               
EZICCOM  DS    CL130               COMMENT                                      
*                                                                               
EZICDLEN EQU   *-EZICFRST                                                       
*                                                                               
*                                                                               
         SPACE 2                                                                
*                      SCHEDULE LINE (AT MODE EZSCHP)                           
*                      -------------                                            
*                                **RECEIVED**                                   
EZSLFRST DS    0C                                                               
EZSLLIN  DS    CL3                 LINE NUMBER                                  
EZSLDAYS DS    CL7                 DAYS OF WEEK                                 
EZSLSTIM DS    CL4                 START TIME HHMM - MILITARY                   
EZSLETIM DS    CL4                 END TIME HHMM - MILITARY                     
EZSLRDET DS    CL3                 RATE DETAIL                                  
EZSLRATE DS    CL10                RATE                                         
EZSLNTMS DS    CL3                 NUMBER OF TIMES THIS MONTH                   
EZSLSDT  DS    CL6                 LINE START DATE                              
EZSLEDT  DS    CL6                 LINE END DATE                                
EZSLPLAN DS    CL10                PLAN CODE                                    
*                                                                               
*                                **CONVERTED**                                  
EZSLBDYS DS    XL1                 DAYS OF WEEK- (MON = X'40')                  
EZSLDDYS DS    CL8                 DAYS OF WEEK- (CODAY OUTPUT)                 
EZSLBSTM DS    XL2                 START TIME BINARY                            
EZSLBETM DS    XL2                 END TIME BINARY                              
EZSLDTIM DS    CL11                START-END TIME DISPLAY                       
EZSLBRAT DS    XL4                 RATE                                         
EZSLBTMS DS    XL2                 TIMES PER MONTH                              
*                                                                               
*                                **TOTALS**                                     
         DS    0F                                                               
EZSLTOTS DS    0XL8                                                             
EZSLTCR  DS    F                   RECON CREDIT                                 
EZSLTDR  DS    F                   RECON DEBIT                                  
EZSLTSPC DS    F                   SPOT COST                                    
EZSLTSPN DS    F                   SPOT COUNT                                   
EZSLDLEN EQU   *-EZSLFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      SCHEDULE LINE COMMENT (AT MODE EZSCOMP)                  
*                      ---------------------                                    
*                                **RECEIVED**                                   
EZSCFRST DS    0C                                                               
EZSCCOM  DS    CL130               COMMENT                                      
*                                                                               
EZSCDLEN EQU   *-EZSCFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      BROADCAST SPOT DETAIL (AT MODE EZSPTP)                   
*                      ---------------------                                    
*                                **RECEIVED**                                   
EZSPFRST DS    0C                                                               
EZSPRUN  DS    CL1                 Y=SPOT RAN, N=DID NOT RUN                    
EZSPDATE DS    CL6                 DATE                                         
EZSPDAY  DS    CL1                 DAY OF WEEK (1=MONDAY, 7=SUNDAY)             
EZSPTIM  DS    CL4                 HHMM MILITARY                                
EZSPTYP  DS    CL3                 TYPE (SPOT LENGTH)                           
EZSPCOPY DS    CL30                COPY CODE (COMMERCIALS)                      
EZSPRATE DS    CL10                RATE                                         
EZSPCLS  DS    CL3                 CLASS                                        
EZSPPGB  DS    CL6                 PIGGYBACK (SECONDS SPLIT - N(3)N(3)          
EZSPMGD1 DS    CL6                 MAKE GOOD DATE                               
EZSPMGD2 DS    CL6                 MAKE GOOD DATE 2                             
EZSPMGT1 DS    CL4                 MAKE GOOD TIME                               
EZSPMGT2 DS    CL4                 MAKE GOOD TIME 2                             
EZSPMGLN DS    CL3                 MAKE GOOD LINE NUMBER                        
EZSPADR  DS    CL10                ADJUSTMENT AMOUNT - DR                       
EZSPACR  DS    CL10                ADJUSTMENT AMOUNT - CR                       
EZSPPRGN DS    CL40                PROGRAM NAME FROM 51 RECORD                  
EZSPBINT DS    XL4                 NETWORK INTEGRATION CHARGE                   
EZSPBBI  DS    CL1                 BILLBOARD INDICATOR                          
EZSPBBLN DS    CL3                 LENGTH IN SECONDS                            
EZSPVCID DS    CL30                VIDEO COPY ID                                
EZSPACID DS    CL30                AUDIO COPY ID                                
EZSPTIMT DS    CL5                 HHMM MILITARY                                
EZSPNINT DS    CL10                NETWORK INTEGRATION CHARGE                   
EZSPACML DS    CL8                 ADDED COMMERCIAL                             
*                                                                               
EZSPPKG  DS    CL3                 PACKAGE FIELD                                
EZSPBPKG DS    CL1                 BINARY PACKAGE FIELD                         
*                                                                               
         DS    CL8                 SPARE                                        
EZSPCNOM DS    CL1                 COMML NO MATCH FLAG (N- CMLS)                
*                                                                               
*                                **LOOKED UP**                                  
EZSPLCM1 DS    XL3                 COMMERCIAL SEQ  NUMBER (1)                   
EZSPLCM2 DS    XL3                 COMMERCIAL SEQ  NUMBER (2)                   
EZSPLPN1 DS    CL20                PRODUCT NAME (1)                             
EZSPLPC1 DS    CL3                 CODE                                         
EZSPLPB1 DS    XL1                 BINARY                                       
EZSPLPN2 DS    CL20                PRODUCT NAME (2)                             
EZSPLPC2 DS    CL3                 CODE                                         
EZSPLPB2 DS    XL1                 BINARY                                       
*                                                                               
EZSPNET  DS    CL3                 LOCAL CABLE NET                              
EZSPSER  DS    CL1                 SERIAL - WILL HAVE TO BE EXPANDED            
*                                   TO 12 IF USED                               
*                                                                               
*                                **CONVERTED**                                  
EZSPDMD1 DS    CL8                 MAKEGOOD DATE 1                              
EZSPDMD2 DS    CL8                 MAKEGOOD DATE 2                              
EZSPDDT  DS    CL8                 DATE - MMMDD/YY                              
EZSPCDT  DS    XL2                      - COMPRESSED                            
EZSPBDAY DS    XL1                 DAY OF WEEK- (MON = X'40')                   
EZSPDDAY DS    CL3                 DAY OF WEEK- DISPLAY                         
EZSPBTIM DS    XL2                 TIME - MILITARY                              
EZSPDTIM DS    CL5                 TIME - HHMMA                                 
EZSPBSLN DS    XL1                 SPOT LENGTH                                  
EZSPPIG  DS    CL1                 PIGGYBACK (Y,N)                              
EZSPBPG1 DS    XL1                 1ST PIGGY LENGTH                             
EZSPBPG2 DS    XL1                 2ND PIGGY LENGTH                             
EZSPBRAT DS    XL4                 RATE                                         
EZSPBDR  DS    XL4                 ADJSUTMENT -DR                               
EZSPBCR  DS    XL4                 ADJUSTMENT -CR                               
EZSPCML1 DS    CL8                 1ST COMMERCIAL                               
EZSPCML2 DS    CL8                 2ND COMMERCIAL                               
EZSPPRD1 DS    CL1                 1ST PRODUCT **DUMMY FIELD**                  
EZSPPRD2 DS    CL1                 2ND PRODUCT **DUMMY FIELD**                  
EZSPDMTM DS    CL11                MAKEGOOD TIMES                               
*                                                                               
EZSPNETB DS    XL1                 CABLE NET BYTE FROM STAPACK                  
EZSPNETH DS    XL1                 CABLE NET BYTE FROM STAPACK                  
*                                  FROM 31 - INVOICE HEADER                     
         DS    CL1                 SPARE                                        
EZSPLKST DS    XL1                   LOOK-UP STATUS                             
EZSPBDDL EQU   X'80'                   SPOT DETAIL - BAD DOLLAR FLD             
EZSPBDTM EQU   X'40'                   SPOT DETAIL - BAD TIME FIELD             
EZSPADID EQU   X'20'                   SPOT DETAIL - BAD TIME FIELD             
*                                                                               
EZSPDLEN EQU   *-EZSPFRST                                                       
*                                                                               
* INVOICE HEADER EXTENTION                                                      
* MAKE SURE TO PROCESS ALONG WITH EZIHFRST                                      
*                                                                               
EZIHEXT  DS    0X                                                               
*                                                                               
EZIHSAV  DS    0CL12               SECOND SAVE FIELD                            
EZIHSREP DS    CL3                 OVERRIDE REP ID                              
EZIHSPRD DS    CL3                 OVERRIDE 3-CHAR PRODUCT                      
EZIHSPR2 DS    CL3                 OVERRIDE 3-CHAR PRODUCT 2                    
EZIHSVER DS    CL1                 INVOICE VERSION NUMBER                       
         DS    CL2                 RESERVED FOR FUTURE USE - NOT SPARE          
*                                                                               
EZIHREPC DS    CL3                 SENT REP ID                                  
EZIHLREP DS    CL3                 LOOKED UP REP                                
EZIHBPKG DS    X                   NETWORK PACKAGE - BINARY                     
EZIHFLG  DS    X                   INVOICE HEADER FLAG                          
EZIHINTQ EQU   X'80'               INVOICE IS INTEGRATION ONLY                  
EZIHIPQ  EQU   X'40'               AT LEAST ONE SPOT HAS INTEGRATION            
*                                                                               
EZIHEXTL EQU   *-EZIHEXT                                                        
*                                                                               
         SPACE 2                                                                
*                            RECONCILIATION REMARK (AT MODE EZRECP)             
*                            ---------------------                              
*                                **RECEIVED**                                   
EZRRFRST DS    0C                                                               
EZRRREM  DS    CL20                REMARKS                                      
*                                                                               
EZRRDLEN EQU   *-EZRRFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      INVOICE COMMENT (BOTTOM) (AT MODE EZRECP)                
*                      ------------------------                                 
*                                **RECEIVED**                                   
EZIBFRST DS    0C                                                               
EZIBCOM  DS    CL130               COMMENT                                      
*                                                                               
EZIBDLEN EQU   *-EZIBFRST                                                       
         SPACE 2                                                                
*                      INVOICE TOTALS (AT MODE EZINVL)                          
*                      --------------                                           
*                                **RECEIVED**                                   
EZITFRST DS    0H                                                               
EZITSCH  DS    CL11                MONTHLY COST/SCHEDULE                        
EZITACT  DS    CL11                MONTHLY COST/ACTUAL                          
EZITAGC  DS    CL11                AGENCY COMMISSION                            
EZITDUE  DS    CL11                NET DUE                                      
EZITRDR  DS    CL11                RECONCILIATION -DR                           
EZITRCR  DS    CL11                               -CR                           
EZITRTO  DS    CL11                               -TOTAL                        
EZITSTX  DS    CL11                STATE TAX                                    
EZITLTX  DS    CL11                LOCAL TAX                                    
EZITPGR  DS    CL11                PRIOR BALANCE - GROSS                        
EZITPNT  DS    CL11                PRIOR BALANCE - NET                          
EZITSPC  DS    CL5                 NUMBER OF SPOTS                              
EZITGST  DS    CL11                GST - CANADA                                 
EZITPST  DS    CL11                PST - CANADA                                 
*                                                                               
*                                **CONVERTED**                                  
         DS    0F                                                               
EZITBSCH DS    XL4                 MONTHLY COST/ORDERED                         
EZITBACT DS    XL4                 MONTHLY COST/ACTUAL                          
EZITBAGC DS    XL4                 AGENCY COMMISSION                            
EZITBDUE DS    XL4                 NET DUE                                      
EZITBRDR DS    XL4                 RECONCILIATION -DR                           
EZITBRCR DS    XL4                                -CR                           
EZITBRTO DS    XL4                                -TOTAL                        
EZITBSTX DS    XL4                 STATE TAX                                    
EZITBLTX DS    XL4                 LOCAL TAX                                    
EZITBPGR DS    XL4                 PRIOR BALANCE - GROSS                        
EZITBPNT DS    XL4                 PRIOR BALANCE - NET                          
EZITBSPC DS    XL4                 SPOT COUNT                                   
EZITBGST DS    XL4                 GST - CANADA                                 
EZITBPST DS    XL4                 PST - CANADA                                 
*                                                                               
         DS    CL4                 SPARE                                        
EZITDLEN EQU   *-EZITFRST                                                       
*                                                                               
         DS    0D                                                               
EZWKA    DS    XL200               EZMOD SAVED WORK AREA                        
*                                                                               
EZORDSTR DS    C                   ORDER NUMBER STRIP FLAG                      
*                                                                               
         DS    XL7                 SPARE                                        
*                                                                               
EZBLKX   DS    0X                  EZBLOCK EXTENTION                            
*                                                                               
*                                                                               
* INVOICE HEADER EXTENTION 2 - 500 BYTES                                        
* MAKE SURE TO PROCESS ALONG WITH EZIHFRST                                      
*                                                                               
EZIHEX2  DS    0X                  500 BYTES                                    
EZIHREFN DS    CL10                INVOICE BEING REPLACED                       
EZIHREFC DS    CL2                 VERSION BEING REPLACED                       
EZIHVERC DS    CL2                 CURRENT INV VERSION                          
EZIHNLOC DS    CL2                 NATIONAL/LOCAL                               
EZIHPREP DS    CL3                 PAYING REP - SENT                            
EZIHRTYP DS    CL1                 REP INVOICE TYPE X'00'/C'R'/C'S'             
         DS    XL480               SPARE                                        
EZIHEX2L EQU   *-EZIHEX2                                                        
*                                                                               
*                                                                               
*                      IDB RECORD (IM AGY NAME/ADDR INFORMATION)                
*                      ------------------------                                 
*                                **RECEIVED**                                   
EZIMFRST DS    0C                                                               
EZIMNAM  DS    CL25                                                             
EZIMADR  DS    CL18                                                             
         DS    CL100             SPARE                                          
*                                                                               
EZIMLEN  EQU   *-EZIMFRST                                                       
*                                                                               
         DS    XL1405              SPARE                                        
*                                                                               
EZBLKXLQ EQU   *-EZBLKX            EZBLOCK EXTENTION LENGTH                     
*                                                                               
EZBLOCKL EQU   *-EZBLOCKD          LENGTH IS OVER 4K NOW                        
*                                                                               
*                                                                               
*                                  RECORD CODE EQUATES                          
*                                  -------------------                          
EZAGEQ   EQU   X'21'               AGENCY                                       
EZSNEQ   EQU   X'22'               STATION                                      
EZPYEQ   EQU   X'23'               PAYEE                                        
EZSTEQ   EQU   X'24'               STANDARD COMMENT (TOP)                       
EZSBEQ   EQU   X'25'               STANDARD COMMENT (BOTTOM)                    
EZIHEQ   EQU   X'31'               INVOICE HEADER                               
EZICEQ   EQU   X'32'               INVOICE COMMENT (TOP)                        
EZSLEQ   EQU   X'41'               SCHEDULE LINE                                
EZSCEQ   EQU   X'42'               SCHEDULE LINE COMMENT                        
EZSPEQ   EQU   X'51'               SPOT DETAIL                                  
EZRREQ   EQU   X'52'               RECONCILIATION                               
EZIBEQ   EQU   X'33'               INVOICE COMMENT (BOTTOM)                     
EZITEQ   EQU   X'34'               INVOICE TOTAL                                
EZBTEQ   EQU   X'12'               BATCH TOTAL                                  
         SPACE 3                                                                
*                                  ERROR CODE EQUATES                           
*                                  -------------------                          
EZERRMIS EQU   X'01'               MISSING FIELD                                
EZERRINV EQU   X'02'               INVALID DATA                                 
EZERRRNF EQU   X'03'               RECORD NOT FOUND                             
EZERRPRD EQU   X'04'               PRODUCT INCONSISTENCY                        
EZERRPIG EQU   X'05'               PIGGYBACK ERROR                              
EZERRCPR EQU   X'06'               PRD/CMML INCONSISTENCY                       
EZERROMN EQU   X'07'               OUT OF MONTH ERROR                           
EZERRFLN EQU   X'08'               FIELD TOO LONG- TRUNCATED                    
EZERRSCO EQU   X'09'               STANDARD COMMENT OVERFLOW                    
EZERRRTP EQU   X'0A'               INVALID RECORD TYPE                          
EZERRSCD EQU   X'0B'               INVALID SPOTPAK CLT/PRD CODE                 
EZERRSPL EQU   X'0C'               SPOT DETAIL SPOT LEN ZERO                    
EZERDMGR EQU   X'0D'               DATA MGR ERROR                               
EZERFILM EQU   X'0E'               INVALID COMMERCIAL CODE                      
EZERREP  EQU   X'0F'               INVALID REP ID                               
*                                                                               
*                                  SET BY EZADDINV                              
*                                  (REASONS FOR NON-CONVERSION)                 
*                                                                               
EZERRDUP EQU   X'11'               INVOICE ON FILE                              
EZERROVF EQU   X'12'               INVOICE OVERFLOW                             
EZERRANF EQU   X'13'               ADVERTISER NOT ON FILE                       
EZERRPNF EQU   X'14'               INVOICE PRODUCT NOT ON FILE                  
EZERRMUL EQU   X'15'               CAN'T RECONVERT COMBINED INVOICES            
EZERRZER EQU   X'16'               COKE ONLY - DON'T CONVERT ZERO INV           
EZERRTMZ EQU   X'17'               SPOT DETAIL TIME BAD                         
EZERRDTE EQU   X'18'               SPOT DETAIL DATE OUT OF RANGE                
EZERRENF EQU   X'19'               ESTIMATE NOT ON SPOT FILE                    
EZERREDT EQU   X'1A'               INVOICES DATES NOT VALID FOR EST             
EZERRTMH EQU   X'1B'               SPOT DETAIL TIME HIGH                        
EZERRDOL EQU   X'1C'               SPOT DETAIL BAD DOLLAR FIELDS                
EZERBDDT EQU   X'1D'               BAD DATE                                     
EZERBRDT EQU   X'1E'               BROADCAST MONTH IS BAD                       
EZERRSTA EQU   X'1F'               STATION CALL LETTERS BAD                     
EZERRSIZ EQU   X'20'               SOON - INVOICE TOO BIG                       
EZERRCON EQU   X'21'               REP CONTRACT # NOT FOUND                     
EZERRTIM EQU   X'22'               SPOT DETAIL BAD TIME FIELD                   
EZERRBDS EQU   X'23'               REP CONTRACT - WRONG STATION                 
EZERRNUM EQU   X'24'               NO INVOICE NUMBER                            
EZERRCML EQU   X'25'               MISSING COMMERCIAL RECORD                    
EZERMCLT EQU   X'26'               CLIENT CODE MISSING                          
EZERMPRD EQU   X'27'               PRODUCT CODE MISSING                         
EZERINVN EQU   X'28'               INVOICE NAME INVALID                         
EZERADVN EQU   X'29'               ADVERTISER NAME MISSING                      
EZERRBDD EQU   X'30'               ADVERTISER NAME MISSING                      
*                                                                               
*                                  ERROR LEVEL EQUATES                          
*                                  -------------------                          
EZERLBAT EQU   X'80'               BATCH NO GOOD                                
EZERLINV EQU   X'40'               INVOICE NO GOOD                              
*                                                                               
*                                  RECORD DESCRIPTOR DSECT                      
*                                  -----------------------                      
EZRDD    DSECT                                                                  
EZRDRCD  DS    CL2                 RECORD CODE                                  
EZRDRCQ  DS    CL1                 RECORD CODE - INTERNAL                       
EZRDFRST DS    AL3                 FIRST FIELD                                  
EZRDNAM  DS    CL20                NAME OF RECORD                               
EZRDDL   EQU   *-EZRDD                                                          
         SPACE 3                                                                
*                                  FIELD DESCRIPTOR DSECT                       
*                                  ----------------------                       
EZFDD    DSECT                                                                  
EZFDLEN  DS    CL1                 MAX LENGTH FOR RECEIVED DATA                 
EZFDDSP  DS    SL2                 DISPLACEMENT INTO EZBLKD                     
EZFDNAM  DS    CL20                NAME OF FIELD                                
EZFDDL   EQU   *-EZFDD                                                          
*                                                                               
LOCTENTQ EQU   20000               NO OF ENTRIES IN LOCTAB                      
*                                                                               
LOCTBD   DSECT                     DSECT FOR LOCAL STA TAB ENTRY                
LOCTPOW  DS    CL2                 POWER CODE                                   
LOCTSIGN DS    CL4                 STATION SIGNON                               
LOCTID   DS    XL2                 USER ID                                      
LOCTBDLQ EQU   *-LOCTBD                                                         
*                                                                               
