*          DATA SET EZLKAGYBLK AT LEVEL 175 AS OF 07/25/13                      
LKAGYBLK DS    0XL(LKAGYBLQ)                                                    
LKAGYBL1 DS    0X                  FOR LENGTH EQU CALCULATION                   
*                                                                               
LKAGYBID DS    XL2                                                              
LKAGYUID DS    CL10                                                             
LKAGYAGY DS    CL2                                                              
LKAGYCTR DS    C                                                                
*                                                                               
LKAGYBLQ EQU   *-LKAGYBL1                                                       
