*          DATA SET FAADRRECX  AT LEVEL 002 AS OF 09/09/92                      
ADRRECD  DSECT                     ***** DATA RECORDER RECORD *****             
*                                                                               
ADRREC   DS    0CL38                                                            
*                                                                               
ADRLINE  DS    CL4                 LINE ID                                      
ADRADDR  DS    CL4                 TERMINAL ADDRESS                             
ADROVSYS DS    C                   SYS NUMBER FOR OVERLAY CALLS                 
ADRSYSNO DS    C                   SYSTEM NUMBER                                
ADRPRGNO DS    C                   PROGRAM NUMBER                               
ADRTASK  DS    C                   PROCESSING TASK ID                           
ADRSIN   DS    F                   SYSTEM INPUT NUMBER                          
*                                                                               
ADRSTTM  DS    F                   PROCESSING START TIME (TU)                   
ADRNDTM  DS    F                   PROCESSING END TIME (TU)                     
ADRCPUTM DS    F                   ELAPSED CPU TIME (TU)                        
ADRQTM   DS    H                   ELAPSED INPUT QUEUE TIME(TU)                 
*                                                                               
ADRMSGI  DS    H                   INPUT MESSAGE LENGTH                         
*                                  X'80' INDICATES UPDATIVE TRANSACTION         
ADRMSGO  DS    H                   OUTPUT MESSAGE LENGTH                        
*                                  X'80' INDICATES OUTPUT MSG QUEUED            
ADRIOCNT DS    H                   I/O COUNTER                                  
ADROVCNT DS    H                   CALL OVERLAY COUNTER                         
