*          DATA SET FAASIDD    AT LEVEL 002 AS OF 11/14/00                      
FAASIDD  DSECT                                                                  
FAASNAME DS    CL8               MVS JOBNAME                                    
FAASASID DS    XL4               ASID ID                                        
FAASTOR  DS    CL1               TOR/AOR IDENTIFIER (C'N' = AOR)                
FAASAORN DS    CL1               AOR IDENTIFIER                                 
