*          DATA SET FACIDTABD  AT LEVEL 003 AS OF 12/19/18                      
FACIDD   DSECT ,                   DSECT FOR FACPAK ID TABLE BY DSPACE          
FACIDSPC DS    CL1                 DSPACE ID CHARACTER                          
         DS    XL3                 N/D                                          
FACAID   DS    A                   A(FACPAK ID TABLE FOR THIS DSPACE)           
FACIDLNQ EQU   *-FACIDD                                                         
                                                                                
FACITABD DSECT ,                   DSECT TO COVER FACPAK ID TABLE               
FACITAB  DS    0XL8                FACPAK IDENTIFICATION TABLE ENTRY            
FACISN4  DS    CL4                 FACPAK FOUR CHR SYSTEM NAME                  
FACIID   DS    XL1                 FACPAK INTERNAL ID NUMBER                    
*&&UK                                                                           
FAC#TTS  EQU   03                  FACPAK TTS ID NUMBER                         
FAC#TST  EQU   01                  FACPAK TST ID NUMBER                         
FAC#FQA  EQU   13                  FACPAK FQA ID NUMBER                         
FAC#CSC  EQU   11                  FACPAK CSC ID NUMBER                         
FAC#NEW  EQU   05                  FACPAK NEW ID NUMBER                         
FAC#IPT  EQU   07                  FACPAK IPT ID NUMBER                         
FAC#BAR  EQU   09                  FACPAK BAR ID NUMBER                         
*&&                                                                             
*&&US                                                                           
FAC#TTS  EQU   06                  FACPAK MEL ID NUMBER                         
FAC#TST  EQU   01                  FACPAK TST ID NUMBER                         
FAC#FQA  EQU   15                  FACPAK FQA ID NUMBER                         
FAC#CSC  EQU   11                  FACPAK CSC ID NUMBER                         
FAC#NEW  EQU   00                  FACPAK ... ID NUMBER                         
FAC#IPT  EQU   00                  FACPAK ... ID NUMBER                         
FAC#BAR  EQU   00                  FACPAK ... ID NUMBER                         
*&&                                                                             
FACIFL   DS    XL1                 FACPAK FLAGS                                 
FACITST  EQU   X'80'               FACPAK TEST SYSTEM                           
FACIRST  EQU   X'40'               FACPAK ALLOW RESTART FROM YESTERDAY          
FACIREP  EQU   X'20'               FACPAK REP SYSTEM                            
FACICSC  EQU   X'08'               FACPAK CSC SYSTEM                            
FACIFQA  EQU   X'04'               FACPAK FQA SYSTEM                            
*                                                                               
FACICH   DS    CL1                 FACPAK MESSAGE CHR                           
FACISN1  DS    CL1                 FACPAK ONE CHR SYSTEM NAME                   
FACITLNQ EQU   *-FACITABD                                                       
