*          DATA SET FACISTABX  AT LEVEL 003 AS OF 05/21/96                      
FACIDTAB DS    0CL8                                                             
*&&US                                                                           
         DC    C'????',AL1(0),X'80',C'/',C'?'                                   
         DC    C'TST ',AL1(1),X'80',C'#',C'T'                                   
         DC    C'ADV1',AL1(2),X'00',C'/',C'1'                                   
         DC    C'ADV5',AL1(3),X'00',C'/',C'5'                                   
         DC    C'REPA',AL1(4),X'20',C'/',C'A'                                   
         DC    C'ADV2',AL1(5),X'00',C'/',C'2'                                   
         DC    C'MEL ',AL1(6),X'80',C'>',C'M'                                   
         DC    C'ADV3',AL1(7),X'00',C'/',C'3'                                   
         DC    C'ADV4',AL1(8),X'00',C'/',C'4'                                   
         DC    C'REPC',AL1(9),X'20',C'/',C'C'                                   
         DC    C'ADV6',AL1(10),X'00',C'/',C'6'                                  
         DC    C'FRED',AL1(11),X'80',C'<',C'F'                                  
         DC    C'ADV7',AL1(12),X'00',C'/',C'7'                                  
         DC    C'DARE',AL1(13),X'80',C'<',C'D'                                  
         DC    C'REPB',AL1(14),X'20',C'/',C'B'                                  
         DC    5X'FF',X'80',C'?',C'?'                                           
FACIDMAX EQU   14                                                               
*&&                                                                             
*&&UK                                                                           
         DC    C'????',AL1(0),X'80',C'?',C'?'                                   
         DC    C'TST ',AL1(1),X'80',C'#',C'T'                                   
         DC    C'ADV1',AL1(2),X'00',C'/',C'1'                                   
         DC    C'TTS ',AL1(3),X'80',C'>',C'S'                                   
         DC    C'ADV2',AL1(4),X'00',C'/',C'2'                                   
         DC    C'NEW ',AL1(5),X'80',C'<',C'N'                                   
         DC    C'ADV3',AL1(6),X'00',C'/',C'3'                                   
         DC    C'????',AL1(7),X'80',C'?',C'?'                                   
         DC    C'ADV4',AL1(8),X'00',C'/',C'4'                                   
         DC    C'JIM ',AL1(9),X'80',C'>',C'J'                                   
         DC    5X'FF',X'80',C'?',C'?'                                           
FACIDMAX EQU   9                                                                
*&&                                                                             
