*          DATA SET FACOMTABD  AT LEVEL 008 AS OF 10/06/16                      
***********************************************************************         
* DSECT TO CONVER FACOMTAB - COMMANDS TO ISSUE TO SYSTEMS / FILES               
***********************************************************************         
FACOMMD  DSECT                                                                  
FACOMAND DS    CL8                 COMMAND                                      
FACOACT# DS    AL2                 COMMAND ACTION NUMBER                        
FACOMINL DS    AL1                 COMMAND MINIMUM LENGTH                       
FACOFLAG DS    XL1                 CONTROL FLAGS                                
FACOADV  EQU   X'80'               .  ADV  RELATED COMMAND                      
FACOFIL  EQU   X'40'               .  FILE RELATED COMMAND                      
FACORSN  EQU   X'20'               .  RESORCE NAME REQUIRED                     
FACONSE  EQU   X'10'               .  NOT SE SYSTEM COMMAND                     
FACOMNTN EQU   X'08'               .  MNTN??? ONLY                              
FACOSYPG EQU   X'04'               .  SYS/PRG                                   
         DS    XL4                 SPARE                                        
FACOMLNQ EQU   *-FACOMMD                                                        
