*          DATA SET FACTRYTAB  AT LEVEL 005 AS OF 12/06/18                      
         CNOP  2,4                                                              
CTRYTAB  DC    AL2(CTRYTAB1-CTRYTAB0)                                           
         DC    A(CTRYTABX-1)                                                    
*&&UK                                                                           
CTRYTAB0 DC    AL1(00,00,00),X'80',AL1(0),C'L+',AL1(00),XL5'00'                 
         DC    CL3'GBP'                                                         
         DC    CL6'GBR   ',CL11'GT BRITAIN ',CL11'           '                  
         DC    CL6'UK    ',CL11'GT BRITAIN ',CL11'           '                  
*&&                                                                             
*&&US                                                                           
CTRYTAB0 DC    AL1(00,00,00),X'80',AL1(0),C'L+',AL1(00),XL5'00'                 
         DC    CL3'USD'                                                         
         DC    CL6'USA   ',CL11'USA        ',CL11'           '                  
         DC    CL6'USA   ',CL11'USA        ',CL11'           '                  
*&&                                                                             
CTRYTAB1 DC    AL1(01,00,00),X'80',AL1(0),C'L+',AL1(00),XL5'00'                 
         DC    CL3'GBP'                                                         
         DC    CL6'GBR   ',CL11'GT BRITAIN ',CL11'           '                  
         DC    CL6'UK    ',CL11'GT BRITAIN ',CL11'           '                  
*                                                                               
         DC    AL1(02,00,00),X'80',AL1(0),C'L-',AL1(05),XL5'00'                 
         DC    CL3'USD'                                                         
         DC    CL6'USA   ',CL11'USA        ',CL11'           '                  
         DC    CL6'USA   ',CL11'USA        ',CL11'           '                  
*                                                                               
         DC    AL1(03,00,03),X'80',AL1(0),C'L+',AL1(01),XL5'00'                 
         DC    CL3'DEM'                                                         
         DC    CL6'GER   ',CL11'GERMANY    ',CL11'           '                  
         DC    CL6'DEU   ',CL11'DEUTSCHLAND',CL11'           '                  
*                                                                               
         DC    AL1(04,00,04),X'80',AL1(0),C'L+',AL1(01),XL5'00'                 
         DC    CL3'FRF'                                                         
         DC    CL6'FRA   ',CL11'FRANCE     ',CL11'           '                  
         DC    CL6'FRA   ',CL11'LA FRANCE  ',CL11'           '                  
*                                                                               
         DC    AL1(05,00,05),X'80',AL1(0),C'L+',AL1(00),XL5'00'                 
         DC    CL3'PTS'                                                         
         DC    CL6'SPA   ',CL11'SPAIN      ',CL11'           '                  
         DC    CL6'ESP   ',CL11'ESPANA     ',CL11'           '                  
*                                                                               
         DC    AL1(06,00,06),X'80',AL1(0),C'L+',AL1(01),XL5'00'                 
         DC    CL3'LIT'                                                         
         DC    CL6'ITA   ',CL11'ITALY      ',CL11'           '                  
         DC    CL6'ITA   ',CL11'ITALIA     ',CL11'           '                  
*                                                                               
         DC    AL1(07,00,07),X'80',AL1(0),C'L+',AL1(01),XL5'00'                 
         DC    CL3'NLG'                                                         
         DC    CL6'HOL   ',CL11'HOLLAND    ',CL11'           '                  
         DC    CL6'NED   ',CL11'NEDERLAND  ',CL11'           '                  
*                                                                               
         DC    AL1(08,00,00),X'80',AL1(0),C'L-',AL1(05),XL5'00'                 
         DC    CL3'CAD'                                                         
         DC    CL6'CAN   ',CL11'CANADA     ',CL11'           '                  
         DC    CL6'CAN   ',CL11'CANADA     ',CL11'           '                  
*                                                                               
         DC    AL1(09,00,00),X'80',AL1(0),C'L+',AL1(00),XL5'00'                 
         DC    CL3'IEP'                                                         
         DC    CL6'IRL   ',CL11'IRELAND    ',CL11'           '                  
         DC    CL6'EIR   ',CL11'EIRE       ',CL11'           '                  
*                                                                               
         DC    AL1(10,00,00),X'80',AL1(0),C'L+',AL1(00),XL5'00'                 
         DC    CL3'GBP'                                                         
         DC    CL6'SCA   ',CL11'SCANDINAVIA',CL11'           '                  
         DC    CL6'SCA   ',CL11'SCANDINAVIA',CL11'           '                  
*                                                                               
         DC    AL1(11,00,00),X'80',AL1(0),C'L+',AL1(11),XL5'00'                 
         DC    CL3'AUD'                                                         
         DC    CL6'AUS   ',CL11'AUSTRALIA  ',CL11'           '                  
         DC    CL6'AUS   ',CL11'AUSTRALIA  ',CL11'           '                  
*                                                                               
         DC    AL1(12,00,00),X'80',AL1(0),C'L+',AL1(05),XL5'00'                 
         DC    CL3'INR'                                                         
         DC    CL6'IND   ',CL11'INDIA      ',CL11'           '                  
         DC    CL6'IND   ',CL11'INDIA      ',CL11'           '                  
*                                                                               
CTRYTABX DC    X'FFFFFFFF'                                                      
