*          DATA SET FACTRY     AT LEVEL 001 AS OF 12/05/86                      
CTRYTABD DSECT                     COUNTRY TABLE                                
*                                  -------------                                
CTRYCODE DS    X                   COUNTRY CODE                                 
CTRYCTRY DS    X                   COUNTRY COUNTRY CODE                         
CTRYLANG DS    X                   COUNTRY LANGUAGE CODE                        
*                                                                               
CTRYTYPE DS    X                   COUNTRY TYPE                                 
CTRYTYCO EQU   X'80'               COUNTRY TYPE IS COUNTRY                      
CTRYTYTO EQU   X'40'               COUNTRY TYPE IS TOWN                         
*                                                                               
CTRYLAN2 DS    X                   COUNTRY SECOND LANGUAGE                      
CTRYTIMC DS    C                   COUNTRY TIME CODE L=LOCAL,G=GMT              
CTRYTIMS DS    C                   COUNTRY TIME SIGN + OR -                     
CTRYTIMD DS    X                   COUNTRY TIME DIFFERENCE HOURS                
*                                                                               
CTRYFLG1 DS    X                   FLAG BYTE 1                                  
         DS    XL4                 SPARE                                        
*                                                                               
CTRYCURR DS    CL3                 COUNTRY CURRENCY                             
*                                                                               
CTRYSHR  DS    CL6        ENGLISH..SHORT NAME CCCTTT CCC=CTRY,TTT=TOWN          
CTRYNAM  DS    CL11                COUNTRY NAME                                 
CTRYTWN  DS    CL11                TOWN NAME                                    
*                                                                               
CTRYSHRN DS    CL6        NATIVE...SHORT NAME CCCTTT CCC=CTRY,TTT=TOWN          
CTRYNAMN DS    CL11                COUNTRY NAME                                 
CTRYTWNN DS    CL11                TOWN NAME                                    
*                                                                               
CTRYTABL EQU   *-CTRYTABD          COUNTRY TABLE ENTRY LENGTH                   
