*          DATA SET FADICTTAB  AT LEVEL 006 AS OF 04/30/93                      
**********************************************************************          
* DATA DICTIONARY INDEX FOR UK                                       *          
* ONE ROW PER SYSTEM (00-15) AND ONE COLUMN PER LANGUAGE (0-7)       *          
* ALL ZERO ENTRY MEANS NO DICTIONARY DEFINED FOR SYS/LANG            *          
* IF DICTIONARY DEFINED 1ST BYTE IS X'SL' FOR PHASE T00ASL           *          
* FIRST REFERENCE CAUSES LOAD FROM DISK AND FIXES CORE ADDR IN ENTRY *          
**********************************************************************          
*&&UK                                                                           
DICTTAB  DS    0F                                                               
SYS0TAB  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS1SER  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS2     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS3     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS4MED  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS5     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS6ACC  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS7FEE  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS8     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS9MBA  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSACTL  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSBGAM  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSC     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSD     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSEPER  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSFGEN  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
*&&                                                                             
         EJECT                                                                  
**********************************************************************          
* DATA DICTIONARY INDEX FOR US                                       *          
* ONE ROW PER SYSTEM (00-15) AND ONE COLUMN PER LANGUAGE (0-7)       *          
* ALL ZERO ENTRY MEANS NO DICTIONARY DEFINED FOR SYS/LANG            *          
* IF DICTIONARY DEFINED 1ST BYTE IS X'SL' FOR PHASE T00ASL           *          
* FIRST REFERENCE CAUSES LOAD FROM DISK AND FIXES CORE ADDR IN ENTRY *          
**********************************************************************          
*&&US                                                                           
DICTTAB  DS    0F                                                               
SYS0TAB  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS1SER  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS2SPT  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS3     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS4PRT  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS5     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS6ACC  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS7     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS8     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYS9MBA  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSACTL  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSBGAM  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSC     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSD     DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSEPER  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
SYSFGEN  DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
         DC    X'00000000',X'00000000',X'00000000',X'00000000'                  
*&&                                                                             
