*          DATA SET FAECB      AT LEVEL 001 AS OF 03/14/00                      
FAECBD   DSECT                     ** DSECT FOR WAITLIST ENTRY **               
FECB     DS    F                                                                
FECBUSYQ EQU   X'80'               ENTRY IS BUSY                                
FETYPE   DS    XL1                 ECB TYPE                                     
FETRUNR  EQU   1                                                                
         DS    XL1                                                              
FETERM   DS    XL2                 TERMINAL NUMBER                              
FEANTRY  DS    A                   A(ENTRY)                                     
         DS    A                   N/D                                          
FAECBL   EQU   *-FAECBD                                                         
