*          DATA SET FAHOLED    AT LEVEL 003 AS OF 03/13/01                      
***********************************************************************         
* DSECT TO COVER THE HOLE                                             *         
***********************************************************************         
         SPACE 1                                                                
HOLED    DSECT                                                                  
HOKEY    DS    XL(PSKEYL)          KEY OF THIS PIECE OF DATA                    
HPSLENH  DS    AL4                 L'SLOT FOR THIS PHASE                        
HPSLEN   DS    AL4                 L'PHASE WITHIN THE SLOT                      
HPSTIME  DS    XL4                 TIME OF THIS LOAD                            
         DS    XL2                                                              
         ORG   HOLED+32                                                         
HOPHASE  DS    0X                  START OF PHASE                               
HOLELQ   EQU   *-HOLED                                                          
         EJECT                                                                  
