*          DATA SET FAJOBREC   AT LEVEL 001 AS OF 03/28/86                      
JOBRECD  DSECT                     ***** JOB RECORD *****                       
JOBRECID DS    CL3                 JOB RECORD ID ($JQ)                          
JOBNAME  DS    CL8                 MVS JOB NAME                                 
JOBJESNO DS    XL2                 JES JOB NUMBER                               
JOBTERM  DS    0CL8                TERMINAL IDENTIFICATION                      
JOBLINE  DS    CL4                 LINE ID                                      
JOBADDR  DS    CL4                 TERMINAL ADDRESS                             
JOBKEY   DS    0XL7                PRTQUE KEY                                   
JOBUSER  DS    XL2                 USER-ID NUMBER                               
JOBSUBID DS    CL3                 REPORT SUB-ID                                
JOBREPNO DS    XL2                 REPORT NUMBER                                
JOBSUBTM DS    PL3                 TIME SUBMITTED (PWOS HMS)                    
JOBENDTM DS    PL3                 TIME COMPLETED (PWOS HMS)                    
JOBSTAT  DS    X                   JOB COMPLETION STATUS                        
JOBPREV  DS    XL3                 TTB OF PREVIOUS JOB RECORD                   
JOBRECL  EQU   *-JOBRECD                                                        
