*          DATA SET FALANGTAB  AT LEVEL 001 AS OF 11/20/90                      
         CNOP  2,4                                                              
LANGTAB  DC    AL2(LANGTAB1-LANGTAB0)                                           
         DC    A(LANGTABX-1)                                                    
*                                                                               
LANGTAB0 DC    AL1(0),C'T',C'X',C',=',XL3'00'                                   
         DC    CL3'ENG',CL13'ENGLISH      '                                     
         DC    CL3'ENG',CL13'ENGLISH      '                                     
*                                                                               
LANGTAB1 DC    AL1(1),C'T',C'X',C',=',XL3'00'                                   
*&&UK*&& DC    CL3'???',CL13'NOT DEFINED  '                                     
*&&UK*&& DC    CL3'???',CL13'NOT DEFINED  '                                     
*&&US*&& DC    CL3'EUK',CL13'ENGLISH UK   '                                     
*&&US*&& DC    CL3'EUK',CL13'ENGLISH UK   '                                     
*                                                                               
LANGTAB2 DC    AL1(2),C'T',C'X',C',=',XL3'00'                                   
*&&UK*&& DC    CL3'EUS',CL13'ENGLISH US   '                                     
*&&UK*&& DC    CL3'EUS',CL13'ENGLISH US   '                                     
*&&US*&& DC    CL3'???',CL13'NOT DEFINED  '                                     
*&&US*&& DC    CL3'???',CL13'NOT DEFINED  '                                     
*                                                                               
         DC    AL1(3),C'G',C'K',C'#=',XL3'00'                                   
         DC    CL3'GER',CL13'GERMAN       '                                     
         DC    CL3'DEU',CL13'DEUTSCH      '                                     
*                                                                               
         DC    AL1(4),C'F',C'J',C';=',XL3'00'                                   
         DC    CL3'FRE',CL13'FRENCH       '                                     
         DC    CL3'FRA',CL13'FRANCAIS     '                                     
*                                                                               
         DC    AL1(5),C'S',C'W',C';=',XL3'00'                                   
         DC    CL3'SPA',CL13'SPANISH      '                                     
         DC    CL3'ESP',CL13'ESPANOL      '                                     
*                                                                               
         DC    AL1(6),C'I',C'M',C';=',XL3'00'                                   
         DC    CL3'ITA',CL13'ITALIAN      '                                     
         DC    CL3'ITA',CL13'ITALIANO     '                                     
*                                                                               
         DC    AL1(7),C'H',C'L',C';=',XL3'00'                                   
         DC    CL3'DUT',CL13'DUTCH        '                                     
         DC    CL3'NED',CL13'NEDERLANDS   '                                     
*                                                                               
LANGTABX DC    X'FFFFFFFF'                                                      
