*          DATA SET FALERB     AT LEVEL 001 AS OF 09/28/77                      
LERBD    DSECT                     ***** LINE ERROR BLOCK *****                 
*              * ACCUMULATORS *                                                 
LERBTTR  DS    F                   TOTAL TRNS                                   
LERBTCR  DS    H                   CMD REJ                                      
LERBTIR  DS    H                   INT REQ                                      
LERBTBO  DS    H                   BUS OUT                                      
LERBTEC  DS    H                   EQP CHK                                      
LERBTDC  DS    H                   DATA CHK                                     
LERBTLD  DS    H                   LOST DATA                                    
LERBTTO  DS    H                   TIME OUTS                                    
LERBTXX  DS    H                   UNKNOWN                                      
*              * COUNTERS *                                                     
LERBCTR  DS    X                   CUR TRNS                                     
LERBCCR  DS    X                   CMD REJ                                      
LERBCIR  DS    X                   INT REQ                                      
LERBCBO  DS    X                   BUS OUT                                      
LERBCEC  DS    X                   EQP CHK                                      
LERBCDC  DS    X                   DATA CHK                                     
LERBCLD  DS    X                   LOST DATA                                    
LERBCTO  DS    X                   TIME OUTS                                    
LERBCXX  DS    X                   UNKNOWN                                      
*                                                                               
LERBID   DS    X                   MAJOR ADDRESS                                
         DS    2X                  SPARE                                        
*                                                                               
LERBTIME DC    F'0'                TIME OF LAST CONSOLE MESSAGE                 
*                                                                               
LERBLEN  EQU   *-LERBTTR           LERB ENTRY LENGTH                            
