*          DATA SET FAPQPL     AT LEVEL 001 AS OF 03/06/80                      
PQPLD    DSECT                     ***** PRINT QUEUE PRINT LINE *****           
PLCC     DS    XL1       +00       CONTROL CHR X'00'=OPEN,X'FF'=CLOSE           
PLDESC   DS    CL11      +01       REPORT DESCRIPTION                           
PLSUBID  DS    CL3       +12       REPORT SUB ID                                
PLSTAT   DS    XL1       +15       REPORT INITIAL STATUS                        
PLLPP    DS    XL1       +16       LINES PER PAGE                               
PLUSER   DS    XL2       +17       USER ID NUMBER (OFFLINE ONLY)                
PLREPNO  DS    XL2       +19       REPORT SEQUENCE NUMBER                       
PLREPNOX DS    XL2       +21       REPORT SEQUENCE NUMBER MAXIMUM               
PLSTRCI  DS    XL2       +23       START CONTROL INTERVAL TRACK                 
PLCLASS  DS    CL1       +25       REPORT CLASS                                 
