*          DATA SET FAREQACC   AT LEVEL 014 AS OF 06/27/83                      
         DC    C'00',6X'00'                                                     
         DC    C'09',6X'00'                                                     
         DC    C'12',6X'00'                                                     
         DC    C'14',6X'00'                                                     
         DC    C'15',6X'00'                                                     
         DC    C'21',6X'00'                                                     
         DC    C'22',6X'00'                                                     
         DC    C'23',6X'00'                                                     
         DC    C'25',6X'00'                                                     
         DC    C'26',6X'00'                                                     
         DC    C'27',6X'00'                                                     
         DC    C'28',6X'00'                                                     
         DC    C'29',6X'00'                                                     
         DC    C'31',6X'00'                                                     
         DC    C'32',6X'00'                                                     
         DC    C'33',6X'00'                                                     
         DC    C'34',6X'00'                                                     
         DC    C'35',6X'00'                                                     
         DC    C'38',6X'00'                                                     
         DC    C'41',6X'00'                                                     
         DC    C'45',6X'00'                                                     
         DC    C'47',6X'00'                                                     
         DC    C'48',6X'00'                                                     
         DC    C'50',6X'00'                                                     
         DC    C'51',6X'00'                                                     
         DC    C'52',6X'00'                                                     
         DC    C'53',6X'00'                                                     
         DC    C'55',6X'00'                                                     
         DC    C'57',6X'00'                                                     
         DC    C'58',6X'00'                                                     
         DC    C'59',6X'00'                                                     
         DC    C'61',6X'00'                                                     
         DC    C'62',6X'00'                                                     
         DC    C'63',6X'00'                                                     
         DC    C'64',6X'00'                                                     
         DC    C'65',6X'00'                                                     
         DC    C'71',6X'00'                                                     
         DC    C'72',6X'00'                                                     
         DC    C'73',6X'00'                                                     
         DC    C'74',6X'00'                                                     
         DC    C'75',6X'00'                                                     
         DC    C'76',6X'00'                                                     
         DC    C'77',6X'00'                                                     
         DC    C'78',6X'00'                                                     
         DC    C'79',6X'00'                                                     
         DC    C'80',6X'00'                                                     
         DC    C'81',6X'00'                                                     
         DC    C'83',6X'00'                                                     
         DC    C'84',6X'00'                                                     
         DC    C'85',6X'00'                                                     
         DC    C'86',6X'00'                                                     
         DC    C'87',6X'00'                                                     
         DC    C'88',6X'00'                                                     
         DC    C'89',6X'00'                                                     
         DC    C'90',6X'00'                                                     
         DC    C'91',6X'00'                                                     
         DC    C'92',6X'00'                                                     
         DC    C'93',6X'00'                                                     
         DC    C'94',6X'00'                                                     
         DC    C'95',6X'00'                                                     
         DC    C'96',6X'00'                                                     
         DC    C'97',6X'00'                                                     
         DC    C'98',6X'00'                                                     
         DC    C'9A',6X'00'                                                     
         DC    C'A1',6X'00'                                                     
         DC    C'A2',6X'00'                                                     
         DC    C'B1',6X'00'                                                     
         DC    C'B2',6X'00'                                                     
         DC    C'B3',6X'00'                                                     
         DC    C'C1',6X'00'                                                     
         DC    C'C2',6X'00'                                                     
         DC    C'C3',6X'00'                                                     
         DC    C'C6',6X'00'                                                     
         DC    C'G1',6X'00'                                                     
         DC    C'G2',6X'00'                                                     
         DC    C'FA',6X'00'                                                     
         DC    C'M2',6X'00'                                                     
         DC    C'P1',6X'00'                                                     
         DC    C'P2',6X'00'                                                     
         DC    C'P3',6X'00'                                                     
         DC    C'P4',6X'00'                                                     
         DC    C'PA',6X'00'                                                     
         DC    C'PC',6X'00'                                                     
         DC    C'T1',6X'00'                                                     
         DC    C'T2',6X'00'                                                     
         DC    C'T3',6X'00'                                                     
         DC    C'T4',6X'00'                                                     
         DC    C'T5',6X'00'                                                     
         DC    C'T9',6X'00'                                                     
         DC    C'TB',6X'00'                                                     
         DC    C'TC',6X'00'                                                     
         DC    C'TD',6X'00'                                                     
         DC    C'TL',6X'00'                                                     
         DC    C'TP',6X'00'                                                     
         DC    C'TR',6X'00'                                                     
         DC    C'TT',6X'00'                                                     
         DC    C'TV',6X'00'                                                     
         DC    C'TW',6X'00'                                                     
