*          DATA SET FAREQCON   AT LEVEL 002 AS OF 01/18/82                      
         DC    C'00',6X'00'                                                     
         DC    C'30',6X'00'                                                     
         DC    C'32',6X'00'                                                     
         DC    C'40',6X'00'                                                     
         DC    C'50',6X'00'                                                     
         DC    C'52',6X'00'                                                     
         DC    C'54',6X'00'                                                     
         DC    C'60',6X'00'                                                     
         DC    C'61',6X'00'                                                     
         DC    C'64',6X'00'                                                     
         DC    C'70',6X'00'                                                     
         DC    C'72',6X'00'                                                     
         DC    C'80',6X'00'                                                     
