*          DATA SET FAREQTRF   AT LEVEL 006 AS OF 06/04/97                      
         DC    C'TA',6X'00'        AUTO GEN INSTR                               
         DC    C'TC',6X'00'        RECAPS                                       
         DC    C'TE',6X'00'        ETRANS - ELEC COV GEN/SHIP GEN               
         DC    C'TF',6X'00'        FAX LETTERS                                  
         DC    C'TG',6X'00'        DEALER INSTRUCTIONS                          
         DC    C'TJ',6X'00'        AMS LETTERS                                  
         DC    C'TK',6X'00'        MARKET LETTERS                               
         DC    C'TL',6X'00'        TRAFFIC LISTS                                
         DC    C'TM',6X'00'        MANUAL INSTR                                 
         DC    C'TO',6X'00'        SHIPPING ORDERS                              
         DC    C'TP',6X'00'        PATTERN BOOKLET                              
         DC    C'TQ',6X'00'        SPOT INSTRUCTIONS                            
         DC    C'TS',6X'00'        SPOT SEED                                    
         DC    C'TU',6X'00'        COMMERCIAL USAGE                             
         DC    C'TV',6X'00'        COVER LETTER INSTRUCTIONS                    
         DC    C'TW',6X'00'        TWX INSTRUCTIONS                             
