*          DATA SET FAREQCPP   AT LEVEL 001 AS OF 04/24/81                      
         DC    C'00',6X'00'                                                     
         DC    C'20',6X'00'                                                     
         DC    C'22',6X'00'                                                     
         DC    C'26',6X'00'                                                     
         DC    C'28',6X'00'                                                     
         DC    C'30',6X'00'                                                     
         DC    C'40',6X'00'                                                     
