*          DATA SET FAREQNET   AT LEVEL 003 AS OF 08/10/84                      
         DC    C'O0',6X'00'                                                     
         DC    C'O2',6X'00'                                                     
         DC    C'O3',6X'00'                                                     
         DC    C'O5',6X'00'                                                     
         DC    C'O6',6X'00'                                                     
         DC    C'O7',6X'00'                                                     
         DC    C'O9',6X'00'                                                     
         DC    C'OB',6X'00'                                                     
         DC    C'OC',6X'00'                                                     
         DC    C'OD',6X'00'                                                     
         DC    C'OE',6X'00'                                                     
         DC    C'OG',6X'00'                                                     
         DC    C'OH',6X'00'                                                     
         DC    C'OL',6X'00'                                                     
         DC    C'OO',6X'00'                                                     
         DC    C'OP',6X'00'                                                     
         DC    C'OR',6X'00'                                                     
         DC    C'OS',6X'00'                                                     
         DC    C'OT',6X'00'                                                     
         DC    C'OW',6X'00'                                                     
         DC    C'OZ',6X'00'                                                     
