*          DATA SET FAREQPRT   AT LEVEL 009 AS OF 02/05/93                      
         DC    C'00',6X'00'                                                     
         DC    C'10',6X'00'                                                     
         DC    C'12',6X'00'                                                     
         DC    C'14',6X'00'                                                     
         DC    C'16',6X'00'                                                     
         DC    C'18',6X'00'                                                     
         DC    C'19',6X'00'                                                     
         DC    C'20',6X'00'                                                     
         DC    C'27',6X'00'                                                     
         DC    C'28',6X'00'                                                     
         DC    C'31',6X'00'                                                     
         DC    C'36',6X'00'                                                     
         DC    C'37',6X'00'                                                     
         DC    C'41',6X'00'                                                     
         DC    C'42',6X'00'                                                     
         DC    C'43',6X'00'                                                     
         DC    C'45',6X'00'                                                     
         DC    C'46',6X'00'                                                     
         DC    C'47',6X'00'                                                     
         DC    C'48',6X'00'                                                     
         DC    C'49',6X'00'                                                     
         DC    C'52',6X'00'                                                     
         DC    C'54',6X'00'                                                     
         DC    C'60',6X'00'                                                     
         DC    C'66',6X'00'                                                     
         DC    C'68',6X'00'                                                     
         DC    C'72',6X'00'                                                     
         DC    C'73',6X'00'                                                     
         DC    C'74',6X'00'                                                     
         DC    C'75',6X'00'                                                     
         DC    C'77',6X'00'                                                     
         DC    C'79',6X'00'                                                     
         DC    C'90',6X'00'                                                     
         DC    C'92',6X'00'                                                     
         DC    C'AC',6X'00'                                                     
         DC    C'AR',6X'00'                                                     
         DC    C'AU',6X'00'                                                     
         DC    C'A8',6X'00'                                                     
         DC    C'BA',6X'00'                                                     
         DC    C'B1',6X'00'                                                     
         DC    C'B9',6X'00'                                                     
         DC    C'D1',6X'00'                                                     
         DC    C'EC',6X'00'                                                     
         DC    C'E1',6X'00'                                                     
         DC    C'IX',6X'00'                                                     
         DC    C'L1',6X'00'                                                     
         DC    C'L2',6X'00'                                                     
         DC    C'LB',6X'00'                                                     
         DC    C'MY',6X'00'                                                     
         DC    C'NV',6X'00'                                                     
         DC    C'NT',6X'00'                                                     
         DC    C'PM',6X'00'                                                     
         DC    C'R1',6X'00'                                                     
         DC    C'RA',6X'00'                                                     
         DC    C'RD',6X'00'                                                     
         DC    C'S2',6X'00'                                                     
         DC    C'XT',6X'00'                                                     
         DC    C'X2',6X'00'                                                     
