*          DATA SET FAREQPER   AT LEVEL 001 AS OF 08/14/85                      
         DC    C'00',6X'00'                                                     
         DC    C'10',6X'00'                                                     
         DC    C'20',6X'00'                                                     
         DC    C'30',6X'00'                                                     
         DC    C'40',6X'00'                                                     
         DC    C'50',6X'00'                                                     
         DC    C'60',6X'00'                                                     
         DC    C'70',6X'00'                                                     
         DC    C'80',6X'00'                                                     
         DC    C'90',6X'00'                                                     
