*          DATA SET FASCRIPTW  AT LEVEL 001 AS OF 03/06/17                      
SCPWORKD DSECT                                                                  
ECB      DS    XL4                 ECB TO WAIT FOR SCRIPT COMPLETION            
*                                                                               
SCPFULL  DS    F                                                                
SCPDUB   DS    D                                                                
SCPDMCB  DS    6F                                                               
*                                                                               
SCPATCB  DS    A                   A(TCB ENTRY)                                 
SCPAUTL  DS    A                   A(UTL ENTRY)                                 
ADUMUTL  DS    A                   A(DUMMY TCB ENTRY)                           
SVTBUFF  DS    A                   A(BUFFER)                                    
SVKCODE  DS    CL8                 SAVED SCRIPT CODE                            
*                                                                               
SVHEADER DS    XL8                 SAVED TBUFF HEADER                           
DUTLSVC  DS    XL2                 TSVCREQ SAVED FROM DUMMY UTL ENTRY           
IO       DS    XL2048              CTFILE RECORD                                
SCPWORKL EQU   *-SCPWORKD                                                       
