*          DATA SET FASRPARM   AT LEVEL 001 AS OF 03/17/87                      
SRPARMD  DSECT                     ***** SERVICE REQ PARAM LIST *****           
*                                                                               
SRPARM1  DS    A                   A(SYSTEM FACILITIES TABLE)                   
SRPARM2  DS    A                   A(TIA)                                       
SRPARM3  DS    A                   A(UTL ENTRY)                                 
SRPARM4  DS    A                   A(COMMON FACILITIES TABLE)                   
SRPARM5  DS    A                   A(SELIST ENTRY)                              
SRPARM6  DS    A                   A(TWA)                                       
SRPARM7  DS    A                   A(PHASE MAP)                                 
SRPARM8  DS    A                   A(TRANSLATOR INPUT OUTPUT BLOCK)             
*                                                                               
         ORG   SRPARM1                                                          
SRQASYSF DS    A                   A(SYSTEM FACILITIES TABLE)                   
SRQATIA  DS    A                   A(TIA)                                       
SRQAUTL  DS    A                   A(UTL ENTRY)                                 
SRQACOMF DS    A                   A(COMMON FACILITIES TABLE)                   
SRQASEL  DS    A                   A(SELIST ENTRY)                              
SRQATWA  DS    A                   A(TWA)                                       
SRQAMAP  DS    A                   A(PHASE MAP)                                 
SRQATIOB DS    A                   A(TRANSLATOR INPUT OUTPUT BLOCK)             
