*          DATA SET FASYSLSTD  AT LEVEL 001 AS OF 05/13/83                      
* DSECT TO COVER FACPAK SYSTEM LIST                                             
*                                                                               
SYSLSTD  DSECT                                                                  
SYSLNUM  DS    XL1                 NATIVE SYSTEM NUMBER                         
SYSLEQU  DS    XL1                 EQUATED SYSTEM NUMBER                        
SYSLNAME DS    CL7                 SYSTEM NAME                                  
SYSLSHRT DS    CL3                 SHORT SYSTEM NAME                            
SYSLRPLT DS    CL1                 REPORT PROFILE KEY LETTER                    
SYSLUSLT DS    CL1                 USER PROFILE KEY LETTER                      
SYSLIND1 DS    XL1                 CONTROL SYSTEM INDICATORS                    
*                                  X'80'=USE AGENCY BINARY IN KEY               
*                                  X'40'=USE AGENCY ALPHA IN KEY                
SYSLIND2 DS    XL1                 OTHER INDICATORS                             
SYSLLEN  EQU   *-SYSLSTD                                                        
