*          DATA SET FATABSTMS  AT LEVEL 004 AS OF 06/20/00                      
TTMSHDRD DSECT                     TEMPEST INFORMATION                          
TTMSEYE  DS    CL8                 *TEMPEST EYECATCHER                          
TTMSNTRY DS    F                   NUMBER OF ENTRIES SUPPORTED IN TABLE         
         DS    5F                  N/D                                          
TTMSHDRL EQU   *-TTMSHDRD                                                       
         SPACE 1                                                                
TTSSHDRD DSECT                     TEMPEST INFORMATION                          
TTSFAC   DS    F                   FACPAK NAME (AS EYECATCHER)                  
TTSLINK  DS    A                   A(NEXT HEADER)                               
TTSMAXCI DS    F                   MAXIMUM NUMBER OF ALLOCATIONS                
TTSUSECI DS    F                   CURRENT NUMBER OF ALLOCATIONS                
TTSHICI  DS    F                   HIGH WATER MARK FOR DAY                      
TTSRPTRK DS    H                   RECORDS PER TRACK                            
TTSTRKS  DS    H                   NUMBER OF TRACKS                             
TTSMAX   DS    H                   MAX PAGES ALLOWED TO ALLOCATE                
TTSRLEN  DS    H                   RECORD LENGTH                                
TTSCITRK DS    H                   NUMBER OF TRACKS PER ALLOCATION              
TTMXSESS DS    H                   NUMBER OF TEMPEST BUFFERS ONLINE             
         ORG   TTSSHDRD+64                                                      
TTSSHDRL EQU   *-TTSSHDRD                                                       
