*          DATA SET FATABSD    AT LEVEL 016 AS OF 01/29/19                      
FATABSD  DSECT                                                                  
TABSADDR DS    0XL64                                                            
TABSDUMP DS    A                   A(DUMP INFO)                                 
TABSZIP  DS    A                   NOT USED                                     
TABSADRF DS    A                   NOT USED                                     
*ABSPQNX DS    A                   NOT USED                                     
TABSCOMM DS    A                   COMMON AREA                                  
TABSLOX  DS    A                   LOCKET TABLE TRACE                           
TABSTMS  DS    A                   A(TEMPEST TABLE)                             
TABSRUN  DS    A                   A(RUNNER SERVERS)                            
TABSSTAT DS    A                   A(STATS FOR GRAPHIC WEB PAGE)                
         DS    7A                                                               
TABSLAST DS    A                   A(END OF DATASPACE)                          
