*          DATA SET FATABSDMP  AT LEVEL 005 AS OF 09/30/97                      
***********************************************************************         
* DATASPACE DUMP DETAILS                                              *         
* DSECT HANGS FROM TABSDUMP FOUND IN FIRST 64 BYTES OF TABSDSP DSPACE *         
***********************************************************************         
         SPACE 1                                                                
TORDUMPD DSECT                                                                  
TDSYSNA  DS    CL4                 4 CHARACTER FACPAK NAME                      
TDLOCK   DS    F                   LOCK ECB FOR BLOCK                           
TDDUMPNO DS    F                   CURRENT DUMP NUMBER                          
TDDUMPFS DS    F                   FIRST DUMP NUMBER                            
TDDUMPMX DS    F                   HIGHEST DUMP NUMBER                          
TDDUMPST DS    F                   DUMP SAVED FLAGS                             
TDPSW    DS    XL8                 LAST DUMP PSW                                
TDREGB   DS    F                   LAST DUMP RB                                 
TDMODID  DS    XL8                 MODULE NAME (RB+22)                          
TDMODDSP DS    F                   LAST DUMP PSW-RB                             
TDDUPCNT DS    F                   DUPLICATE COUNT                              
TDDUPFST DS    PL4                 TIME OF FIRST DUMP                           
TDDUPPRV DS    PL4                 TIME OF PRIOR DUPLICATE                      
TDDUPNOW DS    PL4                 TIME OF THIS DUPLICATE                       
TDDUMPTM DS    PL4                 DUMP TIME                                    
TDLENQ   EQU   *-TORDUMPD                                                       
*                                                                               
