*          DATA SET FATSTTAB   AT LEVEL 006 AS OF 10/22/96                      
TSTTABD  DSECT                     ***** TERMINAL TEST LIST *****               
*                                                                               
TSTNUM   DS    H                   TERMINAL NUMBER                              
TSTACCS  DS    CL4                 TEST ACCESS                                  
TSTLOW   DS    XL2                 LOW TRACK OF CI (ZERO NO TSTRCVR)            
TSTHIGH  DS    XL2                 HIGH TRACK OF CI                             
TSTCPTY  DS    XL2                 TRACK CAPACITY                               
TSTLAST  DS    XL4                 LAST RECORD IN CI                            
TSTTACCS DS    CL4                 ACCESS LIMIT (PASSED TO PGM IN TWA)          
TSTTRC   DS    A                   A(I/O TRACE BUFFER) OR ZERO                  
TSTTRCLN EQU   144                 I/O TRACE ENTRY LENGTH                       
TSTTRCIO DS    H                   START COUNT FOR I/O TRACE                    
TSTFLAGS DS    XL1                 FLAGS                                        
TSTFSCRQ EQU   X'80'               TRACE SCRIPT SCREENS                         
TSTFUPDX EQU   X'40'               INHIBIT UPDATE LOGGING                       
TSTFSCTQ EQU   X'20'               TRACE SCRIPT COMMANDS                        
         DS    XL1                                                              
*                                                                               
TSTPTCH1 DS    0XL22               PATCH#1                                      
         DS    XL3                 PHASE ID X'LSPPOO'                           
         DS    XL2                 PHASE DISPLACEMENT                           
         DS    XL1                 PATCH LENGTH                                 
         DS    XL16                PATCH VALUE                                  
*                                                                               
TSTPTCH2 DS    XL22                PATCH#2                                      
TSTPTCH3 DS    XL22                PATCH#3                                      
TSTPTCH4 DS    XL22                PATCH#4                                      
TSTPTCH5 DS    XL22                PATCH#5                                      
TSTPTCHX DS    0X                                                               
*                                                                               
TSTSCT   DS    AL4                 A(SCRIPT TRACE BUFFER) OR ZERO               
*                                                                               
         DS    XL18                SPARE                                        
*                                                                               
