*          DATA SET FAWLMED    AT LEVEL 001 AS OF 03/13/13                      
WLMED      DSECT                   ENCLAVE CONTROL BLOCK                        
           DS    A                 RESERVED                                     
ECLVRETC   DS    A                 WLM JOIN/LEAVE RETURN CODE                   
ECLVRSNC   DS    A                 WLM JOIN/LEAVE REASON CODE                   
ECLPRG     DS    CL2               PROGRAM IDENTIFIER                           
           DS    CL2               RESERVED                                     
ECLVTOKEN  DS    XL8               ENCLAVE TOKEN FROM IWM4ECRE                  
ECLQTOKEN  DS    XL8               TOKEN RETURNED BY IWMEQRY                    
ECLVWNQ    EQU   *-WLMED           LENGTH OF ENCLAVE WORK                       
