*          DATA SET FAXADMPHDR AT LEVEL 004 AS OF 05/04/90                      
DXAHDRD  DSECT                     ***** DUMP FILE HEADER RECORD *****          
*                                                                               
DXANUM   DS    X                   DUMP NUMBER                                  
         DS    X                                                                
DXATRKS  DS    H                   TOTAL TRACKS                                 
DXABLKS  DS    H                   NUMBER OF 2K DUMP BLOCKS                     
DXATIME  DS    F                   TIME DUMP WAS TAKEN P'HHMMSS'                
DXADESC  DS    CL8                 DUMP DESCRIPTION (*NAME*)                    
DXAPSW   DS    CL8                 PSW                                          
DXAREGS  DS    16F                 GR 0-F                                       
*                                                                               
DXATCB   DS    A                   A(FAILING TASK TCB ENTRY)                    
DXATWA   DS    A                   A(TWA FOR FAILING TASK)                      
DXAFACS  DS    A                   A(SYSTEM FACILITIES)                         
*                                                                               
DXA1LO   DS    A                   AREA 1 LOW CORE ADDRESS                      
DXA1HI   DS    A                   AREA 1 HI  CORE ADDRESS                      
DXA1SZ   DS    H                   AREA 1 NUMBER OF TRACKS                      
         DS    H                                                                
         DS    5CL24               AREA 1 SUB-DUMPS                             
*                                                                               
DXA2LO   DS    A                   AREA 2 LOW CORE ADDRESS                      
DXA2HI   DS    A                   AREA 2 HI  CORE ADDRESS                      
DXA2SZ   DS    H                   AREA 2 NUMBER OF TRACKS                      
         DS    H                                                                
         DS    5CL24               AREA 2 SUB-DUMPS                             
*                                                                               
DXA3LO   DS    A                   AREA 3 LOW CORE ADDRESS                      
DXA3HI   DS    A                   AREA 3 HI  CORE ADDRESS                      
DXA3SZ   DS    H                   AREA 3 NUMBER OF TRACKS                      
         DS    H                                                                
         DS    5CL24               AREA 3 SUB-DUMPS                             
*                                                                               
DXAHDRL  EQU    *-DXAHDRD                                                       
