*          DATA SET FCELEM     AT LEVEL 002 AS OF 06/20/73                      
FCELEM   DS    0C                  *** COMMENT ELEMENT ***                      
FCCODE   DS    X'04'               ELEMENT CODE                                 
FCLEN    DS    CL1 . B             ELEMENT LENGTH                               
FCSTART  DS    CL3 . B             START DATE                                   
FCEND    DS    CL3 . B             ENDDATE                                      
FCSCL    DS    CL1 . A             STATION CLASS                                
FCGRCL   DS    CL1 . B             GROUP CLASS                                  
         DS    CL4 . X             SPARE                                        
FCCOM    DS    CL20 . A            COMMENTS                                     
