*          DATA SET FDKEY      AT LEVEL 002 AS OF 08/08/73                      
FDSTRREC DS    0C                  *** FILM DISTRIBUTION REC ***                
FDKEY    DS    CL13 .              KEY                                          
         ORG   FDKEY                                                            
FDFCODE  DS    X'0A'               FILE CODE                                    
FDRCODE  DS    X'02'               RECORD CODE                                  
FDAGY    DS    CL1 . B             AGENCY CODE                                  
FDMED    DS    CL1 . B             MEDIA CODE                                   
FDCLT    DS    CL2 . A             CLIENT                                       
FDPRDA   DS    CL2 . A             PRODUCT A                                    
FDLNA    DS    CL1 . B             LENGTH A                                     
FDCODE   DS    CL1 . A             COPY CODE                                    
FDPRDB   DS    CL2 . A             PRODUCT B                                    
FDLNB    DS    CL1 . B             LENGTH B                                     
FDLEN    DS    CL2 .    B          RECORD LENGTH                                
FDCNTL   DS    C  CONTROL                                                       
FDLINKS  DS    CL8 .     B         LINKS                                        
