*          DATA SET FDSKEY     AT LEVEL 002 AS OF 06/14/73                      
FDSKEY   DS    CL13 . B            KEY                                          
         ORG   FDSKEY                                                           
FDSFCDE  DS    X'0A'               FILE CODE                                    
FDSRCDE  DS    X'01'               RECORD CODE                                  
FDSAGY   DS    CL1 . B             AGENCY                                       
FDSMED   DS    CL1 . A             MEDIA                                        
FDSCLT   DS    CL2                 CLIENT                                       
FDSPRD   DS    CL2 . A             PRODUCT                                      
FDSFNO   DS    CL2 . B             FILM NUMBER                                  
FDSFLEN  DS    CL1                 LENGTH                                       
         DS    CL2 . B             SPARE                                        
FDSLEN   DS    CL2 . B             RECORD LENGTH                                
FDSCNTL  DS    C                   CONTROL                                      
FDSLINKS DS    CL8 . B             LINKS                                        
