*          DATA SET FISUMKEY   AT LEVEL 001 AS OF 11/21/74                      
FISUMKAY DS    0C                  ***FILM INSTR. SUMMARY KEY***                
FISKEY   DS    CL13                KEY                                          
         ORG   FISKEY                                                           
FISFCODE DS    X'0A'               FILE CODE                                    
FISRCODE DS    X'06'               RECORD CODE                                  
FISAGY   DS    CL1  . B            AGENCY CODE                                  
FISMED   DS    CL1  . A            MEDIA                                        
FISCLT   DS    CL2  . A            CLIENT                                       
FISPRD   DS    CL2  . A            PRODUCT                                      
FISLDTE  DS    CL4  . B            LETTER DATES IN 2 BYTE FORMAT                
FISRNO   DS    CL1                 RECORD NUMBER                                
FISLEN   DS    CL2  . B            RECORD LENGTH                                
FISCNTL  DS    C    . B            CONTROL                                      
FISLINKS DS    CL8  . B            LINKS                                        
