*          DATA SET FMELEM     AT LEVEL 002 AS OF 06/20/73                      
FMELEM   DS    0C                  *** MARKET DISTRIBUTION ELEMENT***           
FMCODE   DS    X'03'               ELEMENT CODE                                 
FMLEN    DS    CL1 . B             ELEMENT LENGTH                               
FMSTART  DS    CL3 . B             START DATE                                   
FMEND    DS    CL3 . B             END DATE                                     
FMSCL    DS    CL1 . A             STATION CLASS                                
FMGRCL   DS    CL1 . B             GROUP CLASS                                  
         DS    CL4 . B             SPARE                                        
*              VARIABLE MARKET LIST (2 BYTES / MARKET)                          
FMMRKT   DS    CL2 . B             MARKET NUMBER                                
*                                    BIT 0 ON = MARKET ADDED                    
*                                    BIT 1 ON = MARKET DELETED                  
