DDSSMF   CSECT                                                          00010026
DDSSMF   RMODE 24                                                       00020099
         ENTRY FWRSMF2                                                  00030048
         ENTRY FWRSMF3                                                  00040057
         ENTRY FWRSMF4                                                  00050060
         ENTRY FWRSMF5                                                  00060060
         ENTRY FWRSMF6                                                  00070083
         ENTRY FWRSMF9                                                  00080075
         ENTRY FWRSMFA                                                  00090079
         USING *,RF                                                     00100089
         STM   RE,R12,12(R13)  SAVE REGS IN CALLER SAVE AREA            00110099
         LH    R8,TYPE1        ENTRY 1                                  00120099
         B     SMF1                                                     00130066
         DC    C'&SYSDATE &SYSTIME'                                     00140046
FWRSMF2  DS    0H               ENTRY POINT 2                           00150047
         USING *,RF                                                     00160099
         STM   RE,R12,12(R13)  SAVE REGS IN CALLER SAVE AREA            00170099
         LA    R8,TYPE2        INDICATE ENTRY 2                         00180099
         B     SMF1                                                     00190061
*                                                                       00200041
FWRSMF3  DS    0H               ENTRY POINT 3  - QDQ CONTENTION         00210061
         USING *,RF                                                     00220099
         STM   RE,R12,12(R13)  SAVE REGS IN CALLER SAVE AREA            00230099
         LA    R8,TYPE3        INDICATE ENTRY 3                         00240099
         B     SMF1                                                     00250060
*                                                                       00260057
FWRSMF4  DS    0H               ENTRY POINT 4  - START SOON JOB         00270061
         USING *,RF                                                     00280099
         STM   RE,RC,12(RD)    SAVE REGS IN CALLER SAVE AREA            00290099
         LA    R8,TYPE4        INDICATE ENTRY 4                         00300099
         B     SMF1                                                     00310060
*                                                                       00320060
FWRSMF5  DS    0H               ENTRY POINT 5  - END SOON JOB           00330061
         USING *,RF                                                     00340099
         STM   RE,RC,12(RD)     SAVE REGS IN CALLER SAVE AREA           00350099
         LA    R8,TYPE5         INDICATE ENTRY 5                        00360099
         B     SMF1                                                     00370060
*                                                                       00380073
FWRSMF9  DS    0H               ENTRY POINT 9  - DARE RECORD            00390074
         USING *,RF                                                     00400099
         STM   RE,R12,12(R13)   SAVE REGS IN CALLER SAVE AREA           00410099
         LA    R8,TYPE6         INDICATE TYPE 6 RECORD  REQUEST         00420095
         B     SMF1                                                     00430073
*                                                                       00440079
FWRSMF6  DS    0H               ENTRY POINT 6  - BALANCING RECORD       00450083
FWRSMFA  DS    0H               ENTRY POINT A  - BALANCING RECORD       00460083
         USING *,RF                                                     00470088
         STM   RE,RC,12(RD)     SAVE REGS IN CALLER SAVE AREA           00480088
         LA    R8,TYPE7         SETUP TO BUILD RECORD TYPE 7            00490099
         B     SMF1                                                     00500079
         EJECT                                                          00510061
SMF1     BALR  RC,0                                                     00520088
         USING *,RC                                                     00530088
         LR    R7,R1           SAVE PARM REG IN 7                       00540088
         L     R0,SIZE                                                  00550088
*NOP     GETMAIN R,LV=(0)                                               00560099
         STORAGE OBTAIN,LENGTH=(0)                                      00570099
         LR    RA,R1                                                    00580099
         USING DATA,RA                                                  00590099
         ST    R13,SAVE+4       SAVE CALLERS SAVE AREA IN MINE          00600000
         LA    R3,SAVE                                                  00610088
         ST    R3,8(R13)        STORE MY SAVE AREA IN HIS               00620088
         LR    R13,R3           SET R13 TO MY SAVE AREA                 00630088
*                                                                       00640000
         LA     R4,RECORD                                               00650088
         USING  SMFREC,R4                                               00660088
         XC     SMFREC,SMFREC                                           00670013
         L      R5,16             GET CVT  FROM 10 HEX                  00680094
         USING  CVTMAP,R5                                               00690088
         L      R5,CVTSMCA        GET SMCA                              00700088
         DROP   R5                                                      00710088
         MVC    SMFSID,SMCASID-SMCABASE(R05)  SMF SYSTEM ID             00720016
         MVI    SMFSYS,X'12'      INDICATE VS2 SYSTEM                   00730054
         MVI    SMFTYPE,X'F7'     RECORD TYPE                           00740009
         LA     R5,SMFSIZE                                              00750088
         STH    R5,SMFRLEN        PUT IN RECORD SIZE                    00760088
         SPACE                                                          00770009
         L      R5,PSATOLD-PSA    GET CURRENT TCB                       00780088
         USING  TCB,R5                                                  00790088
         L      R6,TCBTIO         GET ADDRESS OF TIOT                   00800088
         L      R3,TCBJSCB        GET JSCB ADDRESS                      00810088
         DROP   R5                                                      00820088
         USING  TIOT1,R6                                                00830088
         MVC    SMFJOBNM,TIOCNJOB GET THE JOBNAME FROM TIOT             00840022
         MVC    SMFJOBST,TIOCSTEP GET THE STEP.PROC STEP NAME           00850022
         DROP   R6                                                      00860088
         SPACE                                                          00870020
         USING  IEZJSCB,R3                                              00880088
         L      R3,JSCBACT                                              00890088
         L      R5,JSCBSSIB                                             00900088
         USING  SSIB,R5                                                 00910088
         MVC    SMFJOBID,SSIBJBID     GET JES JOB NO.                   00920061
         LA     R5,SMFJOBNM-SMFREC    GET HEADER OFFSET VALUE           00930088
         STH    R5,SMFDDSHO                                             00940088
         LA     R5,SMFDDSEH-SMFJOBNM  GET HEADER LENGTH                 00950088
         STH    R5,SMFDDSHL                                             00960088
         SPACE                                                          00970022
         B      THRDETRY                                                00980099
         USING  TABLEMAP,R9                                             00990099
USETBLE  LA     R5,WHERETG                                              01000093
         SR     R9,R9                                                   01010093
         SLL    R8,3                 MULTIPLY BY 8 (2**3)               01020093
         LA     R9,0(R8,R5)          CALCULATE ADDR IN WHERE TO GO TBL  01030093
         L      R5,RTNADDR           LOAD TARGET ADDRESS                01040099
         BALR   RE,R5                BRANCH TO IT                       01050097
         DC     H'0'                 WE DON'T EXPECT A RETURN           01060097
         EJECT                                                          01070061
***                                                                     01080061
**   PROCESS REQUEST ACCOUNTING DATA                                    01090061
***                                                                     01100061
MAKEREC1 CLI    ENTRYTYP,TYP1E       PROPER ENTRY IN TABLE?             01110099
         BNE    0(0,RE)              NOPE, EXIT                         01120099
         MVC    SMFSUBTY+1(1),DDSRTYPE  INDICATE DDS TYPE 1 RECORD      01130099
         LA     R5,SMFSYSTE-SMFREC    GET OFFSET TO TYPE 1 RECORD       01140099
         STH    R5,SMFDDS1O           STORE OFFSET                      01150099
         LA     R5,DDS1LEN            GET LENGTH OF TYPE 1 RECORD       01160099
         STH    R5,SMFDDS1L           STORE LENGTH                      01170099
         USING  MASTD,R7              MAKE ORIGINAL DDS STATS RECORD    01180099
         MVC    SMFSYSTE,MCSYSTEM                                       01190017
         MVC    SMFPROG,MCPROG                                          01200017
         MVC    SMFUSER,MCUSER                                          01210017
         MVC    SMFMEDIA,MCMEDIA                                        01220017
*                                                                       01230017
         MVC    SMFREQNO,MCREQNO                                        01240017
         MVC    SMFSEGNO,MCSEGNO                                        01250017
*                                                                       01260017
         MVC    SMFREQCP,MCREQCPU                                       01270017
         MVC    SMFREQLP,MCREQLPS                                       01280017
         MVC    SMFREQSI,MCREQSIO                                       01290017
         MVC    SMFREQPA,MCREQPAG                                       01300017
         MVC    SMFREQLI,MCREQLIN                                       01310017
*                                                                       01320018
         MVC    SMFREMOT,MCREMOTE                                       01330018
         MVC    SMFREMPQ,MCREMPQK    PRINT Q STUFF                      01340018
         L      R6,MCUTL            GET UTL ENTRY                       01350099
         LTR    R6,R6                                                   01360099
         BZ     RECFINAL                                                01370069
         MVC    SMFFILE(1),0(R6)                                        01380099
         B      RECFINAL                                                01390051
         DROP   R7                                                      01400099
         EJECT                                                          01410043
***                                                                     01420061
**     PROCESS REQUEST CARD IMAGES                                      01430061
***                                                                     01440061
MAKEREC2 CLI    ENTRYTYP,TYPE2       PROPER ENTRY IN TABLE?             01450099
         BNE    0(0,RE)              NOPE, EXIT                         01460099
         MVC    SMFRECIM,0(R7)       MOVE THE DATA PASSED W/O EDIT      01470099
         MVC    SMFSUBTY+1(1),DDSRTYPE  INDICATE DDS TYPE 2 RECORD      01480099
         LA     R5,SMFRECIM-SMFREC   GET OFFSET TO TYPE 2 DATA          01490099
         STH    R5,SMFDDS1O          STORE OFFSET                       01500099
         MVI    SMFDDS1L+1,X'50'     INDICATE LENGTH OF OPTIONAL DATA   01510052
         B      RECFINAL                                                01520056
         EJECT                                                          01530061
***                                                                     01540099
**     PROCESS QDQ CONTENTION RECORDS                                   01550099
***                                                                     01560099
MAKEREC3 CLI    ENTRYTYP,TYPE3       PROPER ENTRY IN TABLE?             01570099
         BNE    0(0,RE)              NOPE, EXIT                         01580099
THRDETRY EQU    *                    3RD ENTRY -QDQ CONTENTION          01590061
         LA     R5,TYPE3                                                01600099
         CR     R08,R5               DETERMINE ENTRY TYPE               01610099
         BNE    USETBLE                                                 01620099
*NOPP    BNE    FITHETRY                                                01630099
         SR     R05,R05              CLEAR REG 5                        01640061
         ICM    R05,X'C',0(R07)      REG7 PTS TO 2 BYTES OF LENGTH      01650058
         SRL    R05,16               MOVE OVER TWO BYTES                01660058
         EX     R05,TYP3MOV                                             01670059
         MVI    SMFSUBTY+1,X'03'     INDICATE DDS TYPE 3 RECORD         01680061
         STH    R05,SMFDDS1L         STORE LENGTH VALUE                 01690058
         LA     R05,SMFEQDQD-SMFREC  GET OFFSET TO TYPE 3 DATA          01700061
         STH    R05,SMFDDS1O         STORE OFFSET                       01710056
         B      RECFINAL                                                01720061
         EJECT                                                          01730099
***                                                                     01740099
**     START A SOON REQUEST                                             01750099
***                                                                     01760099
MAKEREC4 CLI    ENTRYTYP,TYPE4       PROPER ENTRY IN TABLE?             01770099
         BNE    0(0,RE)              NOPE, EXIT                         01780099
         MVC    SMFSUBTY+1(1),DDSRTYPE  INDICATE DDS TYPE 4 RECORD      01790099
         SR     R5,R5                CLEAR REG 5                        01800099
         SR     R1,R1                CLEAR REG 1                        01810099
         ICM    R5,X'C',0(R7)        REG7 PTS TO 2 BYTES OF LENGTH      01820099
         SRL    R5,16                MOVE OVER TWO BYTES                01830099
         CH     R5,MAXREC            DO WE HAVE ENOUGH ROOM?            01840099
         BH     REC2BIG              NO, BAD NEWS                       01850099
         LA     R1,SMFFIXLN(,R5)     COMPUTE COMPLETE LENGTH            01860099
         STH    R1,SMFRLEN           SET RECORD SIZE TO BE WRITTEN      01870099
         EX     R5,TYP4MOV                                              01880099
         STH    R5,SMFDDS1L          STORE LENGTH VALUE                 01890099
         LA     R5,SMFEQDQD-SMFREC   GET OFFSET TO TYPE 4 DATA          01900099
         STH    R5,SMFDDS1O          STORE OFFSET                       01910099
*NOP     DC     H'0'                                                    01920099
         B      RECFINAL                                                01930061
TYP4MOV  MVC   SMFSRTSN,2(R07)      MOVE THE DATA PASSED, SKIP OVER LEN 01940099
TYP5MOV  MVC   SMFENDSN,2(R07)      MOVE THE DATA PASSED W/O EDIT       01950099
**                                  DON'T INCLUDE LENGTH AS OF 2/19/98  01951099
         EJECT                                                          01960099
***                                                                     01970099
***                                                                     01980099
***                                                                     01990099
MAKEREC5 CLI    ENTRYTYP,TYPE5       PROPER ENTRY IN TABLE?             02000099
         BNE    0(0,RE)              NOPE, EXIT                         02010099
         SR     R5,R5                CLEAR REG 5                        02020099
         MVC    SMFSUBTY+1(1),DDSRTYPE  INDICATE DDS TYPE 5 RECORD      02030099
         ICM    R5,X'C',0(R7)        REG7 PTS TO 2 BYTES OF LENGTH      02040099
         SRL    R5,16                MOVE OVER TWO BYTES                02050099
         CH     R5,MAXREC            DO WE HAVE ENOUGH ROOM?            02060099
         BH     REC2BIG              NO, BAD NEWS                       02070099
         LA     R1,SMFFIXLN(,R5)     COMPUTE COMPLETE LENGTH            02080099
         STH    R1,SMFRLEN           SET RECORD SIZE TO BE WRITTEN      02090099
         EX     R5,TYP5MOV                                              02100099
         STH    R5,SMFDDS1L          STORE LENGTH VALUE                 02110099
         LA     R5,SMFEQDQD-SMFREC   GET OFFSET TO TYPE 5 DATA          02120099
         STH    R5,SMFDDS1O          STORE OFFSET                       02130099
         B      RECFINAL                                                02140061
*NOP     DC     H'0'                                                    02150099
         EJECT                                                          02160099
***                                                                     02170099
***    DARE RECORD                                                      02180099
***                                                                     02190099
MAKEREC6 CLI    ENTRYTYP,TYPE6       PROPER ENTRY IN TABLE?             02200099
         BNE    0(0,RE)              NOPE, EXIT                         02210099
         SR     R5,R5                CLEAR REG 5                        02220093
         SR     R1,R1                CLEAR REG 1                        02230099
         ICM    R5,X'C',0(R7)        REG7 PTS TO 2 BYTES OF LENGTH      02240099
         SRL    R5,16                MOVE OVER IN REGISTER              02250099
         CH     R5,MAXREC2           DO WE HAVE ENOUGH ROOM?            02260099
         BH     REC2BIG              NO, BAD NEWS                       02270099
         LA     R1,SMFFIXLN(,R5)     COMPUTE COMPLETE LENGTH            02280099
         STH    R1,SMFRLEN           SET RECORD SIZE TO BE WRITTEN      02290099
         EX     R5,TYP6MOV                                              02300093
         MVC    SMFSUBTY+1(1),DDSRTYPE  INDICATE DDS TYPE 6 RECORD      02310099
         STH    R5,SMFDDS1L          STORE LENGTH VALUE                 02320093
         LA     R5,SMFEQDQD-SMFREC   GET OFFSET TO TYPE 6 DATA          02330093
         STH    R5,SMFDDS1O          STORE OFFSET                       02340093
         B      RECFINAL                                                02350073
TYP6MOV  MVC   SMFENDSN,2(R7)        SKIP LENGTH AS OF 1/8/97           02360099
         EJECT                                                          02380093
MAKEREC7 CLI    ENTRYTYP,TYPE7       PROPER ENTRY IN TABLE?             02390099
         BNE    0(0,RE)              NOPE, EXIT                         02400099
         SR     R5,R5                CLEAR REG 5                        02410082
         SR     R1,R1                CLEAR REG 1                        02420084
         ICM    R5,X'C',0(R7)        REG7 PTS TO 2 BYTES OF LENGTH      02430087
         SRL    R5,16                MOVE OVER TWO BYTES                02440085
         SH     R5,=H'2'             DEDUCT 2 FOR LENGTH FIELD          02450099
         CH     R5,MAXREC            DO WE HAVE ENOUGH ROOM?            02460087
         BNH    TYP702               YES, CONTINUE                      02470087
         DC     H'0'                                                    02480093
         LH     R5,MAXREC            NO, SET TO MAX RECORD SIZE         02490087
TYP702   LA     R1,SMFFIXLN(,R5)     COMPUTE COMPLETE LENGTH            02500087
         STH    R1,SMFRLEN           SET RECORD SIZE TO BE WRITTEN      02510084
         EX     R5,TYP7MOV                                              02520082
         MVC    SMFSUBTY+1(1),DDSRTYPE  INDICATE DDS TYPE 7 RECORD      02530099
         STH    R5,SMFDDS1L          STORE LENGTH VALUE                 02540082
         LA     R5,SMFFIBAL-SMFREC   GET OFFSET TO TYPE A DATA          02550082
         STH    R5,SMFDDS1O          STORE OFFSET                       02560082
         B      RECFINAL                                                02570080
TYP7MOV  MVC   SMFENDSN,2(R7)       FILE BALANCING RECORD, SKIP LENGTH  02580099
         EJECT                                                          02581099
**                                                                      02590093
**    THE FOLLOWING IS THE WHERE TO GO TABLE BASED ON ENTRY POINT USED  02600093
**                                                                      02610093
         DC     C'WHERE TO GO TABLE'                                    02620096
         DS     0F                                                      02630099
WHERETG  DC     AL1(DUMMY),X'00',CL2'00',A(BADTYPE)    DUMMY ENTRY      02640093
         DC     AL1(TYP1E),X'01',CL2'11',A(MAKEREC1)   REQUEST ACCOUNT  02650099
         DC     AL1(TYPE2),X'02',CL2'22',A(MAKEREC2)   REQUEST CARD     02660099
         DC     AL1(TYPE3),X'03',CL2'33',A(THRDETRY)   QDQ              02670099
         DC     AL1(TYPE4),X'04',CL2'44',A(MAKEREC4)   SOON START       02680099
         DC     AL1(TYPE5),X'05',CL2'55',A(MAKEREC5)   SOON END         02690099
         DC     AL1(TYPE6),X'06',CL2'06',A(MAKEREC6)   DARE ACTNG       02700099
         DC     AL1(TYPE7),X'07',CL2'07',A(MAKEREC7)   BALANCING        02710099
         DS     0H                                                      02720093
REC2BIG  DC     H'0'                                                    02721099
         LH     R2,ABEND4F7         RECORD IS TOO BIG FOR BUFFER        02722099
         B      ABEND                                                   02723099
BADTYPE  LH     R2,ABEND3F7                                             02730095
         DC     H'0'                                                    02740096
ABEND    ABEND  (R2),DUMP,STEP,SYSTEM                                   02750099
**                                                                      02760051
**    WE GET THE TIME HERE TO BE AS CLOSE AS POSSIBLE TO THE TIME THE   02770051
**    RECORD IS GIVEN TO SMF                                            02780051
**                                                                      02790051
RECFINAL TIME   BIN             R0=TIME R1=DATE                         02800043
         STCM   R0,15,SMFTIME                                           02810099
         STCM   R1,15,SMFDATE                                           02820099
         SMFEWTM (R4),BRANCH=NO,SUBSYS=#DDS                             02830099
         LTR    R6,R15                                                  02840099
         BZ     EXIT                                                    02850040
         DC     H'0'                                                    02860040
ABEND3F7 DC     XL2'03F7'                                               02870064
ABEND4F7 DC     XL2'04F7'                                               02871099
*                                                                       02880000
EXIT     EQU   *                                                        02890040
         L     R5,4(,R13)       GET PTR TO CALLERS SAVE AREA BEFORE     02900087
*                               FREEMAIN OF MY SAVE AREA                02910040
         L     R3,SIZE                                                  02920087
      FREEMAIN R,LV=(3),A=(10),SP=0                                     02930036
         L     RE,12(,R5)      PICK UP RETURN ADDRESS                   02940099
         LM    R0,R12,20(R5)   RESTORE REGS                             02950087
         BR    RE              RETURN TO CALLER                         02960099
         DS    0H                                                       02970087
MAXREC   DC    AL2(SMFDDSM)                                             02980087
MAXREC2  DC    AL2(255)                                                 02981099
TYP3MOV  MVC   SMFEQDQD,0(R07)      MOVE THE DATA PASSED W/O EDIT       02990087
         EJECT                                                          03000000
TABLEMAP DSECT                                                          03010099
ENTRYTYP DS     AL1       1ST BYTE, ENTRY TYPE IN TABLE                 03020099
DDSRTYPE DS     XL1       DDS SUBTYPE BEING CREATED                     03030099
FLAG1    DS     XL1                                                     03040099
FLAG2    DS     XL1                                                     03050099
RTNADDR  DS     AL4       ADDRESS OF ROUTINE TO PROCESS THE RECORD      03060099
SMFREC   DSECT                                                          03070002
SMFRLEN  DS    H                                                        03080002
SMFRDES  DS    H                                                        03090002
SMFSYS   DS    X                                                        03100002
SMFTYPE  DS    X                                                        03110002
SMFTIME  DS    XL4                                                      03120002
SMFDATE  DS    PL4                                                      03130002
SMFSID   DS    CL4                                                      03140002
**                                                                      03150020
SMFSUBSY DS    CL4       SUBSYSTEM IDENTIFICATION                       03160052
SMFSUBTY DS    XL2       RECORD SUBTYPE (DDS DEFINED)                   03170052
SMFDDSHO DS    XL2       OFFSET TO DDS HEADER (FROM SMFREC)             03180052
SMFDDSHL DS    XL2       LENGTH OF DDS HEADER                           03190052
SMFDDS1O DS    XL2       OFFSET TO 1ST DDS SECTION                      03200052
SMFDDS1L DS    XL2       LENGTH OF 1ST DDS SECTION                      03210052
**  DDS HEADER SECTION FOLLOWS                                          03220052
SMFJOBNM DS    CL8       JOB           NAME                             03230022
SMFJOBST DS    CL16      STEP/PROCSTEP NAME                             03240022
SMFJOBID DS    CL8       JES JOB ID    NAME                             03250022
SMFDDSEH EQU   *         END OF DDS HEADER                              03260052
SMFFIXLN EQU   SMFDDSEH-SMFREC                                          03270084
**                       BEGIN DDS DATA SECTION                         03280052
SMFSYSTE DS    CL2                                                      03290017
SMFPROG  DS    CL2                                                      03300017
SMFUSER  DS    CL2                                                      03310017
SMFMEDIA DS    CL1                                                      03320017
SMFREQNO DS    PL3                                                      03330017
SMFSEGNO DS    PL3                                                      03340017
SMFREQCP DS    XL4      REQUEST CPU TIME                                03350021
SMFREQLP DS    XL4              LPS                                     03360021
SMFREQSI DS    XL4              SIO'S                                   03370021
SMFREQPA DS    XL4              PAGES                                   03380021
SMFREQLI DS    XL4              LINES PRINTED                           03390021
SMFREMOT DS    CL80                                                     03400018
SMFREMPQ DS    XL7                                                      03410018
SMFFILE  DS    X                                                        03420069
SMFEND   DS    0X                                                       03430002
         ORG   SMFSYSTE                                                 03440043
SMFRECIM DS    CL80            REQUEST CARD IMAGE                       03450043
         ORG   SMFSYSTE                                                 03460056
SMFEQDQD DS    CL32            ENQ/DEQ DATA                             03470056
         ORG   SMFSYSTE                                                 03480061
SMFENDSN DS    CL4             END OF SOON JOB DATA                     03490061
         ORG   SMFSYSTE                                                 03500067
SMFSRTSN DS    CL4             START OF SOON JOB DATA                   03510067
*      ABOVE FIELD AREA IS ACTUALLY MUCH LONGER                         03520080
         ORG   SMFSYSTE                                                 03530080
SMFFIBAL DS    CL4             START OF FILE BALANCING DATA             03540080
*      ABOVE FIELD AREA IS ACTUALLY MUCH LONGER                         03550072
DDS1LEN  EQU   SMFEND-SMFSYSTE LENGTH OF SUBTYPE 1 RECORD               03560052
SMFSIZE  EQU   SMFEND-SMFREC   LENGTH OF LARGEST  RECORD                03570053
SMFDDSM  EQU   SMFSIZE-SMFFIXLN    LARGEST AREA TO HOLD MOVED IN DATA   03580087
         EJECT                                                          03590000
*          DATA SET DDREPMASTD AT LEVEL 031 AS OF 06/20/85              03600017
*              DSECT TO COVER STORAGE FOR MASTER CONTROL                03610017
         SPACE 3                                                        03620017
MASTD    DSECT                                                          03630017
         SPACE 2                                                        03640017
MCINPUT  DS    CL1                 REQUEST CONTROL                      03650017
MCSTART  DS    PL3                                                      03660017
MCEND    DS    PL3                                                      03670017
MCREQCOD DS    CL2                                                      03680017
MCREQCON DS    CL1                                                      03690017
MCNREQS  DS    PL3                                                      03700017
MCREQREC DS    CL80                                                     03710017
MCUPSI   DS    CL1                                                      03720017
MCTSTRUN DS    XL1                                                      03730017
MCREQFIL DS    CL1                 Y=ALTERNATE SYSIN FILE               03740017
MCRUNMOD DS    CL1                 S=SINGLE REQ MODE FOR RRG            03750017
MCRESTRT DS    CL1                 Y=START CARD PRESENT                 03760017
         DS    CL11                                                     03770017
         SPACE 2                                                        03780017
MCOUTPUT DS    CL1                 OUTPUT CONTROL                       03790017
         DS    CL39                                                     03800017
         SPACE 2                                                        03810017
MCTRACE  DS    CL1                 RUN CONTROL                          03820017
MCDUMP   DS    CL1                                                      03830017
MCWRITE  DS    CL1                                                      03840017
MCDATE   DS    CL8                                                      03850017
MCNUMBER DS    CL4                                                      03860017
MCRERUN  DS    CL1                                                      03870017
MCRECOVR DS    CL1                                                      03880017
MCTIMOPT DS    CL1                                                      03890017
MCTIMCON DS    PL3                                                      03900017
MCPAGCON DS    PL3                                                      03910017
MCCHECKP DS    CL1                                                      03920017
MCLOADSM DS    CL1                                                      03930017
MCBLOW   DS    CL1                                                      03940017
MCRERUND DS    CL2                                                      03950017
MCPOSTNG DS    CL1                                                      03960017
MCMAXLIN DS    CL1                                                      03970017
MCOFFSET DS    CL1                                                      03980017
         DS    CL8                                                      03990017
         SPACE 1                                                        04000017
MCNETPAK DS    CL1                 SPOT SPECIAL                         04010017
         SPACE 2                                                        04020017
MCTEST1  DS    CL1                 PHASE CONTROL                        04030017
MCTEST2  DS    CL1                                                      04040017
MCTEST3  DS    CL1                                                      04050017
MCTEST4  DS    CL1                                                      04060017
MCLOAD   DS    CL4                                                      04070017
MCAPHAS1 DS    A                                                        04080017
MCAPHAS2 DS    A                                                        04090017
MCAPHAS3 DS    A                                                        04100017
MCAPHAS4 DS    A                                                        04110017
         SPACE 2                                                        04120017
MCORIGID DS    H                   WRAP CONTROL                         04130017
MCDESTID DS    H                                                        04140017
MCORIGIN DS    CL33                                                     04150017
MCORIGAD DS    CL33                                                     04160017
         SPACE 2                                                        04170017
MCACPHSE DS    CL1                 ACCPAK SPECIAL                       04180017
MCACIFIL DS    CL1                                                      04190017
MCACOFIL DS    CL1                                                      04200017
MCACWFIL DS    CL1                                                      04210017
MCACFCHE DS    CL4                                                      04220017
MCACLDGE DS    CL1                                                      04230017
         SPACE 2                                                        04240017
MCMEDREP DS    CL1                 MEDLINE SPECIAL                      04250017
         SPACE 2                                                        04260017
MCSYSTEM DS    CL2                 SYSTEM CONTROL                       04270017
MCPROG   DS    CL2                                                      04280017
MCUSER   DS    CL2                                                      04290017
MCMEDIA  DS    CL1                                                      04300017
         SPACE 2                                                        04310017
         DS    0D                                                       04320017
MCUSREGS DS    CL72                INTERRUPTION CONTROL                 04330017
MCRUNLST DS    CL64                                                     04340017
MCREQLST DS    CL64                                                     04350017
MCLSTPSW DS    A                                                        04360017
MCAWORK  DS    F                                                        04370017
MCREASON DS    CL1                                                      04380017
MCNDUMPS DS    PL3                                                      04390017
MCOPTION DS    CL5                                                      04400017
MCSTOP   DS    CL1                                                      04410017
MCREQNO  DS    PL3                                                      04420017
MCSEGNO  DS    PL3                                                      04430017
         SPACE 2                                                        04440017
MCREQCPU DS    F                   REQUEST LEVEL JOB ACCOUNTING         04450017
MCREQLPS DS    F                                                        04460017
MCREQSIO DS    F                                                        04470017
MCREQPAG DS    F                                                        04480017
MCREQLIN DS    F                                                        04490017
         DS    CL12                                                     04500017
         SPACE 3                                                        04510017
MCRUNCPU DS    F                   RUN LEVEL JOB ACCOUNTING             04520017
MCRUNLPS DS    F                                                        04530017
MCRUNSIO DS    F                                                        04540017
MCRUNPAG DS    F                                                        04550017
MCRUNLIN DS    F                                                        04560017
         DS    CL12                                                     04570017
         SPACE 2                                                        04580017
MCBXMRGE DS    A                   ADDRESS OF BOX MERGE ROUTINE         04590017
MCBXAREA DS    A                   ADDRESS OF BOX DEFINITION AREA       04600017
MCVREMOT DS    V                   ADDRESS OF REMOTEC                   04610017
MCVLOGOC DS    V                   ADDRESS OF LOGOC                     04620017
         DS    CL3                                                      04630017
MCPOPSW  DS    C                   C'P' IF TIMER POP ACTIVE             04640017
         SPACE 2                                                        04650017
MCRTP    DS    0XL16                                                    04660017
MCRTPTIM DS    F                   ELAPSED TIME TILL OPER MSG           04670017
MCRTPPGS DS    F                   PAGE COUNT TILL OPER MSG             04680017
MCRTPIOS DS    F                   EXCP COUNT TILL OPER MSG             04690017
MCRTPCPU DS    F                   CONTINUOUS CPU TIME TILL OPER MSG    04700017
*                                                                       04710017
MCNXT    DS    0XL12                                                    04720017
MCNXTTIM DS    F                   NEXT ELAPSED TIME FOR MESSAGE        04730017
MCNXTPGS DS    F                   NEXT PAGE COUNT FOR MESSAGE          04740017
MCNXTIOS DS    F                   NEXT IO COUNT FOR MESSAGE            04750017
*                                                                       04760017
MCACTIOS DS    F                   ACTUAL IO COUNT                      04770017
MCDMPEND DS    A                   END OF DUMP ADDRESS                  04780017
MCUTL    DS    A                   A(UTL)                               04790017
MCREMOTE DS    CL80                                                     04800017
MCREMPQK DS    XL7                 PQ REPORT KEY      (FOR JOB NOTIFY)  04810017
MCREMPQA DS    XL2                 PQ REPORT C/I ADDR (FOR JOB NOTIFY)  04820017
         EJECT                                                          04830017
DATA     DSECT                                                          04840000
         DS    0D                                                       04850031
SAVE     DS    20F                                                      04860032
BUFFER   DS    F                                                        04870002
RECORD   DS    XL(SMFSIZE)                                              04880003
ENDOFA   DS    0X                                                       04890032
DDSSMF   CSECT                                                          04900028
#DDS     DC    CL4'#DDS'                                                04910053
ANUM     DC    F'6000'                                                  04920009
SIZE     DC    F'800'  CHANGE TO DOUBLE WORD MULTIPLE                   04930031
DUMMY    EQU    0       DUMMY TYPE                                      04940091
TYPE1    DC    H'1'                                                     04950051
TYP1E    EQU    1       EQUATE VERSION OF TYPE1                         04960091
TYPE2    EQU    2                                                       04970055
TYPE3    EQU    3                                                       04980057
TYPE4    EQU    4                                                       04990060
TYPE5    EQU    5                                                       05000060
TYPE6    EQU    6                                                       05010073
TYPE7    EQU    7        FILE BALANCING RECORD                          05020081
TYPE9    EQU    9                                                       05030074
*YPEA    EQU    10                                                      05040099
R0       EQU    00                                                      05050074
R1       EQU    01                                                      05060074
R2       EQU    02                                                      05070074
R3       EQU    03                                                      05080074
R4       EQU    04                                                      05090074
R5       EQU    05                                                      05100074
R05      EQU    05                                                      05110074
R6       EQU    06                                                      05120074
R7       EQU    07                                                      05130074
R07      EQU    07                                                      05140074
R8       EQU    08                                                      05150074
R08      EQU    08                                                      05160074
R9       EQU    09                                                      05170074
RA       EQU    10                                                      05180074
RB       EQU    11                                                      05190074
RC       EQU    12                                                      05200074
R12      EQU    12                                                      05210074
RD       EQU    13                                                      05220074
R13      EQU    13                                                      05230074
RE       EQU    14                                                      05240074
R14      EQU    14                                                      05250074
RF       EQU    15                                                      05260074
R15      EQU    15                                                      05270074
         IEESMCA                                                        05280007
         IHAPSA                                                         05290004
*NOP     CVT    DSECT=YES,LIST=YES                                      05300099
         CVT    DSECT=YES                                               05310099
         IEZJSCB                IEZJSCB                                 05320022
         IEFJSSIB               SSIB                                    05330022
         IKJTCB                 TCB                                     05340022
         IEFTIOT1       TCBTIO  TIOT1 IN USING                          05350022
         END                                                            05360000
