*          DATA SET FSLNKEL    AT LEVEL 002 AS OF 11/25/74                      
FSLNKEL  DS    0C                  ***FI SUMRY LINK ELEMENT***                  
FSLCODE  DS    X'04'               ELEMENT CODE                                 
FSLLEN   DS    CL1 . B             ELEMENT LENGTH                               
FSHMRKT  DS    CL2 . B             HIGH MARKET NUMBER                           
FSPACTD  DS    CL2 , B             ACTIVITY DATE                                
