*          DATA SET FSMELEM    AT LEVEL 003 AS OF 07/16/73                      
FSMELEM  DS    0C                  *** FILM SIMULATION ELEMENT ***              
FSMCODE  DS    X'05'               ELEMENT CODE                                 
FSMLEN   DS    CL1 . B             ELEMENT LENGTH                               
FSMPRD   DS    CL2 . A             PRODUCT CODE                                 
FSMSNO   DS    CL2 . B             ISCI FILM NUMBER                             
FSMCNO   DS    CL8 . A/N           CANNISTER FILM NUMBER                        
