*          DATA SET GA29FFD    AT LEVEL 007 AS OF 10/04/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB29FFD      DATE 10/04/91                 
         SPACE 1                                                                
TB29FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
FIBHEADH DS    CL8                                                              
FIBHEAD  DS    CL60     1    2   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL44     3   10   44  A   P    N         T        Y              
FIBNUMBH DS    CL8                                                              
FIBNUMB  DS    CL2      3   58    2  N   U    H         T    I   Y    1         
FIBNUMBX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34     4   10   34  A   P    N         T        Y              
FIBFORMH DS    CL8                                                              
FIBFORM  DS    CL1      4   58    1  A   U    H         T        Y    2         
FIBFORMX DS    CL8                                                              
FIBFRSTH DS    CL8                                                              
FIBFRST  DS    CL15     5   10   15  A   P    N         T        Y              
FIBSCNDH DS    CL8                                                              
FIBSCND  DS    CL15     5   30   15  A   P    N         T        Y              
FIBTHRDH DS    CL8                                                              
FIBTHRD  DS    CL15     5   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     6   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     6   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     6   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     7   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     7   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     7   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     8   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     8   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     8   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     9   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     9   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     9   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    10   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    10   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    10   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    12   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    12   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    12   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    13   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    13   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    13   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    14   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    14   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    14   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    15   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    15   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    15   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    16   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    16   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    16   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    17   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    17   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    17   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    18   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    18   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    18   50   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    19   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    19   30   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    19   50   15  A   P    N         T        Y              
FIBCTAGH DS    CL8                                                              
FIBCTAG  DS    CL1     19   70    1  A   P    N         T        Y              
FIBLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
FIBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1336 BYTES                            
