*          DATA SET GAABBFFD   AT LEVEL 011 AS OF 10/17/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB22FFD      DATE 10/17/94                 
         SPACE 1                                                                
TB22FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCRHEADH DS    CL8                                                              
SCRHEAD  DS    CL60     1    2   60  A  P H             T        Y              
SCRSVRQH DS    CL8                                                              
SCRSVRQ  DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     3    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      5    2    8  A  P N             T        Y              
SCROPTH  DS    CL8                                                              
SCROPT   DS    CL50     5   15   50  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
SCRGRD1H DS    CL8                                                              
SCRGRD1  DS    CL3      7   25    3  A  U N             T        Y              
SCRLTR1H DS    CL8                                                              
SCRLTR1  DS    CL1      7   30    1  A  P N             T        Y    0         
SCRLTR1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   25    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   25    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   25    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   25    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   25    3  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   25    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   25    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   25    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   30    1  A  P N             T        Y              
SCRLSCRH DS    CL8                                                              
SCRLSCR  DS    CL3     16   25    3  A  U N             T        Y              
SCRLGRDH DS    CL8                                                              
SCRLGRD  DS    CL1     16   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
SCRAVG1H DS    CL8                                                              
SCRAVG1  DS    CL3     18   25    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
SCRAVG2H DS    CL8                                                              
SCRAVG2  DS    CL3     20   25    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    22    2   14  A  P N             T        Y              
SCRPRCTH DS    CL8                                                              
SCRPRCT  DS    CL3     22   25    3  A  P N             T        Y              
SCRCHNGH DS    CL8                                                              
SCRCHNG  DS    CL15    22   30   15  A  P N             T        Y              
SCRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 600  BYTES                            
