*          DATA SET GAANAFFD   AT LEVEL 002 AS OF 01/17/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB15FFD      DATE 01/17/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ANAHDRH  DS    CL8                                                              
ANAHDR   DS    CL60     1    2   60  A   P    N         T        Y              
ANASRVH  DS    CL8                                                              
ANASRV   DS    CL17     1   63   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      3    2    7  A   P    N         T        Y              
ANAGMH   DS    CL8                                                              
ANAGM    DS    CL15     3   16   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     4    2   12  A   P    N         T        Y              
ANAFLETH DS    CL8                                                              
ANAFLET  DS    CL1      4   16    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  A   P    H         T        Y              
ANAGUSH  DS    CL8                                                              
ANAGUS   DS    CL15     6   16   15  A   U    H    M    T    I   Y              
ANAG1H   DS    CL8                                                              
ANAG1    DS    CL29     8    2   29  A   P    N         T        Y              
ANAG2H   DS    CL8                                                              
ANAG2    DS    CL29     9    2   29  A   P    N         T        Y              
ANAG3H   DS    CL8                                                              
ANAG3    DS    CL29    10    2   29  A   P    N         T        Y              
ANAANSH  DS    CL8                                                              
ANAANS   DS    CL29    12    2   29  A   P    H         T        Y              
ANASCOH  DS    CL8                                                              
ANASCO   DS    CL21    14    2   21  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL42    21    2   42  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL42    22    2   42  L   P    N         T        Y              
ANALAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
ANAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 827  BYTES                            
