*          DATA SET GABAKFFD   AT LEVEL 002 AS OF 05/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB0BFFD      DATE 05/11/83                 
         SPACE 1                                                                
TB0BFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
BAKHEADH DS    CL8                                                              
BAKHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
BAKSERVH DS    CL8                                                              
BAKSERV  DS    CL17     1   63   17   A    U    N         T         Y           
BAKMIDH  DS    CL8                                                              
BAKMID   DS    CL60     2    2   60   A    P    N         T         Y           
BAKSUBH  DS    CL8                                                              
BAKSUB   DS    CL25     4    2   25   A    P    N         T         Y           
BAKMOVEH DS    CL8                                                              
BAKMOVE  DS    CL27     4   28   27   A    U    N    M    T    I    Y           
         DS    CL8                                                              
         DS    CL57     6    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57     7    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57     8    7   57   A    P    N         T         Y           
BAKLINAH DS    CL8                                                              
BAKLINA  DS    CL57     9    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    10    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    11    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    12    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    13    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    14    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    15    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    16    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    17    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    18    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    19    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    20    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    21    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    22    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    23    7   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL57    24    7   57   A    P    N         T         Y           
BAKLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
BAKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1467 BYTES                            
