*          DATA SET GABATFFD   AT LEVEL 003 AS OF 05/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB09FFD      DATE 05/11/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
BATHDRH  DS    CL8                                                              
BATHDR   DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
BATENTH  DS    CL8                                                              
BATENT   DS    CL15     3    3   15   A    P    N         T         Y           
BATSHOTH DS    CL8                                                              
BATSHOT  DS    CL19     3   20   19   A    U    N    M    T    I    Y           
         DS    CL8                                                              
         DS    CL16     3   58   16   A    P    N         T         Y           
BATYLSH  DS    CL8                                                              
BATYLS   DS    CL22     5    4   22   A    P    N         T         Y           
BATFCBTH DS    CL8                                                              
BATFCBT  DS    CL20     5   58   20   A    P    N         T         Y           
BATPHMSH DS    CL8                                                              
BATPHMS  DS    CL44     6   11   44   A    P    N         T         Y           
BATFCCRH DS    CL8                                                              
BATFCCR  DS    CL20     6   58   20   A    P    N         T         Y           
BATFCFGH DS    CL8                                                              
BATFCFG  DS    CL20     7   58   20   A    P    N         T         Y           
BATMLSH  DS    CL8                                                              
BATMLS   DS    CL22     8    4   22   A    P    N         T         Y           
BATFCDRH DS    CL8                                                              
BATFCDR  DS    CL20     8   58   20   A    P    N         T         Y           
BATMSHTH DS    CL8                                                              
BATMSHT  DS    CL44     9   11   44   A    P    N         T         Y           
BATPQSZH DS    CL8                                                              
BATPQSZ  DS    CL23    11    5   23   A    P    N         T         Y           
BATMQSZH DS    CL8                                                              
BATMQSZ  DS    CL24    11   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL23    12    5   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    12   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL23    13    5   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL20    13   31   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL23    13   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     14    3    1   A    P    N         T         Y           
BATRW1PH DS    CL8                                                              
BATRW1P  DS    CL23    14    5   23   A    U    N         T         Y           
BATGH    DS    CL8                                                              
BATG     DS    CL22    14   30   22   A    P    N         T         Y           
BATRW1MH DS    CL8                                                              
BATRW1M  DS    CL23    14   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     14   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     15    3    1   A    P    N         T         Y           
BATRW2PH DS    CL8                                                              
BATRW2P  DS    CL23    15    5   23   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     15   30    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     15   51    1   A    P    N         T         Y           
BATRW2MH DS    CL8                                                              
BATRW2M  DS    CL23    15   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     15   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16    3    1   A    P    N         T         Y           
BATRW3PH DS    CL8                                                              
BATRW3P  DS    CL23    16    5   23   A    U    N         T         Y           
BATBTSPH DS    CL8                                                              
BATBTSP  DS    CL22    16   30   22   A    P    N         T         Y           
BATRW3MH DS    CL8                                                              
BATRW3M  DS    CL23    16   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     17    3    1   A    P    N         T         Y           
BATRW4PH DS    CL8                                                              
BATRW4P  DS    CL23    17    5   23   A    U    N         T         Y           
BATCRSSH DS    CL8                                                              
BATCRSS  DS    CL22    17   30   22   A    P    N         T         Y           
BATRW4MH DS    CL8                                                              
BATRW4M  DS    CL23    17   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     17   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     18    3    1   A    P    N         T         Y           
BATRW5PH DS    CL8                                                              
BATRW5P  DS    CL23    18    5   23   A    U    N         T         Y           
BATFGTSH DS    CL8                                                              
BATFGTS  DS    CL22    18   30   22   A    P    N         T         Y           
BATRW5MH DS    CL8                                                              
BATRW5M  DS    CL23    18   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     18   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     19    3    1   A    P    N         T         Y           
BATRW6PH DS    CL8                                                              
BATRW6P  DS    CL23    19    5   23   A    U    N         T         Y           
BATDTRSH DS    CL8                                                              
BATDTRS  DS    CL22    19   30   22   A    P    N         T         Y           
BATRW6MH DS    CL8                                                              
BATRW6M  DS    CL23    19   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     19   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     20    3    1   A    P    N         T         Y           
BATRW7PH DS    CL8                                                              
BATRW7P  DS    CL23    20    5   23   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     20   30    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     20   51    1   A    P    N         T         Y           
BATRW7MH DS    CL8                                                              
BATRW7M  DS    CL23    20   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     20   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     21    3    1   A    P    N         T         Y           
BATRW8PH DS    CL8                                                              
BATRW8P  DS    CL23    21    5   23   A    U    N         T         Y           
BATHITSH DS    CL8                                                              
BATHITS  DS    CL22    21   30   22   A    P    N         T         Y           
BATRW8MH DS    CL8                                                              
BATRW8M  DS    CL23    21   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     21   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     22    3    1   A    P    N         T         Y           
BATRW9PH DS    CL8                                                              
BATRW9P  DS    CL23    22    5   23   A    U    N         T         Y           
BATMSSSH DS    CL8                                                              
BATMSSS  DS    CL22    22   30   22   A    P    N         T         Y           
BATRW9MH DS    CL8                                                              
BATRW9M  DS    CL23    22   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     22   78    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL2     23    2    2   A    P    N         T         Y           
BATR10PH DS    CL8                                                              
BATR10P  DS    CL23    23    5   23   A    U    N         T         Y           
BATSNKSH DS    CL8                                                              
BATSNKS  DS    CL22    23   30   22   A    P    N         T         Y           
BATR10MH DS    CL8                                                              
BATR10M  DS    CL23    23   54   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL2     23   78    2   A    P    N         T         Y           
BATTBPTH DS    CL8                                                              
BATTBPT  DS    CL1     24    5    1   A    U    N         T         Y           
BATLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
BATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1749 BYTES                            
