*          DATA SET GABLKFFD   AT LEVEL 003 AS OF 05/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB03FFD      DATE 05/11/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
BLAHEADH DS    CL8                                                              
BLAHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      3    1    7   A    P    N         T         Y           
BLAACTH  DS    CL8                                                              
BLAACT   DS    CL2      3   19    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      4    1    6   A    P    N         T         Y           
BLASTKEH DS    CL8                                                              
BLASTKE  DS    CL5      4   19    5   N    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL1      4   63    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10     6    1   10   A    P    N         T         Y           
BLAYOURH DS    CL8                                                              
BLAYOUR  DS    CL20     6   19   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12     7    1   12   A    P    N         T         Y           
BLAPNTH  DS    CL8                                                              
BLAPNT   DS    CL10     7   19   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10     9    1   10   A    P    N         T         Y           
BLABANKH DS    CL8                                                              
BLABANK  DS    CL20     9   19   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16    11    1   16   A    P    N         T         Y           
BLATHISH DS    CL8                                                              
BLATHIS  DS    CL10    11   19   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL15    12    1   15   A    P    N         T         Y           
BLARESH  DS    CL8                                                              
BLARES   DS    CL10    12   19   10   A    P    N         T         Y           
BLALAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
BLAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 370  BYTES                            
