*          DATA SET GABOGFFBD  AT LEVEL 007 AS OF 09/28/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB18FFD      DATE 09/28/92                 
         SPACE 1                                                                
TB18FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BOGHEADH DS    CL8                                                              
BOGHEAD  DS    CL60     1    2   60  A   P    H         T        Y              
BOGSVRQH DS    CL8                                                              
BOGSVRQ  DS    CL17     1   63   17  A   U    N         T        Y              
BOGMSG1H DS    CL8                                                              
BOGMSG1  DS    CL18     2    2   18  A   P    H         T        Y              
BOGTBDRH DS    CL8                                                              
BOGTBDR  DS    CL26     2   54   26  A   P    N         T        Y              
BOGROW1H DS    CL8                                                              
BOGROW1  DS    CL1      3   54    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      3   56    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      3   59    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      3   61    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      3   64    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      3   66    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      3   69    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      3   71    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      3   74    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      3   76    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      3   79    1  A   P    N         T        Y              
BOGMSG2H DS    CL8                                                              
BOGMSG2  DS    CL24     4    3   24  L   P    N         T        Y              
BOGSHFLH DS    CL8                                                              
BOGSHFL  DS    CL1      4   29    1  A   U    H         T        Y              
BOGDSH1H DS    CL8                                                              
BOGDSH1  DS    CL26     4   54   26  A   P    N         T        Y              
BOGMG3AH DS    CL8                                                              
BOGMG3A  DS    CL39     5    3   39  L   P    N         T        Y              
BOGGNBDH DS    CL8                                                              
BOGGNBD  DS    CL1      5   44    1  A   U    H         T        Y              
BOGROW2H DS    CL8                                                              
BOGROW2  DS    CL1      5   54    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   56    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   59    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   61    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   64    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   66    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   69    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   71    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   74    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   76    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
BOGMSG4H DS    CL8                                                              
BOGMSG4  DS    CL24     6    3   24  L   P    N         T        Y              
BOGDFCTH DS    CL8                                                              
BOGDFCT  DS    CL1      6   29    1  A   U    H         T        Y              
BOGDSH2H DS    CL8                                                              
BOGDSH2  DS    CL26     6   54   26  A   P    N         T        Y              
BOGMSG5H DS    CL8                                                              
BOGMSG5  DS    CL28     7    3   28  L   P    N         T        Y              
BOGTLMTH DS    CL8                                                              
BOGTLMT  DS    CL1      7   33    1  A   U    H         T        Y              
BOGROW3H DS    CL8                                                              
BOGROW3  DS    CL1      7   54    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      7   56    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      7   59    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      7   61    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      7   64    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      7   66    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      7   69    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      7   71    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      7   74    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      7   76    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      7   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14     8    4   14  A   P    Z         T        Y              
BOGTIMEH DS    CL8                                                              
BOGTIME  DS    CL4      8   19    4  A   P    Z         T        Y              
         DS    CL8                                                              
         DS    CL14     8   24   14  A   P    Z         T        Y              
BOGDSH3H DS    CL8                                                              
BOGDSH3  DS    CL26     8   54   26  A   P    N         T        Y              
BOGMSG6H DS    CL8                                                              
BOGMSG6  DS    CL36     9    3   36  L   P    N         T        Y              
BOGSIZEH DS    CL8                                                              
BOGSIZE  DS    CL1      9   41    1  A   U    H         T    I   Y              
BOGROW4H DS    CL8                                                              
BOGROW4  DS    CL1      9   54    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   56    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   59    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   61    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   64    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   66    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   69    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   71    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   74    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   76    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   79    1  A   P    N         T        Y              
BOGDSH4H DS    CL8                                                              
BOGDSH4  DS    CL26    10   54   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL22    11    3   22  A   P    N         T        Y              
BOGGUESH DS    CL8                                                              
BOGGUES  DS    CL10    11   27   10  A   P    H         T        Y              
BOGROW5H DS    CL8                                                              
BOGROW5  DS    CL1     11   54    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   56    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   59    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   61    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   64    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   66    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   69    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   71    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   74    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   76    2  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL41    12    5   41  A   P    N         T        Y              
BOGBBDRH DS    CL8                                                              
BOGBBDR  DS    CL26    12   54   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    14    2   11  L   P    H         T        Y              
BOGPWRDH DS    CL8                                                              
BOGPWRD  DS    CL12    14   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     16    4    6  L   P    N         T        Y              
BOGPSCLH DS    CL8                                                              
BOGPSCL  DS    CL1     16   11    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17    3    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    19    2   11  L   P    H         T        Y              
BOGCWRDH DS    CL8                                                              
BOGCWRD  DS    CL12    19   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     21    4    6  L   P    N         T        Y              
BOGCSCLH DS    CL8                                                              
BOGCSCL  DS    CL1     21   11    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22    3    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23   67   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24   28   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24   41   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24   54   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24   67   12  A   P    N         T        Y              
BOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2520 BYTES                            
