*          DATA SET GACNTFFD   AT LEVEL 003 AS OF 10/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB24FFD      DATE 10/09/98                 
         SPACE 1                                                                
TB24FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CNTHEADH DS    CL8                                                              
CNTHEAD  DS    CL60     1    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
CNTLABLH DS    CL8                                                              
CNTLABL  DS    CL10     3    5   10  A  P N             T        Y              
CNTSTUDH DS    CL8                                                              
CNTSTUD  DS    CL3      3   18    3  A  U N             T        Y              
CNTGRDEH DS    CL8                                                              
CNTGRDE  DS    CL1      3   22    1  A  P N             T    I   Y              
         DS    CL8                                                              
         DS    CL10     4    5   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      4   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      4   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     5    5   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     6    5   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    5   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8    5   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     9    5   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    5   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    5   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    5   10  A  P N             T        Y              
CNTLASTH DS    CL8                                                              
CNTLAST  DS    CL3     12   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    5   10  A  P N             T        Y              
CNTAVGH  DS    CL8                                                              
CNTAVG   DS    CL3     14   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
CNTPREVH DS    CL8                                                              
CNTPREV  DS    CL3     15   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
CNTCHNGH DS    CL8                                                              
CNTCHNG  DS    CL3     16   18    3  A  U N             T        Y              
CNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 632  BYTES                            
