*          DATA SET GACRPFFD   AT LEVEL 024 AS OF 08/13/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB1AFFD      DATE 08/13/93                 
         SPACE 1                                                                
TB1AFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CRPHEADH DS    CL8                                                              
CRPHEAD  DS    CL60     1    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     3    5   21  A  P N             T        Y              
CRPBETH  DS    CL8                                                              
CRPBET   DS    CL6      3   28    6  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL17     4    5   17  A  P N             T        Y              
CRPROLLH DS    CL8                                                              
CRPROLL  DS    CL1      4   24    1  A  U N             T        Y              
CRPDICH  DS    CL8                                                              
CRPDIC   DS    CL11     7    5   11  A  P N             T        Y              
CRPDI1VH DS    CL8                                                              
CRPDI1V  DS    CL1     10    7    1  A  P N             T        Y              
CRPDI2VH DS    CL8                                                              
CRPDI2V  DS    CL1     10   14    1  A  P N             T        Y              
CRPDSUMH DS    CL8                                                              
CRPDSUM  DS    CL2     10   21    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18    5   10  A  P N             T        Y              
CRPSTTVH DS    CL8                                                              
CRPSTTV  DS    CL6     18   30    6  A  P N             T        Y              
CRPSTRTH DS    CL8                                                              
CRPSTRT  DS    CL17    21    5   17  A  P N             T        Y              
CRPNEWGH DS    CL8                                                              
CRPNEWG  DS    CL27    23    5   27  A  P N             T        Y              
CRPINEWH DS    CL8                                                              
CRPINEW  DS    CL1     23   34    1  A  U N             T        Y              
CRPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CRPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 392  BYTES                            
