*          DATA SET GAGINFFD   AT LEVEL 073 AS OF 04/27/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB1DFFD      DATE 04/27/94                 
         SPACE 1                                                                
TB1DFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
GINHEADH DS    CL8                                                              
GINHEAD  DS    CL60     1    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  L  U N             T        Y              
GINCHNDH DS    CL8                                                              
GINCHND  DS    CL60     2    1   60  A  P N             T        Y              
GININPTH DS    CL8                                                              
GININPT  DS    CL11     3    3   11  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL19     5   51   19  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL37     6    1   37  A  P N             T        Y              
GINDKSLH DS    CL8                                                              
GINDKSL  DS    CL1      6   39    1  A  U N             T        Y    1         
GINDKSLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     6   51   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37     7    1   37  A  P N             T        Y              
GINDCSLH DS    CL8                                                              
GINDCSL  DS    CL1      7   39    1  A  U N             T        Y    2         
GINDCSLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7   51   11  A  P N             T        Y              
GINDCVAH DS    CL8                                                              
GINDCVA  DS    CL2      7   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   69    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19     8   51   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37     9    1   37  A  P N             T        Y              
GINGINH  DS    CL8                                                              
GINGIN   DS    CL3      9   39    3  A  U N             T        Y    3         
GINGINX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9   51    9  A  P N             T        Y              
GINDCSH  DS    CL8                                                              
GINDCS   DS    CL9      9   61    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    10   51   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   51   11  A  P N             T        Y              
GINDCVBH DS    CL8                                                              
GINDCVB  DS    CL2     11   66    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11   69    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    12   51   19  A  P N             T        Y              
GINNUM1H DS    CL8                                                              
GINNUM1  DS    CL3     14    4    3  A  P N             T        Y              
GINNUM2H DS    CL8                                                              
GINNUM2  DS    CL3     14   14    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   24    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   34    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   44    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   64    3  A  P N             T        Y              
GINNUM8H DS    CL8                                                              
GINNUM8  DS    CL3     14   74    3  A  P Z             T        Y              
GINC1#1H DS    CL8                                                              
GINC1#1  DS    CL8     15    1    8  A  P N             T        Y              
GINC2#1H DS    CL8                                                              
GINC2#1  DS    CL8     15   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   21    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   31    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   61    8  A  P N             T        Y              
GINC8#1H DS    CL8                                                              
GINC8#1  DS    CL9     15   71    9  A  P Z             T        Y              
GINC1#2H DS    CL8                                                              
GINC1#2  DS    CL1     16    1    1  A  P N             T        Y              
GINC1VAH DS    CL8                                                              
GINC1VA  DS    CL2     16    3    2  A  P H             T        Y              
GINC1#4H DS    CL8                                                              
GINC1#4  DS    CL1     16    9    1  A  P N             T        Y              
GINC2#2H DS    CL8                                                              
GINC2#2  DS    CL1     16   11    1  A  P N             T        Y              
GINC2VAH DS    CL8                                                              
GINC2VA  DS    CL2     16   13    2  A  P H             T        Y              
GINC2#4H DS    CL8                                                              
GINC2#4  DS    CL1     16   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   21    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   23    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   31    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   33    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   39    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   43    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   49    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   51    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   53    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   59    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   69    1  A  P N             T        Y              
GINC8#2H DS    CL8                                                              
GINC8#2  DS    CL1     16   71    1  A  P Z             T        Y              
GINC8VAH DS    CL8                                                              
GINC8VA  DS    CL2     16   73    2  A  P Z             T        Y              
GINC8#4H DS    CL8                                                              
GINC8#4  DS    CL1     16   79    1  A  P Z             T        Y              
GINC1#5H DS    CL8                                                              
GINC1#5  DS    CL9     17    1    9  A  P N             T        Y              
GINC2#5H DS    CL8                                                              
GINC2#5  DS    CL9     17   11    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   21    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   31    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   41    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   51    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   61    9  A  P N             T        Y              
GINC8#5H DS    CL8                                                              
GINC8#5  DS    CL9     17   71    9  A  P Z             T        Y              
GINC1SH  DS    CL8                                                              
GINC1S   DS    CL9     18    1    9  A  P N             T        Y              
GINC2SH  DS    CL8                                                              
GINC2S   DS    CL9     18   11    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   21    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   31    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   41    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   51    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   61    9  A  P N             T        Y              
GINC8SH  DS    CL8                                                              
GINC8S   DS    CL9     18   71    9  A  P Z             T        Y              
GINC1#7H DS    CL8                                                              
GINC1#7  DS    CL9     19    1    9  A  P N             T        Y              
GINC2#7H DS    CL8                                                              
GINC2#7  DS    CL9     19   11    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   21    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   31    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   41    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   51    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   61    9  A  P N             T        Y              
GINC8#7H DS    CL8                                                              
GINC8#7  DS    CL9     19   71    9  A  P Z             T        Y              
GINC1#8H DS    CL8                                                              
GINC1#8  DS    CL1     20    1    1  A  P N             T        Y              
GINC1VBH DS    CL8                                                              
GINC1VB  DS    CL2     20    6    2  A  P H             T        Y              
GINC1#AH DS    CL8                                                              
GINC1#A  DS    CL1     20    9    1  A  P N             T        Y              
GINC2#8H DS    CL8                                                              
GINC2#8  DS    CL1     20   11    1  A  P N             T        Y              
GINC2VBH DS    CL8                                                              
GINC2VB  DS    CL2     20   16    2  A  P H             T        Y              
GINC2#AH DS    CL8                                                              
GINC2#A  DS    CL1     20   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   21    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   26    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   31    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   36    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   39    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   46    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   49    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   51    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   56    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   59    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   66    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   69    1  A  P N             T        Y              
GINC8#8H DS    CL8                                                              
GINC8#8  DS    CL1     20   71    1  A  P Z             T        Y              
GINC8VBH DS    CL8                                                              
GINC8VB  DS    CL2     20   76    2  A  P Z             T        Y              
GINC8#AH DS    CL8                                                              
GINC8#A  DS    CL1     20   79    1  A  P Z             T        Y              
GINC1#BH DS    CL8                                                              
GINC1#B  DS    CL8     21    1    8  A  P N             T        Y              
GINC2#BH DS    CL8                                                              
GINC2#B  DS    CL8     21   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   21    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   31    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   61    8  A  P N             T        Y              
GINC8#BH DS    CL8                                                              
GINC8#B  DS    CL8     21   71    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL10    22    1   10  L  P N             T        Y              
GINSORTH DS    CL8                                                              
GINSORT  DS    CL6     22   12    6  A  P N             T        Y              
GINLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
GINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1920 BYTES                            
