*          DATA SET GAICEFFD   AT LEVEL 002 AS OF 12/19/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB13FFD      DATE 12/19/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
SCRHEADH DS    CL8                                                              
SCRHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
SCRSRVH  DS    CL8                                                              
SCRSRV   DS    CL17     1   63   17   A    U    N         T         Y           
SCRL0H   DS    CL8                                                              
SCRL0    DS    CL78     2    2   78   A    P    N         T         Y           
SCRL1H   DS    CL8                                                              
SCRL1    DS    CL78     3    2   78   A    P    N         T         Y           
SCRL2H   DS    CL8                                                              
SCRL2    DS    CL78     4    2   78   A    P    N         T         Y           
SCRL3H   DS    CL8                                                              
SCRL3    DS    CL78     5    2   78   A    P    N         T         Y           
SCRL4H   DS    CL8                                                              
SCRL4    DS    CL78     6    2   78   A    P    N         T         Y           
SCRL5H   DS    CL8                                                              
SCRL5    DS    CL78     7    2   78   A    P    N         T         Y           
SCRL6H   DS    CL8                                                              
SCRL6    DS    CL78     8    2   78   A    P    N         T         Y           
SCRL7H   DS    CL8                                                              
SCRL7    DS    CL78     9    2   78   A    P    N         T         Y           
SCRL8H   DS    CL8                                                              
SCRL8    DS    CL78    10    2   78   A    P    N         T         Y           
SCRL9H   DS    CL8                                                              
SCRL9    DS    CL78    11    2   78   A    P    N         T         Y           
SCRL10H  DS    CL8                                                              
SCRL10   DS    CL78    12    2   78   A    P    N         T         Y           
SCRL11H  DS    CL8                                                              
SCRL11   DS    CL78    13    2   78   A    P    N         T         Y           
SCRL12H  DS    CL8                                                              
SCRL12   DS    CL78    14    2   78   A    P    N         T         Y           
SCRL13H  DS    CL8                                                              
SCRL13   DS    CL78    15    2   78   A    P    N         T         Y           
SCRL14H  DS    CL8                                                              
SCRL14   DS    CL78    16    2   78   A    P    N         T         Y           
SCRL15H  DS    CL8                                                              
SCRL15   DS    CL78    17    2   78   A    P    N         T         Y           
SCRL16H  DS    CL8                                                              
SCRL16   DS    CL78    18    2   78   A    P    N         T         Y           
SCRL17H  DS    CL8                                                              
SCRL17   DS    CL78    19    2   78   A    P    N         T         Y           
SCRL18H  DS    CL8                                                              
SCRL18   DS    CL78    20    2   78   A    P    N         T         Y           
SCRL19H  DS    CL8                                                              
SCRL19   DS    CL78    21    2   78   A    P    N         T         Y           
SCRL20H  DS    CL8                                                              
SCRL20   DS    CL78    22    2   78   A    P    N         T         Y           
SCRPROH  DS    CL8                                                              
SCRPRO   DS    CL3     23    2    3   A    P    N         T         Y           
SCRINPH  DS    CL8                                                              
SCRINP   DS    CL70    23    7   70   A    U    N    M    T    I    Y           
SCRMESSH DS    CL8                                                              
SCRMESS  DS    CL70    24    7   70   A    P    N         T         Y           
SCRLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2069 BYTES                            
