*          DATA SET GAJIMFFD   AT LEVEL 033 AS OF 10/20/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB21FFD      DATE 10/20/94                 
         SPACE 1                                                                
TB21FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
JSHHEADH DS    CL8                                                              
JSHHEAD  DS    CL60     1    2   60  A  P H             T        Y              
JSHSERQH DS    CL8                                                              
JSHSERQ  DS    CL17     1   63   17  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL31     3   10   31  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL22     3   42   22  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL38     5   10   38  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9      6   10    9  A  P H             T        Y              
JSHOPTNH DS    CL8                                                              
JSHOPTN  DS    CL50     6   20   50  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL39     8   10   39  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL13    10   15   13  A  P H             T        Y              
JSHSCRFH DS    CL8                                                              
JSHSCRF  DS    CL3     10   31    3  A  U N             T        Y   10         
JSHSCRFX DS    CL8                                                              
JSHGRDFH DS    CL8                                                              
JSHGRDF  DS    CL1     10   37    1  A  P N             T        Y   20         
JSHGRDFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   37    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   37    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   31    3  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   37    1  A  P N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   37    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   37    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   31    3  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   37    1  A  P N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   37    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   37    1  A  P N             T        Y              
JSHSCRLH DS    CL8                                                              
JSHSCRL  DS    CL3     19   31    3  A  U N             T        Y              
JSHGRDLH DS    CL8                                                              
JSHGRDL  DS    CL1     19   37    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   15   13  A  P H             T        Y              
JSHAVERH DS    CL8                                                              
JSHAVER  DS    CL3     21   31    3  A  P H             T        Y              
JSHAVGDH DS    CL8                                                              
JSHAVGD  DS    CL1     21   37    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   15   13  A  P H             T        Y              
JSHLTSTH DS    CL8                                                              
JSHLTST  DS    CL3     22   31    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL13    23   15   13  A  P H             T        Y              
JSHCHNGH DS    CL8                                                              
JSHCHNG  DS    CL4     23   31    4  A  P H             T        Y              
JSHSIGNH DS    CL8                                                              
JSHSIGN  DS    CL1     23   37    1  A  P H             T        Y              
JSHLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
JSHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
