*          DATA SET GAMAMTW    AT LEVEL 003 AS OF 07/20/84                      
MAMSCRN  DSECT                                                                  
DONTUSE  DS    CL16                                                             
STTABH   DS    0CL20               STORES CURRENT TABLE HEADER                  
LEN      DS    A                   LEN=NUMBER OF COLUMNS (QNS) IN TABLE         
NONTRYS  DS    A                   NUMBER OF ROWS (ANIMALS) IN TABLE            
ADQNTAB  DS    A                   DISPLACEMENTS FROM START OF                  
ADROWTAB DS    A                   PHASE TB1101                                 
ADCHTAB  DS    A                                                                
HISWINS  DS    CL1                 NO OF GAMES LOST                             
GAMES    DS    CL1                 NO OF GAMES PLAYED                           
STAGE    DS    CL1                                                              
GUESSES  DS    CL1                 NO OF RANDOM QNS TO BE ASKED                 
ANSWER   DS    CL18                HIS ANSWER ARE STORED HERE                   
DKNOWS   DS    CL1                 NO OF DONT KNOW ANSWERS SO FAR               
NOQNS    DS    CL1                 NO OF QNS REMAINING                          
NUMQNS   DS    CL1                 NO OF QNS ASKED IN THIS PHASE                
QNNUM    DS    CL1                 NO OF QN ASKED LAST                          
ANYOTHER DS    CL2                                                              
       ++INCLUDE GAMAMFFD                                                       
         DS    0F                                                               
CANDLST  DS    0CL121                                                           
CANDSAS  DS    CL120               SPACE FOR 30 CANDS ADDRESSES                 
NUMCANDS DS    CL1                                                              
#1       DS    CL1                                                              
#2       DS    CL1                                                              
#3       DS    CL1                                                              
ADTABH1  DS    A                                                                
ADTABH2  DS    A                                                                
ADTABH3  DS    A                                                                
AHNAME   DS    A                                                                
IND      DS    CL1                                                              
LHNAME   DS    CL1                                                              
*                                                                               
       ++INCLUDE GAMAMWK                                                        
