*          DATA SET GAMAMFFD   AT LEVEL 002 AS OF 12/19/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB0DFFD      DATE 12/19/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
MAMTOP1H DS    CL8                                                              
MAMTOP1  DS    CL60     1    2   60   A    P    N         T         Y           
MAMSRVH  DS    CL8                                                              
MAMSRV   DS    CL17     1   63   17   A    U    N         T         Y           
MAMTOP2H DS    CL8                                                              
MAMTOP2  DS    CL60     2    2   60   A    P    N         T         Y           
MAMQN01H DS    CL8                                                              
MAMQN01  DS    CL49     3    2   49   A    P    N         T         Y           
MAMAN01H DS    CL8                                                              
MAMAN01  DS    CL27     3   53   27   A    U    N    M    T    I    Y           
MAMQN02H DS    CL8                                                              
MAMQN02  DS    CL49     4    2   49   A    P    N         T         Y           
MAMAN02H DS    CL8                                                              
MAMAN02  DS    CL27     4   53   27   A    U    N         T         Y           
MAMQN03H DS    CL8                                                              
MAMQN03  DS    CL49     5    2   49   A    P    N         T         Y           
MAMAN03H DS    CL8                                                              
MAMAN03  DS    CL27     5   53   27   A    P    N         T         Y           
MAMQN04H DS    CL8                                                              
MAMQN04  DS    CL49     6    2   49   A    P    N         T         Y           
MAMAN04H DS    CL8                                                              
MAMAN04  DS    CL27     6   53   27   A    P    N         T         Y           
MAMQN05H DS    CL8                                                              
MAMQN05  DS    CL49     7    2   49   A    P    N         T         Y           
MAMAN05H DS    CL8                                                              
MAMAN05  DS    CL27     7   53   27   A    P    N         T         Y           
MAMQN06H DS    CL8                                                              
MAMQN06  DS    CL49     8    2   49   A    P    N         T         Y           
MAMAN06H DS    CL8                                                              
MAMAN06  DS    CL27     8   53   27   A    P    N         T         Y           
MAMQN07H DS    CL8                                                              
MAMQN07  DS    CL49     9    2   49   A    P    N         T         Y           
MAMAN07H DS    CL8                                                              
MAMAN07  DS    CL27     9   53   27   A    P    N         T         Y           
MAMQN08H DS    CL8                                                              
MAMQN08  DS    CL49    10    2   49   A    P    N         T         Y           
MAMAN08H DS    CL8                                                              
MAMAN08  DS    CL27    10   53   27   A    P    N         T         Y           
MAMQN09H DS    CL8                                                              
MAMQN09  DS    CL49    11    2   49   A    P    N         T         Y           
MAMAN09H DS    CL8                                                              
MAMAN09  DS    CL27    11   53   27   A    P    N         T         Y           
MAMQN10H DS    CL8                                                              
MAMQN10  DS    CL49    12    2   49   A    P    N         T         Y           
MAMAN10H DS    CL8                                                              
MAMAN10  DS    CL27    12   53   27   A    P    N         T         Y           
MAMQN11H DS    CL8                                                              
MAMQN11  DS    CL49    13    2   49   A    P    N         T         Y           
MAMAN11H DS    CL8                                                              
MAMAN11  DS    CL27    13   53   27   A    P    N         T         Y           
MAMQN12H DS    CL8                                                              
MAMQN12  DS    CL49    14    2   49   A    P    N         T         Y           
MAMAN12H DS    CL8                                                              
MAMAN12  DS    CL27    14   53   27   A    P    N         T         Y           
MAMQN13H DS    CL8                                                              
MAMQN13  DS    CL49    15    2   49   A    P    N         T         Y           
MAMAN13H DS    CL8                                                              
MAMAN13  DS    CL27    15   53   27   A    P    N         T         Y           
MAMQN14H DS    CL8                                                              
MAMQN14  DS    CL49    16    2   49   A    P    N         T         Y           
MAMAN14H DS    CL8                                                              
MAMAN14  DS    CL27    16   53   27   A    P    N         T         Y           
MAMQN15H DS    CL8                                                              
MAMQN15  DS    CL49    17    2   49   A    P    N         T         Y           
MAMAN15H DS    CL8                                                              
MAMAN15  DS    CL27    17   53   27   A    P    N         T         Y           
MAMQN16H DS    CL8                                                              
MAMQN16  DS    CL49    18    2   49   A    P    N         T         Y           
MAMAN16H DS    CL8                                                              
MAMAN16  DS    CL27    18   53   27   A    P    N         T         Y           
MAMQN17H DS    CL8                                                              
MAMQN17  DS    CL49    19    2   49   A    P    N         T         Y           
MAMAN17H DS    CL8                                                              
MAMAN17  DS    CL27    19   53   27   A    P    N         T         Y           
MAMQN18H DS    CL8                                                              
MAMQN18  DS    CL49    20    2   49   A    P    N         T         Y           
MAMAN18H DS    CL8                                                              
MAMAN18  DS    CL27    20   53   27   A    P    N         T         Y           
MAMQN19H DS    CL8                                                              
MAMQN19  DS    CL49    21    2   49   A    P    N         T         Y           
MAMAN19H DS    CL8                                                              
MAMAN19  DS    CL27    21   53   27   A    P    N         T         Y           
MAMBOT1H DS    CL8                                                              
MAMBOT1  DS    CL49    23    2   49   A    P    N         T         Y           
MAMBOT2H DS    CL8                                                              
MAMBOT2  DS    CL27    23   53   27   A    P    N         T         Y           
MAMBOT3H DS    CL8                                                              
MAMBOT3  DS    CL49    24    2   49   A    P    N         T         Y           
MAMBOT4H DS    CL8                                                              
MAMBOT4  DS    CL27    24   53   27   A    P    N         T         Y           
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2096 BYTES                            
