*          DATA SET GAMAMWK    AT LEVEL 002 AS OF 07/20/84                      
*                                                                               
DUB      DS    D                                                                
PARM     DS    6F                                                               
ATABLES  DS    A                                                                
ARATH    DS    A                                                                
ATYPH    DS    A                                                                
ACHTAB   DS    A                                                                
AROWTAB  DS    A                                                                
AQNTAB   DS    A                                                                
VRANDOM  DS    A                                                                
ABASE    DS    A                                                                
AASKQN   DS    A                                                                
AFIXSCRN DS    A                                                                
ACNAMES  DS    A                                                                
ACMPARE  DS    A                                                                
ARELOC   DS    A                                                                
ACALLOV  DS    A                                                                
AINSERT  DS    A                                                                
TEST1    DS    CL18                                                             
TEST2    DS    CL18                                                             
QNLN1    DS    CL49                                                             
QNLN2    DS    CL49                                                             
SWITCH   DS    1C                                                               
NOLNS    DS    CL1                                                              
VSW      DS    CL1                                                              
