*          DATA SET GANIMFFD   AT LEVEL 003 AS OF 05/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB02FFD      DATE 05/11/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
NIMHEADH DS    CL8                                                              
NIMHEAD  DS    CL50     2   11   50   A    P    N         T         Y           
NIMSUBH  DS    CL8                                                              
NIMSUB   DS    CL50     3   11   50   A    P    N         T         Y           
NIMPILEH DS    CL8                                                              
NIMPILE  DS    CL50     5   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     6   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     7   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     8   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     9   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    10   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    11   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    12   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    13   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    14   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL46    16   13   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL46    17   13   46   A    P    N         T         Y           
NIMAH    DS    CL8                                                              
NIMA     DS    CL6     19   13    6   N    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL1     19   20    1   A    P    N         T         Y           
NIMBH    DS    CL8                                                              
NIMB     DS    CL6     19   33    6   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     19   40    1   A    P    N         T         Y           
NIMCH    DS    CL8                                                              
NIMC     DS    CL6     19   53    6   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     19   63    1   A    U    N         T         Y           
NIMLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
NIMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 969  BYTES                            
