*          DATA SET GAOTHFFD   AT LEVEL 002 AS OF 05/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB0CFFD      DATE 05/11/83                 
         SPACE 1                                                                
TB0CFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
OTHHEADH DS    CL8                                                              
OTHHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
OTHSERVH DS    CL8                                                              
OTHSERV  DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL22     3    8   22   A    P    N         T         Y           
OTHMOVEH DS    CL8                                                              
OTHMOVE  DS    CL4      3   35    4   A    U    N    M    T    I    Y           
         DS    CL8                                                              
         DS    CL22     5    8   22   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL22     5   42   22   A    P    N         T         Y           
OTHAH    DS    CL8                                                              
OTHA     DS    CL28     7    2   28   A    P    N         T         Y           
OTHBH    DS    CL8                                                              
OTHB     DS    CL34     7   36   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL28     8    2   28   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34     8   36   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL28     9    2   28   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34     9   36   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL28    10    2   28   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34    10   36   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL28    11    2   28   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34    11   36   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL28    12    2   28   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34    12   36   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL28    13    2   28   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34    13   36   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL28    14    2   28   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34    14   36   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL22    16    8   22   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL22    16   42   22   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL22    18    8   22   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL22    18   42   22   A    P    N         T         Y           
OTHLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
OTHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 942  BYTES                            
