*          DATA SET GAOXOFFFD  AT LEVEL 002 AS OF 03/16/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN FB01FFD      DATE 03/16/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
OXOHED1H DS    CL8                                                              
OXOHED1  DS    CL60     1    2   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A   U    N         T        Y              
OXOHED2H DS    CL8                                                              
OXOHED2  DS    CL60     2    2   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      3   56    8  L   P    N         T        Y              
OXOLETH  DS    CL8                                                              
OXOLET   DS    CL2      3   65    2  A   U    N         T    I   Y              
OXOFRSTH DS    CL8                                                              
OXOFRST  DS    CL39     5    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20     5   56   20  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39     6    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20     6   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39     7    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20     7   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39     8    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20     8   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39     9    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20     9   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    10    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    11    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   57    1  A   P    N         T        Y              
OXOSCNDH DS    CL8                                                              
OXOSCND  DS    CL39    12    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    12   56   20  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    13    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13   56   20  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    14    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    15    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   56   20  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    16    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16   56   20  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    17    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    18    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   57    1  A   P    N         T        Y              
OXOTHRDH DS    CL8                                                              
OXOTHRD  DS    CL39    19    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    19   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    20    1   39  A   P    N         T        Y              
OXOYSCRH DS    CL8                                                              
OXOYSCR  DS    CL20    20   56   20  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    21    1   39  A   P    N         T        Y              
OXOMSCRH DS    CL8                                                              
OXOMSCR  DS    CL20    21   56   20  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    22    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    22   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    23    1   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    23   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39    24    1   39  A   P    N         T        Y              
OXOLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
OXOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1568 BYTES                            
