*          DATA SET GASCRDATA  AT LEVEL 015 AS OF 04/26/94                      
         TITLE 'GASCR GAME - DICTIONARY'                                        
*                                                                               
SCRAMBL  CSECT                                                                  
*                                                                               
DIFICULT DC    CL13'ABSTRACT'                                                   
         DC    CL13'ADVERTISING'                                                
         DC    CL13'AMAZEMENT'                                                  
         DC    CL13'BOUNDARY'                                                   
         DC    CL13'BOTANICAL'                                                  
         DC    CL13'BOULEVARD'                                                  
         DC    CL13'CHAPARRAL'                                                  
         DC    CL13'CIRCUMVOLVE'                                                
         DC    CL13'COORDINATE'                                                 
         DC    CL13'DESTINATION'                                                
         DC    CL13'DIVIDENT'                                                   
         DC    CL13'CALAMONDIN'                                                 
         DC    CL13'ATMOSPHERE'                                                 
         DC    CL13'EVIDENCE'                                                   
         DC    CL13'EXCLUSIVE'                                                  
         DC    CL13'EXECUTIVE'                                                  
         DC    CL13'FUNDAMENTAL'                                                
         DC    CL13'FORMULATE'                                                  
         DC    CL13'GRAPEFRUIT'                                                 
         DC    CL13'CANCELLATION'                                               
         DC    CL13'COLLOQUIAL'                                                 
         DC    CL13'DICTIONARY'                                                 
         DC    CL13'HEXADECIMAL'                                                
         DC    CL13'HIPPOPOTAMUS'                                               
         DC    CL13'INTELLECTUAL'                                               
         DC    CL13'KNOWLEDGE'                                                  
         DC    CL13'LABORATORY'                                                 
         DC    CL13'COMPUTER'                                                   
         DC    CL13'CALCULATE'                                                  
         DC    CL13'LIGHTNING'                                                  
         DC    CL13'LANGUAGE'                                                   
         DC    CL13'INITIALIZE'                                                 
         DC    CL13'MANIPULATE'                                                 
         DC    CL13'MEDICINE'                                                   
         DC    CL13'MEMBERSHIP'                                                 
         DC    CL13'CHARACTER'                                                  
         DC    CL13'NITROGEN'                                                   
         DC    CL13'NECKLACE'                                                   
         DC    CL13'OBLIGATION'                                                 
         DC    CL13'DEVELOPMENT'                                                
         DC    CL13'ESSENTIAL'                                                  
         DC    CL13'PRODUCTIVITY'                                               
         DC    CL13'PARALLEL'                                                   
         DC    CL13'DETERIORATE'                                                
         DC    CL13'ORGANIZE'                                                   
         DC    CL13'OVERCAST'                                                   
         DC    CL13'PHOTOGRAPH'                                                 
         DC    CL13'PERFECTION'                                                 
         DC    CL13'PERSONNEL'                                                  
         DC    CL13'PINEAPPLE'                                                  
         DC    CL13'DETRIMENTAL'                                                
         DC    CL13'FLEXOGRAPHY'                                                
         DC    CL13'QUALITY'                                                    
         DC    CL13'CONTROL'                                                    
         DC    CL13'RECEIVE'                                                    
         DC    CL13'RECIPROCAL'                                                 
         DC    CL13'RIDICULOUS'                                                 
         DC    CL13'GOVERNMENT'                                                 
         DC    CL13'HYDATHODE'                                                  
         DC    CL13'INVESTIGATE'                                                
         DC    CL13'SPECIFIC'                                                   
         DC    CL13'VULNERABLE'                                                 
         DC    CL13'TEMPERATURE'                                                
         DC    CL13'TERMINATE'                                                  
         DC    CL13'TERMINAL'                                                   
         DC    CL13'THERMOSTAT'                                                 
         DC    CL13'UMBRELLA'                                                   
         DC    CL13'VALUABLE'                                                   
         DC    CL13'INVESTIGATE'                                                
         DC    CL13'EMPLOYEE'                                                   
         DC    CL13'YELLOW'                                                     
         DC    CL13'ZODIAC'                                                     
         DC    CL13'HOLIDAY'                                                    
         DC    CL13'TRAGEDY'                                                    
         DC    CL13'SYSTEM'                                                     
         DC    CL13'SUBSIDIARY'                                                 
         DC    CL13'SUBWAY'                                                     
         DC    CL13'QUADRANT'                                                   
         DC    CL13'SUBSTITUTE'                                                 
         DC    CL13'SHIPPING'                                                   
         DC    CL13'ORNAMENT'                                                   
         DC    CL13'TROPICAL'                                                   
         DC    CL13'WATERMELON'                                                 
         DC    CL13'VEGETABLE'                                                  
         DC    CL13'ISLAND'                                                     
         DC    CL13'SCISSORS'                                                   
         DC    CL13'ORDINARY'                                                   
         DC    CL13'PERCENTAGE'                                                 
         DC    CL13'PENALTY'                                                    
         DC    CL13'PURCHASE'                                                   
         DC    CL13'QUARTERBACK'                                                
         DC    CL13'APPETITE'                                                   
         DC    CL13'CRAYON'                                                     
         DC    CL13'ADVENTURE'                                                  
         DC    CL13'PARTICULAR'                                                 
         DC    CL13'SPLASH'                                                     
         DC    CL13'SOLUTION'                                                   
         DC    CL13'SOLITARE'                                                   
         DC    CL13'SALIFEROUS'                                                 
         DC    CL13'TRANSISTOR'                                                 
MAXWORDQ EQU   (*-DIFICULT)/13     # OF DIF. WORDS IN DIC                       
EASY     DC    CL6'AWARE'                                                       
         DC    CL6'AISLE'                                                       
         DC    CL6'AGAIN'                                                       
         DC    CL6'ALBUM'                                                       
         DC    CL6'BOUND'                                                       
         DC    CL6'BUILD'                                                       
         DC    CL6'CRACK'                                                       
         DC    CL6'CHAOS'                                                       
         DC    CL6'COVER'                                                       
         DC    CL6'BLIND'                                                       
         DC    CL6'CLAIM'                                                       
         DC    CL6'DWELL'                                                       
         DC    CL6'DREAM'                                                       
         DC    CL6'DRILL'                                                       
         DC    CL6'DOUBT'                                                       
         DC    CL6'DRESS'                                                       
         DC    CL6'ELBOW'                                                       
         DC    CL6'ELITE'                                                       
         DC    CL6'EVERY'                                                       
         DC    CL6'EXIST'                                                       
         DC    CL6'FATAL'                                                       
         DC    CL6'FIELD'                                                       
         DC    CL6'FRUIT'                                                       
         DC    CL6'DAIRY'                                                       
         DC    CL6'FAULT'                                                       
         DC    CL6'FEVER'                                                       
         DC    CL6'FORCE'                                                       
         DC    CL6'FRAME'                                                       
         DC    CL6'GIVEN'                                                       
         DC    CL6'GLARE'                                                       
         DC    CL6'GRAND'                                                       
         DC    CL6'GREAT'                                                       
         DC    CL6'HABIT'                                                       
         DC    CL6'HEART'                                                       
         DC    CL6'HEDGE'                                                       
         DC    CL6'HOBBY'                                                       
         DC    CL6'HOUSE'                                                       
         DC    CL6'INDEX'                                                       
         DC    CL6'IMAGE'                                                       
         DC    CL6'JOKER'                                                       
         DC    CL6'KNOCK'                                                       
         DC    CL6'LEGAL'                                                       
         DC    CL6'LOGIC'                                                       
         DC    CL6'LIGHT'                                                       
         DC    CL6'LOBBY'                                                       
         DC    CL6'LUNCH'                                                       
         DC    CL6'MONEY'                                                       
         DC    CL6'MELON'                                                       
         DC    CL6'MOTOR'                                                       
         DC    CL6'MATCH'                                                       
         DC    CL6'NIECE'                                                       
         DC    CL6'NOISE'                                                       
         DC    CL6'NOBLE'                                                       
         DC    CL6'ORDER'                                                       
         DC    CL6'OCCUR'                                                       
         DC    CL6'OFTEN'                                                       
         DC    CL6'OPERA'                                                       
         DC    CL6'OTHER'                                                       
         DC    CL6'RUMOR'                                                       
         DC    CL6'PHASE'                                                       
         DC    CL6'PIANO'                                                       
         DC    CL6'POWER'                                                       
         DC    CL6'PHONE'                                                       
         DC    CL6'RANGE'                                                       
         DC    CL6'RAPID'                                                       
         DC    CL6'SOLID'                                                       
         DC    CL6'SHADE'                                                       
         DC    CL6'SENSE'                                                       
         DC    CL6'QUILT'                                                       
         DC    CL6'SPINE'                                                       
         DC    CL6'QUITE'                                                       
         DC    CL6'QUEEN'                                                       
         DC    CL6'TABLE'                                                       
         DC    CL6'TOKEN'                                                       
         DC    CL6'TRADE'                                                       
         DC    CL6'VALUE'                                                       
         DC    CL6'SCARY'                                                       
         DC    CL6'TRAIN'                                                       
         DC    CL6'UNCLE'                                                       
         DC    CL6'UNION'                                                       
         DC    CL6'UPPER'                                                       
         DC    CL6'WORLD'                                                       
         DC    CL6'WOULD'                                                       
         DC    CL6'WATER'                                                       
         DC    CL6'WHITE'                                                       
         DC    CL6'VALID'                                                       
         DC    CL6'VIDEO'                                                       
         DC    CL6'VIVID'                                                       
         DC    CL6'YIELD'                                                       
         DC    CL6'WAIST'                                                       
         DC    CL6'YOUNG'                                                       
         DC    CL6'ZEBRA'                                                       
         DC    CL6'ZESTY'                                                       
         DC    CL6'YEAST'                                                       
         DC    CL6'YEARN'                                                       
         DC    CL6'WRITE'                                                       
         DC    CL6'WRIST'                                                       
         DC    CL6'VOWEL'                                                       
         DC    CL6'CLEAT'                                                       
         DC    CL6'START'                                                       
