*          DATA SET GASDEFFD   AT LEVEL 002 AS OF 08/10/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB1BFFD      DATE 08/10/93                 
         SPACE 1                                                                
TB1BFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SDEHEADH DS    CL8                                                              
SDEHEAD  DS    CL60     1    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL23     3    2   23  A  P N             T        Y              
SDEVALH  DS    CL8                                                              
SDEVAL   DS    CL3      3   26    3  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL13     4    2   13  A  P N             T        Y              
SDERSLTH DS    CL8                                                              
SDERSLT  DS    CL8      4   16    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A  U N             T        Y              
SDELAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SDEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 248  BYTES                            
