*          DATA SET GASEVFFD   AT LEVEL 003 AS OF 05/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB07FFD      DATE 05/11/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
SEVMESSH DS    CL8                                                              
SEVMESS  DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
SEVINPTH DS    CL8                                                              
SEVINPT  DS    CL5      2    2    5   A    U    N    M    T    I    Y           
         DS    CL8                                                              
         DS    CL1      3    2    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL47     7    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47     8    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24     8   54   24   A    P    N         T         Y           
SEVLIN1H DS    CL8                                                              
SEVLIN1  DS    CL47     9    3   47   A    P    N         T         Y           
SEVHANDH DS    CL8                                                              
SEVHAND  DS    CL24     9   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    10    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    10   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    11    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    11   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    12    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    12   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    13    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    13   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    14    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    14   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    15    3   47   A    P    N         T         Y           
SEVCARDH DS    CL8                                                              
SEVCARD  DS    CL24    15   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    16    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    16   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    17    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    17   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    18    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    18   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    19    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    19   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    20    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    20   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    21    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    21   54   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL47    22    3   47   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL24    22   54   24   A    P    N         T         Y           
SEVLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
SEVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1478 BYTES                            
