*          DATA SET GAVECFFD   AT LEVEL 003 AS OF 05/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB06FFD      DATE 05/11/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
VECHDRH  DS    CL8                                                              
VECHDR   DS    CL60     1    2   60   A    P    N         T         Y           
VECSRVH  DS    CL8                                                              
VECSRV   DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5      3    2    5   A    P    N         T         Y           
VECGUSH  DS    CL8                                                              
VECGUS   DS    CL5      3   12    5   A    U    N         T    I    Y           
VECG1H   DS    CL8                                                              
VECG1    DS    CL30     5    2   30   A    P    N         T         Y           
VECG2H   DS    CL8                                                              
VECG2    DS    CL30     6    2   30   A    P    N         T         Y           
VECG3H   DS    CL8                                                              
VECG3    DS    CL30     7    2   30   A    P    N         T         Y           
VECG4H   DS    CL8                                                              
VECG4    DS    CL30     8    2   30   A    P    N         T         Y           
VECG5H   DS    CL8                                                              
VECG5    DS    CL30     9    2   30   A    P    N         T         Y           
VECG6H   DS    CL8                                                              
VECG6    DS    CL30    10    2   30   A    P    N         T         Y           
VECG7H   DS    CL8                                                              
VECG7    DS    CL30    11    2   30   A    P    N         T         Y           
VECANSH  DS    CL8                                                              
VECANS   DS    CL38    13    2   38   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL76    16    2   76   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL72    17    2   72   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    19    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL61    20    2   61   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    22    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    23    2   79   A    P    N         T         Y           
VECLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
VECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 928  BYTES                            
