*          DATA SET GAWRDFFD   AT LEVEL 030 AS OF 08/02/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB14FFD      DATE 08/02/88                 
         SPACE 1                                                                
TB14FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
WRDHEADH DS    CL8                                                              
WRDHEAD  DS    CL60     1    2   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A   U    N         T        Y              
WRDPRMPH DS    CL8                                                              
WRDPRMP  DS    CL13     3    2   13  A   P    N         T        Y              
WRDINPTH DS    CL8                                                              
WRDINPT  DS    CL12     3   16   12  A   U    N    M    T    I   Y              
WRDSTRNH DS    CL8                                                              
WRDSTRN  DS    CL12     3   35   12  A   P    N         N        Y              
WRDVERSH DS    CL8                                                              
WRDVERS  DS    CL14     3   54   14  A   P    N         N        Y              
WRDFLD1H DS    CL8                                                              
WRDFLD1  DS    CL5      5    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      5   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      5   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      5   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      5   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      5   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      5   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      5   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      6    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      6   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      6   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      6   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      6   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      6   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      6   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      6   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      7    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      7   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      7   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      7   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      7   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      7   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      7   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      7   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      8    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      8   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      8   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      8   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      8   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      8   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      8   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      8   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      9    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      9   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      9   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      9   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      9   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      9   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      9   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5      9   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     10    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     10   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     10   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     10   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     10   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     10   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     10   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     10   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     11    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     11   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     11   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     11   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     11   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     11   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     11   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     11   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     12    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     12   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     12   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     12   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     12   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     12   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     12   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     12   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     13    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     13   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     13   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     13   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     13   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     13   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     13   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     13   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     14    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     14   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     14   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     14   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     14   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     14   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     14   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     14   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     15    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     15   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     15   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     15   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     15   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     15   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     15   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     15   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     16    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     16   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     16   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     16   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     16   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     16   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     16   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     16   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     17    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     17   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     17   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     17   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     17   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     17   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     17   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     17   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     18    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     18   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     18   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     18   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     18   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     18   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     18   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     18   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     19    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     19   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     19   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     19   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     19   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     19   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     19   64    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     19   74    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     20    4    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     20   14    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     20   24    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     20   34    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     20   44    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     20   54    5  A   P    N         N        Y              
         DS    CL8                                                              
         DS    CL5     20   64    5  A   P    N         N        Y              
WRDFLDLH DS    CL8                                                              
WRDFLDL  DS    CL5     20   74    5  A   P    N         N        Y              
WRDHLP0H DS    CL8                                                              
WRDHLP0  DS    CL78    21    2   78  A   P    N         T        Y              
WRDHLP1H DS    CL8                                                              
WRDHLP1  DS    CL78    22    2   78  A   P    N         T        Y              
WRDHLP2H DS    CL8                                                              
WRDHLP2  DS    CL78    23    2   78  A   P    N         T        Y              
WRDHLP3H DS    CL8                                                              
WRDHLP3  DS    CL78    24    2   78  A   P    N         T        Y              
WRDLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
WRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2256 BYTES                            
