*          DATA SET GAWUMFFD   AT LEVEL 024 AS OF 03/13/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB17FFD      DATE 03/13/89                 
         SPACE 1                                                                
TB17FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
WUMHEADH DS    CL8                                                              
WUMHEAD  DS    CL60     1    2   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A   U    N         T        Y              
WUMPRMTH DS    CL8                                                              
WUMPRMT  DS    CL39     3    2   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL31     4    2   31  A   P    N         T        Y              
WUMFIREH DS    CL8                                                              
WUMFIRE  DS    CL16     4   34   16  A   U    N         T    I   Y    4         
WUMFIREX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     7    5   13  A   P    N         T        Y              
WUMCURRH DS    CL8                                                              
WUMCURR  DS    CL2      7   23    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     8    5   17  A   P    N         T        Y              
WUMCON1H DS    CL8                                                              
WUMCON1  DS    CL2      8   23    2  A   P    N         T        Y              
WUMCON2H DS    CL8                                                              
WUMCON2  DS    CL2      8   26    2  A   P    N         T        Y              
WUMCON3H DS    CL8                                                              
WUMCON3  DS    CL2      8   29    2  A   P    N         T        Y              
WUMAROWH DS    CL8                                                              
WUMAROW  DS    CL30    11   30   30  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL71    13    5   71  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    14    5   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    15    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    16    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    17    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    18    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    19    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    20    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    21    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    22    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    23    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    24    1   80  A   P    N         T        Y              
WUMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
WUMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1416 BYTES                            
