*          DATA SET GAXXXFFD   AT LEVEL 009 AS OF 11/23/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB26FFD      DATE 11/23/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      3    2    1  A  P N             T        Y              
         DS    CL8                                               S=   1         
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 16   BYTES                            
