*          DATA SET GAYAHFFD   AT LEVEL 003 AS OF 05/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB04FFD      DATE 05/11/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
YAHHEADH DS    CL8                                                              
YAHHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL45     3    2   45   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL30     3   51   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9      4   71    9   A    P    N         T         Y           
YAHONEH  DS    CL8                                                              
YAHONE   DS    CL55     5    2   55   A    P    N         T         Y           
YAHTWOH  DS    CL8                                                              
YAHTWO   DS    CL55     6    2   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9      6   61    9   A    P    N         T         Y           
YAHHANDH DS    CL8                                                              
YAHHAND  DS    CL9      6   71    9   A    P    N         T         Y           
YAHTHRH  DS    CL8                                                              
YAHTHR   DS    CL55     7    2   55   A    P    N         T         Y           
YAHFORH  DS    CL8                                                              
YAHFOR   DS    CL55     8    2   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6      8   61    6   A    P    N         T         Y           
YAHACTH  DS    CL8                                                              
YAHACT   DS    CL5      8   71    5   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL1      8   79    1   A    U    N         T    I    Y           
YAHFIVH  DS    CL8                                                              
YAHFIV   DS    CL55     9    2   55   A    P    N         T         Y           
YAHSIXH  DS    CL8                                                              
YAHSIX   DS    CL55    10    2   55   A    P    N         T         Y           
YAHTOTH  DS    CL8                                                              
YAHTOT   DS    CL55    11    2   55   A    P    N         T         Y           
YAHBONH  DS    CL8                                                              
YAHBON   DS    CL55    12    2   55   A    P    N         T         Y           
YAHTALH  DS    CL8                                                              
YAHTAL   DS    CL55    13    2   55   A    P    N         T         Y           
YAHTOKH  DS    CL8                                                              
YAHTOK   DS    CL55    15    2   55   A    P    N         T         Y           
YAHFOKH  DS    CL8                                                              
YAHFOK   DS    CL55    16    2   55   A    P    N         T         Y           
YAHFULH  DS    CL8                                                              
YAHFUL   DS    CL55    17    2   55   A    P    N         T         Y           
YAHSHTH  DS    CL8                                                              
YAHSHT   DS    CL55    18    2   55   A    P    N         T         Y           
YAHLNGH  DS    CL8                                                              
YAHLNG   DS    CL55    19    2   55   A    P    N         T         Y           
YAHYAHH  DS    CL8                                                              
YAHYAH   DS    CL55    20    2   55   A    P    N         T         Y           
YAHCHNH  DS    CL8                                                              
YAHCHN   DS    CL55    21    2   55   A    P    N         T         Y           
YAHTBLH  DS    CL8                                                              
YAHTBL   DS    CL55    22    2   55   A    P    N         T         Y           
YAHTA2H  DS    CL8                                                              
YAHTA2   DS    CL55    23    2   55   A    P    N         T         Y           
YAHGAMH  DS    CL8                                                              
YAHGAM   DS    CL55    24    2   55   A    P    N         T         Y           
YAHLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
YAHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1471 BYTES                            
