*          DATA SET GEGENWRK   AT LEVEL 024 AS OF 06/16/20                      
***********************************************************************         
* GLOBAL EQUATES                                                      *         
***********************************************************************         
         SPACE 1                                                                
EOT      EQU   0                   END-OF-TABLE INDICATOR                       
HELPREC  EQU   1                   HELP FOR RECORD TYPE                         
HELPACT  EQU   2                   HELP FOR ACTION (FOR RECORD TYPE)            
HELPKEY  EQU   3                   HELP FOR KEY                                 
HELPOPT  EQU   4                   HELP FOR OPTIONS                             
HELPSEL  EQU   5                   HELP FOR SELECT ACTION                       
         SPACE 1                                                                
***********************************************************************         
* PROGRAM FUNCTION KEY EQUATES                                        *         
***********************************************************************         
         SPACE 1                                                                
PFK01    EQU   01                                                               
PFK02    EQU   02                                                               
PFK03    EQU   03                                                               
PFK04    EQU   04                                                               
PFK05    EQU   05                                                               
PFK06    EQU   06                                                               
PFK07    EQU   07                                                               
PFK08    EQU   08                                                               
PFK09    EQU   09                                                               
PFK10    EQU   10                                                               
PFK11    EQU   11                                                               
PFK12    EQU   12                                                               
         EJECT                                                                  
***********************************************************************         
* I/O CONTROLLER EQUATES                                              *         
***********************************************************************         
         SPACE 1                                                                
*                                  ** I/O FILE EQUATES **                       
IOFILES  EQU   X'0F00'             RESERVED FOR CONTROLLER USE                  
IOSPTDIR EQU   X'0100'             I/O TO SPOT DIRECTORY                        
IOSPTFIL EQU   X'0200'             I/O TO SPOT FILE                             
IOSTAFIL EQU   X'0300'             I/O TO STATION FILE                          
IOXSPDIR EQU   X'0400'             I/O TO XSPOT DIRECTORY                       
IOXSPFIL EQU   X'0500'             I/O TO XSPOT FILE                            
IOMEDDIR EQU   X'0100'             I/O TO MEDIA DIRECTORY                       
IOMEDFIL EQU   X'0200'             I/O TO MEDIA FILE                            
IOMEDZDR EQU   X'0300'             I/O TO MEDDIRZ FROM MEDIA                    
IOMEDZFL EQU   X'0400'             I/O TO MEDFILZ FROM MEDIA                    
IOMPLDIR EQU   X'0100'             I/O TO MPL USER UPDATED DIRECTORY            
IOMPLFIL EQU   X'0200'             I/O TO MPL USER UPDATED FILE                 
IOMPRDRA EQU   X'0300'             I/O TO MPL STATIC DIRECTORY                  
IOMPRFLA EQU   X'0400'             I/O TO MPL STATIC FILE                       
IOMBADIR EQU   X'0100'             I/O TO MBASE DIRECTORY                       
IOMBANDX EQU   X'0200'             I/O TO MBASE INDEX                           
IOMBAFIL EQU   X'0300'             I/O TO MBASE FILE                            
IOMBUDIR EQU   X'0400'             I/O TO MBASE USER DIRECTORY                  
IOMBUFIL EQU   X'0500'             I/O TO MBASE USER FILE                       
IOMBAGDR EQU   X'0600'             I/O TO GENDIR FROM MBASE SYSTEM              
IOMBAGFL EQU   X'0700'             I/O TO GENFIL FROM MBASE SYSTEM              
IOGENDIR EQU   X'0100'             I/O TO GENERAL DIRECTORY                     
IOGENFIL EQU   X'0200'             I/O TO GENERAL FILE                          
IOCONFIL EQU   X'0300'             I/O TO CONTROL FILE (CONTROL SYSTEM)         
IOCONACD EQU   X'0400'             I/O TO ACCDIR (CONTROL SYSTEM)               
IOCONACM EQU   X'0500'             I/O TO ACCMST (CONTROL SYSTEM)               
IOCONMDR EQU   X'0600'             I/O TO MEDDIR (CONTROL SYSTEM)               
IOCONMFL EQU   X'0700'             I/O TO MEDFIL (CONTROL SYSTEM)               
IOACCFIL EQU   X'0100'             I/O TO ACCOUNT FILE                          
IOACCSPD EQU   X'0200'             I/O TO SPTDIR FROM ACCOUNT SYSTEM            
IOACCSPF EQU   X'0300'             I/O TO SPTFIL FROM ACCOUNT SYSTEM            
IOACCNTD EQU   X'0400'             I/O TO NET SPTDIR FROM ACCOUNT SYS           
IOACCNTF EQU   X'0500'             I/O TO NET SPTFIL FROM ACCOUNT SYS           
IOPRTDIR EQU   X'0600'             I/O TO PRTDIR                                
IOPRTFIL EQU   X'0700'             I/O TO PRTFILE                               
IOACCPTD EQU   X'0800'             I/O TO PRTDIR FROM ACCOUNT SYSTEM            
IOACCPTF EQU   X'0900'             I/O TO PRTFILE FROM ACCOUNT SYSTEM           
IOACCDIR EQU   X'0A00'             I/O TO ACCDIR                                
IOACCMST EQU   X'0B00'             I/O TO ACCMST                                
IOFEEDIR EQU   X'0100'             I/O TO ARTISTE FEES DIRECTORY                
IOFEEFIL EQU   X'0200'             I/O TO ARTISTE FEES FILE                     
IOFEEGDR EQU   X'0300'             I/O TO GENDIR FROM FEE SYSTEM                
IOFEEGFL EQU   X'0400'             I/O TO GENFIL FROM FEE SYSTEM                
IOFEEMDR EQU   X'0500'             I/O TO MEDDIR FROM FEE SYSTEM                
IOFEEMFL EQU   X'0600'             I/O TO MEDFIL FROM FEE SYSTEM                
IOFEEACC EQU   X'0700'             I/O TO ACCFIL FROM FEE SYSTEM                
IOCTFILE EQU   X'0F00'             I/O TO CONTROL FILE (OTHER SYSTEMS)          
         SPACE 1                                                                
*                                  ** I/O AREA EQUATES **                       
IO1      EQU   X'0040'             I/O AREA 1 TO BE USED FOR I/O                
IO2      EQU   X'0080'             I/O AREA 2 TO BE USED FOR I/O                
IO3      EQU   X'00C0'             I/O AREA 3 TO BE USED FOR I/O                
         SPACE 1                                                                
*                                  ** I/O COMMAND EQUATES **                    
IOCMNDS  EQU   X'000F'             RESERVED FOR CONTROLLER USE                  
IOLOCK   EQU   X'0010'             READ FOR UPDATE                              
IORDEL   EQU   X'0020'             READ DELETED RECORDS                         
IOHIGH   EQU   X'0001'             DMRDHI                                       
IOHI     EQU   IOHIGH              DMRDHI                                       
IOHID    EQU   IOHI+IORDEL         DMRDHI (FOR DELETES)                         
IOHIUP   EQU   IOHI+IOLOCK         DMRDHI (FOR UPDATE)                          
IOHIUPD  EQU   IOHI+IOLOCK+IORDEL  DMRDHI (FOR UPDATE & DELETES)                
IOREAD   EQU   X'0002'             DMREAD                                       
IORD     EQU   IOREAD              DMREAD                                       
IORDD    EQU   IORD+IORDEL         DMREAD (FOR DELETES)                         
IORDUP   EQU   IORD+IOLOCK         DMREAD (FOR UPDATE)                          
IORDUPD  EQU   IORD+IOLOCK+IORDEL  DMREAD (FOR UPDATE & DELETES)                
IOSEQ    EQU   X'0003'             DMRSEQ                                       
IOSQ     EQU   IOSEQ               DMRSEQ                                       
IOSQD    EQU   IOSQ+IORDEL         DMRSEQ (FOR DELETES)                         
IOSQUP   EQU   IOSQ+IOLOCK         DMRSEQ (FOR UPDATE)                          
IOSQUPD  EQU   IOSQ+IOLOCK+IORDEL  DMRSEQ (FOR UPDATE & DELETES)                
IOGET    EQU   X'0004'             GETREC                                       
IOGETRUP EQU   IOGET+IOLOCK        GETREC (FOR UPDATE)                          
IOADD    EQU   X'0005'             DMADD                                        
IOADDREC EQU   X'0005'             ADDREC                                       
IOWRITE  EQU   X'0006'             DMWRT                                        
IOPUT    EQU   X'0006'             PUTREC                                       
IOPUTREC EQU   IOPUT               PUTREC                                       
IOUNLOCK EQU   X'0007'             DMUNLK                                       
IOSOXADD EQU   X'0008'             SPECAIL SOX OFF ADD                          
IOSOXWRT EQU   X'0009'             SPECAIL SOX OFF WRITE                        
IOSOXPUT EQU   X'0009'             SPECAIL SOX OFF PUT                          
         EJECT                                                                  
***********************************************************************         
* STANDARD ERROR EQUATES  - X'FF00' IDENTIFIES CONTROLLER MSG         *         
***********************************************************************         
         SPACE 1                                                                
FVFIOER  EQU   0                   I/O ERROR HAS OCCURED                        
FVFNONE  EQU   200+X'FF00'         NO DATA INPUT                                
FVFSHRT  EQU   201+X'FF00'         NOT ENOUGH DATA INPUT                        
FVFLONG  EQU   202+X'FF00'         TOO MUCH DATA INPUT                          
FVFNOTV  EQU   203+X'FF00'         INVALID INPUT FIELD                          
FVFNOTN  EQU   204+X'FF00'         INPUT NOT NUMERIC                            
FVFMIXI  EQU   205+X'FF00'         RECORD/ACTION COMBO INVALID                  
FVFKINV  EQU   206+X'FF00'         INVALID OPTION KEYWORD                       
FVFIGLE  EQU   207+X'FF00'         INVALID DATA QUALIFIER                       
FVFKDUP  EQU   208+X'FF00'         DUPLICATED OPTION KEYWORD                    
FVFDINV  EQU   209+X'FF00'         INVALID OPTION DATA VALUE                    
FVFREQD  EQU   210+X'FF00'         REQUIRED OPTION IS MISSING                   
FVFEKEY  EQU   211+X'FF00'         ENTER KEY                                    
FVFIASQ  EQU   212+X'FF00'         INVALID ACTION SEQUENCE                      
FVFERNF  EQU   213+X'FF00'         RECORD NOT ON FILE                           
FVFERAE  EQU   214+X'FF00'         RECORD ALREADY ON FILE                       
FVFRDEL  EQU   215+X'FF00'         RECORD IS DELETED                            
FVFXDEL  EQU   216+X'FF00'         CAN'T DELETE RECORD                          
FVFXCHA  EQU   217+X'FF00'         CAN'T CHANGE RECORD                          
FVFXRES  EQU   218+X'FF00'         CAN'T RESTORE RECORD                         
FVFCCDR  EQU   219+X'FF00'         CAN'T CHANGE A DELETED RECORD                
FVFSKHC  EQU   220+X'FF00'         SELECTED RECORD KEY HAS CHANGED              
FVFESEL  EQU   221+X'FF00'         INVALID SELECTION CODE                       
FVFEWHN  EQU   222+X'FF00'         INVALID WHEN                                 
FVFEOUT  EQU   223+X'FF00'         INVALID OUTPUT TYPE                          
FVFEDST  EQU   224+X'FF00'         INVALID DESTINATION                          
FVFTFUL  EQU   225+X'FF00'         TERMINAL QUEUE FULL                          
FVFQFUL  EQU   226+X'FF00'         PRINT QUEUE FULL                             
FVFEJCL  EQU   227+X'FF00'         JCL BOOK NOT FOUND                           
FVFEOLY  EQU   228+X'FF00'         CAN'T LOAD OVERLAY PHASE                     
FVFEKEYD EQU   229+X'FF00'         ENTER KEY & DATA                             
FVFELANG EQU   230+X'FF00'         INVALID LANGUAGE CODE                        
FVFESYS  EQU   231+X'FF00'         INVALID SYSTEM                               
FVFEPGM  EQU   232+X'FF00'         INVALID PROGRAM                              
FVFINVDT EQU   233+X'FF00'         INVALID DATE                                 
FVFCRDR  EQU   234+X'FF00'         CAN'T COPY/RENAME A DELETED RECORD           
FVFENEW  EQU   235+X'FF00'         ENTER NEW KEY                                
FVFESEL2 EQU   236+X'FF00'         SELECT CODE NOT VALID FOR RECORD             
FVFDUPE  EQU   237+X'FF00'         DUPLICATED INPUT FIELD                       
FVFTOOM  EQU   238+X'FF00'         TOO MANY INPUT FIELDS                        
FVFISYS  EQU   239+X'FF00'         INCOMPATIBLE SYSTEM SPECIFICATION            
FVFTSAF  EQU   240+X'FF00'         TEMPORARY STORAGE ALLOCATION FAILURE         
FVFTSEF  EQU   242+X'FF00'         NOW REQUEST TOO LARGE - TRY SOON             
FVFNAREC EQU   243+X'FF00'         NOT AUTHORISED FOR RECORD                    
FVFNAACT EQU   244+X'FF00'         NOT AUTHORISED FOR ACTION                    
FVFNASEL EQU   245+X'FF00'         NOT AUTHORISED FOR SELECTION                 
FVFNAOPT EQU   246+X'FF00'         NOT AUTHORISED FOR OPTION                    
*                                                                               
FVFGTSET EQU   253+X'FF00'         GETTXT BLOCK BUILT BY APP IN APPARM          
FVFSET   EQU   254+X'FF00'         MESSAGE BUILT BY APPLICATION                 
FVFOK    EQU   255+X'FF00'         FIELD IS VALID                               
         SPACE 1                                                                
***********************************************************************         
* SPECIAL  ERROR EQUATES  - SYSTEM SET TO GENERAL ERROR MSG           *         
***********************************************************************         
FVFNAUTH EQU   1013                NOT AUTHORIZED TO UPDATE                     
FVFWGADV EQU   1014                WRONG ADV                                    
FVFNAVIL EQU   1015                UPDATE NOT AVAILABLE                         
         EJECT                                                                  
***********************************************************************         
* I/O CONTROLLER FILE TABLE DSECT (ADDRESS=AFILTAB)                   *         
***********************************************************************         
         SPACE 1                                                                
FILTABD  DSECT                                                                  
FILNUM   DS    XL1                 FILE NUMBER (IOFILES EQUATE)                 
FILNAME  DS    CL7                 FILE NAME                                    
FILINDS  DS    XL1                 FILE INDICATORS - 1                          
FILIVL   EQU   X'80'               FILE RECORDS ARE VARIABLE LENGTH             
FILIDA   EQU   X'40'               FILE IS A DIRECT ACCESS FILE                 
FILIIS   EQU   X'20'               FILE IS AN INDEX SEQUENTIAL FILE             
FILINDS2 DS    XL1                 FILE INDICATORS - 2                          
FILIDI   EQU   X'80'               FILE IS D/A WITH I/S INDEX                   
FILIID   EQU   FILIDI              FILE IS I/S INDEX TO A D/A FILE              
FILNUM2  DS    XL1                 D/A OR I/S FILE NUMBER                       
FILKEYL  DS    XL1                 D/A OR I/S KEY LENGTH                        
FILCTLL  DS    XL1                 FIXED LENGTH I/S CONTROL LENGTH              
FILDISP  EQU   FILCTLL             DISPLACEMENT TO FIRST RECORD ELEMENT         
FILMAXL  DS    XL2                 MAXIMUM RECORD LENGTH                        
*                                  FOLLOWING FIELDS SET IF FILNAME=NULL         
FILSYSN  EQU   FILINDS             NATIVE SYSTEM NUMBER OF FILE                 
FILFILN  EQU   FILINDS2            NATIVE FILE NUMBER (WITHIN SYSTEM)           
         DS    XL5                 N/D                                          
FILTABL  EQU   *-FILTABD                                                        
         SPACE 1                                                                
***********************************************************************         
* I/O CONTROLLER COMMAND TABLE DSECT (ADDRESS=ACMDTAB)                *         
***********************************************************************         
         SPACE 1                                                                
CMDTABD  DSECT                                                                  
CMDNAME  DS    CL7                 COMMAND NAME                                 
CMDNUMB  DS    XL1                 COMMAND NUMBER (SEE IOCMNDS)                 
CMDINDS  DS    XL1                 COMMAND INDICATORS - 1                       
CMDIDARQ EQU   X'80'               DISK ADDRESS REQUIRED FOR I/O                
CMDIDAXC EQU   X'40'               CLEAR DISK ADDRESS BEFORE I/O                
CMDIDADD EQU   X'20'               DISK ADDRESS RETURNED FROM I/O               
CMDINDS2 DS    XL1                 COMMAND INDICATORS - 2                       
CMDTABL  EQU   *-CMDTABD                                                        
         EJECT                                                                  
***********************************************************************         
* RECORD TYPE TABLE DSECT (ADDRESS=ACRECTAB)                          *         
***********************************************************************         
         SPACE 1                                                                
RECTABD  DSECT                                                                  
RECELEN  DS    XL1                 LENGTH OF TABLE ENTRY (ZERO=EOT)             
RECNAME  DS    CL8                 RECORD TYPE NAME                             
RECSHRT  DS    CL3                 RECORD SHORT NAME                            
RECINDS  DS    XL1                 RECORD TYPE INDICATORS                       
RECIDDS  EQU   X'80'               DDS ONLY RECORD TYPE                         
RECINOP  EQU   X'40'               DISABLE LIST PF KEYS                         
RECINOH  EQU   X'20'               NO HELP FOR THIS RECORD                      
RECISET  EQU   X'10'               APMODE=APMSETT IF NEW MAINT SCREEN           
RECISET2 EQU   X'08'               APMODE=APMSETT ON ALL MAINT SCREENS          
RECIDIS2 EQU   X'04'               APMODE=APMDISS2 AFTER LFM SELECT             
RECITXT  EQU   X'01'               HELP IS GETTXT (RECHELP=TEXT NUMBER)         
RECAUTH  DS    XL1                 AUTHORIZATION INDICATORS                     
RECAUTH2 DS    XL1                 AUTHORIZATION INDICATORS 2                   
RECNUMB  DS    XL1                 RECORD TYPE NUMBER                           
RECOPTR  DS    XL4                 REQUIRED OPTIONS                             
RECOPTX  DS    XL4                 OPTIONS NOT ALLOWED                          
RECUSER  DS    XL8                 USER DEFINABLE AREA                          
RECTABL  EQU   *-RECTABD                                                        
RECHELP  DS    0CL60               RECORD TYPE DEFINITION                       
         SPACE 1                                                                
***********************************************************************         
* ACTION TABLE DSECT (ADDRESS=ACACTTAB)                               *         
***********************************************************************         
         SPACE 1                                                                
ACTTABD  DSECT                                                                  
ACTNAME  DS    CL8                 ACTION NAME                                  
ACTINDS  DS    XL1                 ACTION INDICATORS                            
ACTIDDS  EQU   X'80'               DDS ONLY ACTION                              
ACTAUTH  DS    XL1                 AUTHORIZATION INDICATORS                     
ACTAUTH2 DS    XL1                 AUTHORIZATION INDICATORS 2                   
ACTNUMB  DS    XL1                 ACTION NUMBER                                
ACTADD   EQU   1                   ADD A RECORD                                 
ACTDIS   EQU   2                   DISPLAY A RECORD                             
ACTCHA   EQU   3                   CHANGE A RECORD                              
ACTDEL   EQU   4                   DELETE A RECORD                              
ACTRES   EQU   5                   RESTORE A RECORD                             
ACTCPY   EQU   6                   COPY A RECORD                                
ACTREN   EQU   7                   RENAME A RECORD                              
ACTLFM8  EQU   8                   RESERVED FOR FILE MAINTENANCE                
ACTREP   EQU   9                   REQUEST/RUN A REPORT                         
ACTUPD   EQU   10                  REQUEST/RUN AN ONLINE UPDATE                 
ACTDUMP  EQU   11                  REQUEST/RUN PARTIAL DUMP FOR XFR             
ACTLOAD  EQU   12                  REQUEST/RUN PARTIAL LOAD FOR XFR             
ACTAPLO  EQU   100                 APPLICATION DEFINED ACTION LOW               
ACTAPHI  EQU   200                 APPLICATION DEFINED ACTION HIGH              
ACTSEL   EQU   254                 SELECT A RECORD (IN LIST MODE)               
ACTLST   EQU   255                 LIST RECORDS (FOR SELECTION)                 
ACTOPTR  DS    XL4                 REQUIRED OPTIONS                             
ACTOPTX  DS    XL4                 OPTIONS NOT ALLOWED                          
ACTUSER  DS    XL8                 USER DEFINABLE AREA                          
ACTTABL  EQU   *-ACTTABD                                                        
         EJECT                                                                  
***********************************************************************         
* RECORD/ACTION COMBO TABLE DSECT (ADDRESS=ACMIXTAB)                  *         
***********************************************************************         
         SPACE 1                                                                
MIXTABD  DSECT                                                                  
MIXELEN  DS    XL1                 LENGTH OF TABLE ENTRY (ZERO=EOT)             
MIXRECB  DS    XL1                 RECORD NUMBER                                
MIXACTB  DS    XL1                 ACTION NUMBER (ZERO=USE MIXACTS)             
MIXINDS  DS    XL1                 RECORD TYPE/ACTION INDICATORS - 1            
MIXIDDS  EQU   X'80'               DDS ONLY RECORD/ACTION                       
MIXKREQ  EQU   X'40'               KEY VALUES ARE REQUIRED                      
MIXDREQ  EQU   X'20'               DATA VALUES ARE REQUIRED                     
MIXILFM  EQU   X'10'               FUNCTION IS MAINTENANCE TYPE                 
MIXIREP  EQU   X'08'               FUNCTION IS REQUEST TYPE                     
MIXILST  EQU   X'04'               FUNCTION IS INFO/SELECT TYPE                 
MIXISEL  EQU   X'02'               FUNCTION IS SELECT TYPE                      
MIXIOTH  EQU   X'01'               FUNCTION NOT SUPPORTED BY CONTROLLER         
MIXINDS2 DS    XL1                 RECORD TYPE/ACTION INDICATORS - 2            
MIXINOH  EQU   X'80'               NO HELP FOR THIS RECORD/ACTION               
MIXILSM  EQU   X'40'               LIST/SELECT MONITOR COMBO ONLY               
MIXIORP  EQU   MIXILSM             SEPARATE OFFLINE REPORT PHASE                
MIXITXT  EQU   X'20'               HELP IS GETTXT (MIXHELP=TEXT NUMBER)         
MIXISET  EQU   X'10'               APMODE=APMSETT IF NEW MAINT ACTION           
MIXIDRV  EQU   X'08'               REPORT IS DRIVER/DROOL DRIVEN                
MIXIOKL  EQU   X'07'               LATE IS VALID REPORT                         
MIXIOKU  EQU   X'05'               SOON RUN WITH ACTION UPDATE                  
MIXIOKO  EQU   X'04'               OVERNIGHT IS VALID REPORT WHEN               
MIXIOKS  EQU   X'02'               SOON IS VALID REPORT WHEN                    
MIXIOKN  EQU   X'01'               NOW IS VALID REPORT WHEN                     
MIXAUTH  DS    XL1                 AUTHORIZATION INDICATORS                     
MIXAUTH2 DS    XL1                 AUTHORIZATION INDICATORS 2                   
MIXSCRN  DS    XL1                 SCREEN NUMBER                                
MIXOVER  DS    XL1                 PHASE NUMBER                                 
MIXKEYN  DS    XL1                 NUMBER OF KEY FIELDS ON SCREEN               
MIXKEYC  DS    XL1                 MAXIMUM NUMBER OF KEY COMPONENTS             
MIXKEYT  DS    XL8                 KEY COMPONENTS                               
MIXOPTR  DS    XL4                 REQUIRED OPTIONS                             
MIXOPTX  DS    XL4                 OPTIONS NOT ALLOWED                          
MIXUSER  DS    XL8                 USER DEFINABLE AREA                          
         ORG   MIXUSER             ** REDEFINED FOR ACTION LIST **              
MIXACTS  DS    XL8                 ACTION LIST (ZERO=EOT)                       
         ORG   MIXUSER             ** REDEFINED FOR REPORT ACTION **            
MIXSYSID DS    CL2                 REPORT SYSTEM ID                             
MIXPRGID DS    CL2                 REPORT PROGRAM ID                            
MIXJCLID DS    CL2                 REPORT JCL ID                                
MIXPRTY1 DS    CL1                 REPORT PROCESSING PRIORITY                   
MIXOFFPH DS    0XL1                PHASE NUMBER FOR REPORT (MIXIORP)            
MIXPRTY2 DS    CL1                 REPORT PRINTING PRIORITY                     
         ORG   MIXUSER             ** REDEFINED FOR DROOL ACTION **             
         DS    XL7                                                              
MIXINDRL DS    XL1                 DROOL INDICATORS                             
MIXIDRLS EQU   X'80'               REPORT IS ON-SCREEN                          
MIXTABL  EQU   *-MIXTABD                                                        
MIXHELP  DS    0CL60               RECORD TYPE/ACTION DEFINITION                
         EJECT                                                                  
***********************************************************************         
* KEY COMPONENT TABLE (ADDRESS=ACKEYTAB)                              *         
***********************************************************************         
         SPACE 1                                                                
KEYTABD  DSECT                                                                  
KEYNAME  DS    CL7                 KEY COMPONENT NAME                           
KEYNUMB  DS    XL1                 KEY COMPONENT NUMBER                         
KEYTABL  EQU   *-KEYTABD                                                        
         SPACE 1                                                                
***********************************************************************         
* SELECT ACTION MENU (ADDRESS=ACSELTAB)                               *         
***********************************************************************         
         SPACE 1                                                                
SELTABD  DSECT                                                                  
SELCODE  DS    CL1                 SELECT CODE                                  
SELRECB  DS    XL1                 INPUT RECORD NUMBER                          
SELACTB  DS    XL1                 INPUT ACTION NUMBER                          
SELRECN  DS    XL1                 SELECT RECORD                                
SELACTN  DS    XL1                 SELECT ACTION                                
SELTABL  EQU   *-SELTABD                                                        
SELKEYS  DS    XL(L'MIXKEYT)       LIST OF KEY VALUES (SEE ACLSMIND)            
SELMASK  DS    XL2                 BIT MASK FOR APRECID+0(2) TESTS              
SELLANG  DS    XL1                 LANGUAGE FILTER (0=ALL VALID)                
SELINDS  DS    XL1                 INDICATOR BYTE 1                             
SELIPROC EQU   X'80'               PASS APMPROC MODE TO APPLICATION             
SELINDS2 DS    XL1                 INDICATOR BYTE 2                             
         DS    XL6                 N/D                                          
SELTAB2L EQU   *-SELTABD                                                        
         SPACE 1                                                                
***********************************************************************         
* SYSTEM SWITCH TABLE (LOCATED AT ASSWTAB)                            *         
***********************************************************************         
         SPACE 1                                                                
SYSSWTAB DSECT                     ** SYSTEM SWITCH TABLE **                    
SYSSWSYS DS    XL1                 SE NUMBER                                    
SYSSWSOV DS    XL1                 SYSTEM CALLOV NUMBER                         
SYSSWAGB DS    XL1                 AGENCY BINARY VALUE                          
SYSSWACS DS    XL4                 LIMIT ACCESS VALUE                           
SYSSWLEN EQU   *-SYSSWTAB                                                       
SYSSWMAX EQU   12                  MAXIMUM NUMBER OF ENTRIES IN TABLE           
         EJECT                                                                  
***********************************************************************         
* OPTION TABLE (ADDRESS=ACOPTTAB)                                     *         
***********************************************************************         
         SPACE 1                                                                
OPTTABD  DSECT                                                                  
OPTELEN  DS    XL1                 LENGTH OF TABLE ENTRY (ZERO=EOT)             
OPTNAME  DS    CL8                 OPTION NAME (LONG)                           
OPTSHRT  DS    CL3                 OPTION NAME (SHORT) OR SPACES                
OPTINDS  DS    XL1                 OPTION INDICATORS - 1                        
OPTIDDS  EQU   X'80'               DDS ONLY OPTION                              
OPTNRTN  EQU   X'40'               OPTIADDR=NUMBER OF ROUTINE                   
OPTATAB  EQU   X'20'               OPTIADDR=DISPLACEMENT TO TABLE               
OPTARTN  EQU   X'10'               OPTIADDR=DISPLACEMENT TO ROUTINE             
OPTBOOL  EQU   X'08'               OUTPUT IS A BIT VALUE (OC NOT MVC)           
OPTTABH  EQU   X'04'               OPTION TABLE HAS 60 BYTE HELP HEADER         
OPTDFLT  EQU   X'02'               OPTION HAS A DEFAULT VALUE (OPTDVAL)         
OPTITXT  EQU   X'01'               HELP IS GETTXT (OPTHELP=TEXT NUMBER)         
OPTINDS2 DS    XL1                 OPTION INDICATORS - 2                        
OPTGEQ   EQU   X'80'               GREATER THAN CHARACTER                       
OPTLEQ   EQU   X'40'               LESS THAN CHARACTER                          
OPTNEQ   EQU   X'20'               NOT EQUALS CHARACTER                         
OPTNOSEC EQU   X'10'               SUPPRESS NEW SECURITY TEST                   
OPTISEL  EQU   X'08'               OPTION VALID FOR ACTION IN SEL MODE          
OPTNOHLP EQU   X'04'               DON'T SHOW THIS IN HELP                      
OPTAUTH  DS    XL1                 AUTHORIZATION INDICATORS                     
OPTAUTH2 DS    XL1                 AUTHORIZATION INDICATORS 2                   
OPTRECB  DS    XL1                 RECORD NUMBER (OR ZERO)                      
OPTACTB  DS    XL1                 ACTION NUMBER (OR ZERO)                      
OPTMINKL DS    XL1                 MINIMUM L'OPTNAME ALLOWED                    
OPTMINDL DS    XL1                 MINIMUM L'DATA ALLOWED                       
OPTMAXDL DS    XL1                 MAXIMUM L'DATA ALLOWED                       
OPTOUTDL DS    XL1                 L'OUTPUT OPTION DATA VALUE                   
OPTOPTB  DS    XL4                 OPTION BIT MASK                              
OPTOPTN  DS    XL1                 OPTION NUMBER (1-32)                         
OPTIADDR DS    AL2                 DISPL TO TABLE/RTN OR NUMBER RTN             
OPTOADDR DS    AL2                 DISPLACEMENT TO OPTION/FILTER                
OPTDVAL  DS    XL4                 DEFAULT OPTION VALUE (IF NOT INPUT)          
OPTOPTR  DS    XL4                 OTHER OPTIONS REQUIRED                       
OPTOPTX  DS    XL4                 OTHER OPTIONS NOT ALLOWED                    
OPTTABL  EQU   *-OPTTABD                                                        
OPTHELP  DS    0XL60               OPTION DEF 2 LINES L'T1+T1,L'T2+T2           
         EJECT                                                                  
WORKD    DSECT                     ** GLOBAL WORKING STORAGE **                 
         SPACE 1                                                                
***********************************************************************         
* SYSTEM CONTROLLER WORK AREA                                         *         
***********************************************************************         
         SPACE 1                                                                
SCAREA   DS    0XL256                                                           
SCPARM   DS    8F                                                               
SCDUB    DS    D                                                                
SCFULL   DS    F                                                                
SCWORK   DS    XL64                                                             
SCRELO   DS    A                   CONTROLLER RELOCATION                        
SCBASE1  DS    A                   CONTROLLER BASE REG1                         
SCBASE2  DS    A                   CONTROLLER BASE REG2                         
SCBASE3  DS    A                   CONTROLLER BASE REG3                         
SCBASE4  DS    A                   CONTROLLER BASE REG4                         
SCBASE5  DS    A                   CONTROLLER BASE REG5                         
         DS    A                   N/D                                          
SCATCB   DS    A                   A(TCB ENTRY)                                 
SCAUTL   DS    A                   A(UTL ENTRY)                                 
SCFLAG   DS    X                   CONTROLLER FLAG                              
SCPFKEY  DS    XL1                 PROGRAM FUNCTION KEY                         
SCINDS   DS    XL1                 CONTROLLER INDICATORS                        
SCIGO    EQU   X'80'               GO POINT REACHED IN CONTROLLER               
SCIALL   EQU   X'40'               SELECT ALL ACTIVE FOR CURRENT LINE           
SCINEWSC EQU   X'20'               NEW SCREEN LOADED                            
SCIANYPF EQU   X'10'               USER ENTERED PF KEY THIS TIME                
SCISELOK EQU   X'08'               SELECT CODE OK                               
SCIRQERR EQU   X'04'               APMVALQ ERROR OCCURRED OFFLINE               
SCIACT   EQU   X'02'               RECORD/ACTION HAS BEEN VALIDATED             
SCINOACC EQU   X'01'               SECURITY TEST RETURNED NO ACCESS             
SCRECN   DS    XL1                 RECORD NUMBER                                
SCACTN   DS    XL1                 ACTION NUMBER                                
SCSELLVL DS    XL1                 LIST/SELECT LEVEL INDICATOR                  
SCSELCOD DS    CL1                 CURRENT LIST/SELECT CODE                     
SCRECSN  DS    XL1                 FLAG RECORD SHORT NAME VALIDATION            
SCOMODE  DS    XL1                 SAVED OFFLINE MODE FROM SPOOF                
SCSWSYSN DS    XL1                 NATIVE SYSTEM                                
SCSWSYSC DS    XL1                 CURRENT SWITCHED SYSTEM                      
SCSWSYSP DS    XL1                 PREVIOUS SWITCHED SYSTEM                     
SCRECNAM DS    CL(L'RECNAME)       EXPANDED RECORD NAME                         
SCRECSHT DS    CL(L'RECSHRT)       EXPANDED RECORD SHORT NAME                   
SCRECLNQ EQU   *-SCRECNAM                                                       
SCACTNAM DS    CL(L'ACTNAME)       EXPANDED ACTION NAME                         
SCKEYNAM DS    CL(L'KEYNAME)       EXPANDED KEY NAME                            
SCOPTNAM DS    CL(L'OPTNAME)       EXPANDED OPTION NAME                         
SCOPTSHT DS    CL(L'OPTSHRT)       EXPANDED OPTION SHORT NAME                   
SCOPTLNQ EQU   *-SCOPTNAM                                                       
SCHELP   DS    CL8                 EXPANDED HELP WORD                           
SCTABNAM DS    CL7                 KEY TABLE NAME FOR HELLO CALLS               
SCCHARS  DS    0CL4                LANGUAGE DEPENDANT CHARACTERS                
SCCOMMA  DS    CL1                 COMMA                                        
SCEQUAL  DS    CL1                 EQUALS                                       
SCQUEST  DS    CL1                 QUESTION MARK                                
SCSLASH  DS    CL1                 SLASH                                        
SCDELIM  DS    CL1                 KEY DELIMITER OVERRIDE                       
SCCTYP   DS    CL1                 CALL FLAG FOR ROUTINES                       
SCCINTQ  EQU   1                   - ROUTINE WAS CALLED INTERNALLY              
SCSWSE   DS    XL1                 CURRENT SE NUMBER                            
         DS    XL1                 N/D                                          
SCSVRER1 DS    4A                  SAVE AREA FOR RE THRU R1                     
SCDICONE DS    A                   C'SU  ' FOR SINGLE TRANSLATE                 
SCDICMLT DS    A                   C'TU  ' FOR MULTIPLE TRANSLATE               
SCCINTRE DS    A                   INTERNAL CALL - CALLER'S RE                  
                                                                                
SCDDLBLK DS    0XL10               DDLINK CONTROLS                              
SCDDLDTA DS    AL4                 INDEX TO FIELD DATA VALUE                    
SCDDLREC DS    X                   RECORD NUMBER                                
SCDDLACT DS    X                   ACTION NUMBER                                
SCDDLFLD DS    0XL2                FIELD ID                                     
SCDDLFLN DS    X                   FIELD NUMBER                                 
SCDDLREL DS    X                   RELATIVE FIELD NUMBER                        
         DS    X                   SPARE                                        
SCDDLFLG DS    X                   FLAGS                                        
SCDDLFEQ EQU   X'80'               DDLINK SIMULATE ENTERING NEW DATA            
                                                                                
         ORG   SCAREA+L'SCAREA                                                  
SCAREAX  DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* APPLICATION CONTROLLER WORK AREA                                    *         
***********************************************************************         
         SPACE 1                                                                
ACAREA   DS    0XL256                                                           
ACPARM   DS    8F                                                               
ACDUB    DS    D                                                                
ACFULL   DS    F                                                                
ACWORK   DS    XL64                                                             
*                                                                               
ACPARMA  DS    A                   CONTROLLER R1 VALUE                          
ACRELO   DS    A                   CONTROLLER RELOCATION                        
ACBASE1  DS    A                   CONTROLLER BASE REG1                         
ACBASE2  DS    A                   CONTROLLER BASE REG2                         
ACBASE3  DS    A                   CONTROLLER BASE REG3                         
ACBASE4  DS    A                   CONTROLLER BASE REG4                         
ACWORKA  DS    A                   CONTROLLER WORK REGISTER (RD)                
*                                                                               
ACRECTAB DS    A                   A(RECORD TYPE TABLE)                         
ACACTTAB DS    A                   A(ACTION TABLE)                              
ACMIXTAB DS    A                   A(RECORD/ACTION TABLE)                       
ACKEYTAB DS    A                   A(KEY TABLE)                                 
ACOPTTAB DS    A                   A(OPTIONS TABLE)                             
ACSELTAB DS    A                   A(SELECT TABLE)                              
*                                                                               
ACPHSLST DS    A                   A(PHASE LIST)                                
ACAHOOK  DS    A                   A(CONTROLLER HOOK)                           
ACOBASE  DS    A                   A(OPTIONS MODULE BASE ADDRESS)               
ACAROUT  DS    A                   A(GLOBAL ROUTINES ENTRY POINT)               
*                                                                               
ACIOADD  DS    A                   A(FIRST I/O AREA)                            
ACIOLEN  DS    H                   LENGTH OF EACH I/O AREA                      
ACIONUM  DS    XL1                 NUMBER OF I/O AREAS                          
ACIOIND  DS    XL1                 I/O INDICATORS                               
ACIOIDA  EQU   X'80'               SAVE IODA IN IOADDR                          
ACIOIWK  EQU   X'40'               SAVE IOWORK IN IOADDR                        
*                                                                               
ACSYSPGM DS    XL2                 OVERRIDE CALLOV SYSTEM/PROGRAM               
ACHLPSCR DS    XL1                 HELP SCREEN PHASE NUMBER                     
ACTWAFLD DS    0XL4                TWA FIELD NUMBERS                            
ACTWAREC DS    XL1                 RELATIVE TWA FIELD OF RECORD FIELD           
ACTWAACT DS    XL1                 RELATIVE TWA FIELD OF ACTION FIELD           
ACTWAKEY DS    XL1                 RELATIVE TWA FIELD OF KEY FIELD              
ACTWAOPT DS    XL1                 RELATIVE TWA FIELD OF OPTION FIELD           
ACENDTWA DS    XL2                 DISPLACEMENT TO LOAD POINT IN TWA            
*                                                                               
ACFSTIND DS    XL1                 INDICATORS FOR INITIALIZATION                
ACRECIND DS    XL1                 INDICATORS FOR RECORD TYPE                   
ACACTIND DS    XL1                 INDICATORS FOR ACTION                        
ACKEYIND DS    XL1                 INDICATORS FOR KEY                           
ACOPTIND DS    XL1                 INDICATORS FOR OPTIONS                       
ACOPTITB EQU   X'01'               USE ACTBASE NOT ACOBASE FOR OPTIONS          
ACLFMIND DS    XL1                 INDICATORS FOR MAINTENANCE MONITOR           
ACLFMIFK EQU   X'01'               FIRST VALKEY CALL FOR COPY/RENAME            
ACLFMIRV EQU   X'02'               SAVE RECVALS THIS TIME                       
ACLSMIND DS    XL1                 INDICATORS FOR SELECT MONITOR                
ACLSMISK EQU   X'01'               SELECT TABLE CONTAINS EXPANSION DATA         
ACLSMIDN EQU   X'02'               DON'T ALTER INTENSITY OF LIST LINES          
ACLSMIDV EQU   X'04'               DON'T SET PREVIOUSLY VALIDATED BITS          
ACLSMIMP EQU   X'08'               END OF LIST MESSAGE PROVIDED                 
ACLSMICI EQU   X'10'               CHECK APRECID AFTER APMVALK CALLS            
ACREPIND DS    XL1                 INDICATORS FOR REPORT MONITOR                
ACOTHIND DS    XL1                 INDICATORS FOR OTHER MONITOR                 
ACLSTIND DS    XL1                 INDICATORS FOR TERMINATION                   
ACNOVAL  EQU   X'80'               SKIP PROCESSING                              
ACHKBEF  EQU   X'40'               CALL HOOK BEFORE                             
ACHKAFT  EQU   X'20'               CALL HOOK AFTER                              
ACMODE   DS    XL1                 CONTROLLER MODE SETTING                      
ACMFRST  EQU   1                   FIRST TIME MODE                              
ACMRECR  EQU   2                   PROCESS RECORD TYPE                          
ACMACTR  EQU   3                   PROCESS ACTION                               
ACMKEYR  EQU   4                   PROCESS KEY                                  
ACMOPTR  EQU   5                   PROCESS OPTIONS                              
ACMLFMR  EQU   6                   PROCESS FILE MAINTENANCE                     
ACMLSMR  EQU   7                   PROCESS LIST/SELECT SCREEN                   
ACMREPR  EQU   8                   PROCESS REPORT                               
ACMOTHR  EQU   9                   PROCESS OTHER                                
ACMRECA  EQU   10                  PROCESS RECORD/ACTION IN LIST MODE           
ACMLAST  EQU   16                  LAST TIME MODE                               
ACPFFST  DS    XL1                 PFKEY FOR RESTART LIST                       
ACPFCUR  DS    XL1                 PFKEY FOR REDISPLAY CURRENT SCREEN           
ACPFNXT  DS    XL1                 PFKEY FOR DISPLAY NEXT SCREEN                
ACPFXIT  DS    XL1                 PFKEY FOR QUIT TO HIGHER LEVEL               
ACPFRET  DS    XL1                 PFKEY FOR QUIT TO LIST & PROCESS             
ACPFPRE  DS    XL1                 PFKEY FOR PREVIOUS LIST SCREEN               
         DS    XL4                 N/D                                          
ACINDS   DS    XL1                 GLOBAL INDICATORS                            
ACI24PFK EQU   X'80'               SUPPORT FOR 24 PFKEYS                        
ACINOHLP EQU   X'40'               NO HELP                                      
ACIORIG  EQU   X'20'               USE ORIGIN NAME & ADDRESS ON REPORT          
ACIDEST  EQU   X'10'               USE DESTINATION NAME & ADDRESS               
ACVALIND DS    XL1                 FIELD VALIDATION INDICATORS                  
ACVALIDB EQU   X'01'               DELETE LEADING BLANKS IF FVATB BIT           
*                                  FVADDTB IS NOT ON IN FIELD HEADER            
ACLSMSV  DS    XL1                 LIST SCROLL VALUE (0=PAGE SCROLL)            
ACTBASE  DS    A                   A(OPTION SUB-TABLE BASE ADDRESS)             
ACRECNDX DS    XL1                 INDEX INTO RECUSER FOR COUNTRY CODE          
         DS    XL3                 N/D                                          
ACASEC   DS    A                   A(ACCESS BLOCK)                              
         ORG   ACAREA+L'ACAREA                                                  
ACAREAX  DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* APPLICATION PROGRAM WORK AREA                                       *         
***********************************************************************         
         SPACE 1                                                                
APAREA   DS    0XL512                                                           
APDUB    DS    D                                                                
APPARM   DS    8F                                                               
APFULL   DS    F                                                                
APHALF   DS    H                                                                
APBYTE   DS    XL1                                                              
APFLAG   DS    XL1                                                              
APWORKX  DS    0XL80               EXTEND APWORK TO 80 BYTES                    
APWORK   DS    XL64                                                             
         DS    XL16                                                             
APELEM   DS    XL256                                                            
APNTRYA  DS    A                   APPLICATION ENTRY POINT                      
APALOCAL DS    A                   A(APPLICATION LOCAL W/S) APLOCAL             
APWORKA  DS    A                   APPLICATION RD VALUE                         
APRELO   DS    A                   APPLICATION RELOCATION                       
APBASE1  DS    A                   APPLICATION BASE REG1                        
APBASE2  DS    A                   APPLICATION BASE REG2                        
APBASE3  DS    A                   APPLICATION BASE REG3                        
*                                  ** MODES PASSED TO APPLICATION **            
APACTN   DS    XL1                 ACTION NUMBER                                
APMODE   DS    XL1                 APPLICATION MODE                             
APMVALK  EQU   1                   VALIDATE KEY                                 
APMVALR  EQU   2                   VALIDATE RECORD                              
APMDISK  EQU   3                   DISPLAY KEY                                  
APMDISR  EQU   4                   DISPLAY RECORD                               
APMDELR  EQU   5                   DELETE RECORD                                
APMRESR  EQU   6                   RESTORE RECORD                               
APMVALP  EQU   7                   VALIDATE LIST/SELECT PARAMETERS              
APMGETS  EQU   8                   GET NEXT LIST/SELECT RECORD                  
APMDISS  EQU   9                   DISPLAY LIST/SELECT RECORD                   
APMVALS  EQU   10                  VALIDATE LIST/SELECT DATA                    
APMFLST  EQU   11                  LIST/SELECT FIRST TIME MODE                  
APMPROC  EQU   12                  PROCESS LIST SELECT ACTION                   
APMFSCR  EQU   13                  FIRST TIME FOR LIST/SELECT SCREEN            
APMLSCR  EQU   14                  LAST TIME FOR LIST/SELECT SCREEN             
APMVALQ  EQU   15                  VALIDATE REQUEST DETAILS                     
APMREPP  EQU   16                  PRINT THE REPORT                             
APMSETT  EQU   17                  NEW SCREEN LOADED - SET SCREEN DATA          
APMPUTK  EQU   18                  PUT KEY FIELDS USING APUTKEY                 
APMNEWK  EQU   19                  COPY/RENAME RECORD WITH NEW KEY              
APMFRP   EQU   20                  FIRST SCREEN OF DISPLAY                      
APMDISS2 EQU   21                  DISPLAY LIST/SELECT RECORD AFTER LFM         
APMDRINI EQU   22                  INITIALIZE FOR DRIVER/DROOL                  
APMDRINP EQU   23                  INPUT FOR DRIVER/DROOL                       
APMDROUT EQU   24                  OUTPUT FOR DRIVER/DROOL                      
APMDRHK  EQU   25                  HOOK FOR DRIVER/DROOL                        
*                                  ** MODES RETURNED BY APPLICATION **          
APMDREND EQU   248                 END OF DRIVER/DROOL INPUT                    
APMRET   EQU   249                 RETURN TO PREVIOUS RECORD/ACTION             
APMSWP   EQU   250                 SWAP TO ANOTHER RECORD/ACTION                
APMLRP   EQU   251                 LAST SCREEN OF DISPLAY                       
APMFMOK  EQU   252                 LFM ACTION OK REGARDLESS OF FVMSGNO          
APMPFKS  EQU   253                 PF KEY SET BY OVERLAY                        
APMPLFM  EQU   254                 PROCESS FILE MAINTENANCE TYPE ACTION         
APMEOFS  EQU   255                 NO MORE LIST/SELECT RECORDS                  
*                                                                               
APINDS   DS    XL1                 ** APPLICATION INDICATORS BYTE 1 **          
APIOKADD EQU   X'80'               OK TO ADD RECORD                             
APIOKDIS EQU   X'40'               OK TO DISPLAY RECORD                         
APIOKCHA EQU   X'20'               OK TO CHANGE RECORD                          
APIOKDEL EQU   X'10'               OK TO DELETE RECORD                          
APIOKRES EQU   X'08'               OK TO RESTORE RECORD                         
APILFLST EQU   X'04'               FIRST FOR LIST                               
APILRERD EQU   X'02'               ROUTS S/R EXECUTED AN I/O                    
APILNSEQ EQU   X'01'               SEQUENTIAL LIST READ                         
APILNLST EQU   X'00'               NEXT FOR LIST                                
*                                                                               
APRECKEY DS    XL44                RECORD KEY                                   
APRECNUM DS    XL1                 RECORD NUMBER (SEE RECNUMB EQUATES)          
APRECDA  DS    XL4                 RECORD DISK ADDRESS                          
APRECID  DS    XL4                 RECORD IDENTIFICATION                        
APPFKEY  DS    XL1                 PROGRAM FUNCTION KEY                         
*                                                                               
APINDS2  DS    XL1                 ** APPLICATION INDICATORS BYTE 2 **          
APIMDIS2 EQU   X'80'               PASS APMDISS2 MODE TO APPLICATION            
APIXCKEY EQU   X'40'               XC APRECKEY BEFORE AMPVALK/APMVALP           
APINXOPT EQU   X'20'               DON'T XFER OPTS BETWEEN NESTED LISTS         
APSETSLN EQU   X'10'               SET LSMSELLN EVEN THO SEL FIELD PROT         
APMGKEY0 EQU   X'08'               MERGE KEYS OF NULL IN SETKEY RTNE            
APIOVROK EQU   X'04'               OVERLAY IS HAPPY                             
APINOSOX EQU   X'02'               TURN-OFF SOX CHECK                           
APINCD   EQU   X'01'               RECORD HAS NEW CMPRSD DATES                  
*                                                                               
APACTQLF DS    XL1                 ACTION QUALIFIER                             
APLSMSEL DS    CL1                 SELECT ACTION COMPLETION CHARACTER           
APCURSOR DS    A                   A(OUTPUT FIELD TO CONTAIN CURSOR)            
APLSTADD DS    A                   A(LIST/SELECT LINE)                          
APDDLTAB DS    A                   A(DDLINK FIELD TABLE) SEE DDLFTD             
         ORG   APAREA+L'APAREA                                                  
APAREAX  DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* APPLICATION SYSTEM VARIABLES                                        *         
***********************************************************************         
         SPACE 1                                                                
ASAREA   DS    0XL256                                                           
ASONOFF  DS    XL1                 SYSTEM MODE                                  
ASON     EQU   0                   APPLICATION RUNNING ONLINE                   
ASOFF    EQU   1                   APPLICATION RUNNING OFFLINE                  
ASNAME   DS    CL7                 SYSTEM NAME                                  
ASSHRT   DS    CL3                 SYSTEM SHORT NAME                            
ASSYSN   DS    XL1                 DATAMGR SYSTEM NUMBER                        
ASSYSO   DS    XL1                 NATIVE SYSTEM NUMBER FOR CALLOV              
ASSYSE   DS    XL1                 EQUATED SYSTEM NUMBER FOR CALLOV             
ASRPLT   DS    CL1                 REPORT PROFILE KEY LETTER                    
ASUSLT   DS    CL1                 USER PROFILE KEY LETTER                      
ASIND1   DS    XL1                 SYSTEM INDICATORS BYTE 1                     
ASIALF   EQU   X'80'               USE AGENCY ALPHA IN KEY                      
ASIBIN   EQU   X'40'               USE AGENCY BINARY IN KEY                     
ASIND2   DS    XL1                 SYSTEM INDICATORS BYTE 2                     
ASEDAT   DS    CL8                 SYSTEM DATE (MM/DD/YY OR DD/MM/YY)           
ASBDAT   DS    XL3                 SYSTEM DATE (BINARY YMD)                     
ASPDAT   DS    PL3                 SYSTEM DATE (PWOS YMD)                       
ASCDAT   DS    XL2                 SYSTEM DATE (COMPRESSED)                     
ASTIME   DS    XL4                 SYSTEM TIME (STANDARD FORMAT)                
ASSIN    DS    XL4                 SYSTEM INPUT NUMBER                          
         DS    XL2                 N/D                                          
ASIOASTR DS    A                   A(START OF SYSTEM EXTRA AREA)                
ASIOALEN DS    F                   LENGTH OF SYSTEM EXTRA AREA                  
ASSWTAB  DS    (SYSSWMAX)XL(SYSSWLEN)                                           
         ORG   ASAREA+L'ASAREA                                                  
ASAREAX  DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* CONNECTED USER VARIABLES                                            *         
***********************************************************************         
         SPACE 1                                                                
CUAREA   DS    0XL64                                                            
CUABIN   DS    XL1                 AGENCY BINARY VALUE                          
CUAALF   DS    CL2                 AGENCY ALPHA VALUE                           
CUADDR   DS    0CL8                TERMINAL LINE/ADDRESS                        
CULINE   DS    CL4                 TERMINAL LINE-ID                             
CUTERM   DS    CL4                 TERMINAL ADDRESS                             
CUTRMN   DS    XL2                 TERMINAL NUMBER                              
CUUSER   DS    XL2                 USER-ID NUMBER                               
CUAUTH   DS    XL2                 AUTHORIZATION VALUE                          
CUACCS   DS    CL4                 LIMIT ACCESS VALUE                           
CUJOBI   DS    XL3                 SOON JOB INFO                                
CUOFFC   DS    CL1                 OFFICE CODE (C'*'=DDS)                       
CUSTAT   DS    XL1                 TERMINAL STATUS INDICATORS                   
CUSDDS   EQU   X'80'               USER CONNECTED WITH A DDS TERMINAL           
CUSTRM   EQU   X'40'               CUPASS IS TERMINAL PASSWORD                  
CUSPER   EQU   X'20'               CUPASS IS PERSONAL PASSWORD NUMBER           
CUSPCP   EQU   X'10'               USER CONNECTED THROUGH PC PAK                
CUSDDL   EQU   X'08'               USER CONNECTED VIA GLOB FROM DDLINK          
CUPASS   DS    XL2                 TERMINAL OR PERSONAL PASSWORD NUMBER         
CUCTRY   DS    XL1                 COUNTRY CODE                                 
CULANG   DS    XL1                 LANGUAGE CODE                                
CUAGYSEC DS    CL2                 SECURITY AGENCY                              
         ORG   CUAREA+L'CUAREA                                                  
CUAREAX  DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* FIELD VALIDATION & ERROR HANDLING VARIABLES                         *         
***********************************************************************         
         SPACE 1                                                                
FVAREA   DS    0XL256                                                           
FVADDR   DS    A                   A(INPUT FIELD HEADER) SET BY FVAL            
FVFLAG   DS    XL1                 FLAG BYTE USED BY FVAL ROUTINE               
FVHELP   DS    XL1                 HELP INDEX (ZERO=NO HELP AVAILABLE)          
FVMINL   DS    XL1                 MINIMUM INPUT LENGTH (ZERO=OPTIONAL)         
FVMAXL   DS    XL1                 MAXIMUM INPUT LENGTH (ZERO=MAXIMUM)          
FVOSYS   DS    XL1                 OVERRIDE SYSTEM FOR GETTXT CALLS             
FVOMTYP  DS    XL1                 OVERRIDE MESSAGE TYPE FOR GETTXT             
FVMSGNO  DS    XL2                 MESSAGE NUMBER                               
         ORG   *-1                                                              
FVFERN   DS    XL1                                                              
FVINDX   DS    XL1                 MULTIPLE FIELD INDEX NUMBER                  
FVSUBX   DS    XL1                 MULTIPLE FIELD SUB-INDEX NUMBER              
FVCURS   DS    XL1                 DISPLACEMENT TO CURSOR WITHIN FIELD          
FVXTRA   DS    CL40                TACKED ON TO ERROR MESSAGE IF ROOM           
FVERRIND DS    XL1                 ERROR INDICATOR                              
FVEUNWND EQU   X'80'               UNWIND THE TRANSACTION WITH $ABEND           
         DS    XL3                 N/D                                          
FVIHDR   DS    0XL8                ** EXTRACTED INPUT FIELD HEADER **           
FVTLEN   DS    XL1                 L'FIELD HEADER+L'FIELD                       
FVATRB   DS    XL1                 FIELD ATTRIBUTE                              
FVADDTB  EQU   X'80'               DON'T DELETE TRAILING BLANKS                 
FVALOWC  EQU   X'40'               LOWER CASE                                   
FVAPROT  EQU   X'20'               PROTECTED FIELD                              
FVAHIGH  EQU   X'08'               HIGH INTENSITY                               
FVALOWI  EQU   X'0C'               LOW  INTENSITY                               
FVAXTND  EQU   X'02'               EXTENDED HEADER                              
FVAMODF  EQU   X'01'               MODIFIED INPUT FIELD                         
FVABSA   DS    XL2                 SCREEN ABSOLUTE ADDRESS                      
FVIIND   DS    XL1                 INPUT VALIDATION INDICATORS                  
FVITHIS  EQU   X'80'               FIELD INPUT THIS TIME                        
FVILAST  EQU   X'40'               FIELD HAS BEEN INPUT PREVIOUSLY              
FVIVAL   EQU   X'20'               FIELD HAS BEEN VALIDATED PREVIOUSLY          
FVIINV   EQU   X'10'               FIELD IS INVALID                             
FVINUM   EQU   X'08'               FIELD IS VALID NUMERIC                       
FVIALF   EQU   X'04'               FIELD IS VALID ALPHA                         
FVIHEX   EQU   X'02'               FIELD IS VALID HEXADECIMAL                   
FVILEN   DS    XL1                 ACTUAL INPUT DATA LENGTH                     
FVOIND   DS    XL1                 OUTPUT INDICATORS                            
FVOXMT   EQU   X'80'               TRANSMIT FIELD                               
FVOCUR   EQU   X'40'               INSERT CURSOR TO FIELD                       
FVXLEN   DS    XL1                 ACTUAL INPUT DATA LENGTH-1                   
FVIFLD   DS    CL80                EXTRACTED & SPACE FILLED INPUT FIELD         
FVOMSG   DS    CL60                OUTPUT MESSAGE MAY BE BUILT HERE             
                                                                                
FVDDLERR DS    0XL2                DDLINK FIELD ID IN ERROR                     
FVDDLERN DS    X                   FIELD NUMBER IN ERROR                        
FVDDLERL DS    X                   RELATIVE FIELD NUMBER IN ERROR               
         ORG   FVAREA+L'FVAREA                                                  
FVAREAX  DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* I/O CONTROLLER WORK AREA                                            *         
***********************************************************************         
         SPACE 1                                                                
IOAREA   DS    0XL256                                                           
IODMCB   DS    8F                  I/O PARAMETER LIST                           
IOADDR   DS    A                   I/O AREA ADDRESS                             
IOFILE   DS    CL7                 FILE NAME                                    
IOCMND   DS    CL7                 DATAMGR COMMAND                              
IOFLAG   DS    XL1                 FLAG BYTE USED BY IO ROUTINE                 
IOFSWTCH EQU   X'80'               SYSTEM SWITCH OCCURRED FOR I/O               
IOERR    DS    XL1                 I/O ERROR RETURN BYTE                        
IOEEOF   EQU   X'80'               END-OF-FILE                                  
IOEDSK   EQU   X'40'               NON-RECOVERABLE DISK ERROR                   
IOEDUP   EQU   X'20'               DUPLICATE KEY ON ADD                         
IOERNF   EQU   X'10'               RECORD NOT FOUND                             
IOEDEL   EQU   X'02'               RECORD IS DELETED                            
IOESWS   EQU   X'FF'               SYSTEM SWITCH ERROR OCCURRED                 
IOERRS   EQU   X'FF'               RESERVED FOR CONTROLLER USE                  
IOKEY    DS    CL44                ACTUAL KEY VALUE                             
IOKEYSAV DS    CL44                SAVED ACTUAL KEY VALUE (BEFORE I/O)          
IODA     DS    XL4                 DISK ADDRESS OF D/A RECORD                   
IOWORK   DS    XL96                D/A LINKED FILES WORK AREA                   
         ORG   IOWORK                                                           
IOWDMWK  DS    XL44                FOR GETREC/PUTREC                            
IOWFILE  DS    XL(L'FILNAME)       FILE NAME                                    
         ORG   IOWORK+L'IOWORK                                                  
IOTOGO   DS    XL2                 NUMBER OF I/O'S REMAINING TILL DEATH         
IOINDS1  DS    XL1                 INDICATOR BYTE 1                             
IOISWAUT EQU   X'80'               AUTO SWITCH BACK AFTER I/O                   
IOIDMP6  EQU   X'40'               6TH PARAMTER TO DATAMGR SUPPLIED             
IOINDS2  DS    XL1                 INDICATOR BYTE 2                             
IODAOVER DS    XL4                 OVERRIDE D/A (ALWAYS USED AND XC'D)          
IOSWSE   DS    XL1                 SWITCH SE NUMBER                             
         DS    XL3                 SPARE                                        
IODMP6   DS    A                   A(6TH PARAMETER TO DATAMGR)                  
         ORG   IOAREA+L'IOAREA                                                  
IOAREAX  DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* THIS TIME INPUT VALUES                                              *         
***********************************************************************         
         SPACE 1                                                                
INREC    DS    XL1                 RECORD NUMBER                                
INACT    DS    XL1                 ACTION NUMBER                                
INSCRN   DS    XL1                 SCREEN NUMBER                                
INOVER   DS    XL1                 OVERLAY NUMBER                               
INMIX1   DS    XL1                 RECORD/ACTION INDICATORS - 1                 
INMIX2   DS    XL1                 RECORD/ACTION INDICATORS - 2                 
INKEYN   DS    XL1                 NUMBER OF KEY FIELDS ON SCREEN               
INKEYC   DS    XL1                 NUMBER OF KEY COMPONENTS                     
INKEYT   DS    XL8                 KEY COMPONENT NUMBERS                        
INOPTN   DS    XL1                 NUMBER OF OPTIONS INPUT                      
INACTLFM DS    XL1                 LFM ACTION NUMBER (IF INACT>ACTLFM8)         
INDRLIND DS    XL1                 DROOL INDICATORS                             
INFLAG1  DS    XL1                 FLAG BYTE                                    
INFDISR  EQU   X'80'               FORCE DISPLAY RECORD                         
         DS    XL5                 N/D                                          
*                                                                               
INREPORT DS    0CL8                ** REQUEST/REPORT VALUES **                  
INSYSID  DS    CL2                 REPORT SYSTEM ID                             
INPRGID  DS    CL2                 REPORT PROGRAM ID                            
INJCLID  DS    CL2                 REPORT JCL ID                                
INPRTY1  DS    CL1                 PRIORITY 1 VALUE                             
INOFFPH  DS    0XL1                PHASE NUMBER FOR REPORT (MIXIORP)            
INPRTY2  DS    CL1                 PRIORITY 2 VALUE                             
*                                                                               
INWHEN   DS    XL1                 REPORT WHEN (SEE MIXINDS2 VALUES)            
INOTYP   DS    CL6                 OUTPUT TYPE                                  
INDEST   DS    XL2                 DESTINATION ID                               
INUSER   DS    CL3                 REQUESTOR ID                                 
*                                                                               
INOPTR   DS    XL4                 REQUIRED OPTIONS                             
INOPTX   DS    XL4                 OPTIONS NOT ALLOWED                          
INOPTI   DS    XL4                 OPTIONS INPUT SO FAR                         
INWIDTH  DS    XL1                 REPORT WIDTH (R=REG,N=NARROW,W=WIDE)         
INSML    DS    CL1                 SMALL/MEDIUM/LARGE REPORT                    
         DS    XL14                N/D                                          
*                                                                               
INOPTS   DS    0XL64               ** OPTION VALUES **                          
         ORG   INOPTS+L'INOPTS                                                  
*                                                                               
INFORM   DS    0XL64               ** FORMAT VALUES **                          
         ORG   INFORM+L'INFORM                                                  
         EJECT                                                                  
***********************************************************************         
* ADDRESS DIRECTORY                                                   *         
***********************************************************************         
         SPACE 1                                                                
*                                  ** ADDRESS PASSED FROM FACPAK **             
AINP     DS    A                   A(TRANSLATOR I/O BLOCK)                      
ATWA     DS    A                   A(TERMINAL WORK AREA)                        
ATIA     DS    A                   A(TERMINAL INPUT AREA)                       
ASYS     DS    A                   A(SYSTEM FACILITY LIST)                      
ACOM     DS    A                   A(COMMON FACILITY LIST)                      
ASYSLST  DS    A                   A(GETFACT SYSTEM LIST)                       
         SPACE 1                                                                
*                                  ** ADDRESSES OF TWA FIELDS **                
AMSGHDR  DS    A                   A(MESSAGE FIELD)                             
ARECHDR  DS    A                   A(RECORD TYPE FIELD)                         
AACTHDR  DS    A                   A(ACTION FIELD)                              
AKEYHDR  DS    A                   A(KEY FIELD)                                 
AOPTHDR  DS    A                   A(OPTIONS FIELD)                             
ATWAEND  DS    A                   A(END OF VIRGIN SCREEN)                      
AINKHDR  DS    A                   A(FIELD HEADER OF FIRST KEY FIELD)           
AINDHDR  DS    A                   A(FIELD HEADER OF FIRST DATA FIELD)          
         DS    2A                  N/D                                          
         SPACE 1                                                                
*                                  ** ADDRESSES OF TABLE ENTRIES **             
AFILNTRY DS    A                   A(FILE NAMES TABLE ENTRY)                    
ARECNTRY DS    A                   A(RECORD TYPE TABLE ENTRY)                   
AACTNTRY DS    A                   A(ACTION TABLE ENTRY)                        
AMIXNTRY DS    A                   A(RECORD/ACTION TABLE ENTRY)                 
ASELNTRY DS    A                   A(SELECT ACTION TABLE ENTRY)                 
         DS    2A                  N/D                                          
         SPACE 1                                                                
*                                                                               
COMFACS  DS    0F                  ** COMMON FACILITIES **                      
VDMGR    DS    V                                                                
VCOLY    DS    V                                                                
VGETTXT  DS    V                                                                
VHELLO   DS    V                                                                
VSCANNER DS    V                                                                
VUNSCAN  DS    V                                                                
VHEXIN   DS    V                                                                
VHEXOUT  DS    V                                                                
VCASHVAL DS    V                                                                
VDATVAL  DS    V                                                                
VDATCON  DS    V                                                                
VSCUNKEY DS    V                                                                
VADDAY   DS    V                                                                
VPERVERT DS    V                                                                
VGETFACT DS    V                                                                
VGETDAY  DS    V                                                                
VPERVAL  DS    V                                                                
VMINIO   DS    V                                                                
VPARSNIP DS    V                                                                
VSWITCH  DS    V                                                                
CUREDIT  DS    V                                                                
VDICTAT  DS    V                                                                
VSECRET  DS    V                                                                
VBILLIT  DS    V                                                                
VPROTON  DS    V                                                                
VPROTOFF DS    V                                                                
COMFACN  EQU   (*-COMFACS)/L'COMFACS                                            
         SPACE 1                                                                
CONFACS  DS    0F                  ** CONTROLLER FACILITIES **                  
VTWABLD  DS    V                                                                
AFILTAB  DS    A                   A(SYSTEM FILE TABLE)                         
ASYSTAB  DS    A                   A(GLOBAL SYSTEM FILE TABLE)                  
ACMDTAB  DS    A                   A(SYSTEM FILE COMMAND TABLE)                 
AFVAL    DS    A                   A(FIELD VALIDATION ROUTINE)                  
AIO      DS    A                   A(I/O EXECUTIVE ROUTINE)                     
AOVSCR   DS    A                   A(SCREEN OVERLAY ROUTINE)                    
ABLDTWA  DS    A                   A(TWA BUILDER)                               
AVALWHEN DS    A                   A(WHEN FIELD VALIDATOR)                      
AVALOTYP DS    A                   A(OUTPUT TYPE FIELD VALIDATOR)               
AVALDEST DS    A                   A(DESTINATION FIELD VALIDATOR)               
AVALOPTS DS    A                   A(OPTIONS FIELD VALIDATOR)                   
APUTKEY  DS    A                   A(GLOBAL KEY SAVER)                          
ASETKEY  DS    A                   A(GLOBAL KEY COMPONENT MANAGER)              
AGETKEY  DS    A                   A(GLOBAL KEY GET ROUTINE)                    
AEXPREC  DS    A                   A(EXPAND RECORD NAME INTO SCRECNAM)          
AEXPACT  DS    A                   A(EXPAND ACTION NAME INTO SCACTNAM)          
AEXPKEY  DS    A                   A(EXPAND KEY NAME INTO SCKEYNAM)             
AEXPOPT  DS    A                   A(EXPAND OPTION NAME INTO SCOPTNAM)          
ADRIVER  DS    A                   A(DRIVER/DROOL ROUTINE)                      
CONFACN  EQU   (*-CONFACS)/L'CONFACS                                            
         SPACE 1                                                                
CONLODS  DS    0A                  ** CONTROLLER T00A PHASES **                 
VGETIDS  DS    V                                                                
VREPORT  DS    V                                                                
VREQTWA  DS    V                                                                
VSPOON   DS    V                                                                
VDROOL   DS    V                                                                
         DS    2V                                                               
CONLODN  EQU   (*-CONLODS)/L'CONLODS                                            
         SPACE 1                                                                
CONLDOFF DS    0A                  ** CONTROLLER T00A OFFLINE PHASES **         
VDRIVER  DS    V                                                                
         DS    V                                                                
CONLDOFN EQU   (*-CONLDOFF)/L'CONLDOFF                                          
         SPACE 1                                                                
*                                  ** MISCELLANEOUS ADDRESSES **                
AGLOBAL  DS    A                   A(GLOBAL AREA FOR DRIVER/DROOL)              
AREP     DS    A                   A(REPORT MONITOR W/S)                        
ALSM     DS    A                   A(LIST/SELECT MONITOR W/S)                   
ACTRY    DS    A                   A(COUNTRY TABLE)                             
ALANG    DS    A                   A(LANGUAGE TABLE)                            
         SPACE 1                                                                
COREFACS DS    0A                  ** T00A PHASE ADDRESSES **                   
         DS    32A                                                              
COREFACN EQU   (*-COREFACS)/L'COREFACS                                          
         SPACE 1                                                                
AROUTS   DS    0A                  ** COMMON CONTROLLER ROUTINES **             
         DS    32A                                                              
AROUTN   EQU   (*-AROUTS)/L'AROUTS                                              
         SPACE 1                                                                
***********************************************************************         
* THIS TIME RECORD VALUES (SAVED AT SAVVALS)                          *         
***********************************************************************         
         SPACE 1                                                                
RECVALS  DS    0X                  ** SAVED RECORD VALUES **                    
         DS    1024X                                                            
RECVALSL EQU   *-RECVALS                                                        
         SPACE 1                                                                
******************START OF APPLICATION WORK AREA***********************         
         EJECT                                                                  
***********************************************************************         
* TERMINAL WORK AREA DSECT                                            *         
***********************************************************************         
         SPACE 1                                                                
       ++INCLUDE FATWA                                                          
         ORG   TWAUSER                                                          
TWASAVE  DS    0XL48               ** CONTROLLER SAVE AREA **                   
TWAMODE  DS    XL1                 CONTROLLER MODE SETTING                      
TWAMFST  EQU   X'00'               FIRST FOR SESSION MODE SETTING               
TWAMNXT  EQU   X'80'               SESSION CONTINUATION MODE SETTING            
TWAMLSM  EQU   X'40'               LIST/SELECT MONITOR ACTIVE                   
TWAMSEL  EQU   X'20'               RECORD DISPLAYED LAST TIME                   
TWAMERR  EQU   X'10'               RECORD SELECT ERROR                          
TWAMDFC  EQU   X'08'               RECORD DISPLAYED FOR CHANGE                  
TWAMDFR  EQU   X'04'               RECORD DISPLAYED FOR COPY/RENAME             
TWAMDFN  EQU   X'02'               RECORD DISPLAYED FOR NEXT                    
TWAMODE2 DS    XL1                 CONTROLLER MODE SETTING 2                    
TWAMLVL  EQU   X'07'               LIST/SELECT MONITOR LEVEL                    
TWAHDISP DS    XL2                 DISPLACEMENT TO HELP FIELD IN TWA            
TWAHMORE DS    XL1                 NON-ZERO IF MORE HELP TO COME                
TWASCRN  DS    XL1                 CURRENT OVERLAYED SCREEN NUMBER              
TWALREC  DS    XL1                 LAST TIME RECORD NUMBER                      
TWALACT  DS    XL1                 LAST TIME ACTION NUMBER                      
TWALSMN  DS    XL1                 LIST SCREEN ACTUAL LINES                     
TWALSMA  DS    XL1                 LIST SCREEN LINES USED                       
TWALSCTL DS    XL1                 LIST/SEL CONTROL                             
TWALSHLD EQU   X'80'               HOLD CURRENT SCREEN                          
TWALSRTN EQU   X'40'               RETURN TO OVERLAY ON NEXT ENTER              
TWALSHSL EQU   X'20'               HOLD SELECTED LIST LEVEL                     
TWALSMSV EQU   X'10'               LSM MODE SAVE FOR OPTIONS HELP               
TWALSREC DS    XL1                 SELECT RECORD NUMBER                         
TWALSACT DS    XL1                 SELECT ACTION NUMBER                         
         DS    XL1                 N/D                                          
TWAOVER  DS    0X                  ** CAN BE USED BY OVERLAY **                 
         ORG   TWAUSRID            ** REDEFINED TWAD IF REPORTING **            
         DS    XL20                                                             
TWAOMODE DS    XL1                 OFFLINE MODE SETTING FROM SPOOF              
TWAOLOAD EQU   1                   LOAD SCREEN AND EXIT                         
TWAOPROC EQU   0                   PROCESS REQUEST                              
         DS    XL9                 N/D                                          
TWAOVBUF DS    A                   V(BUFFALO)                                   
TWAOVSRT DS    A                   V(SORTER)                                    
TWAOVPCH DS    A                   V(PATCHER)                                   
TWAOVWRK DS    A                   V(WORKER)                                    
TWAOVBOX DS    A                   V(BOX)                                       
TWAOVMST DS    A                   V(MASTC)                                     
         ORG   TWASAVE+L'TWASAVE                                                
TWASCR   DS    0X                                                               
         ORG   TWAD+3072                                                        
TWASVLEN EQU   (*-TWASCR)-256      LENGTH OF SAVED TWA AREA                     
         EJECT                                                                  
***********************************************************************         
* VALUES SAVED AT END OF TERMINAL WORK AREA                           *         
***********************************************************************         
         SPACE 1                                                                
SAVAREA  DS    0C                                                               
*                                  ** KEY COMPONENT SAVE AREA **                
SAVKEYL  DS    XL2                 L'SAVKEYL+L'SAVED SAVKEYS                    
SAVKEYS  DS    XL256               SAVED KEY COMPONENTS                         
         SPACE 1                                                                
*                                  ** SAVED INPUT VALUES **                     
SAVOPTS  DS    XL64                SAVED OPTIONS VALUES                         
         SPACE 1                                                                
*                                  ** SAVED I/O VALUES **                       
SAVRECN  DS    XL1                 SAVED RECORD NUMBER                          
SAVRECD  DS    XL4                 SAVED RECORD DISK ADDRESS                    
SAVRECI  DS    XL4                 SAVED RECORD ID                              
SAVRECK  DS    XL44                SAVED KEY VALUE                              
         SPACE 1                                                                
*                                                                               
SAVVALS  DS    (RECVALSL)X         SAVED RECORD VALUES                          
SAVSCRM  DS    XL10                SAVED SCREEN MAP (FROM UTL)                  
SAVDROOL DS    XL3                 SAVED VALUES FOR DROOL                       
SAVFILE  DS    XL7                 SAVED FILE NAME                              
SAVACTN  DS    XL8                 SAVED ACTION                                 
*                                                                               
GLOBSAVE DS    0CL16               GLOBBER SAVE AREA                            
GLOBINSY DS    CL3                 - TO SYSTEM  (GLVXTOSY) I.E. US              
GLOBINPR DS    CL3                 - TO PROGRAM (GLVXTOPR) I.E. US              
GLOBFRSY DS    CL3                 - FROM SYSTEM  (GLVXFRSY)                    
GLOBFRPR DS    CL3                 - FROM PROGRAM (GLVXFRPR)                    
GLOBFLG1 DS    CL1                 - FROM FLG1    (GLVXFLG1)                    
         DS    CL3                 - SPARE                                      
*                                                                               
         DS    XL212               N/D                                          
         SPACE 1                                                                
*                                  ** START OF OVERLAY SAVE AREA **             
SAVOVER  DS    0X                                                               
         ORG   SAVAREA+3072                                                     
SAVOVERX DS    0C                  END OF OVERLAY SAVE AREA                     
*                                                                               
*                                  RESERVED FOR GENERAL SAVE AREA               
*                                                                               
         ORG   SAVAREA+4096                                                     
SAVAREAX DS    0C                  END OF RESERVED SAVE AREA                    
*                                                                               
*                                  FREE FOR STORAGE FROM HERE UPTO              
*                                  FACPAK TABLES AT 12K (SEE FACHKPT)           
*                                                                               
TWAX     EQU   *                                                                
         EJECT                                                                  
***********************************************************************         
* LIST/SELECT MONITOR PAGE DSECT                                      *         
***********************************************************************         
         SPACE 1                                                                
LSMD     DSECT                     ** LIST/SELECT MONITOR SAVE PAGE **          
LSMSREC  DS    XL1                 SELECT RECORD NUMBER                         
LSMSACT  DS    XL1                 SELECT ACTION NUMBER                         
LSMSSCR  DS    XL1                 SELECT SCREEN NUMBER                         
LSMSOVR  DS    XL1                 SELECT OVERLAY NUMBER                        
LSMLOVR  DS    XL1                 LIST OVERLAY NUMBER                          
LSMLREC  DS    XL1                 RECORD NUMBER                                
LSMLACT  DS    XL1                 LIST ACTION NUMBER                           
LSMAACT  DS    XL1                 LIST ACTION NUMBER (SELECT ALL)              
LSMLSCR  DS    XL1                 LIST SCREEN OVERLAY NUMBER                   
LSMSELLN DS    XL1                 LENGTH OF SELECT FIELD                       
LSMUKEY  DS    XL44                USER INITIAL KEY VALUE                       
LSMUOPT  DS    XL64                USER INPUT OPTIONS                           
LSMLKEY  DS    XL44                KEY OF LAST LSMDTAB ENTRY                    
LSMINDS  DS    XL1                 LIST/SELECT INDICATORS                       
LSMISEL  EQU   X'80'               USER INVITED TO ENTER SELECTIONS             
LSMIEOL  EQU   X'40'               END OF LIST THIS SCREEN                      
LSMIEOS  EQU   X'20'               END OF SCREEN                                
LSMISEOS EQU   X'08'               ACTION+ INPUT (SELECT ALL TO EOS)            
LSMISEOL EQU   X'04'               ACTION2 INPUT (SELECT ALL TO EOL)            
LSMIDIS2 EQU   X'02'               PASS APMDISS2 MODE TO APPLICATION            
LSMALLCD DS    CL1                 ACTION+/ACTION2 CODE                         
LSMSMIX1 DS    XL1                 SELECT ACTION MIXINDS                        
LSMSMIX2 DS    XL1                 SELECT ACTION MIXINDS2                       
LSMSACTL DS    XL1                 SELECT ACTION NUMBER FOR LFM                 
         DS    XL6                 N/D                                          
*                                                                               
LSMADSP  DS    H                   DISPLACEMENT TO ACTION+ FIELD                
LSMRDSP  DS    H                   DISPLACEMENT TO CURRENT LSMRTAB NTRY         
LSMTWDSP DS    H                   DISPLACEMENT TO CURRENT SELECT LINE          
LSMTWFST DS    H                   DISPLACEMENT TO FIRST SELECT FIELD           
LSMTWEND DS    H                   DISPLACEMENT TO END OF LIST SCREEN           
LSMTWLEN DS    H                   LENGTH OF EACH SELECT LINE                   
LSMTWNUM DS    XL1                 NUMBER OF LINES ON LIST SCREEN               
LSMTWACT DS    XL1                 NUMBER OF LINES DISPLAYED ON SCREEN          
LSMTWCUR DS    XL1                 CURRENT ENTRY NUMBER                         
LSMTWMAX EQU   20                  MAXIMUM NUMBER OF SELECT LINES               
         DS    XL4                 N/D                                          
*                                                                               
LSMTWSV  DS    (TWASVLEN)X         ** SAVED LIST/SELECT TWA **                  
LSMTWSVL EQU   *-LSMTWSV                                                        
*                                                                               
LSMRTAB  DS    0X                  ** SAVE RECORD TABLE **                      
LSMRNUM  DS    XL1                 RECORD NUMBER (SEE RECNUMB EQUATES)          
LSMRDA   DS    XL4                 RECORD DISK/ADDRESS                          
LSMRID   DS    XL4                 RECORD IDENTIFICATION                        
LSMRKEY  DS    XL44                RECORD KEY                                   
LSMRTABL EQU   *-LSMRTAB                                                        
         DS    (LSMTWMAX)XL(LSMRTABL)                                           
LSMOVER  DS    2000X               AVAILABLE TO OVERLAYS                        
LSMKEYSV DS    XL86                SAVED INPUT KEY FIELD                        
*                                                                               
LSMEXTEN EQU   *                   ** EXTENSION FOR 14K TEMPSTR **              
LSMOPTS  DS    XL150               OPTIONS - AS INPUT (NESTED LISTS)            
LSMINOPT DS    XL(L'INOPTS)        OPTIONS - SAVED INOPTS "     "               
*                                                                               
LSMPRK   DS    0XL(LSMPRKLQ)                                                    
LSMPRKNO DS    XL1                                                              
LSMPRKLO DS    XL1                                                              
*                                  PREVIOUS LIST SCREENS' 1ST KEYS              
LSMPRKYS DS    (LSMPRKMQ)XL(L'LSMLKEY)                                          
LSMPRKLQ EQU   *-LSMPRKNO                                                       
LSMPRKMQ EQU   50                  MAX #SCREENS FOR BACKWARD SCROLLING          
         ORG   LSMD+(14*1024)                                                   
LSMX     EQU   *                                                                
         EJECT                                                                  
***********************************************************************         
* REPORT MONITOR WORK AREA DSECT                                      *         
***********************************************************************         
         SPACE 1                                                                
REPD     DSECT                                                                  
       ++INCLUDE FAREPBLK                                                       
         EJECT                                                                  
REPHS    DS    0CL132              ** REPORT HEAD LINES **                      
REPH1    DS    CL132                                                            
REPH2    DS    CL132                                                            
REPH3    DS    CL132                                                            
REPH4    DS    CL132                                                            
REPH5    DS    CL132                                                            
REPH6    DS    CL132                                                            
REPH7    DS    CL132                                                            
REPH8    DS    CL132                                                            
REPH9    DS    CL132                                                            
REPHA    DS    CL132                                                            
REPHB    DS    CL132                                                            
REPHC    DS    CL132                                                            
REPHD    DS    CL132                                                            
REPHE    DS    CL132                                                            
REPHN    EQU   (*-REPHS)/L'REPHS                                                
*                                                                               
REPMS    DS    0CL132              ** REPORT MID LINES **                       
REPM1    DS    CL132                                                            
REPM2    DS    CL132                                                            
REPM3    DS    CL132                                                            
REPM4    DS    CL132                                                            
REPMN    EQU   (*-REPMS)/L'REPMS                                                
*                                                                               
REPPS    DS    0CL132              ** REPORT PRINT LINES **                     
REPP1    DS    CL132                                                            
REPP2    DS    CL132                                                            
REPP3    DS    CL132                                                            
REPP4    DS    CL132                                                            
REPP5    DS    CL132                                                            
REPP6    DS    CL132                                                            
REPP7    DS    CL132                                                            
REPP8    DS    CL132                                                            
REPP9    DS    CL132                                                            
REPPA    DS    CL132                                                            
REPPB    DS    CL132                                                            
REPPC    DS    CL132                                                            
REPPD    DS    CL132                                                            
REPPE    DS    CL132                                                            
REPPN    EQU   (*-REPPS)/L'REPPS                                                
*                                                                               
REPFS    DS    0XL132              ** REPORT FOOT LINES **                      
REPF1    DS    CL132                                                            
REPF2    DS    CL132                                                            
REPFN    EQU   (*-REPFS)/L'REPFS                                                
*                                                                               
         ORG   REPHS                                                            
REPHWS   DS    0CL165              ** WIDE REPORT HEAD LINES **                 
REPHW1   DS    CL165                                                            
REPHW2   DS    CL165                                                            
REPHW3   DS    CL165                                                            
REPHW4   DS    CL165                                                            
REPHW5   DS    CL165                                                            
REPHW6   DS    CL165                                                            
REPHW7   DS    CL165                                                            
REPHW8   DS    CL165                                                            
REPHW9   DS    CL165                                                            
REPHWA   DS    CL165                                                            
REPHWB   DS    CL165                                                            
REPHWN   EQU   (*-REPHWS)/L'REPHWS                                              
*                                                                               
REPMWS   DS    0CL165              ** WIDE REPORT MID LINES **                  
REPMW1   DS    CL165                                                            
REPMW2   DS    CL165                                                            
REPMW3   DS    CL165                                                            
REPMWN   EQU   (*-REPMWS)/L'REPMWS                                              
*                                                                               
REPPWS   DS    0CL165              ** WIDE REPORT PRINT LINES **                
REPPW1   DS    CL165                                                            
REPPW2   DS    CL165                                                            
REPPW3   DS    CL165                                                            
REPPW4   DS    CL165                                                            
REPPW5   DS    CL165                                                            
REPPW6   DS    CL165                                                            
REPPW7   DS    CL165                                                            
REPPW8   DS    CL165                                                            
REPPW9   DS    CL165                                                            
REPPWA   DS    CL165                                                            
REPPWB   DS    CL165                                                            
REPPWN   EQU   (*-REPPWS)/L'REPPWS                                              
*                                                                               
REPFWS   DS    0CL165              ** WIDE REPORT FOOT LINES **                 
REPFW1   DS    CL165                                                            
REPFW2   DS    CL165                                                            
REPFWN   EQU   (*-REPFWS)/L'REPFWS                                              
*                                                                               
         ORG   REPHS                                                            
REPHNS   DS    0CL110              ** NARROW REPORT HEAD LINES **               
REPHN1   DS    CL110                                                            
REPHN2   DS    CL110                                                            
REPHN3   DS    CL110                                                            
REPHN4   DS    CL110                                                            
REPHN5   DS    CL110                                                            
REPHN6   DS    CL110                                                            
REPHN7   DS    CL110                                                            
REPHN8   DS    CL110                                                            
REPHN9   DS    CL110                                                            
REPHNA   DS    CL110                                                            
REPHNB   DS    CL110                                                            
REPHNC   DS    CL110                                                            
REPHND   DS    CL110                                                            
REPHNE   DS    CL110                                                            
REPHNF   DS    CL110                                                            
REPHNG   DS    CL110                                                            
REPHNN   EQU   (*-REPHNS)/L'REPHNS                                              
*                                                                               
REPMNS   DS    0CL110              ** NARROW REPORT MID LINES **                
REPMN1   DS    CL110                                                            
REPMN2   DS    CL110                                                            
REPMN3   DS    CL110                                                            
REPMN4   DS    CL110                                                            
REPMNN   EQU   (*-REPMNS)/L'REPMNS                                              
*                                                                               
REPPNS   DS    0CL110              ** NARROW REPORT PRINT LINES **              
REPPN1   DS    CL110                                                            
REPPN2   DS    CL110                                                            
REPPN3   DS    CL110                                                            
REPPN4   DS    CL110                                                            
REPPN5   DS    CL110                                                            
REPPN6   DS    CL110                                                            
REPPN7   DS    CL110                                                            
REPPN8   DS    CL110                                                            
REPPN9   DS    CL110                                                            
REPPNA   DS    CL110                                                            
REPPNB   DS    CL110                                                            
REPPNC   DS    CL110                                                            
REPPND   DS    CL110                                                            
REPPNE   DS    CL110                                                            
REPPNF   DS    CL110                                                            
REPPNG   DS    CL110                                                            
REPPNN   EQU   (*-REPPNS)/L'REPPNS                                              
*                                                                               
REPFNS   DS    0CL110              ** NARROW REPORT FOOT LINES **               
REPFN1   DS    CL110                                                            
REPFN2   DS    CL110                                                            
REPFN3   DS    CL110                                                            
REPFN4   DS    CL110                                                            
REPFNN   EQU   (*-REPFNS)/L'REPFNS                                              
*                                                                               
         ORG                                                                    
REPX     EQU   *                                                                
         EJECT                                                                  
***********************************************************************         
* DDLINK FIELD TABLE DSECT (OLAY MUST PUT ADDRESS IN APDDLTAB)        *         
***********************************************************************         
         SPACE 1                                                                
DDLFTD   DSECT                                                                  
DDLFTNUM DS    AL2                 FIELD NUMBER                                 
*                                  AL2(0) = END OF TABLE                        
DDLFTDSP DS    AL2                 FIELD DISP INTO TWA OR WORKD                 
DDLFTMLN DS    X                   MAX FIELD LENGTH (NOT ELEMENT LEN)           
DDLFTIND DS    X                   FIELD FLAGS                                  
DDLFTIKQ EQU   X'80'               FIELD IS A KEY FIELD                         
DDLFTIWQ EQU   X'40'               FIELD IS IN WORKD, NOT TWA FIELD             
DDLFTIOQ EQU   X'20'               FIELD IS OUTPUT ONLY (E.G. PROT)             
DDLFTDLQ EQU   *-DDLFTD                                                         
