*          DATA SET GEGENSCR   AT LEVEL 014 AS OF 09/14/10                      
***********************************************************************         
* NEW FILE CONTROLLER RECORDS                                         *         
*                                                                     *         
* 00(XA) ACTION RECORDS                                               *         
* 00(XD) DOWNLOAD RECORDS                                             *         
* 00(XF) FIELD RECORDS                                                *         
* 00(XP) PFKEY RECORDS                                                *         
* 00(XR) RECORD RECORDS                                               *         
* 00(XS) SCREEN RECORDS                                               *         
* 00(XX) DEFAULT COLUMN RECORDS                                       *         
***********************************************************************         
         EJECT                                                                  
***********************************************************************         
* FIELD ELEMENT DSECT                                                 *         
***********************************************************************         
         SPACE 1                                                                
FDRELD   DSECT                     ** NEW FIELD TABLE ENTRY **                  
FDREL    DS    XL1                 FIELD ELEMENT                                
FDRELQ   EQU   X'01'               FIELD ELEMENT FIXED ON FIELD RECORD          
FLTRLQ   EQU   X'04'               FILTER ELEMENT IF FIELD FILTERABLE           
FDRLN    DS    XL1                 FIELD ELEMENT LENGTH                         
FDRNUM   DS    XL2                 EXTERNAL REFERENCE NUMBER                    
FDRHLP   DS    XL1                 HELP NUMBER                                  
FDRSEC   DS    XL1                 SECURITY REFERENCE NUMBER                    
FDRCTRY  DS    XL4                 COUNTRY BITMASK                              
FDRLVL   DS    XL1                 RECORD LEVEL OF DATA (DIR/FIL/TAB)           
FDRIKEY  EQU   X'20'               DATA IN KEY                                  
FDRIFILE EQU   X'10'               DATA IN FILE RECORD                          
FDRISTT  EQU   X'08'               DATA IN STATUS ONLY                          
FDRITSAR EQU   X'04'               DATA ON TSAR RECORD                          
FDRIUSR  EQU   X'02'               DATA AT USER DEFINED LEVEL                   
*                                                                               
FDRINDS1 DS    XL1                 INDICATORS BYTE 1                            
FDR1DDS  EQU   X'80'               FIELD IS DDS ONLY                            
FDR1PRO  EQU   X'40'               INPUT FIELD IS PROTECTED                     
FDR1RDIS EQU   X'20'               REDISPLAY FIELD AFTER VALIDATION             
FDR1REQ  EQU   X'10'               INPUT TO FIELD IS REQUIRED                   
FDR1IDEF EQU   X'08'               FIELD HAS DEFAULT VALUE                      
FDR1XTAG EQU   X'04'               SUPPRESS TAG FIELD                           
FDR1SPC1 EQU   X'02'               CLEAR ALL AFTER 1ST SPACE ON VAL.            
*                                                                               
FDRINDS2 DS    XL1                 INDICATORS BYTE 2 (FOR LIST)                 
FDR2FILT EQU   X'80'               FIELD IS FILTERABLE (FLTRLQ ADDED)           
*                                                                               
FDRTFHAT DS    XL1                 TAG ATTRIBUTE BYTE                           
FDRTFHXT DS    XL1                 TAG EXTENDED ATTRIBUTE BYTE                  
FDRFHAT  DS    XL1                 FIELD ATTRIBUTE BYTE                         
FDRFHXA  DS    XL1                 FIELD EXTENDED ATTRIBUTE BYTE                
*                                                                               
FDRTDEFL DS    XL1                 TAG FIELD LENGTH (FROM DCDD)                 
FDRRTAG  DS    XL4                 DEFAULT DCDD FOR TAG                         
FDRFDEFL DS    XL1                 INPUT FIELD LENGTH                           
FDRFMIN  DS    XL1                 MINIMUM INPUT LENGTH ALLOWED                 
FDRFMAX  DS    XL1                 MAXIMUM INPUT LENGTH ALLOWED                 
*                                                                               
*                                  * LIST SCREEN INFORMATION *                  
FDRLHLEN DS    XL1                 COLUMN HEADING WIDTH                         
FDRLCLEN DS    XL1                 COLUMN FIELD WIDTH                           
FDRLCDSP DS    XL1                 DISPLACEMENT TO FIELD WITHIN HEADING         
FDRLHED1 DS    XL4                 DCDD FOR COLUMN HEADING 1                    
FDRLHED2 DS    XL4                 DCDD FOR COLUMN HEADING 2                    
*                                                                               
FDRLIND1 DS    XL1                 LIST INDICATOR BYTE 1                        
FDRLIEOP EQU   X'80'               SELECTABLE TO END-OF-PAGE                    
FDRLIEOL EQU   X'40'               SELECTABLE TO END-OF-LIST                    
         DS    XL3                 N/D                                          
FDRLNQ   EQU   *-FDRELD                                                         
         ORG   FDRLHLEN                                                         
*                               ** FILTER INFORMATION (ON FLTRLQ)               
FDRFVAL1 DS    XL1                                                              
FDRF1NOT EQU   X'80'            NOT IS A VALID FILTER                           
FDRF1EQ  EQU   X'40'            EQUAL IS A VALID FILTER                         
FDRF1GT  EQU   X'20'            GREATER THAN IS A VALID FILTER                  
FDRF1LT  EQU   X'10'            LESS THAN IS A VALID FILTER                     
*                                                                               
*                               ** DEFAULT FILTER VALUE                         
FDRD1NOT EQU   X'08'            NOT IS PART OF DEFAULT                          
FDRD1EQ  EQU   X'04'            EQUAL IS PART OF DEFAULT                        
FDRD1GT  EQU   X'02'            GREATER THAN IS PART OF DEFAULT                 
FDRD1LT  EQU   X'01'            LESS THAN IS PART OF DEFAULT                    
*                                                                               
FDRFVAL2 DS    XL1                                                              
FDRF2RNG EQU   X'80'            A RANGE IS VALID FOR FILTER                     
FDRF2NE  EQU   X'40'            NOT RANGE                                       
FDRF2V1  EQU   X'20'            VALUE 1 INPUT FOR RANGE THIS TIME               
FDRF2V2  EQU   X'10'            VALUE 2 INPUT FOR RANGE THIS TIME               
FDRF2LST EQU   X'08'            A LIST IS VALID FOR FILTER                      
FDRF2OWN EQU   X'04'            OWNER HANDLES FILTER FIELD                      
FDRF2NOV EQU   X'02'            NO OVERRIDES WILL BE ENTERED                    
FDRFSAVL DS    XL1                                                              
FDRFTOL  DS    XL1                                                              
         DS    XL4                                                              
FLTRLNQ  EQU   *-FDRELD                                                         
         EJECT                                                                  
***********************************************************************         
* FIELD LIST ELEMENT - LISTS DATA OBJECTS USED IN RECORD              *         
***********************************************************************         
         SPACE 1                                                                
FLRELD   DSECT                                                                  
FLREL    DS    XL1                                                              
FLRELQ   EQU   X'02'                                                            
FLRLN    DS    XL1                                                              
FLRNUM   DS    XL2                 FIELD NUMBER                                 
FLRIND1  DS    XL1                 INDICATORS 1                                 
FLRIND2  DS    XL1                 INDICATORS 2                                 
         DS    XL5                 N/D                                          
FLRLNQ   EQU   *-FLRELD                                                         
         EJECT                                                                  
***********************************************************************         
* SCREEN ELEMENT - LISTS FIELDS USED TO BUILD ONE SCREEN PAGE         *         
***********************************************************************         
         SPACE 1                                                                
FSRELD   DSECT                                                                  
FSREL    DS    XL1                 SCREEN ELEMENT                               
FSRELQ   EQU   X'03'                                                            
FSRLN    DS    XL1                 SCREEN ELEMENT LENGTH                        
FSRPOSN  DS    XL2                 ABSOLUTE SCREEN DISPLACEMENT                 
FSRIND1  DS    XL1                 FIELD TYPE                                   
FSRIOVR  EQU   X'80'               OVERLAY A SCREEN (# IN FSRIND2)              
FSRITAG  EQU   X'40'               TAG FIELD ONLY (NO FIELD ENTRY)              
FSRSLST  EQU   X'20'               TOP LEFT OF LIST                             
FSRELST  EQU   X'10'               BOTTOM RIGHT OF LIST                         
FSRIND2  DS    XL1                 INDICATOR BYTE                               
FSRNUM   DS    XL2                 FIELD NUMBER                                 
FSRLN1Q  EQU   *-FSRELD                                                         
         ORG   FSRNUM                                                           
FSRTLN   DS    XL1                 LENGTH OF TAG IF TAG ONLY                    
FSRTDICT DS    XL4                 DDCD FOR TAG IF TAG ONLY                     
FSRTFHAT DS    XL1                 TAG ATTRIBUTE BYTE                           
FSRTFHXT DS    XL1                 TAG EXTENDED ATTRIBUTE BYTE                  
FSRLN2Q  EQU   *-FSRELD                                                         
         SPACE 1                                                                
***********************************************************************         
* DEFAULT COLUMN LIST ELEMENT                                         *         
***********************************************************************         
         SPACE 1                                                                
FCRELD   DSECT                                                                  
FCREL    DS    XL1                 COLUMN LIST ELEMENT CODE                     
FCRELQ   EQU   X'04'                                                            
FCRLN    DS    XL1                 COLUMN LIST ELEMENT LENGTH                   
FCRTYPE  DS    XL1                 COLUMN TYPE                                  
FCRTFIX  EQU   C'1'                FIXED COLUMN TYPE                            
FCRTVAR  EQU   C'2'                VARIABLE COLUMN TYPE                         
FCRTVOK  EQU   C'3'                OK TO SHOW THIS FIELD IF USER WISHES         
FCRCNUM  DS    XL1                 COLUMN NUMBER                                
FCRFNUM  DS    XL2                 FIELD NUMBER                                 
FCRCIND  DS    XL1                 COLUMN INDICATORS (DCTINDS)                  
FCRLNQ   EQU   *-FCRELD                                                         
         SPACE 1                                                                
***********************************************************************         
* DOWNLOAD COLUMN LIST ELEMENT                                        *         
***********************************************************************         
         SPACE 1                                                                
FDLELD   DSECT                                                                  
FDLEL    DS    XL1                 DOWNLOAD ELEMENT CODE                        
FDLELQ   EQU   X'04'                                                            
FDLLN    DS    XL1                 DOWNLOAD ELEMENT LENGTH                      
FDLCNUM  DS    XL1                 COLUMN NUMBER                                
FDLFNUM  DS    XL2                 FIELD NUMBER                                 
FDLCIND  DS    XL2                 N/D                                          
FDLLNQ   EQU   *-FDLELD                                                         
         SPACE 1                                                                
***********************************************************************         
* RECORD ELEMENT DSECT                                                *         
***********************************************************************         
         SPACE 1                                                                
FRRELD   DSECT                     ** NEW FIELD TABLE ENTRY **                  
FRREL    DS    XL1                 RECORD ELEMENT                               
FRRELQ   EQU   X'05'               RECORD ELEMENT TYPE                          
FRRLN    DS    XL1                 LENGTH                                       
FRRDICT  DS    XL2                 DICTIONARY NUMBER OF RECORD NAME             
FRRCTRY  DS    XL1                 RECORD IS VALID FOR THIS COUNTRY             
FRRSUB   DS    XL1                 RECORD VALID FOR THIS SUB-COUNTRY            
FRRPHASE DS    XL1                 PHASE NUMBER OF RECORD                       
FRRSYS   DS    XL1                 RECORD SYSTEM                                
FRRINDS1 DS    XL1                 INDICATORS BYTE 1                            
FRR1DDS  EQU   X'80'               RECORD IS DDS ONLY                           
FRR1SEL  EQU   X'40'               RECORD IS SELECT TYPE ONLY                   
FRR1UPDT EQU   X'20'               RECORD IS UPDATED ON PFKEY PRESS             
FRR1HEIR EQU   X'10'               RECORD INHERITS FROM LEVEL ABOVE             
FRR1GLOB EQU   X'08'               RECORD IS A GLOBAL RECORD                    
FRR1USC  EQU   X'04'               RECORD USES SCREEN CODES                     
FRR1UKC  EQU   X'02'               RECORD USES KEY SCREEN CODES                 
FRR1ULC  EQU   X'01'               RECORD USES LIST SCREEN CODES                
FRRINDS2 DS    XL1                 INDICATORS BYTE 2                            
FRR2TSO  EQU   X'80'               RECORD IS TEST SYSTEM ONLY                   
FRRHELP  DS    AL2                 HELP TEXT NUMBER                             
FRRHELPL EQU   60                  LENGTH OF HELP TEXT                          
FRRDIR   DS    XL1                 DIRECTORY WITHIN SYSTEM                      
FRRSEC   DS    XL1                 SECURITY OVERRIDE NUMBER                     
         DS    XL11                N/D                                          
FRRLNQ   EQU   *-FRRELD                                                         
         EJECT                                                                  
***********************************************************************         
* ACTION ELEMENT DSECT                                                *         
***********************************************************************         
         SPACE 1                                                                
FRAELD   DSECT                     ** NEW ACTION TABLE ENTRY **                 
FRAEL    DS    XL1                 ACTION ELEMENT                               
FRAELQ   EQU   X'06'               ACTION ELEMENT TYPE                          
FRALN    DS    XL1                 LENGTH                                       
FRANUM   DS    XL1                 ACTION NUMBER                                
FRADICT  DS    XL2                 DICTIONARY NUMBER OF ACTION NAME             
FRATYPE  DS    XL1                 MAINTAIN/LIST ETC                            
FRATMNT  EQU   1                   ACTION IS MAINTENANCE TYPE                   
FRATLIST EQU   2                   ACTION IS LIST TYPE                          
FRATREP  EQU   3                   ACTION IS REPORT                             
FRATDWN  EQU   4                   ACTION IS DOWNLOAD                           
*                                                                               
FRAINDS1 DS    XL1                 INDICATORS BYTE 1                            
FRA1DDS  EQU   X'80'               ACTION IS DDS ONLY                           
FRA1NOH  EQU   X'40'               ACTION IS SELECT ONLY (NO HELP)              
FRA1UPD  EQU   X'20'               ACTION IS UPDATIVE                           
FRA1SUB  EQU   X'10'               ACTION IS SUB ACTION ON LIST                 
*                                                                               
FRAINDS2 DS    XL1                 INDICATORS BYTE 2                            
FRAVERB  DS    XL1                 ACTION VERB                                  
FRAHELP  DS    XL2                 HELP MESSAGE                                 
FRANREC  DS    XL1                 SUB-ACTION RECORD                            
FRANACT  DS    XL1                 SUB-ACTION ACTION                            
FRASACT  DS    XL1                 SUB-ACTION VERB                              
*                                                                               
FRAOACT  DS    XL1                 OVERRIDE PHASE FOR THIS ACTION               
FRASHELP DS    XL2                 SUB-ACTION HELP MESSAGE                      
FRARSEC  DS    XL1                 SECURITY OVERRIDE NUMBER - RECORD            
FRAASEC  DS    XL1                 SECURITY OVERRIDE NUMBER - ACTION            
         DS    XL2                                                              
FRALNQ   EQU   *-FRAELD                                                         
         EJECT                                                                  
***********************************************************************         
* PFKEY ELEMENT DSECT                                                 *         
***********************************************************************         
         SPACE 1                                                                
FRPELD   DSECT                     ** NEW PFKEY TABLE ENTRY **                  
FRPEL    DS    XL1                 PFKEY ELEMENT                                
FRPELQ   EQU   X'07'               PFKEY ELEMENT TYPE                           
FRPLN    DS    XL1                 LENGTH                                       
FRPPFK#  DS    XL1                 PFKEY NUMBER                                 
FRPDICT  DS    XL2                 DICTIONARY NUMBER OF PFKEY NAME              
FRPTYPE  DS    XL1                 PFKEY TYPE                                   
FRPTRAC  EQU   1                   TYPE IS RECORD ACTION COMBO                  
FRPTRACN EQU   2                   TYPE IS RECORD ACTION WITH NTRSES            
FRPTUP   EQU   3                   TYPE IS SCROLL UP FOR LIST                   
FRPTDOWN EQU   4                   TYPE IS SCROLL DOWN FOR LIST                 
FRPTLEFT EQU   5                   TYPE IS SCROLL LEFT FOR LIST                 
FRPTRGHT EQU   6                   TYPE IS SCROLL RIGHT FOR LIST                
FRPTQPN  EQU   7                   TYPE IS QUIT & PROCESS NEXT                  
FRPTQPL  EQU   8                   TYPE IS QUIT TO PREVIOUS LEVEL               
FRPTAPPL EQU   9                   TYPE IS PFKEY FOR APPLICATION USE            
FRPTAPA  EQU   10                  TYPE IS KNOWN APPLICATION ACTION             
FRPTALT  EQU   11                  TYPE IS ALTERNATE PFKEY DISPLAY ACT          
FRPTPOSN EQU   12                  TYPE IS POSITIONAL (ON LIST)                 
FRPTRFRS EQU   13                  TYPE IS REFRESH LIST SCREEN                  
FRPTUPDT EQU   14                  TYPE IS UPDATE RECORD TO FILE                
FRPTMBAC EQU   15                  TYPE IS MAINT SCROLL BACKWARDS               
FRPTMFWD EQU   16                  TYPE IS MAINT SCROLL FORWARDS                
FRPTSRCH EQU   17                  TYPE IS SEARCH                               
FRPTSCRL EQU   18   ?? WHATS THIS  LOSE THIS FUCKER                             
FRPTDWN  EQU   19                  TYPE IS START DOWNLOAD                       
FRPTRACS EQU   20                  TYPE IS REC/ACT WITH NTRSES - SELECT         
FRPTMUP  EQU   21                  TYPE IS MAX SCROLL UP FOR LIST               
FRPTMDWN EQU   22                  TYPE IS MAX SCROLL DOWN FOR LIST             
FRPTCLRF EQU   23                  TYPE IS CLEAR ALL FILTERS                    
FRPTMLAS EQU   24                  TYPE IS MAINT SCROLL TO LAST PAGE            
*                                                                               
FRPINDS1 DS    XL1                 INDICATORS BYTE 1                            
FRP1SCR  EQU   X'03'               USE TO TURN OFF SCROLL BITS                  
FRP1U    EQU   X'00'               SCROLL UP                                    
FRP1D    EQU   X'01'               SCROLL DOWN                                  
FRP1L    EQU   X'02'               SCROLL LEFT                                  
FRP1R    EQU   X'03'               SCROLL RIGHT                                 
FRP1DDS  EQU   X'80'               PFKEY ACTION IS DDS ONLY                     
*                                                                               
FRPINDS2 DS    XL1                 INDICATORS BYTE 2                            
FRP2RTN  EQU   X'40'               RETURN FROM SELECT WITH INPUT SET            
FRP2CALL EQU   X'20'               CALL APPLICATION ROUTINE                     
FRP2LONG EQU   X'10'               LONG PFK NAME                                
*                                                                               
FRPINDS3 DS    XL1                 INDICATORS BYTE 3                            
*                                                                               
FRPRECA  DS    0XL2                RECORD/ACTION COMBO                          
FRPREC   DS    XL1                 RECORD TO GO TO (FRPTRAC/RACN SET)           
FRPACT   DS    XL1                 ACTION TO GO TO                              
*                                                                               
FRPSUB   DS    XL1                 SUB ACTION (FRPTAPA SET)                     
FRPNEXT  DS    XL1                 NEXT TIME AUTO PFKEY VALUE                   
         DS    XL11                                                             
FRPLNQ   EQU   *-FRPELD                                                         
         SPACE 2                                                                
***********************************************************************         
* SCREEN POINTER ELEMENT                                              *         
***********************************************************************         
         SPACE 1                                                                
SPRELD   DSECT                                                                  
SPREL    DS    XL1                 SCREEN POINTER ELEMENT CODE                  
SPRELQ   EQU   X'08'                                                            
SPRLN    DS    XL1                                                              
SPRPRG   DS    XL1                 SCREEN SHADOW PROGRAM                        
SPRREC   DS    XL1                 SCREEN SHADOW RECORD                         
SPRLNQ   EQU   *-SPRELD                                                         
         SPACE 2                                                                
***********************************************************************         
* PAGE NAME ELEMENT                                                   *         
***********************************************************************         
         SPACE 1                                                                
PNMELD   DSECT                                                                  
PNMEL    DS    XL1                 PAGE NAME ELEMENT                            
PNMELQ   EQU   X'09'                                                            
PNMLN    DS    XL1                                                              
PNMNAME  DS    XL4                 DDREF FOR NAME                               
PNMLNQ   EQU   *-PNMELD                                                         
         SPACE 2                                                                
***********************************************************************         
* FIELD RECORD KEY                                                    *         
***********************************************************************         
         SPACE 1                                                                
FDRRECD  DSECT                                                                  
FDRKEY   DS    0XL32               FIELD RECORD                                 
FDRKMAJ  DS    XL1                 MAJOR SYSTEM (ZERO)                          
FDRKMIN  DS    XL1                 MINOR SYSTEM (ZERO)                          
FDRKMINQ EQU   C'X'                NEW FILE CONTROL RECORDS                     
FDRKTYP  DS    XL1                 TYPE                                         
FDRKTYPQ EQU   C'F'                FIELD RECORDS                                
FDRKSYS  DS    XL1                 SYSTEM                                       
FDRKPRG  DS    XL1                 PROGRAM                                      
FDRKREC  DS    XL1                 RECORD                                       
         DS    XL21                N/D                                          
FDRKNUM  DS    XL2                 FIELD NUMBER                                 
FDRKCTRY DS    XL1                 COUNTRY CODE (XC'D FF)                       
FDRKSUB  DS    XL1                 IN CASE IT EVER OVERFLOWS                    
FDRKTEST DS    XL1                 TEST PHASE                                   
*                                                                               
*                                  ** DIRECTORY VALUES **                       
FDRKSTAT DS    XL1                 STATUS                                       
FDRKFLT  EQU   X'40'               DATA IS FILTERABLE                           
FDRKKEY  EQU   X'20'               DATA IN KEY                                  
FDRKFILE EQU   X'10'               DATA IN FILE RECORD                          
FDRKSTT  EQU   X'08'               DATA IN STATUS ONLY                          
FDRKTSAR EQU   X'04'               DATA ON TSAR RECORD                          
FDRKUSR  EQU   X'02'               FILTER IS USER DEFINED                       
FDRKCTL  DS    XL3                 CONTROL                                      
FDRKDA   DS    XL4                 DISK ADDRESS                                 
FDRKLEN  EQU   *-FDRRECD           DIRECTORY REC LENGTH                         
         ORG   FDRKSTAT                                                         
*                                  ** FILE VALUES **                            
FDRFLEN  DS    XL2                 RECORD LENGTH                                
FDRFSTAT DS    XL1                 STATUS                                       
FDRFCTL  DS    XL3                 CONTROL                                      
FDRFSYS  DS    XL4                 SYSTEM LINKAGE AREA                          
FDRFIRST EQU   *-FDRRECD           FIRST ELEMENT                                
         SPACE 1                                                                
***********************************************************************         
* FIELD LIST RECORD KEY                                               *         
***********************************************************************         
         SPACE 1                                                                
FLRRECD  DSECT                                                                  
FLRKEY   DS    0XL32               FIELD LIST RECORD                            
FLRKMAJ  DS    XL1                 MAJOR SYSTEM (ZERO)                          
FLRKMIN  DS    XL1                 MINOR SYSTEM (ZERO)                          
FLRKMINQ EQU   C'X'                NEW FILE CONTROL RECORDS                     
FLRKTYP  DS    XL1                 TYPE                                         
FLRKTYPQ EQU   C'L'                FIELD LIST RECORDS                           
FLRKSYS  DS    XL1                 SYSTEM                                       
FLRKPRG  DS    XL1                 PROGRAM                                      
FLRKREC  DS    XL1                 RECORD                                       
         ORG   FLRKEY+L'FLRKEY-(L'FLRKSUB)                                      
FLRKSUB  DS    XL1                 SEQUENCE NUMBER                              
*                                                                               
*                                  ** DIRECTORY VALUES **                       
FLRKSTAT DS    XL1                 STATUS                                       
FLRKCTL  DS    XL3                 CONTROL                                      
FLRKDA   DS    XL4                 DISK ADDRESS                                 
FLRKLEN  EQU   *-FLRRECD           DIRECTORY REC LENGTH                         
         ORG   FLRKSTAT                                                         
*                                  ** FILE VALUES **                            
FLRFLEN  DS    XL2                 RECORD LENGTH                                
FLRFSTAT DS    XL1                 STATUS                                       
FLRFCTL  DS    XL3                 CONTROL                                      
FLRFSYS  DS    XL4                 SYSTEM LINKAGE AREA                          
FLRFIRST EQU   *-FLRRECD           FIRST ELEMENT                                
         SPACE 1                                                                
***********************************************************************         
* SCREEN RECORD KEY                                                   *         
***********************************************************************         
         SPACE 1                                                                
FSRRECD  DSECT                                                                  
FSRKEY   DS    0XL32               FIELD LIST RECORD                            
FSRKMAJ  DS    XL1                 MAJOR SYSTEM (ZERO)                          
FSRKMIN  DS    XL1                 MINOR SYSTEM (ZERO)                          
FSRKMINQ EQU   C'X'                NEW FILE CONTROL RECORDS                     
FSRKTYP  DS    XL1                 TYPE                                         
FSRKTYPQ EQU   C'S'                SCREEN RECORDS                               
FSRKSYS  DS    XL1                 SYSTEM                                       
FSRKPRG  DS    XL1                 PROGRAM                                      
FSRKREC  DS    XL1                 RECORD                                       
FSRKCODE DS    XL1                 TYPE CODE (EG FOR MEDIA TYPE)                
FSRKPAGE DS    XL1                 PAGE NUMBER (OR 0 FOR KEY)                   
FSRKPKEY EQU   X'00'               MAINTENANCE KEY SCREEN                       
FSRKPREP EQU   X'FD'               REPORT SCREEN                                
FSRKPDWN EQU   X'FE'               DOWNLOAD SCREEN                              
FSRKPLST EQU   X'FF'               TOP OF LIST SCREEN                           
         DS    XL21                N/D                                          
FSRKCTRY DS    XL1                 COUNTRY CODE (XC'D X'FF')                    
FSRKSUB  DS    XL1                 IN CASE OF OVERFLOW                          
FSRKTEST DS    XL1                 TEST PHASE                                   
*                                                                               
*                                  ** DIRECTORY VALUES **                       
FSRKSTAT DS    XL1                 STATUS                                       
FSRKCTL  DS    XL3                 CONTROL                                      
FSRKDA   DS    XL4                 DISK ADDRESS                                 
FSRKLEN  EQU   *-FSRRECD           DIRECTORY REC LENGTH                         
         ORG   FSRKSTAT                                                         
*                                  ** FILE VALUES **                            
FSRFLEN  DS    XL2                 RECORD LENGTH                                
FSRFSTAT DS    XL1                 STATUS                                       
FSRFCTL  DS    XL3                 CONTROL                                      
FSRFSYS  DS    XL4                 SYSTEM LINKAGE AREA                          
FSRFIRST EQU   *-FSRRECD           FIRST ELEMENT                                
         SPACE 1                                                                
***********************************************************************         
* RECORD RECORD KEY                                                   *         
***********************************************************************         
         SPACE 1                                                                
FRRRECD  DSECT                                                                  
FRRKEY   DS    0XL32               RECORD RECORD                                
FRRKMAJ  DS    XL1                 MAJOR SYSTEM (ZERO)                          
FRRKMIN  DS    XL1                 MINOR SYSTEM (ZERO)                          
FRRKMINQ EQU   C'X'                NEW FILE CONTROL RECORDS                     
FRRKTYP  DS    XL1                 TYPE                                         
FRRKTYPQ EQU   C'R'                RECORD RECORDS                               
FRRKSYS  DS    XL1                 SYSTEM                                       
FRRKPRG  DS    XL1                 PROGRAM                                      
FRRKREC  DS    XL1                 RECORD                                       
         DS    XL23                N/D                                          
FRRKCTRY DS    XL1                 COUNTRY FILTER (XI'D FF)                     
FRRKSUB  DS    XL1                 SUB-COUNTRY FILTER (XI'D FF)                 
FRRKTEST DS    XL1                 TEST PHASE                                   
*                                                                               
*                                  ** DIRECTORY VALUES **                       
FRRKSTAT DS    XL1                 STATUS                                       
FRRKLVAL EQU   X'07'               BYTES FOR LENGTH VALIDATION                  
FRRKCTL  DS    XL3                 CONTROL                                      
         ORG   FRRKCTL                                                          
FRRKDICT DS    XL2                 (FRRDICT)                                    
FRRKIND1 DS    XL1                 (FRRINDS1)                                   
FRRKDA   DS    XL4                 DISK ADDRESS                                 
FRRKLEN  EQU   *-FRRRECD           DIRECTORY REC LENGTH                         
         ORG   FRRKSTAT                                                         
*                                  ** FILE VALUES **                            
FRRFLEN  DS    XL2                 RECORD LENGTH                                
FRRFSTAT DS    XL1                 STATUS                                       
FRRFCTL  DS    XL3                 CONTROL                                      
FRRFSYS  DS    XL4                 SYSTEM LINKAGE AREA                          
FRRFIRST EQU   *-FRRRECD           FIRST ELEMENT                                
         SPACE 1                                                                
***********************************************************************         
* ACTION RECORD KEY                                                   *         
***********************************************************************         
         SPACE 1                                                                
FRARECD  DSECT                                                                  
FRAKEY   DS    0XL32               ACTION RECORD                                
FRAKMAJ  DS    XL1                 MAJOR SYSTEM (ZERO)                          
FRAKMIN  DS    XL1                 MINOR SYSTEM (ZERO)                          
FRAKMINQ EQU   C'X'                NEW FILE CONTROL RECORDS                     
FRAKTYP  DS    XL1                 TYPE                                         
FRAKTYPQ EQU   C'A'                ACTION RECORDS                               
FRAKSYS  DS    XL1                 SYSTEM                                       
FRAKPRG  DS    XL1                 PROGRAM                                      
FRAKREC  DS    XL1                 RECORD                                       
FRAKACT  DS    XL1                 ACTION                                       
         DS    XL22                N/D                                          
FRAKCTRY DS    XL1                 COUNTRY FILTER (XI'D FF)                     
FRAKSUB  DS    XL1                 SUB-COUNTRY FILTER (XI'D FF)                 
FRAKTEST DS    XL1                 TEST PHASE                                   
*                                                                               
*                                  ** DIRECTORY VALUES **                       
FRAKSTAT DS    XL1                 STATUS                                       
FRAKLVAL EQU   X'07'               BYTES FOR LENGTH VALIDATION                  
FRAKSVAL EQU   X'38'               BYTES FOR SUB-ACT LENGTH VALIDATION          
FRAKCTL  DS    XL3                 CONTROL                                      
         ORG   FRAKCTL                                                          
FRAKDICT DS    XL2                 (FRRDICT)                                    
FRAKIND1 DS    XL1                 (FRRINDS1)                                   
FRAKDA   DS    XL4                 DISK ADDRESS                                 
FRAKLEN  EQU   *-FRARECD           DIRECTORY REC LENGTH                         
         ORG   FRAKSTAT                                                         
*                                  ** FILE VALUES **                            
FRAFLEN  DS    XL2                 RECORD LENGTH                                
FRAFSTAT DS    XL1                 STATUS                                       
FRAFCTL  DS    XL3                 CONTROL                                      
FRAFSYS  DS    XL4                 SYSTEM LINKAGE AREA                          
FRAFIRST EQU   *-FRARECD           FIRST ELEMENT                                
         SPACE 1                                                                
***********************************************************************         
* PFKEY RECORD KEY                                                    *         
***********************************************************************         
         SPACE 1                                                                
FRPRECD  DSECT                                                                  
FRPKEY   DS    0XL32               ACTION RECORD                                
FRPKMAJ  DS    XL1                 MAJOR SYSTEM (ZERO)                          
FRPKMIN  DS    XL1                 MINOR SYSTEM (ZERO)                          
FRPKMINQ EQU   C'X'                NEW FILE CONTROL RECORDS                     
FRPKTYP  DS    XL1                 TYPE                                         
FRPKTYPQ EQU   C'P'                PFKEY RECORDS                                
FRPKSYS  DS    XL1                 SYSTEM                                       
FRPKPRG  DS    XL1                 PROGRAM                                      
FRPKREC  DS    XL1                 RECORD                                       
FRPKACT  DS    XL1                 ACTION                                       
FRPKPFK  DS    XL1                 PFKEY NUMBER                                 
         DS    XL21                N/D                                          
FRPKCTRY DS    XL1                 COUNTRY FILTER (XI'D FF)                     
FRPKSUB  DS    XL1                 SUB-COUNTRY FILTER (XI'D FF)                 
FRPKTEST DS    XL1                 TEST PHASE                                   
*                                                                               
*                                  ** DIRECTORY VALUES **                       
FRPKSTAT DS    XL1                 STATUS                                       
FRPKCTL  DS    XL3                 CONTROL                                      
         ORG   FRPKCTL                                                          
FRPKDICT DS    XL2                                                              
FRPKIND1 DS    XL1                                                              
FRPKDA   DS    XL4                 DISK ADDRESS                                 
FRPKLEN  EQU   *-FRPRECD           DIRECTORY REC LENGTH                         
         ORG   FRPKSTAT                                                         
*                                  ** FILE VALUES **                            
FRPFLEN  DS    XL2                 RECORD LENGTH                                
FRPFSTAT DS    XL1                 STATUS                                       
FRPFCTL  DS    XL3                 CONTROL                                      
FRPFSYS  DS    XL4                 SYSTEM LINKAGE AREA                          
FRPFIRST EQU   *-FRPRECD           FIRST ELEMENT                                
         SPACE 1                                                                
***********************************************************************         
* COLUMN RECORD KEY                                                   *         
***********************************************************************         
         SPACE 1                                                                
FCRRECD  DSECT                                                                  
FCRKEY   DS    0XL32               FIELD LIST RECORD                            
FCRKMAJ  DS    XL1                 MAJOR SYSTEM (ZERO)                          
FCRKMIN  DS    XL1                 MINOR SYSTEM (ZERO)                          
FCRKMINQ EQU   C'X'                                                             
FCRKTYP  DS    XL1                 TYPE                                         
FCRKTYPQ EQU   C'X'                FIELD COLUMN RECORDS (C WAS USED)            
         DS    XL8                                                              
FCRKSYS  DS    XL1                 SYSTEM                                       
FCRKPRG  DS    XL1                 PROGRAM                                      
FCRKREC  DS    XL1                 RECORD                                       
         DS    XL1                 N/D                                          
FCRKTYPE DS    XL1                 INTERNAL TYPE CODE                           
FCRKPAGE DS    XL1                 LIST PAGE NUMBER (0 = LIST ACT LIST)         
FCRKPLST EQU   0                   LIST TYPE PAGE                               
FCRKCTRY DS    XL1                 COUNTRY CODE                                 
FCRKACT  DS    XL1                 ACTION (IF IN MAINTENANCE LIST)              
FCRKSREC DS    XL1                 SUB-RECORD (PREVIOUS RECORD)                 
         DS    XL2                 N/D                                          
FCRKAGY  DS    XL2                 AGENCY                                       
         DS    XL2                 N/D                                          
FCRKPER  DS    XL2                 PERSON ID                                    
         ORG   FCRKEY+L'FCRKEY                                                  
*                                  ** DIRECTORY VALUES **                       
FCRKSTAT DS    XL1                 STATUS                                       
FCRKCTL  DS    XL3                 CONTROL                                      
FCRKDA   DS    XL4                 DISK ADDRESS                                 
FCRKLEN  EQU   *-FCRRECD           DIRECTORY REC LENGTH                         
         ORG   FCRKSTAT                                                         
*                                  ** FILE VALUES **                            
FCRFLEN  DS    XL2                 RECORD LENGTH                                
FCRFSTAT DS    XL1                 STATUS                                       
FCRFCTL  DS    XL3                 CONTROL                                      
FCRFSYS  DS    XL4                 SYSTEM LINKAGE AREA                          
FCRFIRST EQU   *-FCRRECD           FIRST ELEMENT                                
         SPACE 1                                                                
***********************************************************************         
* DOWNLOAD RECORD KEY                                                 *         
***********************************************************************         
         SPACE 1                                                                
FDLRECD  DSECT                                                                  
FDLKEY   DS    0XL32               FIELD LIST RECORD                            
FDLKMAJ  DS    XL1                 MAJOR SYSTEM (ZERO)                          
FDLKMIN  DS    XL1                 MINOR SYSTEM (ZERO)                          
FDLKMINQ EQU   C'X'                                                             
FDLKTYP  DS    XL1                 TYPE                                         
FDLKTYPQ EQU   C'D'                FIELD COLUMN RECORDS (C WAS USED)            
FDLKSYS  DS    XL1                 SYSTEM                                       
FDLKPRG  DS    XL1                 PROGRAM                                      
FDLKREC  DS    XL1                 RECORD                                       
FDLKAGY  DS    XL2                 AGENCY                                       
         DS    XL2                                                              
FDLKCODE DS    XL8                 IDENTIFIER                                   
         ORG   FDLKEY+L'FDLKEY                                                  
*                                  ** DIRECTORY VALUES **                       
FDLKSTAT DS    XL1                 STATUS                                       
FDLKCTL  DS    XL3                 CONTROL                                      
FDLKDA   DS    XL4                 DISK ADDRESS                                 
FDLKLEN  EQU   *-FDLRECD           DIRECTORY REC LENGTH                         
         ORG   FDLKSTAT                                                         
*                                  ** FILE VALUES **                            
FDLFLEN  DS    XL2                 RECORD LENGTH                                
FDLFSTAT DS    XL1                 STATUS                                       
FDLFCTL  DS    XL3                 CONTROL                                      
FDLFSYS  DS    XL4                 SYSTEM LINKAGE AREA                          
FDLFIRST EQU   *-FDLRECD           FIRST ELEMENT                                
         SPACE 1                                                                
