*          DATA SET GEGENFED   AT LEVEL 021 AS OF 12/19/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TFD8FED      DATE 12/19/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
PGMNAMEH DS    CL8                                                              
PGMNAME  DS    CL8      5   10    8  A   U    N         T    I   N              
PGMNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
PGMFILTH DS    CL8                                                              
PGMFILT  DS    CL27     5   28   27  A   U    N         T        Y              
PGMFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    N         T        Y              
PGMOPTSH DS    CL8                                                              
PGMOPTS  DS    CL16     5   64   16  A   U    N         T        Y              
PGMOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL29     7    2   29  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL9      7   56    9  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      7   68    8  A   P    H         T        Y              
PGMSELH  DS    CL8                                                              
PGMSEL   DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     8    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    23    6   74  A   P    N         T        Y              
PGMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PGMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
