*          DATA SET GEGENWORK  AT LEVEL 195 AS OF 05/25/00                      
***********************************************************************         
* GLOBAL EQUATES                                                      *         
***********************************************************************         
         SPACE 1                                                                
EOT      EQU   0                   END-OF-TABLE INDICATOR                       
RECNAMLQ EQU   8                                                                
ACTNAMLQ EQU   8                                                                
PFKSCRLQ EQU   8                                                                
         SPACE 1                                                                
***********************************************************************         
* PROGRAM FUNCTION KEY EQUATES                                        *         
***********************************************************************         
         SPACE 1                                                                
PFK01    EQU   01                                                               
PFK02    EQU   02                                                               
PFK03    EQU   03                                                               
PFK04    EQU   04                                                               
PFK05    EQU   05                                                               
PFK06    EQU   06                                                               
PFK07    EQU   07                                                               
PFK08    EQU   08                                                               
PFK09    EQU   09                                                               
PFK10    EQU   10                                                               
PFK11    EQU   11                                                               
PFK12    EQU   12                                                               
PFK13    EQU   13                                                               
PFK14    EQU   14                                                               
PFK15    EQU   15                                                               
PFK16    EQU   16                                                               
PFK17    EQU   17                                                               
PFK18    EQU   18                                                               
PFK19    EQU   19                                                               
PFK20    EQU   20                                                               
PFK21    EQU   21                                                               
PFK22    EQU   22                                                               
PFK23    EQU   23                                                               
PFK24    EQU   24                                                               
         SPACE 2                                                                
***********************************************************************         
* I/O CONTROLLER COMMAND TABLE DSECT                                  *         
***********************************************************************         
         SPACE 1                                                                
CMDTABD  DSECT                                                                  
CMDNAME  DS    CL7                 COMMAND NAME                                 
CMDNUMB  DS    XL1                 COMMAND NUMBER (SEE IOCMNDS)                 
CMDINDS  DS    XL1                 COMMAND INDICATORS - 1                       
CMDIDARQ EQU   X'80'               DISK ADDRESS REQUIRED FOR I/O                
CMDIDAXC EQU   X'40'               CLEAR DISK ADDRESS BEFORE I/O                
CMDIDADD EQU   X'20'               DISK ADDRESS RETURNED FROM I/O               
CMDINDS2 DS    XL1                 COMMAND INDICATORS - 2                       
CMDTABL  EQU   *-CMDTABD                                                        
         EJECT                                                                  
***********************************************************************         
* SYSTEM SWITCH TABLE (LOCATED AT ASSWTAB)                            *         
***********************************************************************         
         SPACE 1                                                                
SYSSWTAB DSECT                     ** SYSTEM SWITCH TABLE **                    
SYSSWSYS DS    XL1                 SE NUMBER                                    
SYSSWSOV DS    XL1                 SYSTEM CALLOV NUMBER                         
SYSSWAGB DS    XL1                 AGENCY BINARY VALUE                          
SYSSWACS DS    XL4                 LIMIT ACCESS VALUE 1                         
SYSSWAC2 DS    XL4                 LIMIT ACCESS VALUE 2                         
SYSSINDS DS    XL1                 INDICATORS                                   
SYSSIOPN EQU   X'80'               OFFLINE - SYSTEM IS ALREADY OPEN             
SYSSWLEN EQU   *-SYSSWTAB                                                       
SYSSWMAX EQU   12                  MAXIMUM NUMBER OF ENTRIES IN TABLE           
         EJECT                                                                  
WORKD    DSECT                     ** GLOBAL WORKING STORAGE **                 
***********************************************************************         
* OVERLAY PROGRAM WORK AREA                                           *         
***********************************************************************         
         SPACE 1                                                                
BOWS     DS    0X                                                               
BODUB1   DS    D                                                                
BODUB2   DS    D                                                                
BODUB3   DS    D                                                                
BODUB4   DS    D                                                                
BOPARM   DS    6F                                                               
BODMCB   DS    6F                                                               
BOFULL1  DS    F                                                                
BOFULL2  DS    F                                                                
BOHALF1  DS    H                                                                
BOHALF2  DS    H                                                                
BOBYTE1  DS    XL1                                                              
BOBYTE2  DS    XL1                                                              
BOFLAG1  DS    XL1                                                              
BOFLAG2  DS    XL1                                                              
BOWORK1  DS    XL80                                                             
BOWORK2  DS    XL80                                                             
BOELEM   DS    XL256                                                            
BONTRYA  DS    A                   APPLICATION ENTRY POINT                      
BOALOCAL DS    A                   A(APPLICATION LOCAL W/S) APLOCAL             
BOWORKA  DS    A                   APPLICATION RD VALUE                         
BORELO   DS    A                   APPLICATION RELOCATION                       
BOBASE1  DS    A                   APPLICATION BASE REG1                        
BOBASE2  DS    A                   APPLICATION BASE REG2                        
BOBASE3  DS    A                   APPLICATION BASE REG3                        
BOCURSOR DS    A                   A(OUTPUT FIELD TO CONTAIN CURSOR)            
BOADDR1  DS    A                   ADDRESS FOR OVERLAY USE - 1                  
BOADDR2  DS    A                   ADDRESS FOR OVERLAY USE - 2                  
BOSVALS2 DS    A                   A(OSVALS2 IN TWA)                            
BORELOF  DS    A                   RELO FACTOR FOR FACILITIES USE               
BOACTN   DS    XL1                 ACTION NUMBER                                
BOMODE   DS    XL1                 APPLICATION MODE                             
BOINDS1  DS    XL1                 ** APPLICATION INDICATORS BYTE 1 **          
BOIREDIS EQU   X'80'               RE-DISPLAY FIELD AFTER VALIDATED             
BOIINFLD EQU   X'40'               FIELD IS INPUT FIELD                         
BOIUPSEL EQU   X'20'               SELECTED RECORDS TO BE UPDATED               
BOINAMCH EQU   X'10'               NAME FIELD HAS CHANGED                       
BOISUBNO EQU   X'08'               SUB-ACTION MEANING 'NO' INPUT                
BOINDS2  DS    XL1                 ** APPLICATION INDICATORS BYTE 2 **          
BOPL61   DS    PL6                                                              
BOPL62   DS    PL6                                                              
BOPL81   DS    PL8                                                              
BOPL82   DS    PL8                                                              
BOWSX    DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* APPLICATION SYSTEM VARIABLES                                        *         
***********************************************************************         
         SPACE 1                                                                
ASWS     DS    0F                                                               
ASONOFF  DS    XL1                 SYSTEM MODE                                  
ASON     EQU   0                   APPLICATION RUNNING ONLINE                   
ASOFF    EQU   1                   APPLICATION RUNNING OFFLINE                  
ASSYSN   DS    XL1                 DATAMGR SYSTEM NUMBER                        
ASSYSO   DS    XL1                 NATIVE SYSTEM NUMBER FOR CALLOV              
ASEDAT   DS    CL8                 SYSTEM DATE (MM/DD/YY OR DD/MM/YY)           
ASBDAT   DS    XL3                 SYSTEM DATE (BINARY YMD)                     
ASPDAT   DS    PL3                 SYSTEM DATE (PWOS YMD)                       
ASCDAT   DS    XL2                 SYSTEM DATE (COMPRESSED)                     
ASBMOS   DS    CL2                 BATCH MONTH OF SERVICE                       
ASTIME   DS    XL4                 SYSTEM TIME (STANDARD FORMAT)                
ASSIN    DS    XL4                 SYSTEM INPUT NUMBER                          
ASIOASTR DS    AL4                 A(START OF SYSTEM EXTRA AREA)                
ASIOALEN DS    XL4                 LENGTH OF SYSTEM EXTRA AREA                  
ASTEST   DS    XL1                 TEST PHASE USED 0/A/B/C                      
         DS    XL15                N/D                                          
ASWSX    DS    0X                                                               
         SPACE 2                                                                
***********************************************************************         
* CONNECTED USER VARIABLES                                            *         
***********************************************************************         
         SPACE 1                                                                
CUWS     DS    0X                                                               
CUABIN   DS    XL1                 AGENCY BINARY VALUE                          
CUAALF   DS    CL2                 AGENCY ALPHA VALUE                           
CUTSYM   DS    CL8                 TERMINAL SYMBOLIC ID                         
CUUSER   DS    XL2                 USER-ID NUMBER                               
CUAUTH   DS    XL2                 AUTHORISATION VALUE                          
CUACCS   DS    CL4                 LIMIT ACCESS VALUE                           
CUSTAT   DS    XL1                 TERMINAL STATUS INDICATORS                   
CUSDDS   EQU   X'80'               USER CONNECTED WITH A DDS TERMINAL           
CUSTRM   EQU   X'40'               CUPASS IS TERMINAL PASSWORD                  
CUSPER   EQU   X'20'               CUPASS IS PERSONAL PASSWORD NUMBER           
CUPASS   DS    XL2                 TERMINAL OR PERSONAL PASSWORD NUMBER         
CUCTRY   DS    XL1                 COUNTRY CODE                                 
CULANG   DS    XL1                 LANGUAGE CODE                                
CUTERM   DS    XL2                 TERMINAL NUMBER                              
CUASEC   DS    CL2                 AGENCY ALPHA VALUE FOR SECURITY              
         DS    XL12                N/D                                          
CUWSX    DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* FIELD VALIDATION & ERROR HANDLING VARIABLES                         *         
***********************************************************************         
         SPACE 1                                                                
FVWS     DS    0F                                                               
FVADDR   DS    A                   A(INPUT FIELD HEADER) SET BY FVAL            
FVSAVE   DS    AL2                 DISP TO SAVED INPUT FOR HELP                 
FVFIELD  DS    XL1                 TYPE OF FIELD BEING VALIDATED                
FVFREC   EQU   1                   RECORD FIELD HELP                            
FVFACT   EQU   2                   ACTION FIELD HELP                            
FVFOPT   EQU   3                   OPTION FIELD HELP                            
FVFSEL   EQU   4                   SELECT FIELD HELP                            
FVINDS   DS    XL1                 FIELD INDICATORS                             
FVIHELP  EQU   X'80'               HELP REQUESTED FOR FIELD                     
FVFLAG   DS    XL1                 FLAG BYTE USED BY FVAL ROUTINE               
FVMINL   DS    XL1                 MINIMUM INPUT LENGTH (ZERO=OPTIONAL)         
FVMAXL   DS    XL1                 MAXIMUM INPUT LENGTH (ZERO=MAXIMUM)          
FVOSYS   DS    XL1                 OVERRIDE SYSTEM FOR GETTXT CALLS             
FVOMTYP  DS    XL1                 OVERRIDE MESSAGE TYPE FOR GETTXT             
FVMSGNO  DS    XL2                 MESSAGE NUMBER                               
FVINDX   DS    XL1                 MULTIPLE FIELD INDEX NUMBER                  
FVSUBX   DS    XL1                 MULTIPLE FIELD SUB-INDEX NUMBER              
FVCURS   DS    XL1                 DISPLACEMENT TO CURSOR WITHIN FIELD          
FVERRIND DS    XL1                 ERROR INDICATOR                              
FVEUNWND EQU   X'80'               UNWIND THE TRANSACTION WITH $ABEND           
FVXTRA   DS    CL16                TACKED ON TO ERROR MESSAGE IF ROOM           
FVPARMS  DS    XL32                MESSAGE SUBSTITUTION PARAMETERS              
FVERRNDX DS    XL1                 ERROR INDEX VALUE                            
FVCURIND DS    XL1                 CURSOR INDICATOR                             
FVCKEEP  EQU   X'80'               KEEP CURSOR WHERE IT WAS BEFORE              
         DS    XL7                 N/D                                          
FVIXHDR  DS    0XL8                ** EXTENDED FIELD HEADER **                  
FVIXNU   DS    XL1                 REFERENCE NUMBER                             
FVIXHE   DS    XL2                 DYNAMIC HELP INFO                            
         DS    XL1                                                              
FVIXSC   DS    XL1                 SCREEN NUMBER                                
FVIXXA   DS    XL1                 EXTENDED ATTRIBUTE                           
FVIXUS   DS    0XL2                APPLICATION DEFINED                          
FVIXUS1  DS    X                                                                
FVX1PRO  EQU   X'80'                                                            
FVIXUS2  DS    X                                                                
FVIHDR   DS    0XL8                ** EXTRACTED INPUT FIELD HEADER **           
FVTLEN   DS    XL1                 L'FIELD HEADER+L'FIELD                       
FVATRB   DS    XL1                 FIELD ATTRIBUTE                              
FVADDTB  EQU   X'80'               DON'T DELETE TRAILING BLANKS                 
FVAPROT  EQU   X'20'               PROTECTED FIELD                              
FVAHIGH  EQU   X'08'               HIGH INTENSITY                               
FVAZERO  EQU   X'0C'               ZERO INTENSITY                               
FVAXTND  EQU   X'02'               EXTENDED HEADER                              
FVAMODF  EQU   X'01'               MODIFIED INPUT FIELD                         
FVABSA   DS    XL2                 SCREEN ABSOLUTE ADDRESS                      
FVIIND   DS    XL1                 INPUT VALIDATION INDICATORS                  
FVITHIS  EQU   X'80'               FIELD INPUT THIS TIME                        
FVILAST  EQU   X'40'               FIELD HAS BEEN INPUT PREVIOUSLY              
FVIVAL   EQU   X'20'               FIELD HAS BEEN VALIDATED PREVIOUSLY          
FVIINV   EQU   X'10'               FIELD IS INVALID                             
FVINUM   EQU   X'08'               FIELD IS VALID NUMERIC                       
FVIALF   EQU   X'04'               FIELD IS VALID ALPHA                         
FVIHEX   EQU   X'02'               FIELD IS VALID HEXADECIMAL                   
FVILEN   DS    XL1                 ACTUAL INPUT DATA LENGTH                     
FVOIND   DS    XL1                 OUTPUT INDICATORS                            
FVOXMT   EQU   X'80'               TRANSMIT FIELD                               
FVOCUR   EQU   X'40'               INSERT CURSOR TO FIELD                       
FVXLEN   DS    XL1                 ACTUAL INPUT DATA LENGTH-1                   
FVIFLD   DS    CL80                EXTRACTED & SPACE FILLED INPUT FIELD         
FVWSX    DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* STANDARD ERROR EQUATES  - X'FF00' IDENTIFIES CONTROLLER MSG         *         
***********************************************************************         
         SPACE 1                                                                
FVFIOER  EQU   0                   I/O ERROR HAS OCCURED                        
FVFNONE  EQU   200+X'FF00'         NO DATA INPUT                                
FVFSHRT  EQU   201+X'FF00'         NOT ENOUGH DATA INPUT                        
FVFLONG  EQU   202+X'FF00'         TOO MUCH DATA INPUT                          
FVFNOTV  EQU   203+X'FF00'         INVALID INPUT FIELD                          
FVFNOTN  EQU   204+X'FF00'         INPUT NOT NUMERIC                            
FVFMIXI  EQU   205+X'FF00'         RECORD/ACTION COMBO INVALID                  
FVFKINV  EQU   206+X'FF00'         INVALID OPTION KEYWORD                       
FVFIGLE  EQU   207+X'FF00'         INVALID DATA QUALIFIER                       
FVFKDUP  EQU   208+X'FF00'         DUPLICATED OPTION KEYWORD                    
FVFDINV  EQU   209+X'FF00'         INVALID OPTION DATA VALUE                    
FVFREQD  EQU   210+X'FF00'         REQUIRED OPTION IS MISSING                   
FVFEKEY  EQU   211+X'FF00'         ENTER KEY                                    
FVFIASQ  EQU   212+X'FF00'         INVALID ACTION SEQUENCE                      
FVFERNF  EQU   213+X'FF00'         RECORD NOT ON FILE                           
FVFERAE  EQU   214+X'FF00'         RECORD ALREADY ON FILE                       
FVFRDEL  EQU   215+X'FF00'         RECORD IS DELETED                            
FVFXDEL  EQU   216+X'FF00'         CAN'T DELETE RECORD                          
FVFXCHA  EQU   217+X'FF00'         CAN'T CHANGE RECORD                          
FVFXRES  EQU   218+X'FF00'         CAN'T RESTORE RECORD                         
FVFCCDR  EQU   219+X'FF00'         CAN'T CHANGE A DELETED RECORD                
FVFSKHC  EQU   220+X'FF00'         SELECTED RECORD KEY HAS CHANGED              
FVFESEL  EQU   221+X'FF00'         INVALID SELECTION CODE                       
FVFEWHN  EQU   222+X'FF00'         INVALID WHEN                                 
FVFEOUT  EQU   223+X'FF00'         INVALID OUTPUT TYPE                          
FVFEDST  EQU   224+X'FF00'         INVALID DESTINATION                          
FVFTFUL  EQU   225+X'FF00'         TERMINAL QUEUE FULL                          
FVFQFUL  EQU   226+X'FF00'         PRINT QUEUE FULL                             
FVFEJCL  EQU   227+X'FF00'         JCL BOOK NOT FOUND                           
FVFEOLY  EQU   228+X'FF00'         CAN'T LOAD OVERLAY PHASE                     
FVFEKEYD EQU   229+X'FF00'         ENTER KEY & DATA                             
FVFELANG EQU   230+X'FF00'         INVALID LANGUAGE CODE                        
FVFESYS  EQU   231+X'FF00'         INVALID SYSTEM                               
FVFEPGM  EQU   232+X'FF00'         INVALID PROGRAM                              
FVFINVDT EQU   233+X'FF00'         INVALID DATE                                 
FVFCRDR  EQU   234+X'FF00'         CAN'T COPY/RENAME A DELETED RECORD           
FVFENEW  EQU   235+X'FF00'         ENTER NEW KEY                                
FVFESEL2 EQU   236+X'FF00'         SELECT CODE NOT VALID FOR RECORD             
FVFDUPE  EQU   237+X'FF00'         DUPLICATED INPUT FIELD                       
FVFTOOM  EQU   238+X'FF00'         TOO MANY INPUT FIELDS                        
FVFISYS  EQU   239+X'FF00'         INCOMPATIBLE SYSTEM SPECIFICATION            
*                                                                               
FVFGTSET EQU   253+X'FF00'         GETTXT BLOCK BUILT BY APP IN APPARM          
FVFSET   EQU   254                 MESSAGE BUILT BY APPLICATION                 
FVFOK    EQU   255                 FIELD IS VALID                               
         EJECT                                                                  
***********************************************************************         
* I/O CONTROLLER WORK AREA                                            *         
***********************************************************************         
         SPACE 1                                                                
IOWS     DS    0X                                                               
IOADDR   DS    A                   I/O AREA ADDRESS                             
IOFILE   DS    CL7                 FILE NAME                                    
IOCMND   DS    CL7                 DATAMGR COMMAND                              
IOFLAG   DS    XL1                 FLAG BYTE USED BY IO ROUTINE                 
IOFSWTCH EQU   X'80'               SYSTEM SWITCH OCCURRED FOR I/O               
IOERR    DS    XL1                 I/O ERROR RETURN BYTE                        
IOEEOF   EQU   X'80'               END-OF-FILE                                  
IOEDSK   EQU   X'40'               NON-RECOVERABLE DISK ERROR                   
IOEDUP   EQU   X'20'               DUPLICATE KEY ON ADD                         
IOERNF   EQU   X'10'               RECORD NOT FOUND                             
IOEDEL   EQU   X'02'               RECORD IS DELETED                            
IOESWS   EQU   X'FF'               SYSTEM SWITCH ERROR OCCURRED                 
IOERRS   EQU   X'FF'               RESERVED FOR CONTROLLER USE                  
IOKEY    DS    XL64                ACTUAL KEY VALUE                             
IOKEYSAV DS    XL64                SAVED ACTUAL KEY VALUE (BEFORE I/O)          
IODA     DS    XL4                 DISK ADDRESS OF D/A RECORD                   
IOWORK   DS    XL44                D/A LINKED FILES WORK AREA                   
IOINDS1  DS    XL1                 INDICATOR BYTE 1                             
IO1XSWCH EQU   X'80'               DO NOT SWITCH BACK AFTER I/O                 
IOINDS2  DS    XL1                 INDICATOR BYTE 2                             
IODAOVER DS    XL4                 OVERRIDE D/A (ALWAYS USED AND XC'D)          
         DS    XL8                 N/D                                          
IOWSX    DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* SYSTEM VARIABLES                                                    *         
***********************************************************************         
         SPACE 1                                                                
SYSVARS  DS    XL162                                                            
         EJECT                                                                  
***********************************************************************         
* ADDRESS DIRECTORY                                                   *         
***********************************************************************         
         SPACE 1                                                                
AFAC     DS    0A                  ** ADDRESSES PASSED FROM FACPAK **           
AINP     DS    A                   A(TRANSLATOR I/O BLOCK)                      
ATWA     DS    A                   A(TERMINAL WORK AREA)                        
ATIA     DS    A                   A(TERMINAL INPUT AREA)                       
ASYS     DS    A                   A(SYSTEM FACILITY LIST)                      
ACOM     DS    A                   A(COMMON FACILITY LIST)                      
ASYSLST  DS    A                   A(GETFACT SYSTEM LIST)                       
         DS    3A                  N/D                                          
ASYSFAC  DS    A                   A(SYSFACS)                                   
         SPACE 1                                                                
AENTRIES DS    0A                  ** ADDRESSES OF TABLE ENTRIES **             
AFILNTRY DS    A                   A(FILE NAMES TABLE ENTRY)                    
ATABLES  DS    7A                                                               
         SPACE 1                                                                
COMFACS  DS    0F                  ** COMMON FACILITIES **                      
VDMGR    DS    V                                                                
VCOLY    DS    V                                                                
VGETMSG  DS    V                                                                
VGETTXT  DS    V                                                                
VHELLO   DS    V                                                                
VSCANNER DS    V                                                                
VUNSCAN  DS    V                                                                
VHEXIN   DS    V                                                                
VHEXOUT  DS    V                                                                
VCASHVAL DS    V                                                                
VDATVAL  DS    V                                                                
VDATCON  DS    V                                                                
VSCUNKEY DS    V                                                                
VADDAY   DS    V                                                                
VPERVERT DS    V                                                                
VGETFACT DS    V                                                                
VGETDAY  DS    V                                                                
VPERVAL  DS    V                                                                
VMINIO   DS    V                                                                
VPARSNIP DS    V                                                                
VSWITCH  DS    V                                                                
CUREDIT  DS    V                                                                
VDICTAT  DS    V                                                                
VGETPROF DS    V                                                                
VEDITOR  DS    V                                                                
VSECRET  DS    V                                                                
VGETHELP DS    V                                                                
VCONVERT DS    V                                                                
VPRORATA DS    V                                                                
VGETCUR  DS    V                                                                
VBLDCUR  DS    V                                                                
         DS    2V                  N/D                                          
COMFACN  EQU   (*-COMFACS)/L'COMFACS                                            
*                                                                               
AADDRESS DS    11A                 CONTROLLER DEPENDANT ADDRESSES               
AADDRS2  DS    0A                                                               
         DS    6A                  CONTROLLER DEPENDANT ADDRESSES               
ADICUPR  DS    A                   UPPERCASE DICTIONARY                         
ADICMIX  DS    A                   MIXED CASE DICTIONARY                        
         DS    7A                                                               
ADDRS2N  EQU   (*-AADDRS2)/L'AADDRS2                                            
*                                                                               
ADDRCDA  DS    100A                CONTROLLER DEPENDANT ADDRESSES               
*                                                                               
APHASES  DS    0A                                                               
         DS    3A                  CONTROLLER DEPENDANT ADDRESSES               
VREPORT  DS    V                                                                
VREQTWA  DS    V                                                                
         DS    10A                 CONTROLLER DEPENDANT ADDRESSES               
VGETIDS  DS    V                                                                
         DS    3A                                                               
         SPACE 1                                                                
*                                  ** MISCELLANEOUS ADDRESSES **                
AREP     DS    A                   A(REPORT MONITOR W/S)                        
ACTRY    DS    A                   A(COUNTRY TABLE)                             
ALANG    DS    A                   A(LANGUAGE TABLE)                            
AOVERLAY DS    A                   A(OVERLAY PHASE)                             
AOVERWRK DS    A                   A(OVERLAY WORKING STORAGE)                   
         DS    4A                                                               
         SPACE 1                                                                
*                                  ** ADDRESSES OF I/O AREAS **                 
AIO1     DS    A                   A(I/O AREA 1)                                
AIO2     DS    A                   A(I/O AREA 2)                                
AIO3     DS    A                   A(I/O AREA 3)                                
AIO4     DS    A                   A(I/O AREA 4)                                
AIO5     DS    A                   A(I/O AREA 5)                                
AIO6     DS    A                   A(I/O AREA 6)                                
AIO7     DS    A                   A(I/O AREA 7)                                
AIO8     DS    A                   A(I/O AREA 8)                                
AIO9     DS    A                   A(I/O AREA 9)                                
AIOA     DS    A                   A(I/O AREA 10)                               
AIOREC   DS    A                   A(CONTROLLER I/O AREA)                       
         SPACE 1                                                                
ABLOCKS  DS    0A                  ** A(WORKING-STORAGE BLOCKS) **              
ASECBLK  DS    A                   A(SECURITY ACCESS BLOCK)                     
ASWSTAB  DS    A                   A(SYSTEM SWITCH TABLE)                       
         DS    9A                  CONTROLLER SPECIFIC ADDRESSES                
ATSABLK  DS    A                   A(TSAR BLOCK)                                
         DS    A                   CONTROLLER SPECIFIC ADDRESS                  
AWORKX   DS    A                   A(END OF GENERAL W/S)                        
         DS    A                   CONTROLLER SPECIFIC ADDRESS                  
         EJECT                                                                  
***********************************************************************         
* BATCH CONTROLLER WORK AREA                                          *         
***********************************************************************         
         SPACE 2                                                                
BCWS     DS    0X                                                               
BCPARM   DS    6F                                                               
BCDMCB   DS    6F                                                               
BCDUB    DS    D                                                                
BCFULL   DS    F                                                                
BCHALF   DS    H                                                                
BCBYTE1  DS    X                                                                
BCBYTE2  DS    X                                                                
BCWORK   DS    XL64                                                             
BCSVRD   DS    A                   SAVED RD VALUE ON ENTRY                      
BCRELO   DS    A                   CONTROLLER RELOCATION                        
BCDSPOPT DS    XL2                 DISPLACEMENT TO OPTIONS FIELD                
BCDSPOVR DS    XL2                 DISPLACEMENT TO SCREEN LOAD POINT            
BCAUTL   DS    A                   A(UTL ENTRY)                                 
BCACUR   DS    A                   A(CURSOR AT TIME OF INPUT)                   
BCBASER1 DS    A                   CONTROLLER BASE REGISTER 1                   
BCBASER2 DS    A                   CONTROLLER BASE REGISTER 2                   
BCBASER3 DS    A                   CONTROLLER BASE REGISTER 3                   
BCBASER4 DS    A                   CONTROLLER BASE REGISTER 4                   
BCNTRYA  DS    A                   BATCH SUB-CONTROLLER ADDRESS                 
BCFLAG   DS    X                   CONTROLLER FLAG                              
BCPFKEY  DS    XL1                 PROGRAM FUNCTION KEY                         
BCPFXITS EQU   255                 XITSES PFKEY VALUE                           
BCINDS1  DS    XL1                 CONTROLLER INDICATORS - 1                    
BCIANYPF EQU   X'80'               USER PRESSED PF KEY THIS TIME                
BCINREC  EQU   X'40'               NEW RECORD INPUT THIS TIME                   
BCINACT  EQU   X'20'               NEW ACTION INPUT THIS TIME                   
BCIFRST  EQU   X'10'               ON=NOT FIRST TIME                            
BCIGRAB  EQU   X'08'               RESERVED FOR NEW FILE                        
BCINDS2  DS    XL1                 CONTROLLER INDICATORS - 2                    
BCINTRS  EQU   X'80'               NTRSES JUST ISSUED                           
BCIPFNTR EQU   X'40'               NTRSES TO BE ISSUED VIA PFKEY                
BCIACTCP EQU   X'20'               FILE MAINTENANCE ACTION COMPLETED            
BCIANYCH EQU   X'10'               AT LEAST ONE INPUT FIELD CHANGED             
BCIHLDLP EQU   X'08'               HOLD CURRENT LIST PAGE                       
BCIREBLS EQU   X'04'               RE-BUILD LIST SCREEN                         
BCISCH   EQU   X'02'               SEARCH FIELD SELECTED                        
BCSWSYSN DS    XL1                 NATIVE SYSTEM                                
BCSWSYSC DS    XL1                 CURRENT SWITCHED SYSTEM                      
BCSWSYSP DS    XL1                 PREVIOUS SWITCHED SYSTEM                     
BCSYSTEM DS    CL2                 C'US' OR C'UK'                               
BCCTRYAT DS    XL8                 COUNTRY GLOBAL ATTRIBUTES                    
BCEFFS   DS    CL8                 X'FFFFFFFFFFFFFFFF'                          
BCSPACES DS    CL132               CL132' '                                     
BCPZERO  DS    PL1                 P'0'                                         
BCHELPSO DS    XL1                 HELP SCREEN OVERLAY NUMBER                   
         DS    XL3                 N/D                                          
BCSCROLL DS    XL1                 SCROLL AMOUNT                                
BCDTADSP DS    H                   DISP. TO FIRST ELEMENT ON OLD FILE           
*                                                                               
BCCHARS  DS    0CL8                LANGUAGE DEPENDANT CHARACTERS                
BCCOMMA  DS    CL1                 COMMA                                        
BCEQUAL  DS    CL1                 EQUALS                                       
BCQUEST  DS    CL1                 QUESTION MARK                                
BCSLASH  DS    CL1                 SLASH                                        
BCHASH   DS    CL1                 HASH                                         
BCDECMAL DS    CL1                 DECIMAL POINT                                
         DS    CL2                 N/D                                          
*                                                                               
BCSYSPRG DS    0XL2                USED FOR MAINTENANCE CALLOV CALLS            
BCOVSYS  DS    XL1                 OVERLAY SYSTEM NUMBER                        
BCPRGNO  DS    XL1                 PROGRAM NUMBER                               
BCDSPREC DS    XL2                 DISPLACEMENT TO RECORD FIELD                 
BCDSPACT DS    XL2                 DISPLACEMENT TO ACTION FIELD                 
BCDSPSCR DS    XL2                 DISPLACEMENT TO SCROLL FIELD                 
BCDSPREP DS    XL2                 DISPLACEMENT TO REPORT-ID FIELD              
BCMIXLEN DS    XL1                 LENGTH OF MIXTAB ENTRIES                     
         DS    XL1                 N/D                                          
BCDSPSAV DS    XL2                 DISPLACEMENT TO START OF SAVE SCREEN         
         DS    XL2                 N/D                                          
*                                                                               
BCGLOBS  DS    0XL6                GLOBAL INDICATORS                            
BCGLOB1  DS    XL1                 GLOBAL INDICATORS 1                          
BCGLOB2  DS    XL1                 GLOBAL INDICATORS 2                          
BCGLOB3  DS    XL1                 GLOBAL INDICATORS 3                          
BCGLOB4  DS    XL1                 GLOBAL INDICATORS 4                          
BCGLOB5  DS    XL1                 GLOBAL INDICATORS 5                          
BCGLOB6  DS    XL1                 GLOBAL INDICATORS 6                          
*                                                                               
BCVALS   DS    0XL2048             ** FOLLOWING DATA SAVED IN BSVALS **         
*                                                                               
CSVALS   DS    0XL512              ** CURRENT SESSION VALUES **                 
*                                                                               
CSINDSL  DS    0XL3                LOCAL SESSION INDICATORS                     
CSINDSL1 DS    XL1                 LOCAL SESSION INDICATORS - 1                 
CSIUSELC EQU   X'80'               USE CSLSTCUR FOR NESTED CALL                 
CSIUENTK EQU   X'20'               USER INVITED TO ENTER KEY                    
CSINDSL2 DS    XL1                 LOCAL SESSION INDICATORS - 2                 
CSINDSL3 DS    XL1                 LOCAL SESSION INDICATORS - 3                 
*                                                                               
CSINDSG  DS    0XL3                GLOBAL SESSION INDICATORS                    
CSINDSG1 DS    XL1                 GLOBAL SESSION INDICATORS - 1                
CSINDUNW EQU   X'40'               UNWIND VIA $ABEND PENDING                    
CSINDSG2 DS    XL1                 GLOBAL SESSION INDICATORS - 2                
CSINDSG3 DS    XL1                 GLOBAL SESSION INDICATORS - 3                
*                                                                               
CSVCDS1  DS    XL148               CONTROLLER DEPENDENT STORAGE                 
CSBPID   DS    CL8                 PUBLIC ID                                    
         DS    XL6                 CONTROLLER DEPENDENT STORAGE                 
CSRECNAM DS    CL(RECNAMLQ)        CURRENT RECORD NAME                          
CSACTNAM DS    CL(ACTNAMLQ)        CURRENT ACTION NAME                          
         DS    XL38                CONTROLLER DEPENDENT STORAGE                 
CSRECACT DS    0XL2                RECORD/ACTION NUMBER                         
CSREC    DS    XL1                 RECORD NUMBER                                
CSACT    DS    XL1                 ACTION NUMBER                                
CSSCRN   DS    XL1                 SCREEN NUMBER                                
CSOVER   DS    XL1                 OVERLAY NUMBER                               
         DS    XL2                 CONTROLLER DEPENDENT STORAGE                 
CSMSGNUM DS    XL2                 MESSAGE NUMBER                               
CSMSGTYP DS    XL1                 MESSAGE TYPE                                 
CSNEXTPF DS    XL1                 NEXT TIME AUTO PFKEY VALUE                   
         DS    XL2                 CONTROLLER DEPENDANT STORAGE                 
CSCURDSP DS    AL2                 DISPLACEMENT TO CURSOR POSITION              
CSHIRECN DS    XL2                 HIGH TSAR RECORD NUMBER                      
         DS    XL23                CONTROLLER DEPENDENT STORAGE                 
CSNXRECN DS    XL2                 HIGH TSAR NUMBER NEXT SESSION                
         DS    XL2                 CONTROLLER DEPENDENT STORAGE                 
CSPSRECN DS    XL2                 HIGH TSAR NUMBER PREVIOUS SESSION            
         DS    XL13                CONTROLLER DEPENDENT STORAGE                 
CSREPID  DS    CL3                 PRINT QUEUE REPORT-ID                        
CSDSTID  DS    XL2                 PRINT QUEUE USER-ID                          
         ORG   CSVALS+L'CSVALS                                                  
CSVALSL  EQU   *-CSVALS                                                         
*                                                                               
BCVCDS1  DS    XL204               CONTROLLER SPECIFIC STORAGE                  
BCTSLOWP DS    XL1                 TEMPEST LOW PAGE NUMBER                      
BCTSNUMP DS    XL1                 NUMBER OF TEMPEST PAGES ALLOCATED            
BCTSINDS DS    XL1                 TSAR INDICATORS                              
BCTSIINI EQU   X'80'               TEMPEST BUFFER INITIALISED                   
BCTSIRES EQU   X'40'               TEMPEST BUFFER RESTORED                      
BCTSHIGH DS    XL2                 TSAR HIGHEST RECORD NUMBER ADDED             
*                                                                               
BCVCDS2  DS    600X                CONTROLLER SPECIFIC STORAGE                  
*                                                                               
BCUSERID DS    CL8                 CONNECTED USER ID CODE                       
         DS    XL17                CONTROLLER SPECIFIC STORAGE                  
BCORGNAM DS    CL33                CONNECTED USER-ID ORIGIN NAME                
BCORGADD DS    CL33                CONNECTED USER-ID ORIGIN ADDRESS             
BCDSTNAM DS    CL33                CONNECTED USER-ID DESTINATION NAME           
BCDSTAD1 DS    CL33                CONNECTED USER-ID DEST. ADDRESS - 1          
BCDSTAD2 DS    CL33                CONNECTED USER-ID DEST. ADDRESS - 2          
BCDSTAD3 DS    CL33                CONNECTED USER-ID DEST. ADDRESS - 3          
*                                                                               
         ORG   BCVALS+L'BCVALS                                                  
BCVALSL  EQU   *-BCVALS                                                         
BCWSX    DS    0X                                                               
         EJECT                                                                  
*                                  ** I/O AREAS **                              
IOAREALN EQU   2000+L'IODA+L'IOWORK                                             
IOAREA1  DS    (IOAREALN)X                                                      
IOAREA2  DS    (IOAREALN)X                                                      
IOAREA3  DS    (IOAREALN)X                                                      
IOAREA4  DS    (IOAREALN)X                                                      
IOAREA5  DS    (IOAREALN)X                                                      
IOAREA6  DS    (IOAREALN)X                                                      
IOAREA7  DS    (IOAREALN)X                                                      
IOAREA8  DS    (IOAREALN)X                                                      
IOAREA9  DS    (IOAREALN)X                                                      
IOAREAA  DS    (IOAREALN)X                                                      
IOAREAS  EQU   (*-IOAREA1)/IOAREALN                                             
         SPACE 1                                                                
SWSTAB   DS    (SYSSWMAX)XL(SYSSWLEN)                                           
*                                                                               
OVERWRK  DS    (4*1024)X           OVERLAY WORKING STORAGE                      
OVERWRKL EQU   *-OVERWRK                                                        
*                                                                               
REPWRK   DS    (REPX-REPD)X        OVERLAY WORKING STORAGE                      
REPWRKL  EQU   *-REPWRK                                                         
*                                                                               
TSABLK   DS    (TSPNEWL)X                                                       
*                                                                               
GENWORKX DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* TERMINAL WORK AREA DSECT                                            *         
***********************************************************************         
         SPACE 1                                                                
       ++INCLUDE FATWA                                                          
         ORG   TWAUSER                                                          
TWAVALS  DS    0XL(L'TWAUSER)      ** CONTROLLER SAVE AREA **                   
TWAMODE  DS    XL1                 OVERLAY MODE                                 
TWAINDS1 DS    XL1                 CONTROLLER INDICATORS - 1                    
TW1INIT  EQU   X'80'               INITIALISED BEFORE (=TWAIINIT)               
TWAINDS2 DS    XL1                 CONTROLLER INDICATORS - 2                    
TWAINDS3 DS    XL1                 CONTROLLER INDICATORS - 3                    
TWAIPFKD EQU   X'80'               PFK INDICATORS                               
*                                                                               
TWAINDS4 DS    XL1                 CONTROLLER INDICATORS - 4                    
TWASESNL DS    XL1                 CURRENT NESTING LEVEL                        
TWASESMX EQU   8                   MAXIMIUM NESTING LEVELS PERMITTED            
TWACTRL1 DS    XL7                 CONTROLLER DEPENDENT                         
         ORG   TWACTRL1                                                         
TWASCRN  DS    XL1                 CURRENT LOADED SCREEN                        
TWASCRF  DS    XL1                 FLAVOUR OF CURRENT LOADED SCREEN             
         ORG   TWACTRL1+L'TWACTRL1                                              
*                                                                               
TWASESRA DS    (TWASESMX)XL(L'CSRECACT)                                         
TWACTRL2 DS    XL11                CONTROLLER DEPENDENT                         
TWAPPLIC DS    0X                  AVAILABLE TO APPLICATION                     
*                                                                               
         ORG   TWAUSRID        *** REDEFINED FOR OFFLINE FROM DDGENTWA          
         DS    XL20                                                             
TWAOMODE DS    XL1             1E  OFFLINE MODE FROM SPOOF                      
TWAOLOAD EQU   1                   LOAD SCREEN                                  
TWAOPROC EQU   0                   PROCESS REPORT                               
         DS    XL9             1F                                               
TWAOVBUF DS    A               28  V(BUFFALO)                                   
TWAOVSRT DS    A               2C  V(SORTER)                                    
TWAOVPCH DS    A               30  V(PATCHER)                                   
TWAOVWRK DS    A               34  V(WORKER)                                    
TWAOVBOX DS    A               38  V(BOX)                                       
TWAOVMST DS    A               3C  V(MASTC)                                     
*                                                                               
         ORG   TWAVALS+L'TWAVALS                                                
TWASCR   DS    0X                                                               
TWAMSGH  DS    XL8                 MESSAGE FIELD HEADER                         
TWAMSG   DS    CL60                MESSAGE FIELD                                
TWASRVH  DS    XL8                 SERVICE FIELD HEADER                         
TWASRV   DS    CL17                SERVICE FIELD                                
TWAPOLY  DS    0X                  PROGRAM/OVERLAY SCREEN                       
*                                                                               
         ORG   TWAD+X'EDC'     *** REDEFINED FOR OFFLINE FROM DDGENTWA          
TWAOVADC DS    A                   V((TWADCONS) - IN DDTWADCONS                 
*                                                                               
         ORG   TWAD+TWAMAX-2048  ORG TO USER END OF TWA0                        
TWAX     EQU   *                                                                
         EJECT                                                                  
***********************************************************************         
* REPORT MONITOR WORK AREA DSECT                                      *         
***********************************************************************         
         SPACE 1                                                                
REPD     DSECT                                                                  
       ++INCLUDE FAREPBLK                                                       
         EJECT                                                                  
REPHS    DS    0CL132              ** REPORT HEAD LINES **                      
REPH1    DS    CL132                                                            
REPH2    DS    CL132                                                            
REPH3    DS    CL132                                                            
REPH4    DS    CL132                                                            
REPH5    DS    CL132                                                            
REPH6    DS    CL132                                                            
REPH7    DS    CL132                                                            
REPH8    DS    CL132                                                            
REPH9    DS    CL132                                                            
REPHA    DS    CL132                                                            
REPHB    DS    CL132                                                            
REPHC    DS    CL132                                                            
REPHD    DS    CL132                                                            
REPHE    DS    CL132                                                            
REPHN    EQU   (*-REPHS)/L'REPHS                                                
*                                                                               
REPMS    DS    0CL132              ** REPORT MID LINES **                       
REPM1    DS    CL132                                                            
REPM2    DS    CL132                                                            
REPM3    DS    CL132                                                            
REPM4    DS    CL132                                                            
REPMN    EQU   (*-REPMS)/L'REPMS                                                
*                                                                               
REPPS    DS    0CL132              ** REPORT PRINT LINES **                     
REPP1    DS    CL132                                                            
REPP2    DS    CL132                                                            
REPP3    DS    CL132                                                            
REPP4    DS    CL132                                                            
REPP5    DS    CL132                                                            
REPP6    DS    CL132                                                            
REPP7    DS    CL132                                                            
REPP8    DS    CL132                                                            
REPP9    DS    CL132                                                            
REPPA    DS    CL132                                                            
REPPB    DS    CL132                                                            
REPPC    DS    CL132                                                            
REPPD    DS    CL132                                                            
REPPE    DS    CL132                                                            
REPPN    EQU   (*-REPPS)/L'REPPS                                                
*                                                                               
REPFS    DS    0XL132              ** REPORT FOOT LINES **                      
REPF1    DS    CL132                                                            
REPF2    DS    CL132                                                            
REPFN    EQU   (*-REPFS)/L'REPFS                                                
*                                                                               
         ORG   REPHS                                                            
REPHWS   DS    0CL165              ** WIDE REPORT HEAD LINES **                 
REPHW1   DS    CL165                                                            
REPHW2   DS    CL165                                                            
REPHW3   DS    CL165                                                            
REPHW4   DS    CL165                                                            
REPHW5   DS    CL165                                                            
REPHW6   DS    CL165                                                            
REPHW7   DS    CL165                                                            
REPHW8   DS    CL165                                                            
REPHW9   DS    CL165                                                            
REPHWA   DS    CL165                                                            
REPHWB   DS    CL165                                                            
REPHWN   EQU   (*-REPHWS)/L'REPHWS                                              
*                                                                               
REPMWS   DS    0CL165              ** WIDE REPORT MID LINES **                  
REPMW1   DS    CL165                                                            
REPMW2   DS    CL165                                                            
REPMW3   DS    CL165                                                            
REPMWN   EQU   (*-REPMWS)/L'REPMWS                                              
*                                                                               
REPPWS   DS    0CL165              ** WIDE REPORT PRINT LINES **                
REPPW1   DS    CL165                                                            
REPPW2   DS    CL165                                                            
REPPW3   DS    CL165                                                            
REPPW4   DS    CL165                                                            
REPPW5   DS    CL165                                                            
REPPW6   DS    CL165                                                            
REPPW7   DS    CL165                                                            
REPPW8   DS    CL165                                                            
REPPW9   DS    CL165                                                            
REPPWA   DS    CL165                                                            
REPPWB   DS    CL165                                                            
REPPWN   EQU   (*-REPPWS)/L'REPPWS                                              
*                                                                               
REPFWS   DS    0CL165              ** WIDE REPORT FOOT LINES **                 
REPFW1   DS    CL165                                                            
REPFW2   DS    CL165                                                            
REPFWN   EQU   (*-REPFWS)/L'REPFWS                                              
*                                                                               
         ORG   REPHS                                                            
REPHNS   DS    0CL110              ** NARROW REPORT HEAD LINES **               
REPHN1   DS    CL110                                                            
REPHN2   DS    CL110                                                            
REPHN3   DS    CL110                                                            
REPHN4   DS    CL110                                                            
REPHN5   DS    CL110                                                            
REPHN6   DS    CL110                                                            
REPHN7   DS    CL110                                                            
REPHN8   DS    CL110                                                            
REPHN9   DS    CL110                                                            
REPHNA   DS    CL110                                                            
REPHNB   DS    CL110                                                            
REPHNC   DS    CL110                                                            
REPHND   DS    CL110                                                            
REPHNE   DS    CL110                                                            
REPHNF   DS    CL110                                                            
REPHNG   DS    CL110                                                            
REPHNN   EQU   (*-REPHNS)/L'REPHNS                                              
*                                                                               
REPMNS   DS    0CL110              ** NARROW REPORT MID LINES **                
REPMN1   DS    CL110                                                            
REPMN2   DS    CL110                                                            
REPMN3   DS    CL110                                                            
REPMN4   DS    CL110                                                            
REPMNN   EQU   (*-REPMNS)/L'REPMNS                                              
*                                                                               
REPPNS   DS    0CL110              ** NARROW REPORT PRINT LINES **              
REPPN1   DS    CL110                                                            
REPPN2   DS    CL110                                                            
REPPN3   DS    CL110                                                            
REPPN4   DS    CL110                                                            
REPPN5   DS    CL110                                                            
REPPN6   DS    CL110                                                            
REPPN7   DS    CL110                                                            
REPPN8   DS    CL110                                                            
REPPN9   DS    CL110                                                            
REPPNA   DS    CL110                                                            
REPPNB   DS    CL110                                                            
REPPNC   DS    CL110                                                            
REPPND   DS    CL110                                                            
REPPNE   DS    CL110                                                            
REPPNF   DS    CL110                                                            
REPPNG   DS    CL110                                                            
REPPNN   EQU   (*-REPPNS)/L'REPPNS                                              
*                                                                               
REPFNS   DS    0CL110              ** NARROW REPORT FOOT LINES **               
REPFN1   DS    CL110                                                            
REPFN2   DS    CL110                                                            
REPFN3   DS    CL110                                                            
REPFN4   DS    CL110                                                            
REPFNN   EQU   (*-REPFNS)/L'REPFNS                                              
*                                                                               
         ORG                                                                    
REPX     EQU   *                                                                
         EJECT                                                                  
* DDTSARD                                                                       
         PUSH  PRINT                                                            
         PRINT OFF                                                              
       ++INCLUDE DDTSARD                                                        
         POP   PRINT                                                            
         SPACE 1                                                                
* DDCTRYEQUS                                                                    
         PUSH  PRINT                                                            
         PRINT OFF                                                              
       ++INCLUDE DDCTRYEQUS                                                     
CTRYNOT  EQU   X'80'                                                            
CTRYALL  EQU   0                                                                
         POP   PRINT                                                            
         SPACE 1                                                                
* DDCURTABD                                                                     
         PUSH  PRINT                                                            
         PRINT OFF                                                              
       ++INCLUDE DDCURTABD                                                      
         POP   PRINT                                                            
         SPACE 1                                                                
* DDLANGEQUS                                                                    
         PUSH  PRINT                                                            
         PRINT OFF                                                              
       ++INCLUDE DDLANGEQUS                                                     
         POP   PRINT                                                            
         SPACE 1                                                                
* FAGETTXTD                                                                     
         PUSH  PRINT                                                            
         PRINT OFF                                                              
       ++INCLUDE FAGETTXTD                                                      
         POP   PRINT                                                            
         SPACE 1                                                                
* FATIOB                                                                        
         PUSH  PRINT                                                            
         PRINT OFF                                                              
       ++INCLUDE FATIOB                                                         
         POP   PRINT                                                            
         SPACE 1                                                                
* DDPERVALD                                                                     
         PUSH  PRINT                                                            
         PRINT OFF                                                              
       ++INCLUDE DDPERVALD                                                      
         POP   PRINT                                                            
