*          DATA SET GEKEYFFD   AT LEVEL 009 AS OF 11/28/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF05FFD      DATE 11/28/90                 
         SPACE 1                                                                
TF05FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CONHEADH DS    CL8                                                              
CONHEAD  DS    CL60     1    2   60  A   P    N         T        Y              
CONSERVH DS    CL8                                                              
CONSERV  DS    CL17     1   63   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      3    2    7  A   P    H         T        Y              
CONSYSTH DS    CL8                                                              
CONSYST  DS    CL8      3   10    8  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL7      3   20    7  A   P    H         T        Y              
CONACTNH DS    CL8                                                              
CONACTN  DS    CL8      3   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      3   38    7  A   P    N         T        Y              
CONKEYH  DS    CL8                                                              
CONKEY   DS    CL34     3   46   34  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      4    2    7  A   P    N         T        Y              
CONWHENH DS    CL8                                                              
CONWHEN  DS    CL8      4   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      4   20    7  A   P    N         T        Y              
CONOUTH  DS    CL8                                                              
CONOUT   DS    CL8      4   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      4   38    7  A   P    N         T        Y              
CONDESTH DS    CL8                                                              
CONDEST  DS    CL8      4   46    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      4   56    7  A   P    N         T        Y              
CONOTHH  DS    CL8                                                              
CONOTH   DS    CL16     4   64   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     5    2   11  A   P    H         T        Y              
CONRCRDH DS    CL8                                                              
CONRCRD  DS    CL10     5   16   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL26     5   40   26  A   P    N         T        Y              
CONP0H   DS    CL8                                                              
CONP0    DS    CL10     7    2   10  A   P    N         T        Y              
CONI0H   DS    CL8                                                              
CONI0    DS    CL60     7   16   60  A   P    N         T        Y   20         
CONI0X   DS    CL8                                                              
CONP1H   DS    CL8                                                              
CONP1    DS    CL10     8    2   10  A   P    N         T        Y              
CONI1H   DS    CL8                                                              
CONI1    DS    CL60     8   16   60  A   P    N         T        Y   20         
CONI1X   DS    CL8                                                              
CONP2H   DS    CL8                                                              
CONP2    DS    CL10     9    2   10  A   P    N         T        Y              
CONI2H   DS    CL8                                                              
CONI2    DS    CL60     9   16   60  A   P    N         T        Y   20         
CONI2X   DS    CL8                                                              
CONP3H   DS    CL8                                                              
CONP3    DS    CL10    10    2   10  A   P    N         T        Y              
CONI3H   DS    CL8                                                              
CONI3    DS    CL60    10   16   60  A   P    N         T        Y   20         
CONI3X   DS    CL8                                                              
CONP4H   DS    CL8                                                              
CONP4    DS    CL10    11    2   10  A   P    N         T        Y              
CONI4H   DS    CL8                                                              
CONI4    DS    CL60    11   16   60  A   P    N         T        Y   20         
CONI4X   DS    CL8                                                              
CONP5H   DS    CL8                                                              
CONP5    DS    CL10    12    2   10  A   P    N         T        Y              
CONI5H   DS    CL8                                                              
CONI5    DS    CL60    12   16   60  A   P    N         T        Y   20         
CONI5X   DS    CL8                                                              
CONP6H   DS    CL8                                                              
CONP6    DS    CL10    13    2   10  A   P    N         T        Y              
CONI6H   DS    CL8                                                              
CONI6    DS    CL60    13   16   60  A   P    N         T        Y   20         
CONI6X   DS    CL8                                                              
CONP7H   DS    CL8                                                              
CONP7    DS    CL10    14    2   10  A   P    N         T        Y              
CONI7H   DS    CL8                                                              
CONI7    DS    CL60    14   16   60  A   P    N         T        Y   20         
CONI7X   DS    CL8                                                              
CONP8H   DS    CL8                                                              
CONP8    DS    CL10    15    2   10  A   P    N         T        Y              
CONI8H   DS    CL8                                                              
CONI8    DS    CL60    15   16   60  A   P    N         T        Y   20         
CONI8X   DS    CL8                                                              
CONP9H   DS    CL8                                                              
CONP9    DS    CL10    16    2   10  A   P    N         T        Y              
CONI9H   DS    CL8                                                              
CONI9    DS    CL60    16   16   60  A   P    N         T        Y   20         
CONI9X   DS    CL8                                                              
CONPAH   DS    CL8                                                              
CONPA    DS    CL10    17    2   10  A   P    N         T        Y              
CONIAH   DS    CL8                                                              
CONIA    DS    CL60    17   16   60  A   P    N         T        Y   20         
CONIAX   DS    CL8                                                              
CONPBH   DS    CL8                                                              
CONPB    DS    CL10    18    2   10  A   P    N         T        Y              
CONIBH   DS    CL8                                                              
CONIB    DS    CL60    18   16   60  A   P    N         T        Y   20         
CONIBX   DS    CL8                                                              
CONPCH   DS    CL8                                                              
CONPC    DS    CL10    19    2   10  A   P    N         T        Y              
CONICH   DS    CL8                                                              
CONIC    DS    CL60    19   16   60  A   P    N         T        Y   20         
CONICX   DS    CL8                                                              
CONPDH   DS    CL8                                                              
CONPD    DS    CL10    20    2   10  A   P    N         T        Y              
CONIDH   DS    CL8                                                              
CONID    DS    CL60    20   16   60  A   P    N         T        Y   20         
CONIDX   DS    CL8                                                              
CONPEH   DS    CL8                                                              
CONPE    DS    CL10    21    2   10  A   P    N         T        Y              
CONIEH   DS    CL8                                                              
CONIE    DS    CL60    21   16   60  A   P    N         T        Y   20         
CONIEX   DS    CL8                                                              
CONPFH   DS    CL8                                                              
CONPF    DS    CL10    22    2   10  A   P    N         T        Y              
CONIFH   DS    CL8                                                              
CONIF    DS    CL60    22   16   60  A   P    N         T        Y   20         
CONIFX   DS    CL8                                                              
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1992 BYTES                            
