*          DATA SET GELNKFFD   AT LEVEL 002 AS OF 11/03/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA06FFD      DATE 11/03/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LNKHEADH DS    XL8                                                              
LNKHEAD  DS    CL60     1    2   60  L  P N             T        Y              
LNKSERVH DS    XL8                                                              
LNKSERV  DS    CL17     1   63   17  A  U N             T        Y              
LNKINPH  DS    XL8                                                              
LNKINP   DS    CL79     2    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     3    2   79  A  U N             T        Y              
LNKFLNKH DS    XL8                                                              
LNKFLNK  DS    CL79     4    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     5    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     6    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     7    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     8    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  U N             T        Y              
LNKTAGH  DS    XL8                                                              
LNKTAG   DS    CL1     23    2    1  A  P N             T        Y              
LNKLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LNKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
