*          DATA SET GENOLD     AT LEVEL 006 AS OF 01/24/75                      
         SPACE 3                                                                
*                  GENERAL DSECT FOR ON-LINE MODULES                            
         SPACE 3                                                                
GENOLD   DSECT                                                                  
DMWORK   DS    12D                                                              
WORK     DS    CL48                                                             
DMCB     DS    6F                                                               
DUB      DS    D                                                                
VTWA     DS    A                   A(TWA)                                       
VDATAMGR DS    A                   A(DATAMGR)                                   
VCALLOV  DS    A                   A(CALLOV)                                    
VCASHVAL DS    A                   A(CASHVAL)                                   
VDATVAL  DS    A                   A(DATVAL)                                    
VADDAY   DS    A                   A(ADDAY)                                     
VDTCNV   DS    A                   A(DTCNV)                                     
VGETDAY  DS    A                   A(GETDAY)                                    
VRECUP   DS    A                   A(RECUP)                                     
VGETMSG  DS    A                   A(GETMSG)                                    
ERRAREA  DS    A                   A(ERROR AREA)                                
FRSTFLD  DS    A                   A(FIRST INPUT HEADER)                        
LASTFLD  DS    A                   A(LAST  INPUT HEADER)                        
NUMFLD   DS    H                   NUMBER OF INPUT FIELDS                       
AGYNUM   DS    CL1                 AGENCY NUMBER                                
REPALPHA DS    0C                  FOR REPPAK ALPHA REP CODE                    
AGYALPHA DS    CL2                 AGENCY ALPHA CODE                            
TERMNAL  DS    CL1                 TERMINAL NUMBER                              
DMINBTS  DS    CL1                 SET TO X'C0' BY INITL                        
DMOUTBTS DS    CL1                 SET TO X'FD' BY INITL                        
BYTE     DS    CL1                 USED IN DATAMGR ERROR TESTS                  
BYTE2    DS    CL1                                                              
BYTE3    DS    CL1                                                              
BYTE4    DS    CL1                                                              
KEY      DS    CL32                                                             
KEYSAVE  DS    CL32                SET EQUAL TO KEY ON READ HIGH                
FILENAME DS    CL8                                                              
COMMAND  DS    CL6                                                              
FULL     DS    F                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
IOAREA   DS    0D                  41 DOUBLE WORDS SO FAR                       
