*          DATA SET GEPAK03TC  AT LEVEL 001 AS OF 01/27/04                      
***********************************************************************         
* TABLES CONSTANTS FOR GEPAK03 - PCPAK DATA FILE DOWNLOAD             *         
***********************************************************************         
         SPACE 1                                                                
PAK03    CSECT                                                                  
         SPACE 1                                                                
EOLTXT   DC    C'XX'               END OF LINE                                  
VERTXT   DC    C'VERSION='         VERSION TEXT                                 
VERTXTLQ EQU   (*-VERTXT)-1                                                     
FILSTXT  DC    C'FILES'                                                         
SCRSTXT  DC    C'SCREENS'                                                       
         SPACE 1                                                                
