*          DATA SET GEPAKFFD   AT LEVEL 006 AS OF 05/08/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF36FFD      DATE 05/08/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CONHEADH DS    XL8                                                              
CONHEAD  DS    CL60     1    2   60  A  P H             T        Y              
CONSERVH DS    XL8                                                              
CONSERV  DS    CL17     1   63   17  A  U N             T        Y              
CONTAGH  DS    XL8                                                              
CONTAG   DS    CL3      2    2    3  L  P N             T        Y              
CONKEYH  DS    XL8                                                              
CONKEY   DS    CL65     2   10   65  A  U N             T    I   Y  100         
CONKEYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      2   79    1  A  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 200  BYTES                            
