*          DATA SET GEPFMFDD   AT LEVEL 001 AS OF 07/08/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF01FDD      DATE 07/08/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PFMTIT1H DS    XL8                                                              
PFMTIT1  DS    CL11     8    2   11  A  P N R R         T        Y  100         
PFMTIT1X DS    XL8                                                              
PFMTIT2H DS    XL8                                                              
PFMTIT2  DS    CL40     8   16   40  A  P N R R         T        Y  101         
PFMTIT2X DS    XL8                                                              
PFMTIT3H DS    XL8                                                              
PFMTIT3  DS    CL20     8   58   20  A  P N R R         T        Y  102         
PFMTIT3X DS    XL8                                                              
PFMDL1OH DS    XL8                                                              
PFMDL1O  DS    CL11     9    2   11  A  P N             T        Y              
PFMDL1HH DS    XL8                                                              
PFMDL1H  DS    CL40     9   16   40  A  U N             T        Y              
PFMDL1AH DS    XL8                                                              
PFMDL1A  DS    CL20     9   58   20  A  U N             T        Y              
PFMDL2OH DS    XL8                                                              
PFMDL2O  DS    CL11    10    2   11  A  P N             T        Y              
PFMDL2HH DS    XL8                                                              
PFMDL2H  DS    CL40    10   16   40  A  U N             T        Y              
PFMDL2AH DS    XL8                                                              
PFMDL2A  DS    CL20    10   58   20  A  U N             T        Y              
PFMDL3OH DS    XL8                                                              
PFMDL3O  DS    CL11    11    2   11  A  P N             T        Y              
PFMDL3HH DS    XL8                                                              
PFMDL3H  DS    CL40    11   16   40  A  U N             T        Y              
PFMDL3AH DS    XL8                                                              
PFMDL3A  DS    CL20    11   58   20  A  U N             T        Y              
PFMDL4OH DS    XL8                                                              
PFMDL4O  DS    CL11    12    2   11  A  P N             T        Y              
PFMDL4HH DS    XL8                                                              
PFMDL4H  DS    CL40    12   16   40  A  U N             T        Y              
PFMDL4AH DS    XL8                                                              
PFMDL4A  DS    CL20    12   58   20  A  U N             T        Y              
PFMDL5OH DS    XL8                                                              
PFMDL5O  DS    CL11    13    2   11  A  P N             T        Y              
PFMDL5HH DS    XL8                                                              
PFMDL5H  DS    CL40    13   16   40  A  U N             T        Y              
PFMDL5AH DS    XL8                                                              
PFMDL5A  DS    CL20    13   58   20  A  U N             T        Y              
PFMDL6OH DS    XL8                                                              
PFMDL6O  DS    CL11    14    2   11  A  P N             T        Y              
PFMDL6HH DS    XL8                                                              
PFMDL6H  DS    CL40    14   16   40  A  U N             T        Y              
PFMDL6AH DS    XL8                                                              
PFMDL6A  DS    CL20    14   58   20  A  U N             T        Y              
PFMDL7OH DS    XL8                                                              
PFMDL7O  DS    CL11    15    2   11  A  P N             T        Y              
PFMDL7HH DS    XL8                                                              
PFMDL7H  DS    CL40    15   16   40  A  U N             T        Y              
PFMDL7AH DS    XL8                                                              
PFMDL7A  DS    CL20    15   58   20  A  U N             T        Y              
PFMDL8OH DS    XL8                                                              
PFMDL8O  DS    CL11    16    2   11  A  P N             T        Y              
PFMDL8HH DS    XL8                                                              
PFMDL8H  DS    CL40    16   16   40  A  U N             T        Y              
PFMDL8AH DS    XL8                                                              
PFMDL8A  DS    CL20    16   58   20  A  U N             T        Y              
PFMDL9OH DS    XL8                                                              
PFMDL9O  DS    CL11    17    2   11  A  P N             T        Y              
PFMDL9HH DS    XL8                                                              
PFMDL9H  DS    CL40    17   16   40  A  U N             T        Y              
PFMDL9AH DS    XL8                                                              
PFMDL9A  DS    CL20    17   58   20  A  U N             T        Y              
PFMDLAOH DS    XL8                                                              
PFMDLAO  DS    CL11    18    2   11  A  P N             T        Y              
PFMDLAHH DS    XL8                                                              
PFMDLAH  DS    CL40    18   16   40  A  U N             T        Y              
PFMDLAAH DS    XL8                                                              
PFMDLAA  DS    CL20    18   58   20  A  U N             T        Y              
PFMDLBOH DS    XL8                                                              
PFMDLBO  DS    CL11    19    2   11  A  P N             T        Y              
PFMDLBHH DS    XL8                                                              
PFMDLBH  DS    CL40    19   16   40  A  U N             T        Y              
PFMDLBAH DS    XL8                                                              
PFMDLBA  DS    CL20    19   58   20  A  U N             T        Y              
PFMDLCOH DS    XL8                                                              
PFMDLCO  DS    CL11    20    2   11  A  P N             T        Y              
PFMDLCHH DS    XL8                                                              
PFMDLCH  DS    CL40    20   16   40  A  U N             T        Y              
PFMDLCAH DS    XL8                                                              
PFMDLCA  DS    CL20    20   58   20  A  U N             T        Y              
PFMDLDOH DS    XL8                                                              
PFMDLDO  DS    CL11    21    2   11  A  P N             T        Y              
PFMDLDHH DS    XL8                                                              
PFMDLDH  DS    CL40    21   16   40  A  U N             T        Y              
PFMDLDAH DS    XL8                                                              
PFMDLDA  DS    CL20    21   58   20  A  U N             T        Y              
PFMDLEOH DS    XL8                                                              
PFMDLEO  DS    CL11    22    2   11  A  P N             T        Y              
PFMDLEHH DS    XL8                                                              
PFMDLEH  DS    CL40    22   16   40  A  U N             T        Y              
PFMDLEAH DS    XL8                                                              
PFMDLEA  DS    CL20    22   58   20  A  U N             T        Y              
PFMDLFOH DS    XL8                                                              
PFMDLFO  DS    CL11    23    2   11  A  P N             T        Y              
PFMDLFHH DS    XL8                                                              
PFMDLFH  DS    CL40    23   16   40  A  U N             T        Y              
PFMDLFAH DS    XL8                                                              
PFMDLFA  DS    CL20    23   58   20  A  U N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1552 BYTES                            
