*          DATA SET GEPFMFFD   AT LEVEL 001 AS OF 07/08/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF01FFD      DATE 07/08/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PFMHDRH  DS    XL8                                                              
PFMHDR   DS    CL60     1    2   60  A  P N R R         T        Y              
PFMSRH   DS    XL8                                                              
PFMSR    DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     2    2   12  A  P N             T        Y              
PFMFILEH DS    XL8                                                              
PFMFILE  DS    CL15     2   16   15  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL12     3    2   12  A  P N             T        Y              
PFMRID1H DS    XL8                                                              
PFMRID1  DS    CL60     3   16   60  L  U N             T        Y              
PFMRID2H DS    XL8                                                              
PFMRID2  DS    CL60     4   16   60  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     5    2   12  A  P N             T        Y              
PFMRACTH DS    XL8                                                              
PFMRACT  DS    CL24     5   16   24  A  U N             T        Y              
PFMMSGH  DS    XL8                                                              
PFMMSG   DS    CL20     5   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     6    2   12  A  P N             T        Y              
PFMEIDH  DS    XL8                                                              
PFMEID   DS    CL24     6   16   24  A  U N             T        Y              
PFMMSG1H DS    XL8                                                              
PFMMSG1  DS    CL22     6   58   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
PFMEACTH DS    XL8                                                              
PFMEACT  DS    CL24     7   16   24  A  U N             T        Y              
PFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
PFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 512  BYTES                            
