*          DATA SET GEPFMFED   AT LEVEL 001 AS OF 07/08/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF01FED      DATE 07/08/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PFMHIT1H DS    XL8                                                              
PFMHIT1  DS    CL11     8    2   11  A  P N R R         T        Y  100         
PFMHIT1X DS    XL8                                                              
PFMHIT2H DS    XL8                                                              
PFMHIT2  DS    CL32     8   16   32  A  P N R R         T        Y  101         
PFMHIT2X DS    XL8                                                              
PFMHIT3H DS    XL8                                                              
PFMHIT3  DS    CL16     8   58   16  A  P N R R         T        Y  102         
PFMHIT3X DS    XL8                                                              
PFMHL1OH DS    XL8                                                              
PFMHL1O  DS    CL11     9    2   11  A  P N             T        Y              
PFMHL1HH DS    XL8                                                              
PFMHL1H  DS    CL32     9   16   32  A  U N             T        Y              
PFMHL1AH DS    XL8                                                              
PFMHL1A  DS    CL16     9   58   16  A  U N             T        Y              
PFMHL2OH DS    XL8                                                              
PFMHL2O  DS    CL11    10    2   11  A  P N             T        Y              
PFMHL2HH DS    XL8                                                              
PFMHL2H  DS    CL32    10   16   32  A  U N             T        Y              
PFMHL2AH DS    XL8                                                              
PFMHL2A  DS    CL16    10   58   16  A  U N             T        Y              
PFMHL3OH DS    XL8                                                              
PFMHL3O  DS    CL11    11    2   11  A  P N             T        Y              
PFMHL3HH DS    XL8                                                              
PFMHL3H  DS    CL32    11   16   32  A  U N             T        Y              
PFMHL3AH DS    XL8                                                              
PFMHL3A  DS    CL16    11   58   16  A  U N             T        Y              
PFMHL4OH DS    XL8                                                              
PFMHL4O  DS    CL11    12    2   11  A  P N             T        Y              
PFMHL4HH DS    XL8                                                              
PFMHL4H  DS    CL32    12   16   32  A  U N             T        Y              
PFMHL4AH DS    XL8                                                              
PFMHL4A  DS    CL16    12   58   16  A  U N             T        Y              
PFMHL5OH DS    XL8                                                              
PFMHL5O  DS    CL11    13    2   11  A  P N             T        Y              
PFMHL5HH DS    XL8                                                              
PFMHL5H  DS    CL32    13   16   32  A  U N             T        Y              
PFMHL5AH DS    XL8                                                              
PFMHL5A  DS    CL16    13   58   16  A  U N             T        Y              
PFMHL6OH DS    XL8                                                              
PFMHL6O  DS    CL11    14    2   11  A  P N             T        Y              
PFMHL6HH DS    XL8                                                              
PFMHL6H  DS    CL32    14   16   32  A  U N             T        Y              
PFMHL6AH DS    XL8                                                              
PFMHL6A  DS    CL16    14   58   16  A  U N             T        Y              
PFMHL7OH DS    XL8                                                              
PFMHL7O  DS    CL11    15    2   11  A  P N             T        Y              
PFMHL7HH DS    XL8                                                              
PFMHL7H  DS    CL32    15   16   32  A  U N             T        Y              
PFMHL7AH DS    XL8                                                              
PFMHL7A  DS    CL16    15   58   16  A  U N             T        Y              
PFMHL8OH DS    XL8                                                              
PFMHL8O  DS    CL11    16    2   11  A  P N             T        Y              
PFMHL8HH DS    XL8                                                              
PFMHL8H  DS    CL32    16   16   32  A  U N             T        Y              
PFMHL8AH DS    XL8                                                              
PFMHL8A  DS    CL16    16   58   16  A  U N             T        Y              
PFMHL9OH DS    XL8                                                              
PFMHL9O  DS    CL11    17    2   11  A  P N             T        Y              
PFMHL9HH DS    XL8                                                              
PFMHL9H  DS    CL32    17   16   32  A  U N             T        Y              
PFMHL9AH DS    XL8                                                              
PFMHL9A  DS    CL16    17   58   16  A  U N             T        Y              
PFMHLAOH DS    XL8                                                              
PFMHLAO  DS    CL11    18    2   11  A  P N             T        Y              
PFMHLAHH DS    XL8                                                              
PFMHLAH  DS    CL32    18   16   32  A  U N             T        Y              
PFMHLAAH DS    XL8                                                              
PFMHLAA  DS    CL16    18   58   16  A  U N             T        Y              
PFMHLBOH DS    XL8                                                              
PFMHLBO  DS    CL11    19    2   11  A  P N             T        Y              
PFMHLBHH DS    XL8                                                              
PFMHLBH  DS    CL32    19   16   32  A  U N             T        Y              
PFMHLBAH DS    XL8                                                              
PFMHLBA  DS    CL16    19   58   16  A  U N             T        Y              
PFMHLCOH DS    XL8                                                              
PFMHLCO  DS    CL11    20    2   11  A  P N             T        Y              
PFMHLCHH DS    XL8                                                              
PFMHLCH  DS    CL32    20   16   32  A  U N             T        Y              
PFMHLCAH DS    XL8                                                              
PFMHLCA  DS    CL16    20   58   16  A  U N             T        Y              
PFMHLDOH DS    XL8                                                              
PFMHLDO  DS    CL11    21    2   11  A  P N             T        Y              
PFMHLDHH DS    XL8                                                              
PFMHLDH  DS    CL32    21   16   32  A  U N             T        Y              
PFMHLDAH DS    XL8                                                              
PFMHLDA  DS    CL16    21   58   16  A  U N             T        Y              
PFMHLEOH DS    XL8                                                              
PFMHLEO  DS    CL11    22    2   11  A  P N             T        Y              
PFMHLEHH DS    XL8                                                              
PFMHLEH  DS    CL32    22   16   32  A  U N             T        Y              
PFMHLEAH DS    XL8                                                              
PFMHLEA  DS    CL16    22   58   16  A  U N             T        Y              
PFMHLFOH DS    XL8                                                              
PFMHLFO  DS    CL11    23    2   11  A  P N             T        Y              
PFMHLFHH DS    XL8                                                              
PFMHLFH  DS    CL32    23   16   32  A  U N             T        Y              
PFMHLFAH DS    XL8                                                              
PFMHLFA  DS    CL16    23   58   16  A  U N             T        Y              
PFMHLGOH DS    XL8                                                              
PFMHLGO  DS    CL11    24    2   11  A  P N             T        Y              
PFMHLGHH DS    XL8                                                              
PFMHLGH  DS    CL32    24   16   32  A  U N             T        Y              
PFMHLGAH DS    XL8                                                              
PFMHLGA  DS    CL16    24   58   16  A  U N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1440 BYTES                            
