*          DATA SET GEREQFDD   AT LEVEL 002 AS OF 10/18/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TFD8FDD      DATE 10/18/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    N         T        Y              
REQFILTH DS    CL8                                                              
REQFILT  DS    CL60     5   10   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
REQSEL1H DS    CL8                                                              
REQSEL1  DS    CL1      7    2    1  A   U    N         T        Y              
REQDSP1H DS    CL8                                                              
REQDSP1  DS    CL74     7    5   74  A   U    N         T        Y              
REQSEL2H DS    CL8                                                              
REQSEL2  DS    CL1      8    2    1  A   U    N         T        Y              
REQDSP2H DS    CL8                                                              
REQDSP2  DS    CL74     8    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     9    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    10    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    5   74  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    5   74  A   U    N         T        Y              
REQLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1464 BYTES                            
