*          DATA SET GERLPF6D   AT LEVEL 002 AS OF 05/04/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF2DF6D      DATE 05/04/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DATHEADH DS    XL8                                                              
DATHEAD  DS    CL79     8    2   79  A  P H             T        Y              
DATLIN1H DS    XL8                                                              
DATLIN1  DS    CL79     9    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
DATPFKH  DS    XL8                                                              
DATPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
DATPFKX  DS    XL8                                                              
DATLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
DATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1496 BYTES                            
