*          DATA SET GERLPF8D   AT LEVEL 003 AS OF 05/18/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF2DF8D      DATE 05/18/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CALHED1H DS    CL8                                                              
CALHED1  DS    CL78     8    2   78  A  P N             T        Y              
CALSUB1H DS    CL8                                                              
CALSUB1  DS    CL78     9    2   78  A  P N             T        Y              
CALM1W1H DS    CL8                                                              
CALM1W1  DS    CL3     10    2    3  A  P N             T        Y              
CALWK1H  DS    CL8                                                              
CALWK1   DS    CL7     10    6    7  A  U H             T        Y              
CALM2W1H DS    CL8                                                              
CALM2W1  DS    CL3     10   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   19    7  A  U H             T        Y              
CALM3W1H DS    CL8                                                              
CALM3W1  DS    CL3     10   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   32    7  A  U H             T        Y              
CALM4W1H DS    CL8                                                              
CALM4W1  DS    CL3     10   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   45    7  A  U H             T        Y              
CALM5W1H DS    CL8                                                              
CALM5W1  DS    CL3     10   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   58    7  A  U H             T        Y              
CALM6W1H DS    CL8                                                              
CALM6W1  DS    CL3     10   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   71    7  A  U H             T        Y              
CALM1W2H DS    CL8                                                              
CALM1W2  DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    6    7  A  U H             T        Y              
CALM2W2H DS    CL8                                                              
CALM2W2  DS    CL3     11   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   19    7  A  U H             T        Y              
CALM3W2H DS    CL8                                                              
CALM3W2  DS    CL3     11   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   32    7  A  U H             T        Y              
CALM4W2H DS    CL8                                                              
CALM4W2  DS    CL3     11   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   45    7  A  U H             T        Y              
CALM5W2H DS    CL8                                                              
CALM5W2  DS    CL3     11   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   58    7  A  U H             T        Y              
CALM6W2H DS    CL8                                                              
CALM6W2  DS    CL3     11   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   71    7  A  U H             T        Y              
CALM1W3H DS    CL8                                                              
CALM1W3  DS    CL3     12    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    6    7  A  U H             T        Y              
CALM2W3H DS    CL8                                                              
CALM2W3  DS    CL3     12   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   19    7  A  U H             T        Y              
CALM3W3H DS    CL8                                                              
CALM3W3  DS    CL3     12   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   32    7  A  U H             T        Y              
CALM4W3H DS    CL8                                                              
CALM4W3  DS    CL3     12   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   45    7  A  U H             T        Y              
CALM5W3H DS    CL8                                                              
CALM5W3  DS    CL3     12   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   58    7  A  U H             T        Y              
CALM6W3H DS    CL8                                                              
CALM6W3  DS    CL3     12   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   71    7  A  U H             T        Y              
CALM1W4H DS    CL8                                                              
CALM1W4  DS    CL3     13    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    6    7  A  U H             T        Y              
CALM2W4H DS    CL8                                                              
CALM2W4  DS    CL3     13   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   19    7  A  U H             T        Y              
CALM3W4H DS    CL8                                                              
CALM3W4  DS    CL3     13   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   32    7  A  U H             T        Y              
CALM4W4H DS    CL8                                                              
CALM4W4  DS    CL3     13   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   45    7  A  U H             T        Y              
CALM5W4H DS    CL8                                                              
CALM5W4  DS    CL3     13   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   58    7  A  U H             T        Y              
CALM6W4H DS    CL8                                                              
CALM6W4  DS    CL3     13   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   71    7  A  U H             T        Y              
CALM1W5H DS    CL8                                                              
CALM1W5  DS    CL3     14    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    6    7  A  U H             T        Y              
CALM2W5H DS    CL8                                                              
CALM2W5  DS    CL3     14   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   19    7  A  U H             T        Y              
CALM3W5H DS    CL8                                                              
CALM3W5  DS    CL3     14   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   32    7  A  U H             T        Y              
CALM4W5H DS    CL8                                                              
CALM4W5  DS    CL3     14   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   45    7  A  U H             T        Y              
CALM5W5H DS    CL8                                                              
CALM5W5  DS    CL3     14   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   58    7  A  U H             T        Y              
CALM6W5H DS    CL8                                                              
CALM6W5  DS    CL3     14   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   71    7  A  U H             T        Y              
CALM1W6H DS    CL8                                                              
CALM1W6  DS    CL3     15    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    6    7  A  U H             T        Y              
CALM2W6H DS    CL8                                                              
CALM2W6  DS    CL3     15   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   19    7  A  U H             T        Y              
CALM3W6H DS    CL8                                                              
CALM3W6  DS    CL3     15   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   32    7  A  U H             T        Y              
CALM4W6H DS    CL8                                                              
CALM4W6  DS    CL3     15   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   45    7  A  U H             T        Y              
CALM5W6H DS    CL8                                                              
CALM5W6  DS    CL3     15   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   58    7  A  U H             T        Y              
CALM6W6H DS    CL8                                                              
CALM6W6  DS    CL3     15   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   71    7  A  U H             T        Y              
CALHED2H DS    CL8                                                              
CALHED2  DS    CL78    16    2   78  A  P N             T        Y              
CALSUB2H DS    CL8                                                              
CALSUB2  DS    CL78    17    2   78  A  P N             T        Y              
CALM7W1H DS    CL8                                                              
CALM7W1  DS    CL3     18    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    6    7  A  U H             T        Y              
CALM8W1H DS    CL8                                                              
CALM8W1  DS    CL3     18   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   19    7  A  U H             T        Y              
CALM9W1H DS    CL8                                                              
CALM9W1  DS    CL3     18   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   32    7  A  U H             T        Y              
CALMAW1H DS    CL8                                                              
CALMAW1  DS    CL3     18   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   45    7  A  U H             T        Y              
CALMBW1H DS    CL8                                                              
CALMBW1  DS    CL3     18   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   58    7  A  U H             T        Y              
CALMCW1H DS    CL8                                                              
CALMCW1  DS    CL3     18   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   71    7  A  U H             T        Y              
CALM7W2H DS    CL8                                                              
CALM7W2  DS    CL3     19    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    6    7  A  U H             T        Y              
CALM8W2H DS    CL8                                                              
CALM8W2  DS    CL3     19   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   19    7  A  U H             T        Y              
CALM9W2H DS    CL8                                                              
CALM9W2  DS    CL3     19   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   32    7  A  U H             T        Y              
CALMAW2H DS    CL8                                                              
CALMAW2  DS    CL3     19   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   45    7  A  U H             T        Y              
CALMBW2H DS    CL8                                                              
CALMBW2  DS    CL3     19   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   58    7  A  U H             T        Y              
CALMCW2H DS    CL8                                                              
CALMCW2  DS    CL3     19   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   71    7  A  U H             T        Y              
CALM7W3H DS    CL8                                                              
CALM7W3  DS    CL3     20    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    6    7  A  U H             T        Y              
CALM8W3H DS    CL8                                                              
CALM8W3  DS    CL3     20   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   19    7  A  U H             T        Y              
CALM9W3H DS    CL8                                                              
CALM9W3  DS    CL3     20   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   32    7  A  U H             T        Y              
CALMAW3H DS    CL8                                                              
CALMAW3  DS    CL3     20   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   45    7  A  U H             T        Y              
CALMBW3H DS    CL8                                                              
CALMBW3  DS    CL3     20   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   58    7  A  U H             T        Y              
CALMCW3H DS    CL8                                                              
CALMCW3  DS    CL3     20   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   71    7  A  U H             T        Y              
CALM7W4H DS    CL8                                                              
CALM7W4  DS    CL3     21    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    6    7  A  U H             T        Y              
CALM8W4H DS    CL8                                                              
CALM8W4  DS    CL3     21   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   19    7  A  U H             T        Y              
CALM9W4H DS    CL8                                                              
CALM9W4  DS    CL3     21   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   32    7  A  U H             T        Y              
CALMAW4H DS    CL8                                                              
CALMAW4  DS    CL3     21   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   45    7  A  U H             T        Y              
CALMBW4H DS    CL8                                                              
CALMBW4  DS    CL3     21   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   58    7  A  U H             T        Y              
CALMCW4H DS    CL8                                                              
CALMCW4  DS    CL3     21   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   71    7  A  U H             T        Y              
CALM7W5H DS    CL8                                                              
CALM7W5  DS    CL3     22    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    6    7  A  U H             T        Y              
CALM8W5H DS    CL8                                                              
CALM8W5  DS    CL3     22   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   19    7  A  U H             T        Y              
CALM9W5H DS    CL8                                                              
CALM9W5  DS    CL3     22   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   32    7  A  U H             T        Y              
CALMAW5H DS    CL8                                                              
CALMAW5  DS    CL3     22   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   45    7  A  U H             T        Y              
CALMBW5H DS    CL8                                                              
CALMBW5  DS    CL3     22   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   58    7  A  U H             T        Y              
CALMCW5H DS    CL8                                                              
CALMCW5  DS    CL3     22   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   71    7  A  U H             T        Y              
CALM7W6H DS    CL8                                                              
CALM7W6  DS    CL3     23    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    6    7  A  U H             T        Y              
CALM8W6H DS    CL8                                                              
CALM8W6  DS    CL3     23   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   19    7  A  U H             T        Y              
CALM9W6H DS    CL8                                                              
CALM9W6  DS    CL3     23   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   32    7  A  U H             T        Y              
CALMAW6H DS    CL8                                                              
CALMAW6  DS    CL3     23   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   45    7  A  U H             T        Y              
CALMBW6H DS    CL8                                                              
CALMBW6  DS    CL3     23   54    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   58    7  A  U H             T        Y              
CALMCW6H DS    CL8                                                              
CALMCW6  DS    CL3     23   67    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   71    7  A  U H             T        Y              
CALPFKH  DS    CL8                                                              
CALPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
CALPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2320 BYTES                            
