*          DATA SET GERLPFED   AT LEVEL 003 AS OF 05/18/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF2DFED      DATE 05/18/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     5    2   20  L  P N             T        Y              
GLIGRPH  DS    CL8                                                              
GLIGRP   DS    CL18     5   23   18  A  U N             T        Y    1         
GLIGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     5   42   20  L  P N             T        Y              
GLIFRQH  DS    CL8                                                              
GLIFRQ   DS    CL18     5   63   18  A  U N             T        Y    2         
GLIFRQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     6    2   20  L  P N             T        Y              
GLIOTYPH DS    CL8                                                              
GLIOTYP  DS    CL18     6   23   18  A  U N             T        Y    3         
GLIOTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     6   42   20  L  P N             T        Y              
GLIDESTH DS    CL8                                                              
GLIDEST  DS    CL18     6   63   18  A  U N             T        Y    4         
GLIDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     7    2   20  L  P N             T        Y              
GLINXTRH DS    CL8                                                              
GLINXTR  DS    CL18     7   23   18  A  U N             T        Y    5         
GLINXTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     7   42   20  L  P N             T        Y              
GLILSTRH DS    CL8                                                              
GLILSTR  DS    CL18     7   63   18  A  U N             T        Y    6         
GLILSTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     8    2   20  L  P N             T        Y              
GLIENDH  DS    CL8                                                              
GLIEND   DS    CL18     8   23   18  A  U N             T        Y    7         
GLIENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     8   42   20  L  P N             T        Y              
GLINAMEH DS    CL8                                                              
GLINAME  DS    CL18     8   63   18  A  U N             T        Y    8         
GLINAMEX DS    CL8                                                              
GLIHD1H  DS    CL8                                                              
GLIHD1   DS    CL73    10    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     11    2    4  L  P H             T        Y              
GLIHD2H  DS    CL8                                                              
GLIHD2   DS    CL73    11    7   73  L  P H             T        Y              
GLIACT1H DS    CL8                                                              
GLIACT1  DS    CL4     12    2    4  A  U N             T        Y    9         
GLIACT1X DS    CL8                                                              
GLILIN1H DS    CL8                                                              
GLILIN1  DS    CL73    12    7   73  L  P H             T        Y              
GLIACT2H DS    CL8                                                              
GLIACT2  DS    CL4     13    2    4  A  U N             T        Y    9         
GLIACT2X DS    CL8                                                              
GLILIN2H DS    CL8                                                              
GLILIN2  DS    CL73    13    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    14    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     15    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    15    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     16    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    16    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     17    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    17    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     18    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    18    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     19    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    19    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     20    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    20    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     21    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    21    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     22    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    22    7   73  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     23    2    4  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    23    7   73  L  P H             T        Y              
GLIPFKH  DS    CL8                                                              
GLIPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
GLIPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1984 BYTES                            
