*          DATA SET GERLPFAD   AT LEVEL 003 AS OF 05/18/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TF2DFAD      DATE 05/18/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     5    2   20  L  P N             T        Y              
RGLGRPH  DS    CL8                                                              
RGLGRP   DS    CL8      5   23    8  A  U H             T        Y              
RGLDSCH  DS    CL8                                                              
RGLDSC   DS    CL24     5   45   24  L  P N             T        Y              
RGLGRPDH DS    CL8                                                              
RGLGRPD  DS    CL78     7    2   78  L  P H             T        Y              
RGLREQDH DS    CL8                                                              
RGLREQD  DS    CL78     8    2   78  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    10    2   20  L  P N             T        Y              
RGLSRCHH DS    CL8                                                              
RGLSRCH  DS    CL50    10   23   50  L  U N             T        Y    1         
RGLSRCHX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    12   23   20  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    12   45   20  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    13    2   20  L  P H             T        Y              
RGLRQRFH DS    CL8                                                              
RGLRQRF  DS    CL12    13   23   12  A  U N             T        Y    2         
RGLRQRFX DS    CL8                                                              
RGLRQRTH DS    CL8                                                              
RGLRQRT  DS    CL12    13   45   12  A  U N             T        Y    3         
RGLRQRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    14    2   20  L  P H             T        Y              
RGLOTYFH DS    CL8                                                              
RGLOTYF  DS    CL6     14   23    6  A  U N             T        Y    4         
RGLOTYFX DS    CL8                                                              
RGLOTYTH DS    CL8                                                              
RGLOTYT  DS    CL6     14   45    6  A  U N             T        Y    5         
RGLOTYTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    15    2   20  L  P H             T        Y              
RGLDSTFH DS    CL8                                                              
RGLDSTF  DS    CL10    15   23   10  A  U N             T        Y    6         
RGLDSTFX DS    CL8                                                              
RGLDSTTH DS    CL8                                                              
RGLDSTT  DS    CL10    15   45   10  A  U N             T        Y    7         
RGLDSTTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    16    2   20  L  P H             T        Y              
RGLRUNFH DS    CL8                                                              
RGLRUNF  DS    CL4     16   23    4  A  U N             T        Y    8         
RGLRUNFX DS    CL8                                                              
RGLRUNTH DS    CL8                                                              
RGLRUNT  DS    CL4     16   45    4  A  U N             T        Y    9         
RGLRUNTX DS    CL8                                                              
RGLPFKH  DS    CL8                                                              
RGLPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
RGLPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 800  BYTES                            
