*          DATA SET GESTATPRT  AT LEVEL 005 AS OF 07/14/08                      
PPVALUES DS    0X                  ** STATS VALUES FOR PRINTPAK **              
                                                                                
*                                  ** KEY FIELDS **                             
PPMEDCDE DS    C                   MEDIA CODE                                   
PPCLTCDE DS    CL3                 CLIENT CODE                                  
PPCLTNDE DS    XL(L'CFMADVN)       CLIENT NODE                                  
PPPRDCDE DS    CL3                 PRODUCT CODE                                 
PPPRDNDE DS    XL(L'CFMVENN)       PRODUCT NODE                                 
PPPUBCOD DS    XL6                 PUBLICATION CODE                             
PPVENNDE DS    XL(L'CFMVENN)       VENDOR NODE                                  
PPDATPER DS    XL(L'PBUYKDAT)      DATE/PERIOD                                  
PPPUBNAM DS    CL(L'PUBNAME)       PUBLICATION NAME                             
                                                                                
*                                  ** OPTIONAL FIELDS **                        
PPSPACE  DS    CL17                SPACE/DESCRIPTION                            
PPESTNUM DS    XL(L'PBUYKEST)      ESTIMATE NUMBER                              
                                                                                
*                                  ** ACCUMULATOR VALUES **                     
PPBUYS   DS    XL4                 NUMBER OF INSERTIONS                         
PPZBUYS  DS    XL4                 NUMBER OF ZERO COST INSERTIONS               
PPGROSSC DS    PL8                 GROSS COST (PENNIES)                         
PPNETC   DS    PL8                 NET COST (PENNIES)                           
                                                                                
PPESTNAM DS    CL(L'PESTNAME)      ESTIMATE NAME                                
                                                                                
PPVALUEL EQU   *-PPVALUES                                                       
