*          DATA SET GESTATNET  AT LEVEL 004 AS OF 08/01/08                      
NPVALUES DS    0X                  ** STATS VALUES FOR NETPAK **                
                                                                                
*                                  ** KEY FIELDS **                             
NPMEDCDE DS    C                   MEDIA CODE                                   
NPCLTCDE DS    CL3                 CLIENT CODE                                  
NPCLTNDE DS    XL(L'CFMADVN)       CLIENT NODE                                  
NPPRDCDE DS    CL3                 PRODUCT CODE                                 
NPPRDNDE DS    XL(L'CFMVENN)       PRODUCT NODE                                 
NPSTANET DS    XL(L'NUKNET)        STATION/NETWORK CODE                         
NPVENNDE DS    XL(L'CFMVENN)       VENDOR NODE                                  
NPDATPER DS    XL(L'NUKDATE)       DATE/PERIOD                                  
                                                                                
*                                  ** OPTIONAL FIELDS **                        
NPWKYROT DS    XL(L'NUDAY)         WEEKLY ROTATION                              
NPUNTLEN DS    XL(L'NULEN)         UNIT LENGTH                                  
NPPRGNAM DS    CL(L'NUPROGNM)      PROGRAM NAME                                 
NPPRGTIM DS    XL(L'NUTIME)        PROGRAM TIME                                 
NPESTNUM DS    XL(L'NUKDEST)       ESTIMATE NUMBER                              
                                                                                
*                                  ** ACCUMULATOR VALUES **                     
NPUNITS  DS    XL4                 NUMBER OF UNITS                              
NPZUNITS DS    XL4                 NUMBER OF ZERO COST UNITS                    
NPGROSS  DS    PL8                 GROSS COST (PENNIES)                         
NPNET    DS    PL8                 NET COST (PENNIES)                           
                                                                                
NPEDESC  DS    CL(L'EDESC)         ESTIMATE DESCRIPTION                         
                                                                                
NPVALUEL EQU   *-NPVALUES                                                       
