*          DATA SET GETADVCD   AT LEVEL 043 AS OF 12/13/91                      
GETADVCD DSECT                                                                  
*                                  USE TO COVER ENTRIES IN TABLE                
*                                  PRODUCED BY GETADVC                          
*                                                                               
GETVSYS  DS    CL1                 PRINT NUMBER I.E. "5" OF PRNT5               
GETVSE   DS    XL1                 SE NUMBER                                    
GETVAGY  DS    CL2                 AGENCY                                       
GETVACLT DS    CL3                 AGENCY CLIENT CODE                           
GETVVCLT DS    CL3                 ADVERTISER CLIENT                            
GETVSTRD DS    CL3                 START DATE - BINARY                          
GETVENDD DS    CL3                 END DATE - BINARY                            
GETVCNTL DS    CL4                 CONTROLS                                     
*                                                                               
GETVLEN  EQU   *-GETADVCD                                                       
