*          DATA SET GXPARMD    AT LEVEL 001 AS OF 08/28/18                      
***********************************************************************         
* GXTRACT PARAMETER BLOCK                                                       
***********************************************************************         
GXPARMD  DSECT                                                                  
GXPDXBLK DS    A                   A(DXBLOCK)                                   
*                                                                               
GXPFLAG1 DS    X                                                                
GXPF1_MULTIQ EQU X'01'             MULTIPLE RECORD TYPES EXTRACTED              
*                                                                               
GXPELCNT DS    X                   ELEMENT COUNT                                
GXPARMDLQ EQU  *-GXPARMD                                                        
