*          DATA SET GXRECID    AT LEVEL 002 AS OF 12/09/19                      
***********************************************************************         
* CONTRROL SYSTEM GENERAL EXTRACT RECORD TYPES                        *         
***********************************************************************         
GXDSTQ    DC   CL5'05521'          DARE STATION - NON-RADIO                     
GXPARQ    DC   CL5'05522'          DARE PARTNER                                 
GXFEAQ    DC   CL5'05523'          DARE FEATURE                                 
GXVENQ    DC   CL5'05524'          DARE VENDOR                                  
GXVEFQ    DC   CL5'05525'          DARE VENDOR FEATURE                          
GXIDIQ    DC   CL5'05526'          DARE PARTNER IDI                             
GXDSRQ    DC   CL5'05527'          DARE STATION - RADIO                         
GXBAGQ    DC   CL5'05528'          BUYING AGENCY RECORD                         
