*          DATA SET HEXOUTD    AT LEVEL 001 AS OF 01/10/74                      
*                        PARAMETER LIST FOR CSECT HEXOUT                        
HEXOUTD  DSECT                                                                  
HOAS     DS    F         A(SOURCE)                                              
HOAD     DS    F         A(DESTN)                                               
HOLS     DS    F         L'SOURCE                                               
HOAO     DS    F         A(OPTION)                                              
HOLD     DS    F         L'DESTN                                                
