*          DATA SET JHIGSPSFMD AT LEVEL 003 AS OF 11/06/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21770D      DATE 11/06/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DISMEDH  DS    XL8                                                              
DISMED   DS    CL1      5   10    1  A  U N             T    I   Y              
DISMEDNH DS    XL8                                                              
DISMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
DISCLTH  DS    XL8                                                              
DISCLT   DS    CL3      5   46    3  A  U N             T        Y              
DISCLTNH DS    XL8                                                              
DISCLTN  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
DISPRDH  DS    XL8                                                              
DISPRD   DS    CL3      6   10    3  A  U N             T        Y              
DISCODEH DS    XL8                                                              
DISCODE  DS    CL4      6   20    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P H             T        Y              
DISPRDNH DS    XL8                                                              
DISPRDN  DS    CL20     7   20   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
DISCPCDH DS    XL8                                                              
DISCPCD  DS    CL5      9   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
DISPCLSH DS    XL8                                                              
DISPCLS  DS    CL2     10   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
DISBNAMH DS    XL8                                                              
DISBNAM  DS    CL30    12   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   11    7  A  P N             T        Y              
DISADD1H DS    XL8                                                              
DISADD1  DS    CL30    13   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   11    7  A  P N             T        Y              
DISADD2H DS    XL8                                                              
DISADD2  DS    CL30    14   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   11    7  A  P N             T        Y              
DISADD3H DS    XL8                                                              
DISADD3  DS    CL30    15   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
DISFEEH  DS    XL8                                                              
DISFEE   DS    CL5     16   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL28    17    2   28  A  P N             T        Y              
DISFBASH DS    XL8                                                              
DISFBAS  DS    CL5     17   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   38    8  A  P N             T        Y              
DISCPCTH DS    XL8                                                              
DISCPCT  DS    CL8     17   47    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   56   10  A  P N             T        Y              
DISCBASH DS    XL8                                                              
DISCBAS  DS    CL5     17   68    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   20   15  A  P N             T        Y              
DISEMTHH DS    XL8                                                              
DISEMTH  DS    CL8     18   38    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
DISGCODH DS    XL8                                                              
DISGCOD  DS    CL1     19   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
DISPCODH DS    XL8                                                              
DISPCOD  DS    CL64    20   12   64  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
DISUP1H  DS    XL8                                                              
DISUP1   DS    CL32    21   26   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
DISUP2H  DS    XL8                                                              
DISUP2   DS    CL16    22   26   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
DISOPTH  DS    XL8                                                              
DISOPT   DS    CL67    23   10   67  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    24    2   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    24   14   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    24   27   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    24   41   10  A  P H             T        Y              
DISLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1032 BYTES                            
