*          DATA SET JSHRECID   AT LEVEL 028 AS OF 12/11/02                      
***********************************************************************         
* ACCOUNT SYSTEM EXTRACT RECORD TYPES                                 *         
***********************************************************************         
          SPACE 1                                                               
*NOTE THERE IS A 3 CHAR CODE ASSOCIATED WITH EACH OF THESE RECORDS              
*WHICH UNIQUELY DEFINES THE RECORD TYPE. IT IS USED WHEN RUNNING THE            
*EXTRACT FOR A SINGLE RECORD TYPE. IT ALSO GIVES THE NAME OF THE AX             
*BOOK WHICH RELATES TO THIS RECORD, AND THE RECORD`S ENTRY IN AXCNVX            
*WHICH BUILDS THE VARIABLE LENGTH TABLE ENTRIES FOR SQL RECORDS                 
*THE 3 CHAR CODE IS THE 4.5.6 CHARS OF THE EQUATE NAME -E.G. FOR THE            
*ADJUSTED RATE RECORD, THE 3 CHAR CODE IS ADR.                                  
          SPACE 2                                                               
AXDACDQ   DC   CL5'05001'         NOT USED IN TEMPO                             
AXDTRDQ   DC   CL5'05002'         NOT USED IN TEMPO                             
AXDADRQ   DC   CL5'05003'         ADJUSTED RATE                                 
AXDCALQ   DC   CL5'05004'         CALENDAR                                      
AXDCLIQ   DC   CL5'05005'         CLIENT                                        
AXDCPYQ   DC   CL5'05006'         COMPANY                                       
AXDCSRQ   DC   CL5'05007'         COST RATE                                     
AXDCSAQ   DC   CL5'05008'         COSTING ACCOUNT                               
AXDDEPQ   DC   CL5'05009'         DEPARTMENT                                    
AXDDEGQ   DC   CL5'05010'         DEPARTMENT GROUP                              
AXDHRSQ   DC   CL5'05011'         HOURS                                         
AXDINAQ   DC   CL5'05012'         INCOME ACCOUNT                                
AXDISAQ   DC   CL5'05013'         INCOME SUSPENSE ACCOUNT                       
AXDJOBQ   DC   CL5'05014'         JOB                                           
AXDLEDQ   DC   CL5'05015'         LEDGER                                        
AXDLESQ   DC   CL5'05016'         LEDGER STRUCTURE                              
AXDLOCQ   DC   CL5'05017'         LOCALITY                                      
AXDLCIQ   DC   CL5'05018'         LOCALITY INFORMATION                          
***       DC   CL5'05019'         * NOT USED *                                  
***       DC   CL5'05020'         * NOT USED *                                  
AXDMEDQ   DC   CL5'05021'         MEDIA                                         
AXDMGRQ   DC   CL5'05022'         MEDIA GROUP                                   
AXDNCTQ   DC   CL5'05023'         NON-CLIENT TIME ACCOUNT                       
AXDOFFQ   DC   CL5'05024'         OFFICE                                        
AXDOGRQ   DC   CL5'05025'         OFFICE GROUP                                  
AXDOFLQ   DC   CL5'05026'         OFFICE LIST                                   
AXDOLEQ   DC   CL5'05027'         OFFICE LIST ENTRY                             
AXDPEDQ   DC   CL5'05028'         PERIOD                                        
AXDPERQ   DC   CL5'05029'         PERSON                                        
AXDPEAQ   DC   CL5'05030'         PERSON ASSIGNMENT                             
AXDPROQ   DC   CL5'05031'         PRODUCT                                       
AXDRATQ   DC   CL5'05032'         RATE                                          
AXDSTHQ   DC   CL5'05033'         STANDARD HOURS                                
AXDSBDQ   DC   CL5'05034'         SUB-DEPARTMENT                                
AXDTSKQ   DC   CL5'05035'         TASK                                          
AXDTISQ   DC   CL5'05036'         TIMESHEET                                     
* NOTE:        TIMESHEETS DEALT WITH UNDER 'TAL'                                
AXDTALQ   DC   CL5'05037'         TIMESHEET ALLOCATION LINE                     
AXDTATQ   DC   CL5'05038'         TIMESHEET ALLOCATION TAX INFO                 
* NOTE:        TAX INFO DEALT WITH UNDER 'TAL'                                  
AXDOPTQ   DC   CL5'05039'         OPTION                                        
AXDP1RQ   DC   CL5'05040'         PERSON1R RECORDS                              
AXDPOFQ   DC   CL5'05041'         PRODUCTION OFFICE                             
AXDEDTQ   DC   CL5'05042'         EDIT HOURS                                    
AXDCAPQ   DC   CL5'05043'         COST ALLOCATION PROFILE                       
AXDPHIQ   DC   CL5'05044'         EXTRACTED COST RATES                          
AXDTGRQ   DC   CL5'05045'         TASK GROUP TABLE                              
