*          DATA SET KATZT      AT LEVEL 002 AS OF 04/23/96                      
         DC    CL8'A041T041'                                                    
         DC    CL8'A041T315'                                                    
         DC    CL8'A041T759'                                                    
         DC    CL8'A041T997'                                                    
         DC    CL8'A041TB03'                                                    
         DC    CL8'A041TD52'                                                    
         DC    CL8'A041TG46'                                                    
         DC    CL8'A041TM81'                                                    
         DC    CL8'A041TM82'                                                    
         DC    CL8'A117T117'                                                    
         DC    CL8'A117T769'                                                    
         DC    CL8'A117TF30'                                                    
         DC    CL8'A240T240'                                                    
         DC    CL8'A240T627'                                                    
         DC    CL8'B029T029'                                                    
         DC    CL8'B029T850'                                                    
         DC    CL8'B029T851'                                                    
         DC    CL8'B149T149'                                                    
         DC    CL8'B149T990'                                                    
         DC    CL8'B211T211'                                                    
         DC    CL8'B211T483'                                                    
         DC    CL8'B247T247'                                                    
         DC    CL8'C046T046'                                                    
         DC    CL8'C046T439'                                                    
         DC    CL8'C046T527'                                                    
         DC    CL8'C046T534'                                                    
         DC    CL8'C046T756'                                                    
         DC    CL8'C046T757'                                                    
         DC    CL8'C046T758'                                                    
         DC    CL8'C046TH10'                                                    
         DC    CL8'C046TH11'                                                    
         DC    CL8'C046TN00'                                                    
         DC    CL8'C103T103'                                                    
         DC    CL8'C103T325'                                                    
         DC    CL8'C223T223'                                                    
         DC    CL8'C223T395'                                                    
         DC    CL8'C223T417'                                                    
         DC    CL8'C223T429'                                                    
         DC    CL8'C223TB23'                                                    
         DC    CL8'C223TF31'                                                    
         DC    CL8'D033T033'                                                    
         DC    CL8'D033TC43'                                                    
         DC    CL8'D033TC85'                                                    
         DC    CL8'D033TF52'                                                    
         DC    CL8'D033TH12'                                                    
         DC    CL8'D033TH13'                                                    
         DC    CL8'D033TH14'                                                    
         DC    CL8'D037T037'                                                    
         DC    CL8'D037T322'                                                    
         DC    CL8'D037T355'                                                    
         DC    CL8'D037T419'                                                    
         DC    CL8'D037T548'                                                    
         DC    CL8'D037T563'                                                    
         DC    CL8'D037T760'                                                    
         DC    CL8'D037T761'                                                    
         DC    CL8'D037T773'                                                    
         DC    CL8'D037TL64'                                                    
         DC    CL8'D066T365'                                                    
         DC    CL8'D066T676'                                                    
         DC    CL8'D066T677'                                                    
         DC    CL8'D066T678'                                                    
         DC    CL8'D066T679'                                                    
         DC    CL8'D066T790'                                                    
         DC    CL8'D066TF94'                                                    
         DC    CL8'D093T751'                                                    
         DC    CL8'D093T752'                                                    
         DC    CL8'D093T841'                                                    
         DC    CL8'D093T842'                                                    
         DC    CL8'D093T843'                                                    
         DC    CL8'D093T844'                                                    
         DC    CL8'D093T845'                                                    
         DC    CL8'D093T846'                                                    
         DC    CL8'D093T847'                                                    
         DC    CL8'D093T848'                                                    
         DC    CL8'D093T976'                                                    
         DC    CL8'D093T977'                                                    
         DC    CL8'D093T978'                                                    
         DC    CL8'D093T979'                                                    
         DC    CL8'D093T980'                                                    
         DC    CL8'D093T981'                                                    
         DC    CL8'D093T982'                                                    
         DC    CL8'D093TD57'                                                    
         DC    CL8'D093TD68'                                                    
         DC    CL8'D093TD69'                                                    
         DC    CL8'D093TG38'                                                    
         DC    CL8'D093TG39'                                                    
         DC    CL8'D093TG96'                                                    
         DC    CL8'D093TI00'                                                    
         DC    CL8'D093TI01'                                                    
         DC    CL8'D093TI02'                                                    
         DC    CL8'D221T221'                                                    
         DC    CL8'D221T754'                                                    
         DC    CL8'D221T755'                                                    
         DC    CL8'D221TB11'                                                    
         DC    CL8'D221TH26'                                                    
         DC    CL8'DF89TF89'                                                    
         DC    CL8'DF89TF90'                                                    
         DC    CL8'DF89TG16'                                                    
         DC    CL8'DF89TG17'                                                    
         DC    CL8'DF89TG31'                                                    
         DC    CL8'DF89TM95'                                                    
         DC    CL8'E048T048'                                                    
         DC    CL8'E048T536'                                                    
         DC    CL8'E048T582'                                                    
         DC    CL8'E048T762'                                                    
         DC    CL8'E048T763'                                                    
         DC    CL8'E049T049'                                                    
         DC    CL8'E049T674'                                                    
         DC    CL8'E049T675'                                                    
         DC    CL8'E049TF97'                                                    
         DC    CL8'E049TF98'                                                    
         DC    CL8'E078T078'                                                    
         DC    CL8'E078T989'                                                    
         DC    CL8'E078TB08'                                                    
         DC    CL8'E078TH42'                                                    
         DC    CL8'E237T237'                                                    
         DC    CL8'E237T348'                                                    
         DC    CL8'F160T160'                                                    
         DC    CL8'G094T094'                                                    
         DC    CL8'G094T350'                                                    
         DC    CL8'G094T720'                                                    
         DC    CL8'G094TD89'                                                    
         DC    CL8'G096T096'                                                    
         DC    CL8'G098T098'                                                    
         DC    CL8'G098TC78'                                                    
         DC    CL8'G098TH70'                                                    
         DC    CL8'G098TK99'                                                    
         DC    CL8'G098TL00'                                                    
         DC    CL8'G098TM97'                                                    
         DC    CL8'G109T109'                                                    
         DC    CL8'G109T613'                                                    
         DC    CL8'G109T614'                                                    
         DC    CL8'G109T615'                                                    
         DC    CL8'G109T616'                                                    
         DC    CL8'G109T617'                                                    
         DC    CL8'G109T618'                                                    
         DC    CL8'G109T619'                                                    
         DC    CL8'G109T620'                                                    
         DC    CL8'G109T621'                                                    
         DC    CL8'G109T622'                                                    
         DC    CL8'G109T623'                                                    
         DC    CL8'G109T624'                                                    
         DC    CL8'G109T625'                                                    
         DC    CL8'G161T161'                                                    
         DC    CL8'G161T996'                                                    
         DC    CL8'G161TB26'                                                    
         DC    CL8'G195T195'                                                    
         DC    CL8'G195TG47'                                                    
         DC    CL8'G210T210'                                                    
         DC    CL8'G210TJ17'                                                    
         DC    CL8'H121T121'                                                    
         DC    CL8'H121T485'                                                    
         DC    CL8'H187T187'                                                    
         DC    CL8'H187T310'                                                    
         DC    CL8'H187T983'                                                    
         DC    CL8'H187T984'                                                    
         DC    CL8'H187T985'                                                    
         DC    CL8'I233T193'                                                    
         DC    CL8'I233T340'                                                    
         DC    CL8'I233T481'                                                    
         DC    CL8'J042T042'                                                    
         DC    CL8'J042T324'                                                    
         DC    CL8'J042T390'                                                    
         DC    CL8'J042T535'                                                    
         DC    CL8'J042T580'                                                    
         DC    CL8'J042T687'                                                    
         DC    CL8'J042T688'                                                    
         DC    CL8'J042T689'                                                    
         DC    CL8'J042T690'                                                    
         DC    CL8'J042T691'                                                    
         DC    CL8'J042T692'                                                    
         DC    CL8'J042T693'                                                    
         DC    CL8'J042T694'                                                    
         DC    CL8'J042T695'                                                    
         DC    CL8'J042T696'                                                    
         DC    CL8'J042T697'                                                    
         DC    CL8'J042T698'                                                    
         DC    CL8'J042T699'                                                    
         DC    CL8'J042T700'                                                    
         DC    CL8'J042T701'                                                    
         DC    CL8'J042T702'                                                    
         DC    CL8'J042T703'                                                    
         DC    CL8'J042T704'                                                    
         DC    CL8'J042T705'                                                    
         DC    CL8'J042T706'                                                    
         DC    CL8'J042TB39'                                                    
         DC    CL8'J042TB40'                                                    
         DC    CL8'J042TB41'                                                    
         DC    CL8'J042TF07'                                                    
         DC    CL8'J212T212'                                                    
         DC    CL8'J212T448'                                                    
         DC    CL8'J220T220'                                                    
         DC    CL8'J246T246'                                                    
         DC    CL8'J252T252'                                                    
         DC    CL8'J252T320'                                                    
         DC    CL8'J252TC40'                                                    
         DC    CL8'J252TC44'                                                    
         DC    CL8'J252TD99'                                                    
         DC    CL8'J252TF51'                                                    
         DC    CL8'K067T067'                                                    
         DC    CL8'K067T317'                                                    
         DC    CL8'K076T076'                                                    
         DC    CL8'K076T533'                                                    
         DC    CL8'K076T581'                                                    
         DC    CL8'K076T607'                                                    
         DC    CL8'K076T707'                                                    
         DC    CL8'K076T708'                                                    
         DC    CL8'K076T709'                                                    
         DC    CL8'K076T710'                                                    
         DC    CL8'K076T711'                                                    
         DC    CL8'K076T712'                                                    
         DC    CL8'K076T713'                                                    
         DC    CL8'K076T714'                                                    
         DC    CL8'K076T715'                                                    
         DC    CL8'K076T724'                                                    
         DC    CL8'K076T725'                                                    
         DC    CL8'K076TB35'                                                    
         DC    CL8'K076TF28'                                                    
         DC    CL8'K076TF50'                                                    
         DC    CL8'K076TF62'                                                    
         DC    CL8'K076TG30'                                                    
         DC    CL8'K076TG56'                                                    
         DC    CL8'K076TH68'                                                    
         DC    CL8'K076TH76'                                                    
         DC    CL8'K076TI48'                                                    
         DC    CL8'K076TI54'                                                    
         DC    CL8'K076TJ44'                                                    
         DC    CL8'K076TK69'                                                    
         DC    CL8'K076TK71'                                                    
         DC    CL8'KBCI100T'                                                    
         DC    CL8'KBCI102T'                                                    
         DC    CL8'KBMT900T'                                                    
         DC    CL8'KCCN300T'                                                    
         DC    CL8'KCCN301T'                                                    
         DC    CL8'KENS800T'                                                    
         DC    CL8'KENS803T'                                                    
         DC    CL8'KENS804T'                                                    
         DC    CL8'KESQ200T'                                                    
         DC    CL8'KFOR900T'                                                    
         DC    CL8'KFOR902T'                                                    
         DC    CL8'KFOR903T'                                                    
         DC    CL8'KFOR904T'                                                    
         DC    CL8'KFOR905T'                                                    
         DC    CL8'KFOR906T'                                                    
         DC    CL8'KFOR907T'                                                    
         DC    CL8'KFOR908T'                                                    
         DC    CL8'KFOR909T'                                                    
         DC    CL8'KFSM500T'                                                    
         DC    CL8'KFSM600T'                                                    
         DC    CL8'KGBT500T'                                                    
         DC    CL8'KGBT501T'                                                    
         DC    CL8'KGBT503T'                                                    
         DC    CL8'KGBT504T'                                                    
         DC    CL8'KGBT505T'                                                    
         DC    CL8'KGBT506T'                                                    
         DC    CL8'KIDK700T'                                                    
         DC    CL8'KIDK701T'                                                    
         DC    CL8'KIII400T'                                                    
         DC    CL8'KJEO200T'                                                    
         DC    CL8'KJEO201T'                                                    
         DC    CL8'KJEO202T'                                                    
         DC    CL8'KLAS500T'                                                    
         DC    CL8'KLAS502T'                                                    
         DC    CL8'KLAS503T'                                                    
         DC    CL8'KLRT400T'                                                    
         DC    CL8'KLRT402T'                                                    
         DC    CL8'KNXV400T'                                                    
         DC    CL8'KNXV401T'                                                    
         DC    CL8'KNXV402T'                                                    
         DC    CL8'KNXV404T'                                                    
         DC    CL8'KOCB700T'                                                    
         DC    CL8'KOCB701T'                                                    
         DC    CL8'KOINA00T'                                                    
         DC    CL8'KOINA01T'                                                    
         DC    CL8'KOMO500T'                                                    
         DC    CL8'KOMO501T'                                                    
         DC    CL8'KOMO502T'                                                    
         DC    CL8'KSNW800T'                                                    
         DC    CL8'KSNW803T'                                                    
         DC    CL8'KTBS600T'                                                    
         DC    CL8'KTBS601T'                                                    
         DC    CL8'KTBS604T'                                                    
         DC    CL8'KTBS701T'                                                    
         DC    CL8'KTBS702T'                                                    
         DC    CL8'KTBS703T'                                                    
         DC    CL8'KTBS704T'                                                    
         DC    CL8'KTBS705T'                                                    
         DC    CL8'KTBS706T'                                                    
         DC    CL8'KTBS707T'                                                    
         DC    CL8'KTBS708T'                                                    
         DC    CL8'KTBS709T'                                                    
         DC    CL8'KTBS70AT'                                                    
         DC    CL8'KTUL200T'                                                    
         DC    CL8'KTUL203T'                                                    
         DC    CL8'KTVD200T'                                                    
         DC    CL8'KTVD201T'                                                    
         DC    CL8'KTVD204T'                                                    
         DC    CL8'KTVD800T'                                                    
         DC    CL8'KTVN600T'                                                    
         DC    CL8'KTVN601T'                                                    
         DC    CL8'KUSI300T'                                                    
         DC    CL8'KUSI301T'                                                    
         DC    CL8'KUSI302T'                                                    
         DC    CL8'KZCR400T'                                                    
         DC    CL8'KZCR401T'                                                    
         DC    CL8'KZCR402T'                                                    
         DC    CL8'KZCR405T'                                                    
         DC    CL8'KZCR406T'                                                    
         DC    CL8'KZCR407T'                                                    
         DC    CL8'KZCR408T'                                                    
         DC    CL8'KZCR409T'                                                    
         DC    CL8'KZCR40AT'                                                    
         DC    CL8'KZCR40BT'                                                    
         DC    CL8'KZCR410T'                                                    
         DC    CL8'KZHO300T'                                                    
         DC    CL8'KZHO301T'                                                    
         DC    CL8'KZHO302T'                                                    
         DC    CL8'KZHO304T'                                                    
         DC    CL8'KZHO305T'                                                    
         DC    CL8'KZHO306T'                                                    
         DC    CL8'KZHO308T'                                                    
         DC    CL8'KZHO309T'                                                    
         DC    CL8'KZMI500T'                                                    
         DC    CL8'KZMI501T'                                                    
         DC    CL8'KZMI502T'                                                    
         DC    CL8'KZMI504T'                                                    
         DC    CL8'KZSF100T'                                                    
         DC    CL8'KZSF101T'                                                    
         DC    CL8'KZSF102T'                                                    
         DC    CL8'KZSF104T'                                                    
         DC    CL8'KZSF105T'                                                    
         DC    CL8'KZSF106T'                                                    
         DC    CL8'KZSF108T'                                                    
         DC    CL8'KZSF109T'                                                    
         DC    CL8'KZSF10AT'                                                    
         DC    CL8'KZSF10BT'                                                    
         DC    CL8'KZTA300T'                                                    
         DC    CL8'KZTA303T'                                                    
         DC    CL8'KZTA304T'                                                    
         DC    CL8'KZTA305T'                                                    
         DC    CL8'KZTA306T'                                                    
         DC    CL8'KZTA307T'                                                    
         DC    CL8'KZTA308T'                                                    
         DC    CL8'KZTA309T'                                                    
         DC    CL8'L023T023'                                                    
         DC    CL8'L023T542'                                                    
         DC    CL8'L028T028'                                                    
         DC    CL8'L028T106'                                                    
         DC    CL8'L028T371'                                                    
         DC    CL8'L028T418'                                                    
         DC    CL8'L028T547'                                                    
         DC    CL8'L028TB37'                                                    
         DC    CL8'L032T032'                                                    
         DC    CL8'L032T366'                                                    
         DC    CL8'L032T367'                                                    
         DC    CL8'L032T368'                                                    
         DC    CL8'L032T470'                                                    
         DC    CL8'L032T514'                                                    
         DC    CL8'L032T605'                                                    
         DC    CL8'L032T612'                                                    
         DC    CL8'L032T635'                                                    
         DC    CL8'L032T636'                                                    
         DC    CL8'L032T637'                                                    
         DC    CL8'L032T638'                                                    
         DC    CL8'L032T639'                                                    
         DC    CL8'L032T640'                                                    
         DC    CL8'L032T641'                                                    
         DC    CL8'L032T642'                                                    
         DC    CL8'L032T643'                                                    
         DC    CL8'L105T105'                                                    
         DC    CL8'L125TI39'                                                    
         DC    CL8'L125TI40'                                                    
         DC    CL8'L125TI41'                                                    
         DC    CL8'L130T130'                                                    
         DC    CL8'L130TC59'                                                    
         DC    CL8'L130TC60'                                                    
         DC    CL8'L172T172'                                                    
         DC    CL8'L172TC79'                                                    
         DC    CL8'L600T002'                                                    
         DC    CL8'L600T012'                                                    
         DC    CL8'L600T282'                                                    
         DC    CL8'L600T339'                                                    
         DC    CL8'L600T415'                                                    
         DC    CL8'L600T454'                                                    
         DC    CL8'L600T462'                                                    
         DC    CL8'L600T469'                                                    
         DC    CL8'L600T471'                                                    
         DC    CL8'L600T472'                                                    
         DC    CL8'L600T474'                                                    
         DC    CL8'L600T549'                                                    
         DC    CL8'L600T550'                                                    
         DC    CL8'L600T551'                                                    
         DC    CL8'L600T552'                                                    
         DC    CL8'L600T596'                                                    
         DC    CL8'L600T597'                                                    
         DC    CL8'L620T356'                                                    
         DC    CL8'L620TG89'                                                    
         DC    CL8'L620TG99'                                                    
         DC    CL8'L620TH00'                                                    
         DC    CL8'L620TH01'                                                    
         DC    CL8'L620TH02'                                                    
         DC    CL8'L620TH03'                                                    
         DC    CL8'L620TH04'                                                    
         DC    CL8'L620TH05'                                                    
         DC    CL8'L620TH06'                                                    
         DC    CL8'L620TH08'                                                    
         DC    CL8'L620TH09'                                                    
         DC    CL8'L620TH27'                                                    
         DC    CL8'L620TH72'                                                    
         DC    CL8'L620TH87'                                                    
         DC    CL8'L620TH88'                                                    
         DC    CL8'L640T437'                                                    
         DC    CL8'L640T446'                                                    
         DC    CL8'L640T999'                                                    
         DC    CL8'L640TG59'                                                    
         DC    CL8'L640TH98'                                                    
         DC    CL8'L640TH99'                                                    
         DC    CL8'L640TI14'                                                    
         DC    CL8'L640TI38'                                                    
         DC    CL8'L640TI42'                                                    
         DC    CL8'L640TI43'                                                    
         DC    CL8'L640TI44'                                                    
         DC    CL8'L640TQ84'                                                    
         DC    CL8'L660T138'                                                    
         DC    CL8'L660T303'                                                    
         DC    CL8'L660T377'                                                    
         DC    CL8'L660T378'                                                    
         DC    CL8'L660T380'                                                    
         DC    CL8'L660T382'                                                    
         DC    CL8'L660T569'                                                    
         DC    CL8'L660T957'                                                    
         DC    CL8'L660T995'                                                    
         DC    CL8'L660TA88'                                                    
         DC    CL8'L660TA89'                                                    
         DC    CL8'L660TA90'                                                    
         DC    CL8'L660TA92'                                                    
         DC    CL8'L660TA93'                                                    
         DC    CL8'L660TA94'                                                    
         DC    CL8'L660TA95'                                                    
         DC    CL8'L660TA97'                                                    
         DC    CL8'L660TB16'                                                    
         DC    CL8'L660TB19'                                                    
         DC    CL8'L660TB20'                                                    
         DC    CL8'L660TH30'                                                    
         DC    CL8'L660TH31'                                                    
         DC    CL8'L660TH33'                                                    
         DC    CL8'L660TH74'                                                    
         DC    CL8'L660TM98'                                                    
         DC    CL8'L680T393'                                                    
         DC    CL8'L680T396'                                                    
         DC    CL8'L680T401'                                                    
         DC    CL8'L680T402'                                                    
         DC    CL8'L680T403'                                                    
         DC    CL8'L680T447'                                                    
         DC    CL8'L680T500'                                                    
         DC    CL8'L680T560'                                                    
         DC    CL8'L680T598'                                                    
         DC    CL8'L680TA82'                                                    
         DC    CL8'L680TA96'                                                    
         DC    CL8'L6A0T006'                                                    
         DC    CL8'L6A0T014'                                                    
         DC    CL8'L6A0T308'                                                    
         DC    CL8'L6A0T360'                                                    
         DC    CL8'L6A0T373'                                                    
         DC    CL8'L6A0T374'                                                    
         DC    CL8'L6A0T375'                                                    
         DC    CL8'L6A0T376'                                                    
         DC    CL8'L6A0T379'                                                    
         DC    CL8'L6A0T383'                                                    
         DC    CL8'L6A0T593'                                                    
         DC    CL8'L6A0TA39'                                                    
         DC    CL8'L6C0T458'                                                    
         DC    CL8'L6C0T531'                                                    
         DC    CL8'L6C0T532'                                                    
         DC    CL8'L6C0T570'                                                    
         DC    CL8'L6C0T571'                                                    
         DC    CL8'L6C0T572'                                                    
         DC    CL8'L6C0T573'                                                    
         DC    CL8'L6C0T574'                                                    
         DC    CL8'L6C0T575'                                                    
         DC    CL8'L6C0T576'                                                    
         DC    CL8'L6C0T577'                                                    
         DC    CL8'L6C0T578'                                                    
         DC    CL8'L6C0T579'                                                    
         DC    CL8'L6C0T972'                                                    
         DC    CL8'L6C0T973'                                                    
         DC    CL8'L6E0T392'                                                    
         DC    CL8'L6E0T427'                                                    
         DC    CL8'L6E0T428'                                                    
         DC    CL8'L6E0T431'                                                    
         DC    CL8'L6E0T433'                                                    
         DC    CL8'L6E0T435'                                                    
         DC    CL8'L6E0T494'                                                    
         DC    CL8'L6E0T495'                                                    
         DC    CL8'L6E0T509'                                                    
         DC    CL8'L6E0T513'                                                    
         DC    CL8'L6E0T518'                                                    
         DC    CL8'L6E0T590'                                                    
         DC    CL8'L6E0T601'                                                    
         DC    CL8'L6E0T602'                                                    
         DC    CL8'L6E0T603'                                                    
         DC    CL8'L6E0T604'                                                    
         DC    CL8'L6E0T998'                                                    
         DC    CL8'L6E0TG80'                                                    
         DC    CL8'LB00T001'                                                    
         DC    CL8'LB00T009'                                                    
         DC    CL8'LB00T015'                                                    
         DC    CL8'LB00T277'                                                    
         DC    CL8'LB00T307'                                                    
         DC    CL8'LB00T311'                                                    
         DC    CL8'LB00T312'                                                    
         DC    CL8'LB00T326'                                                    
         DC    CL8'LB00T369'                                                    
         DC    CL8'LB00T460'                                                    
         DC    CL8'LB00T520'                                                    
         DC    CL8'LB00T521'                                                    
         DC    CL8'LB00T555'                                                    
         DC    CL8'LB00T685'                                                    
         DC    CL8'LB00T753'                                                    
         DC    CL8'LB00T770'                                                    
         DC    CL8'LB00T771'                                                    
         DC    CL8'LB00TD73'                                                    
         DC    CL8'LB00TD75'                                                    
         DC    CL8'LB00TD77'                                                    
         DC    CL8'LB00TD78'                                                    
         DC    CL8'LB00TD79'                                                    
         DC    CL8'LB00TD90'                                                    
         DC    CL8'LB00TG78'                                                    
         DC    CL8'LB20T003'                                                    
         DC    CL8'LB20T008'                                                    
         DC    CL8'LB20T011'                                                    
         DC    CL8'LB20T056'                                                    
         DC    CL8'LB20T364'                                                    
         DC    CL8'LB20T372'                                                    
         DC    CL8'LB20T793'                                                    
         DC    CL8'LB20T794'                                                    
         DC    CL8'LB20TA72'                                                    
         DC    CL8'LB20TA75'                                                    
         DC    CL8'LB20TA76'                                                    
         DC    CL8'LB20TA77'                                                    
         DC    CL8'LB20TA78'                                                    
         DC    CL8'LB20TA79'                                                    
         DC    CL8'LB20TA80'                                                    
         DC    CL8'LB20TA81'                                                    
         DC    CL8'LB20TA83'                                                    
         DC    CL8'LB20TA84'                                                    
         DC    CL8'LB20TA85'                                                    
         DC    CL8'LB20TA86'                                                    
         DC    CL8'LB20TD70'                                                    
         DC    CL8'LB20TG60'                                                    
         DC    CL8'LB40T869'                                                    
         DC    CL8'LB40T870'                                                    
         DC    CL8'LB40T871'                                                    
         DC    CL8'LB40T872'                                                    
         DC    CL8'LB40T873'                                                    
         DC    CL8'LB40T874'                                                    
         DC    CL8'LB40T875'                                                    
         DC    CL8'LB40T876'                                                    
         DC    CL8'LB40T877'                                                    
         DC    CL8'LB40T878'                                                    
         DC    CL8'LB40T879'                                                    
         DC    CL8'LB40T880'                                                    
         DC    CL8'LB40T881'                                                    
         DC    CL8'LB40T882'                                                    
         DC    CL8'LB40T883'                                                    
         DC    CL8'LB40T884'                                                    
         DC    CL8'LB40T885'                                                    
         DC    CL8'LB40T886'                                                    
         DC    CL8'LB60T887'                                                    
         DC    CL8'LB60T888'                                                    
         DC    CL8'LB60T889'                                                    
         DC    CL8'LB60T890'                                                    
         DC    CL8'LB60T891'                                                    
         DC    CL8'LB60T892'                                                    
         DC    CL8'LB60T893'                                                    
         DC    CL8'LB60T894'                                                    
         DC    CL8'LB60T895'                                                    
         DC    CL8'LB60T896'                                                    
         DC    CL8'LB60T897'                                                    
         DC    CL8'LB60T898'                                                    
         DC    CL8'LB60T899'                                                    
         DC    CL8'LB60T900'                                                    
         DC    CL8'LB60T901'                                                    
         DC    CL8'LB60T902'                                                    
         DC    CL8'LB60T903'                                                    
         DC    CL8'LB60T904'                                                    
         DC    CL8'LB60T905'                                                    
         DC    CL8'LB60T906'                                                    
         DC    CL8'LB60T907'                                                    
         DC    CL8'LB60T908'                                                    
         DC    CL8'LB60T909'                                                    
         DC    CL8'LB60T910'                                                    
         DC    CL8'LB60T911'                                                    
         DC    CL8'LB60T912'                                                    
         DC    CL8'LB60T913'                                                    
         DC    CL8'LB60T914'                                                    
         DC    CL8'LB60T915'                                                    
         DC    CL8'LB60T916'                                                    
         DC    CL8'LB60T917'                                                    
         DC    CL8'LB60T918'                                                    
         DC    CL8'LB80T919'                                                    
         DC    CL8'LB80T920'                                                    
         DC    CL8'LB80T921'                                                    
         DC    CL8'LB80T922'                                                    
         DC    CL8'LB80T923'                                                    
         DC    CL8'LB80T924'                                                    
         DC    CL8'LB80T925'                                                    
         DC    CL8'LB80T926'                                                    
         DC    CL8'LB80T927'                                                    
         DC    CL8'LB80T928'                                                    
         DC    CL8'LB80T929'                                                    
         DC    CL8'LB80T930'                                                    
         DC    CL8'LB80T931'                                                    
         DC    CL8'LB80T932'                                                    
         DC    CL8'LB80T933'                                                    
         DC    CL8'LB80T934'                                                    
         DC    CL8'LB80T935'                                                    
         DC    CL8'LB80T936'                                                    
         DC    CL8'LB80T937'                                                    
         DC    CL8'LB80T938'                                                    
         DC    CL8'LB80T940'                                                    
         DC    CL8'LB80T941'                                                    
         DC    CL8'LBA0T381'                                                    
         DC    CL8'LBA0TC42'                                                    
         DC    CL8'LBA0TC45'                                                    
         DC    CL8'LBA0TD30'                                                    
         DC    CL8'LBA0TD31'                                                    
         DC    CL8'LBA0TD32'                                                    
         DC    CL8'LBA0TD33'                                                    
         DC    CL8'LBA0TD65'                                                    
         DC    CL8'LBA0TE13'                                                    
         DC    CL8'LBA0TE59'                                                    
         DC    CL8'LBA0TE65'                                                    
         DC    CL8'LBA0TF01'                                                    
         DC    CL8'LBA0TF10'                                                    
         DC    CL8'LBA0TF11'                                                    
         DC    CL8'LBA0TF27'                                                    
         DC    CL8'LBA0TF54'                                                    
         DC    CL8'LBE0TB07'                                                    
         DC    CL8'LBE0TF81'                                                    
         DC    CL8'LBE0TG19'                                                    
         DC    CL8'LBF0TJ20'                                                    
         DC    CL8'LBF0TJ21'                                                    
         DC    CL8'LBF0TJ22'                                                    
         DC    CL8'LBF0TJ40'                                                    
         DC    CL8'M043T043'                                                    
         DC    CL8'M043T488'                                                    
         DC    CL8'M043T493'                                                    
         DC    CL8'M043T501'                                                    
         DC    CL8'M043T502'                                                    
         DC    CL8'M043T524'                                                    
         DC    CL8'M043T524'                                                    
         DC    CL8'M043T631'                                                    
         DC    CL8'M043T668'                                                    
         DC    CL8'M043T669'                                                    
         DC    CL8'M043T670'                                                    
         DC    CL8'M043T671'                                                    
         DC    CL8'M043T672'                                                    
         DC    CL8'M043T745'                                                    
         DC    CL8'M043T768'                                                    
         DC    CL8'M043T852'                                                    
         DC    CL8'M043T974'                                                    
         DC    CL8'M043TB22'                                                    
         DC    CL8'M043TB54'                                                    
         DC    CL8'M043TC41'                                                    
         DC    CL8'M043TC64'                                                    
         DC    CL8'M043TD28'                                                    
         DC    CL8'M043TD55'                                                    
         DC    CL8'M043TF64'                                                    
         DC    CL8'M043TH34'                                                    
         DC    CL8'M043TH35'                                                    
         DC    CL8'M043TH36'                                                    
         DC    CL8'M043TH37'                                                    
         DC    CL8'M043TI80'                                                    
         DC    CL8'M043TI81'                                                    
         DC    CL8'M043TI82'                                                    
         DC    CL8'M043TI83'                                                    
         DC    CL8'M043TI84'                                                    
         DC    CL8'M043TI85'                                                    
         DC    CL8'M043TI86'                                                    
         DC    CL8'M043TI87'                                                    
         DC    CL8'M043TI88'                                                    
         DC    CL8'N102T102'                                                    
         DC    CL8'N102T726'                                                    
         DC    CL8'N124T124'                                                    
         DC    CL8'N124T465'                                                    
         DC    CL8'N124T522'                                                    
         DC    CL8'N124TB06'                                                    
         DC    CL8'N176T176'                                                    
         DC    CL8'N176T306'                                                    
         DC    CL8'N176T840'                                                    
         DC    CL8'R045T045'                                                    
         DC    CL8'R045T529'                                                    
         DC    CL8'R045T543'                                                    
         DC    CL8'R045T544'                                                    
         DC    CL8'R045T586'                                                    
         DC    CL8'R045T737'                                                    
         DC    CL8'R045T738'                                                    
         DC    CL8'R045T739'                                                    
         DC    CL8'R045T740'                                                    
         DC    CL8'R045T741'                                                    
         DC    CL8'R045TE09'                                                    
         DC    CL8'R045TI24'                                                    
         DC    CL8'R218T218'                                                    
         DC    CL8'R218TB04'                                                    
         DC    CL8'R222T222'                                                    
         DC    CL8'R222TB10'                                                    
         DC    CL8'RA45TF85'                                                    
         DC    CL8'RA45TG18'                                                    
         DC    CL8'RA45TG55'                                                    
         DC    CL8'T044T044'                                                    
         DC    CL8'T044T540'                                                    
         DC    CL8'T044T541'                                                    
         DC    CL8'T044T585'                                                    
         DC    CL8'T044T733'                                                    
         DC    CL8'T044T734'                                                    
         DC    CL8'T044T735'                                                    
         DC    CL8'T044T736'                                                    
         DC    CL8'T044TB05'                                                    
         DC    CL8'T194T194'                                                    
         DC    CL8'T216T216'                                                    
         DC    CL8'T216T591'                                                    
         DC    CL8'T216TG28'                                                    
         DC    CL8'T44AT118'                                                    
         DC    CL8'T44ATF79'                                                    
         DC    CL8'T44ATF80'                                                    
         DC    CL8'U051T051'                                                    
         DC    CL8'U051T453'                                                    
         DC    CL8'U051T539'                                                    
         DC    CL8'U051T784'                                                    
         DC    CL8'U051TH40'                                                    
         DC    CL8'U104T104'                                                    
         DC    CL8'U104T729'                                                    
         DC    CL8'V036T036'                                                    
         DC    CL8'V036T341'                                                    
         DC    CL8'V036T561'                                                    
         DC    CL8'V036T764'                                                    
         DC    CL8'V036T765'                                                    
         DC    CL8'V036TG88'                                                    
         DC    CL8'V189TF67'                                                    
         DC    CL8'WALB200T'                                                    
         DC    CL8'WALB201T'                                                    
         DC    CL8'WALB701T'                                                    
         DC    CL8'WALB703T'                                                    
         DC    CL8'WBIR201T'                                                    
         DC    CL8'WBIR203T'                                                    
         DC    CL8'WCCB100T'                                                    
         DC    CL8'WCCB101T'                                                    
         DC    CL8'WCIV600T'                                                    
         DC    CL8'WCPX402T'                                                    
         DC    CL8'WCPX404T'                                                    
         DC    CL8'WCPX405T'                                                    
         DC    CL8'WCTI700T'                                                    
         DC    CL8'WCTI702T'                                                    
         DC    CL8'WFTS600T'                                                    
         DC    CL8'WFTS601T'                                                    
         DC    CL8'WFTS602T'                                                    
         DC    CL8'WFTS604T'                                                    
         DC    CL8'WFTS605T'                                                    
         DC    CL8'WFTS607T'                                                    
         DC    CL8'WFTS608T'                                                    
         DC    CL8'WHNT800T'                                                    
         DC    CL8'WHNT801T'                                                    
         DC    CL8'WHNT802T'                                                    
         DC    CL8'WMAZ300T'                                                    
         DC    CL8'WMAZ301T'                                                    
         DC    CL8'WNCNB00T'                                                    
         DC    CL8'WNCNB01T'                                                    
         DC    CL8'WNFT500T'                                                    
         DC    CL8'WNFT501T'                                                    
         DC    CL8'WNFT502T'                                                    
         DC    CL8'WPEC300T'                                                    
         DC    CL8'WPEC302T'                                                    
         DC    CL8'WPEC304T'                                                    
         DC    CL8'WRBL900T'                                                    
         DC    CL8'WREG900T'                                                    
         DC    CL8'WREG901T'                                                    
         DC    CL8'WTTO400T'                                                    
         DC    CL8'WTTO401T'                                                    
         DC    CL8'WTTO402T'                                                    
         DC    CL8'WTVF600T'                                                    
         DC    CL8'WTVF602T'                                                    
         DC    CL8'WTVF604T'                                                    
         DC    CL8'WTVF605T'                                                    
         DC    CL8'WTVF606T'                                                    
         DC    CL8'WTVF607T'                                                    
         DC    CL8'WTVF608T'                                                    
         DC    CL8'WTVF609T'                                                    
         DC    CL8'WTVF60AT'                                                    
         DC    CL8'WTVF60BT'                                                    
         DC    CL8'WTVF60CT'                                                    
         DC    CL8'WTVF60DT'                                                    
         DC    CL8'WTVF60ET'                                                    
         DC    CL8'WTVF60FT'                                                    
         DC    CL8'WTVF610T'                                                    
         DC    CL8'WTVF611T'                                                    
         DC    CL8'WTVF612T'                                                    
         DC    CL8'WVLA100T'                                                    
         DC    CL8'WVLA102T'                                                    
         DC    CL8'WVLA105T'                                                    
         DC    CL8'WVLA106T'                                                    
         DC    CL8'WVLA107T'                                                    
         DC    CL8'WVLA108T'                                                    
         DC    CL8'WVLA109T'                                                    
         DC    CL8'WVLA10AT'                                                    
         DC    CL8'WVLA10BT'                                                    
         DC    CL8'WVLA10CT'                                                    
         DC    CL8'WVLA10DT'                                                    
         DC    CL8'WVLA10ET'                                                    
         DC    CL8'WXII200T'                                                    
         DC    CL8'WXII201T'                                                    
         DC    CL8'WXII202T'                                                    
         DC    CL8'WYFF800T'                                                    
         DC    CL8'WYFF801T'                                                    
         DC    CL8'WYFF804T'                                                    
         DC    CL8'WYFF805T'                                                    
         DC    CL8'X022T022'                                                    
         DC    CL8'X022T400'                                                    
         DC    CL8'X022T525'                                                    
         DC    CL8'X022T628'                                                    
         DC    CL8'X022T645'                                                    
         DC    CL8'X022T646'                                                    
         DC    CL8'X022T647'                                                    
         DC    CL8'X022T648'                                                    
         DC    CL8'X022T649'                                                    
         DC    CL8'X022T650'                                                    
         DC    CL8'X022T651'                                                    
         DC    CL8'X022T652'                                                    
         DC    CL8'X022T653'                                                    
         DC    CL8'X022T654'                                                    
         DC    CL8'X022T655'                                                    
         DC    CL8'X022T656'                                                    
         DC    CL8'X022T657'                                                    
         DC    CL8'X022T658'                                                    
         DC    CL8'X022T659'                                                    
         DC    CL8'X022T660'                                                    
         DC    CL8'X022T661'                                                    
         DC    CL8'X022T849'                                                    
         DC    CL8'X022T854'                                                    
         DC    CL8'X022TB24'                                                    
         DC    CL8'X022TB34'                                                    
         DC    CL8'X022TH61'                                                    
         DC    CL8'X022TH75'                                                    
         DC    CL8'X022TM99'                                                    
         DC    CL8'X113T113'                                                    
         DC    CL8'X113TL61'                                                    
         DC    CL8'X113TL62'                                                    
