*          DATA SET LTLREC     AT LEVEL 005 AS OF 06/14/83                      
LTLREC   DS    0C                  ** PRINTPAK PUB SUPPLEMENTAL REC **          
LTLKEY   DS    0CL25                                                            
LTLKMED  DS    CL1       A         MEDIA                                        
LTLKPUB  DS    CL4       PWOS      PUB                                          
LTLKZON  DS    CL1       PWOS      ZONE                                         
LTLKED   DS    CL1       A         EDITION                                      
LTLKAGY  DS    CL2       A         AGENCY CODE                                  
LTLKCOD  DS    X'85'     B         RECORD CODE                                  
         DS    CL15                SPARE                                        
*                                                                               
         DS    CL2       B         RECORD LENGTH                                
         DS    CL2       B         CONTROL BYTES                                
         DS    CL4       B         DISK ADDRESS                                 
*                                                                               
*                                                                               
*                                                                               
* ELEMENT - DESCRIPTION            CODE  NO.  COMMENTS                          
* ---------------------            ----  ---  --------                          
* PUBSPREL  PRODUCTION SUPPL.      X'21' 0-1                                    
* PUBDSTEL  CLT-DIV-REG-DST        X'71' 0-N                                    
