*          DATA SET MEDEMFILED AT LEVEL 067 AS OF 11/04/11                      
* CMOL 067 04NOV11 ADD SKYFUBU6, SKYFUBU7 AND ANIXE           PR002189          
* CBLA 066 29SEP11 SECONDS IN C0 PROG PASSIVE KEYS            OT68247L          
* PWES 065 08AUG11 ADD COMMENTS FOR FILESETS                  BR43305L          
* CMOL 064 04JUL11 ADD SPIEGEL TV GESCHICHTE (SPIEGELG)       PR001961          
* MMCA 063 16JUN11 ADD GERMAN SKY SPORTS 3 AND 4              PR001887          
* CBLA 062 19APR11 CORRECTIONS TO COMMENTS ON HEADER CONTENTS PR000974          
* CBLA 061 11APR11 FINAL CHANGES FOR BIGGER KEYS              PR000974          
* JMUR 060 22MAR11 ALLOW IRISH ATT.IN ATT.BRAND GROUPS        PR001199          
* DLOW 059 11JAN11 NEW GERMAN ONLY MEDZ CONTROL REC           PR000613          
* CBLA 058 20DEC10 PREP WORK FOR BIGGER KEYS                  PR000974          
* CBLA 057 15NOV10 INCREASE MAX RECLEN FOR DEMO FILES         PR001149          
* CBLA 056 05NOV10 DEMSTBIQ FOR IRISH QTRS THAT GOT 2 BIG     OT63700L          
* MMCA 055 01NOV10 ADD MOTORVISION                            PR001009          
* DLOW 053 05OCT10 RESUSE OF DESPTICQ FOR TAM2010 +1DAY LIVES PR000889          
* DLOW 052 01SEP10 NEW DEM 'HOUSEKEEPING' IN PROGRESS SETTING PR000311          
* CMOL 051 13JUL10 ADD SKY CINEMA HITS HD AND SKY ACTION HD   PR000511          
* DLOW 050 10JUN10 NEW ROI CONTROL DATES/PUSH NEW AMEND DATES LO01-9842         
* MMCA 049 04JUN10 ADD SIXX                                   PR000372          
*                  ADD BONGUSTO                               PR000372          
* MMCA 048 16APR10 GERMAN DSF -> SPORT1                       PR000159          
*                  ADD FUSSBALL SPORT BUNDESLIGA 2            PR000168          
*                  NEW DATES FOR AMEND UPDATES                LO01-9842         
* MMCA 047 26MAR10 ADD GERMAN STATION MGM                     LO01-9980         
* CBLA 046 10MAR10 REMOVE DEAD WEEK NUMBER REFS               LO01-9436         
* MMCA 045 05MAR10 NEW GERMAN STATIONS                        DU01-9952         
* MMCA 044 16FEB10 ALLOCATE FIVEMIN REC S4C INDICATOR BIT     BR30477L          
* DCHA 043 01FEB10 MMS 'IRISH' EQUATE                         LO01-9740         
* DLOW             NEW PAS MERGE XOVER EQUATE ON B3 HEADER    LO01-9192         
* MMCA 042 13NOV09 ADD MORE GERMAN SKY STATIONS               DU01-9501         
* CBLA 041 05OCT09 INCREASE PMAXFLMQ AGAIN FOR DEMHDR                           
* MMCA 040 22SEP09 ADD HD PLATFORM IN IBTS                    LO01-8209         
* MMCA 039 11AUG09 ADD HD PLATFORM IN SPOT/PROG/SLOT/IBTS     LO01-8209         
* DLOW 038 06AUG09 NEW 'OTHER' PLATFORM BIT GIVING '7F'       LO01-9223         
* DLOW 037 31JUL09 NEW DEMSPNOQ FOR 2010 - PROGDATA ON DMO... LO01-9192         
* MMCA 036 16JUL09 ADD MORE GERMAN SKY STATIONS               DU01-9143         
* MMCA 035 07JUL09 ADD GERMAN SKY STATIONS                    DU01-9061         
* JMUR 034 01APR09 REMOVE EQUATE DEKB.PHIQ (MAX BR CDE 150000)LO01-8789         
* DLOW 033 16MAY08 SPOT MISCEL REVAMP/BUG FIX                 BR17713L          
* MMCA 032 30JAN08 NEW GERMAN STATIONS - SAT1 COM, KABEL1 CLA OT17439L          
* MMCA 031 29OCT07 NEW GERMAN STATIONS                        DU01-6945         
* DLOW 030 31JUL07 DESPTSHQ DEFUNCT                           LO01-6684         
* DLOW 029 01JUN07 REWORD/CLARIFY  2002 DEFINITIONS           LO01-6363         
* DLOW 028 16MAY07 REMOVE PRE-BARB 2002 DEFINITIONS           LO01-6363         
* MMCA 027 02MAY07 ADD 13TH ST FOR GERMANY                    DU01-6416         
*                  ADD HIST CHAN, SCIFI, BIOGRAPHY - GERMANY  DU01-6415         
* DLOW 026 26APR07 PAS CODES IN DEHPDCOD/DEKHBCOD NOW XL5     LO01-6284         
* MMCA 025 26MAR07 INCREASE PMAXFLMQ FROM 400000->550000      BR11585L          
* DLOW 024 01MAR07 SLIGHT CHANGES TO L023                     LO01-6174         
* CBLA 023 12FEB07 NEW DECNTUCI EQUATES / COMMENTS            LO01-6174         
* DLOW 022 26JAN07 ADD 'DEBCKPPQ' PIB=PENULTIMATE             LO01-5701         
* MMCA 021 23JAN07 ADD COMEDY CENTRAL FOR GERMANY             DU01-6122         
* DLOW 020 07NOV06 PMAXFLMQ FROM 350000->400000                                 
* MMCA 019 31OCT06 ADD CHAMPS TV FOR GERMANY                  DU01-5772         
* PWES 018 23AUG06 ADD DMAX FOR GERMANY (MEDZ CTL REC)        LO01-5725         
* MMCA 017 18AUG06 NEW GERMAN TERRANOVA AND NRW.TV            DU01-5645         
* PWES 016 05JUN06 LABEL FOR IRISH WEEKLY PROGS IN DEDCD      LO03-0000         
* MMCA 015 18MAY06 CHANGE DEMSLODR RECORD TYPE                LO01-5459         
* DLOW 014 14MAR06 NEW CHANNEL ACTIVITY BIT FOR ROI CHAN 6    LO01-5233         
* DLOW 013 13MAR06 NEW MAXFILM EQUATE FOR PEELING-PMAXFLMQ    LO01-4652         
* PWES 012 15FEB06 GROUP MAXIMUMS EQUS + NOTE OBSOLETE ITEMS  LO01-4849         
*                  ADD GERMAN PREMEIRE (10)                   DU01-5197         
* MMCA 011 06JAN05 ADD GERMAN TVW                             DU01-5071         
* DLOW 010 20DEC05 NOTE IN RESPECT OF DESPMXNQ (>63)          LO01-4652         
* DLOW 009 14DEC05 NEW CHANNEL ACTIVITY BIT FOR ULSTER->ROI   LO01-4652         
* PWES 008 21SEP05 ADD VIERTE FOR GERMANY (MEDZ CTL REC)      LO01-4652         
* PWES 007 01SEP05 TVMB-OPTIMISATION RULES IN MEDZ CTL DETCEL LO01-4658         
* DLOW 006 11AUG05 ADD DEKBNIFQ - IRISH 88888 BRAND           LO01-4480         
* DLOW 005 11AUG05 IRISH (FILM) CLOCK NUMBERS                 LO01-4480         
* MMCA 004 05JUL05 REMOVE DEGATNGQ                            LO01-4418         
* MMCA 003 27JUN05 REMOVE DEKABSRQ/DEMSAPNQ/DEKAPTRQ          LO01-4272         
* PWES 002 27MAY05 TVMB - LOAD DATE/TIME IN MEDZ CTL DEDCEL'S LO01-4357         
* MMCA 001 27MAY05 ADD TABLE DATES ELEM TO MEDZ CONTROL REC   LO01-4327         
*                  ADD EURONEWS FOR GERMANY                   DU01-4354         
* -----------------------------------------------------------------             
*                                                                               
* DSECTS TO COVER DEMOGRAPHIC SYSTEM RECORDS ON MEDFILE AND DEMFILE             
* -----------------------------------------------------------------             
*                                                                               
* ********  DEMOGRAPHIC RECORD TYPES ON MEDFILE ********                        
*                                                                               
*           .. = 00, * = COMPLEMENTED                                           
*                                                                               
* RECORD    ---------------------KEY DISPLACEMENT----------------------         
*  TYPE     00 01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19         
*                                                                               
*           ****** PRIME POINTERS *************************************         
*                                                                               
* SPONCOPY  00 A0 SPONSORSHIP FILMCOPY CODE 2005+------------> .. .. ..         
*                                                                               
* CONTROL   00 B0 .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. ..         
*                                                                               
* BRAND     00 B1 .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. -DEMPRO-         
*                                                                               
* PROGRAMME 00 B3 .. .. .. .. .. .. .. .. .. .. .. .. .. .. CY -DEMPRG-         
* (ADVANCE) 00 B7 .. .. .. .. .. .. .. .. .. .. .. .. .. .. CY DS -PRG-         
* (NOTE - COUNTRY - CY - IS NULL FOR UK RECORDS)                                
*                                                                               
* MMS GRP   00 B5 .. .. .. .. 05 MMSGP .. .. .. .. .. .. .. .. SU SU 00         
*                                                                               
* ROI GROUP 00 B5 .. .. .. .. 80 -ROI GROUP- .. .. .. .. .. .. 00 00 00         
*                                                                               
* USER BGRP A0 B5 .. .. .. .. 00 -AGY USER BRAND GROUP CODE--- SU MN SQ         
*                                                                               
* USER FGRP A0 B6 .. .. .. .. 00 -AGY USER FILM GROUP CODE---- SU MN SQ         
*                                                                               
* USER PGRP A0 B9 .. .. .. .. 00 -AGY USER PROG GROUP CODE---- SU 00 SQ         
*                                                                               
* ABSTRACT  00 B8 .. DEFUNCT. .. .. .. .. .. DS AR -PRG- CDATE TOPIC PG         
*                                                                               
* ITVA FILM 00 BA -AGENCY- -CLI- -PRO- -NUMBER- -LENGTH- --ADDITIONAL--         
*                                                                               
* GENRE     00 D6 .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. - CODE -         
*                                                                               
* UNIVERSE  00 E4 .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. *CDAT AR         
*                                                                               
* SPOT ACTV 00 EA .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. ..         
*                                                                               
*           ****** PASSIVE POINTERS ***********************************         
*                                                                               
* AGB BRND  00 B2 .. .. .. .. .. .. C1 -AGB BRAND---- 40 40 40 -*DEMPRO         
*                                                                               
* ROI BRND  00 B2 .. .. .. .. .. .. C5 -ROI BRAND- 40 40 40 40 -*DEMPRO         
*                                                                               
* MMS  GPTR 00 B6 .. .. .. .. 05 MMSGP 40 40 SU SU -DEMPRO- 00 00 00 00         
*                                                                               
*      GPTR 00 B6 .. .. .. .. 06 -DEMPRO- MMSGP 4040 SU SU  00 00 00 00         
*                                                                               
*      GPTR 00 B6 .. .. .. .. 07 MMSGP 40 40 00 00 -DEMPRO- 00 00 00 00         
*                                                                               
* ROI  GPTR 00 B6 .. .. .. .. 80 -ROI GROUP- 00 00 -DEMPRO- -IRISHCODE-         
*                                                                               
*      GPTR 00 B6 .. .. .. .. 81 -DEMPRO- ROI GROUP- 00 00  -IRISHCODE-         
*                                                                               
* BRND SRCH 00 E0 B1 .. .. .. .. .. ------STANDARD SEARCH KEY DATA-----         
*                                                                               
* AGB  PROG 00 B4 .. .. .. .. .. .. C1 --AGB PROG CODE-- 40 40 -*DEMPRG         
*                                                                               
* TOPS PROG 00 B4 .. .. .. .. .. .. E3 .. .. .. .. .. -TOPSCD- -*DEMPRG         
*                                                                               
* PROG TOPS 00 B4 .. .. .. .. .. .. D7 -DEMPRG- -TOPSCD- -.............         
*                                                                               
* PROG SRCH 00 E0 B3 .. .. .. .. .. ------STANDARD SEARCH KEY DATA-----         
*                                                                               
         EJECT                                                                  
* ********  DEMOGRAPHIC RECORD TYPES ON DEMFILE ********                        
*                                                                               
*           .. = 00, * = COMPLEMENTED                                           
*                                                                               
* RECORD    ------KEY DISPLACEMENT-------    -STATUS BYTES-                     
*  TYPE     00 01 02 03 04 05 06 07 08 09    01 02 03 04 05                     
*                                                                               
*           ****** PRIME POINTERS *******                                       
*                                                                               
* HEADER    00 00 00 00 00 00 00 00 00 **    S. .. .. .. ..                     
*                                     (**=00,01,02,03)                          
*                                                                               
* BUCKET    10 AR CH DATE SPTLN DP  .. ..    S. .. .. .. ..                     
*           12 AR CH DATE SPTLN 00  .. ..    S. .. .. .. ..                     
*           14 AR CH DATE 0000  DP  .. ..    S. .. .. .. ..                     
*           16 AR CH DATE 0000  00  .. ..    S. .. .. .. ..                     
*           X'02' BIT = ALL DAYPARTS                                            
*           X'04' BIT = ALL SPOTLENGTHS                                         
*                                                                               
* QTR HOUR  20 .. .. .. AR .. CDATE ETIME    SD .. XX .. MB XX WAS DPT          
*                                                                               
* SLOT      30 .. .. .. AR CH CDATE ETIME    SD .. XX .. MB XX WAS DPT          
*                                                                               
* PROGRAMME 40 -DEMPRG- AR CH *CDAT *STIM    SD XX XX MINSB XX WAS DPT          
* (ADVANCE) 48 DS -PRG- AR CH *CDAT *STIM    SD XX XX MINSB                     
*                                                                               
* SPOT      50 -DEMPRO- AR CH CDATE SQ ..    SD DP XX DSECB XX WAS DP2          
*                                                                               
* BLOKTOTS  70 AR CH AU MD BLOK  * IMPS *    S. $$ $$ $$ $$                     
*           71 AR CH AU MD BLOK  * IMPS *    S. $$ $$ $$ $$                     
*           72 AR CH AU MD BLOK  * IMPS *    S. $$ $$ $$ $$                     
*                                                                               
* TRAILER   ** FF FF FF FF FF FF FF FF FF    S. .. .. .. ..                     
*          (** = FC,FD,FE,FF)                                                   
*                                                                               
*           ****** PASSIVE POINTERS *****                                       
*                                                                               
* PROG/TIME C0 AR CH CDATE ETIME -DEMPRG-    SD DPMSK MINSB                     
* (ADVANCE) C8 AR CH CDATE ETIME DS -PRG-    SD DPMSK MINSB                     
*                                                                               
* PROG/HIST C1 -DEMPRG- *CDAT *STIM AR CH    SD DPMSK MINSB                     
* (ADVANCE) C9 DS -PRG- *CDAT *STIM AR CH    SD DPMSK MINSB                     
*                                                                               
* PROG/BLK  C2  - GERMAN GFK BLOCK NUMBER BREAK PASSIVES - SEE DEKPRBRQ         
* (ADVANCE) CA  - AS ABOVE                                                      
*                                                                               
* SPOT/TIME D0 AR CH CDATE -DEMPRO- SQ ..    SD DPMSK DSECB                     
* SLOT/BLK  D1  - GERMAN GFK BLOCK NUMBER BREAK PASSIVES - SEE DEKSLBRQ         
*                                                                               
* BLOKTOTS  F0 AR CH AU MD TIME  * IMPS *    S. $$ $$ $$ $$                     
*           F1 AR CH AU MD TIME  * IMPS *    S. $$ $$ $$ $$                     
*           F2 AR CH AU MD TIME  * IMPS *    S. $$ $$ $$ $$                     
                                                                                
* THE CHANNEL CODE BYTE IS USED AS FOLLOWS                                      
*                                                                               
*    B'000CCCCC' - NORMAL TRANSMISSION AREA, CCCCC IS CHANNEL NUMBER,           
*                  AREA BYTE DEFINES AREA - ITV, MACRO OR NETWORK.              
*    B'010CCCCC' - 'MEMO' TRANSMISSION, CCCCC IS CHANNEL NUMBER, AREA           
*                  BYTE DEFINES MEMO AREA - ITV, MACRO OR NETWORK.              
*                  A MEMO TRANSMISSION IS A DUMMY TRANSMISSION RECORD           
*                  SHOWING AN AREA'S SHARE OF A REAL NETWORK, MACRO OR          
*                  BBC TRANSMISSION, OR THE NETWORK SUM OF REAL AREAS.          
*    B'110CCCCC' - TVAM OR GMTV 'MEMO' TRANSMISSION. SAME AS ABOVE, BUT         
*                  X'80' BIT DISTINGUISHES TVAM/GMTV 'MEMO' FROM OTHER          
*                  'MEMO' TRANSMISSIONS, AS FOR EXAMPLE WITH CHANNEL 3          
*                  TRANSMISSIONS IN A C4 MACRO AREA.                            
         EJECT                                                                  
*        FILE STRUCTURE                                                         
*        --------------                                                         
                                                                                
* DEMOGRAPHIC DATA IS HELD IN A SET OF DEDICATED FILES UNDER MEDZ.              
                                                                                
* 'HEADER' RECORDS, I.E. BRAND HEADERS AND PROGRAMME HEADERS, BRAND             
* POINTER RECORDS, BRAND GROUP RECORDS AND UNIVERSE DATA ARE ALL HELD           
* ON MEDFILZ AND MEDDIRZ AND USE THE STANDARD MEDIA RECORD STRUCTURE.           
*                                                                               
* AGENCY BRAND GROUP RECORDS ARE HELD ON THE AGENCY'S OWN MEDIA FILES.          
                                                                                
* TRANSMISSION PERFORMANCE RECORDS, I.E. QUARTER HOUR, SLOT, PROGRAMME          
* AND SPOT TRANSMISSION DATA, ARE ALL HELD IN A SET OF FILES WITHIN             
* MEDZ, COLLECTIVELY REFERRED TO AS DEMFILES.                                   
*                                                                               
* THE DEMFILES USE THE STANDARD DDS DIRECTORY/FILE STRUCTURE,                   
* EXCEPT THAT EACH DIRECTORY MAY POINT TO MORE THAN ONE FILE.                   
*                                                                               
* THE DEMFILES ARE SPLIT INTO TWO SETS, KNOWN AS DEMNEW AND DEMOLD.             
                                                                                
* DEMNEW CONTAINS 'CURRENT' TRANSMISSION DATA, WHILE DEMOLD CONTAINS            
* 'ARCHIVE' DATA GOING BACK FOR UP TO FIVE COMPLETE YEARS IN ADDITION           
* TO THE CURRENT YEAR.                                                          
*                                                                               
* DEMNEW CONSISTS OF TWO FILES AND A DIRECTORY. DMNDIR IS THE DIRECTORY         
* POINTING TO BOTH FILES. STATUS BYTE 1 INDICATES WHICH OF THE FILES A          
* DIRECTORY RECORD POINTS TO. DMNOLD IS THE MAIN BODY OF THE FILE AND           
* IS READ ONLY. IT CONTAINS DATA FOR THE MOST RECENT 12 TO 18 MONTHS,           
* EXCEPT THE LATEST MONTH, WHICH IS HELD IN DMNNEW. DMNNEW AND DMNOLD           
* ARE BOTH UPDATIVE, ALLOWING SPOT MATCHING TO EITHER, AND DMNNEW IS            
* THE FILE TO WHICH NEW BARB DATA IS ADDED.                                     
*                                                                               
* EVERY MONTH, DATA IS TRANSFERRED FROM DMNNEW TO DMNOLD SO THAT DMNNEW         
* CONTAINS ANYTHING UP TO 5 WEEKS WORTH OF DATA, DEPENDING ON THE TIME          
* WITHIN THE QUARTERLY CYCLE. A RECORD IS ELIGIBLE FOR TRANSFER WHEN IT         
* IS NO LONGER SUBJECT TO UPDATE BY NEW BARB DATA.                              
                                                                                
* DEMOLD CONSISTS OF FOUR FILES AND A DIRECTORY AND CONTAINS DATA FOR           
* THE YEARS PRIOR TO DEMNEW. DMODIR IS THE DIRECTORY POINTING TO                
* ALL FOUR FILES. STATUS BYTE 1 INDICATES WHICH FILE EACH DIRECTORY             
* RECORD POINTS TO. DMO1FL CONTAINS DATA FOR THE MOST RECENT YEAR, WITH         
* DMO2FL, DMO3FL AND DMO4FL CARRYING EACH PREVIOUS YEAR. ALL FOUR               
* FILES, AND THE DIRECTORY, ARE READ ONLY.                                      
*                                                                               
* EVERY YEAR, AROUND JANUARY, DMO4FL DATA IS DELETED AND DATA IS                
* TRANSFERRED BACKWARDS FROM DMO3FL TO DMO4FL, DMO2FL TO DMO3FL AND             
* DMO1FL TO DMO2FL. THE FIRST HALF OF THE YEAR'S DATA ON DMNOLD IS THEN         
* MOVED INTO DMO1FL.                                                            
* SIX MONTHS LATER, AROUND JULY, THE SECOND HALF YEAR'S DATA IS MOVED           
* FROM DMNOLD TO DMO1FL                                                         
                                                                                
* IN AN EARLIER VERSION OF THE SYSTEM, AGB BRANDS WHOSE BRAND CODE HAD          
* BEEN REUSED WERE GIVEN THE DUMMY BRAND CODE 'AXXXXXX'. LATER VERSIONS         
* ALLOW MULTIPLE GENERATIONS. THIS DUMMY CODE IS IGNORED WHEN CREATING          
* AGB BRAND CODE PASSIVES.                                                      
         EJECT                                                                  
***********************************************************************         
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                     *         
*        DEMOGRAPHIC RECORDS ON  M E D F I L E                        *         
*                                                                     *         
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
DEMMKEY  DS    0XL20               MEDFILE KEY                                  
DEMMKAG  DS    XL1                 AGENCY IF AGENCY GROUP RECORD                
DEMMKTYP DS    XL1                 RECORD TYPE                                  
         DS    XL18                                                             
DEMMKEND DS    0C                  END OF KEY                                   
*                                                                               
DEMMKSTA DS    0XL8                DIRECTORY STATUS BYTES                       
DEMMKSTC DS    XL1                 DIR CONTROL STATUS                           
DEMMDELQ EQU   X'80'               STATUS = RECORD DELETED                      
DEMMKSTR DS    XL7                 DIR STATUS BYTE 2-8                          
*                                                                               
DEMMKDA  DS    XL4                 DIRECTORY DISK ADDR                          
*                                                                               
DEMMDLNQ EQU   *-DEMMKEY           DIRECTORY RECORD LENGTH                      
                                                                                
         ORG   DEMMKEND                                                         
DEMMRLEN DS    XL2                 RECORD LENGTH                                
*                                                                               
DEMMRSTA DS    0XL8                RECORD STATUS BYTES                          
DEMMRSTC DS    XL1                 REC CONTROL STATUS                           
DEMMRSTR DS    XL7                 REC STATUS BYTE 2-8                          
*                                                                               
DEMMCNTL DS    XL4                 RECORD LINKAGE                               
*                                                                               
DEMMRDEL DS    XL1                 DUMMY ELEMENT CODE (X'02')                   
DEMMRDLN DS    XL1                 DUMMY ELEMENT LENGTH (2)                     
*                                                                               
DEMMFRST DS    0C                  FIRST ELEMENT ADDRESS                        
DEMMRLNQ EQU   *-DEMMKEY           DISP TO FIRST ELEMENT                        
                                                                                
DEMMSTDQ EQU   DEMMRSTA-DEMMKSTA   DISP DIFF BETWEEN DIR & REC STATUS           
         EJECT                                                                  
* ELEMENT USAGE                                                                 
*                                                                               
* MEDFILE  RECORD TYPE   DESCRIPTION                                            
* ELEMENT  -----------   -----------                                            
*                                                                               
*  X'0A'   LOAD CONTROL  GENERAL DEM SYSTEM CONTROL                             
*  X'0B'   LOAD CONTROL  DATA LOAD CONTROL                                      
*  X'0C'   LOAD CONTROL  PENDING DATA LOAD CONTROL                              
*  X'10'   2002 CONTROL  DATA LOAD CONTROL                                      
*  X'11'   2002 CONTROL  PENDING DATA LOAD CONTROL                              
*  X'0D'   LOAD CONTROL  ADVANCE PROGRAMME DATA LOAD CONTROL                    
*  X'0E'   LOAD CONTROL  GERMAN PROGRAMME DATA LOAD CONTROL                     
*  X'10'   BRAND HEADER  BRAND HEADER ELEMENT                                   
*  X'10'   ABSTRACT      ABSTRACT ELEMENT                                       
*  X'10'   TRANSMISSION  TRANSMISSION DETAIL BITMAP                             
*  X'10'   NEWIN         TITLE ELEMENT                                          
*  X'11'   PTR HEADER    BRAND POINTER ELEMENT                                  
*  X'11'   ITVA FILM     ITVA FILM ELEMENT                                      
*  X'12'   PROG HEADER   PROGRAMME HEADER ELEMENT                               
*  X'13'   BRAND/PRG HDR CHANNEL ACTIVITY ELEMENT                               
*  X'18'   BRAND GROUP   GROUP SEQUENCE LIST (GROUP HEADERS ONLY)               
*  X'20'   ANY HEADER    FULL NAME ELEMENT                                      
*  X'20'   BRAND GROUP   BRAND GROUP NAME    (GROUP HEADERS ONLY)               
*  X'20'   ABSTRACT      ABSTRACT TEXT ELEMENT                                  
*  X'20'   NEWIN         DETAIL TEXT ELEMENT                                    
*  X'22'   GENRE HEADER  SHORT NAME ELEMENT                                     
*  X'30'   BRAND HEADER  ROI GROUP POINTER ELEMENT - IRISH BRANDS               
*  X'31'   BRAND HEADER  NIELSEN ATTRIBUTION ELEM  - IRISH BRANDS               
*  X'35'   PROG HEADER   LONG NAME           (UK)                               
*  X'40'   BRAND GROUP   DEMPRO STRING       (STRING RECORDS ONLY)              
*  X'42'   BRAND GROUP   SAVED BUILD FILTERS                                    
*  X'44'   BRAND GROUP   HIGH DATE SPOT/PGM DATA                                
*  X'46'   BRAND GROUP   PASSWORD                                               
*  X'50'   FILM GROUP    FILM                                                   
*  X'52'   BRAND GROUP   ATTRIBUTION ELEMENT                                    
*  X'54'   BRAND GROUP   TARGET AUDIENCE                                        
*  X'66'   SPONSOR       PROG/EVENT                                             
*  X'67'   SPONSOR       PROG SUPPLEMENTARY DATA                                
*  X'68'   SPONSOR       SALESHOUSE                                             
         EJECT                                                                  
***********************************************************************         
* DEMFILE LOAD CONTROL RECORD - <<MEDZFILE>>                          *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
DEKCNTR  DS    XL1                 RECORD TYPE                                  
DEKCNTRQ EQU   X'B0'                                                            
DEKCNTCY DS    XL1                 COUNTRY - NULL IF UK, 01=GERMANY             
         DS    XL17                NULLS                                        
*                                                                               
         ORG   DEMMKSTR            STATUS BYTE USAGE (NONE)                     
                                                                                
         ORG   DEMMFRST            STATUS BYTE USAGE (NONE)                     
DECNTD   EQU   *                                                                
DECNTEL  DS    XL1                 DEMFILE GENERAL CONTROL ELEMENT              
DECNTELQ EQU   X'0A'                                                            
DECNTLEN DS    XL1                                                              
         DS    XL3                 SPARE                                        
         DS    XL3                 SPARE                                        
DECNTUPD DS    0XL8                UPDATE CONTROL FIELDS                        
DECNTUCI DS    XL1                 UPDATE CONTROL BYTE                          
DECNTCVQ EQU   X'80'               CVESPOT JOB IN PROGRESS                      
DECNTUPQ EQU   X'40'               DEMOUPD IN PROGRESS                          
DECNTGBQ EQU   X'40'               GBPCONV IN PROGRESS                          
DECNTUSQ EQU   X'20'               DEMOUPD RUNNING IS A SPOT ONE                
DECNTISQ EQU   X'10'               DEMOUPD RUNNING IS IRISH                     
DECNTAMQ EQU   X'08'               AMENDSU JOB IN PROGRESS                      
DECNTDBQ EQU   X'04'               DEMBUCK JOB IN PROGRESS                      
DECNTHKQ EQU   X'02'               DEM WKLY HOUSEKEEPING IN PROGRESS            
DECNTATQ EQU   X'01'               ATTRIBUTION UPDATE IN PROGRESS               
DECNTUCF DS    0XL7                UPDATE CONTROL FIELDS                        
DECNTUDT DS    XL2                 DATE OF UPDATE                               
DECNTUTM DS    XL2                 TIME OF UPDATE                               
DECNTUGN DS    XL3                 DMNNEW GENERATION AFTER UPDATE               
DECNTLNQ EQU   *-DECNTEL                                                        
         EJECT                                                                  
***********************************************************************         
* DEMFILE DATE CONTROL ELEMENT - BARB 2002 ONWARDS                    *         
***********************************************************************         
                                                                                
DEDCD    DSECT                                                                  
DEDCEL   DS    XL1       +00                                                    
DEDCELLQ EQU   X'10'               LIVE DATE CONTROL ELEMENT                    
DEDCELPQ EQU   X'11'               PENDING DATE CONTROL ELEMENT, WHEN           
DEDCLEN  DS    XL1       +01                                                    
DEDCTYP  DS    XL1       +02       TYPE OF DATA                                 
DEDCTBQ  EQU   C'B'                - BREAKS                                     
DEDCTFQ  EQU   C'F'                - FIVE MINUTES                               
DEDCTMQ  EQU   C'M'                - MINUTES                                    
DEDCTPQ  EQU   C'P'                - PROGRAMMES                                 
DEDCTQQ  EQU   C'Q'                - QUARTERS (BARB STOPS 31DEC2001)            
DEDCTSQ  EQU   C'S'                - SPOTS                                      
*                                  * BARB DATES *                               
DEDCBACT DS    XL4       +03       DATE/TIME LAST LOAD (ACTY SECS) TVMB         
DEDCBOLD DS    XL2       +07       OLDEST BARB DATA                             
DEDCBLIV DS    XL2       +09       LATEST LIVE DATA                             
DEDCBCON DS    XL2       +11       LATEST CONSOLIDATED DATA                     
DEDCBCVL DS    XL2       +13       LOWEST CVE BUILD DATE                        
DEDCBCVH DS    XL2       +15       LATEST CVE BUILD DATE                        
         DS    XL2       +17       SPARE                                        
*                                  * IRISH DATES *                              
DEDCIACT DS    XL4       +19       DATE/TIME LAST LOAD (ACTY SECS)              
DEDCIOLD DS    XL2       +23       OLDEST IRISH DATA                            
DEDCILAT DS    XL2       +25       LATEST IRISH DATA                            
DEDCIWB  DS    XL2       +27       LATEST WEEKLY CROSS BORDER BREAKS            
DEDCIWK  DS    0XL2      +29       LATEST IRISH WEEKLY (PROGS/SPOTS)            
DEDCIWS  DS    XL2       +29       LATEST NON-ROI WEEKLY IRISH SPOTS            
DEDCICVL DS    XL2       +31       LOWEST CVE BUILD DATE                        
DEDCICVH DS    XL2       +33       LATEST CVE BUILD DATE                        
*                                  * TAM 2010 NEW DATES *                       
DEDCIDC  DS    XL2       +35       LATEST IRISH DAILY  CONS DATE                
DEDCIWC  DS    XL2       +37       LATEST IRISH WEEKLY CONS DATE                
DEDCIWL  DS    XL4       +39       DATE/TIME LAST LOAD IWEEKLY (ACTY)           
         DS    XL2       +43       SPARE                                        
*                                  * AMEND DATES *                              
DEDCBAM  DS    XL4       +45       LATEST BARB AMENDED DATE (ACTY SECS)         
DEDCIAM  DS    XL4       +49       LATEST ROI  AMENDED DATE (ACTY SECS)         
         DS    XL8                 SPARE                                        
DEDCLNQ  EQU   *-DEDCD                                                          
                                                                                
***********************************************************************         
* DEMFILE ADVANCE PROG CONTROL ELEMENT                                *         
***********************************************************************         
                                                                                
DEAPCD   DSECT                                                                  
DEAPCEL  DS    XL1                                                              
DEAPCELQ EQU   X'0D'                                                            
DEAPCLEN DS    XL1                                                              
DEAPCAS  DS    XL1                 ADVANCE PGM SOURCE (SEE DEKHDRAS)            
*                                                                               
DEAPCLOD DS    XL2                 DATE LAST LOADED                             
DEAPCPDL DS    XL2                 EARLIEST PGM DETAIL REC (DEMFILE)            
DEAPCPDH DS    XL2                 LATEST PGM DETAIL REC (DEMFILE)              
DEAPCDPG DS    XL2                 HIGHEST ADV DEMPROG                          
DEAPCLNQ EQU   *-DEAPCD            LENGTH OF FIXED PART                         
*                                  COULD ALSO HOLD REGION(S) ACTIVE             
                                                                                
***********************************************************************         
* DMGFILE GERMAN PROG CONTROL ELEMENT                                 *         
***********************************************************************         
                                                                                
DEGPCD   DSECT                                                                  
DEGPCEL  DS    XL1                                                              
DEGPCELQ EQU   X'0E'                                                            
DEGPCLEN DS    XL1                                                              
DEGPCSUP DS    XL1                   SUPPLIER                                   
DEGPCARQ EQU   C'A'         =X'C1' - ARD                                        
DEGPCBRQ EQU   C'B'         =X'C2' - BR                                         
DEGPCNWQ EQU   C'C'         =X'C3' - ARDNW                                      
DEGPCDSQ EQU   C'D'         =X'C4' - SPORT1 (WAS DSF)                           
DEGPNEUQ EQU   C'E'         =X'C5' - NEU LIVE                                   
DEGPCMTQ EQU   C'F'         =X'C6' - MTV                                        
DEGPCM2Q EQU   C'G'         =X'C7' - MTV 2                                      
DEGPCHRQ EQU   C'H'         =X'C8' - HR                                         
DEGPTL5Q EQU   C'I'         =X'C9' - TELE 5                                     
DEGPCK1Q EQU   C'K'         =X'D2' - KABEL1/DKK (MGM)                           
DEGPCMDQ EQU   C'M'         =X'D4' - MDR                                        
DEGPCNIQ EQU   C'N'         =X'D5' - NICKELODEON                                
DEGPCSOQ EQU   C'O'         =X'D6' - SFB+ORB                                    
DEGPCP7Q EQU   C'P'         =X'D7' - PRO7 (MGM)                                 
DEGPCRTQ EQU   C'R'         =X'D9' - RTL (INC RTL2/SUPERRTL PRE FEB01)          
DEGPCS1Q EQU   C'S'         =X'E2' - SAT1                                       
DEGPCNTQ EQU   C'T'         =X'E3' - N-TV                                       
DEGPCVXQ EQU   C'V'         =X'E5' - VOX                                        
DEGPCWDQ EQU   C'W'         =X'E6' - WDR                                        
DEGPCR2Q EQU   C'X'         =X'E7' - RTL2                                       
DEGPCRSQ EQU   C'Y'         =X'E8' - SUPERRTL                                   
DEGPCZDQ EQU   C'Z'         =X'E9' - ZDF                                        
DEGPCNDQ EQU   C'1'         =X'F1' - NDR                                        
DEGPCDCQ EQU   C'2'         =X'F2' - DISCOVERY                                  
DEGPCSRQ EQU   C'3'         =X'F3' - SR                                         
DEGPCSWQ EQU   C'4'         =X'F4' - SWF                                        
DEGPCTMQ EQU   C'5'         =X'F5' - TM3 (WITH DEGPCRTQ UNTIL 13JAN99)          
DEGPCRBQ EQU   C'6'         =X'F6' - RB                                         
DEGPCN2Q EQU   C'7'         =X'F7' - N24                                        
DEGPCBLQ EQU   C'8'         =X'F8' - BLOOMBERG                                  
DEGPCVIQ EQU   C'9'         =X'F9' - VIVA                                       
DEGPCV2Q EQU   C'0'         =X'F0' - VIVA2                                      
DEGPCVPQ EQU   DEGPCV2Q            - VIVA PLUS (VIVA2 RENAMED MAR02)            
DEGPEURQ EQU   C'!'         =X'5A' - EUROSPORT                                  
DEGPCGGQ EQU   C'?'         =X'6F' - GIGA                                       
DEGPCXXQ EQU   C'@'         =X'7C' - TVXXP                                      
DEGPCNRQ EQU   C'>'         =X'6E' - NRW                                        
DEGPTVBQ EQU   C'<'         =X'4C' - TV BERLIN                                  
DEGPTVMQ EQU   C'%'         =X'6C' - TV MUENCHEN                                
DEGPTVGQ EQU   C'('         =X'4D' - TV GUSTO                                   
DEGPEUNQ EQU   C')'         =X'5D' - EURONEWS                                   
DEGPCVRQ EQU   C'A'-X'40'   =X'81' - VIERTE                                     
DEGPCTWQ EQU   C'B'-X'40'   =X'82' - ARD TVW                                    
DEGPPRKQ EQU   C'C'-X'40'   =X'83' - PREMIERE KRIMI                             
DEGPPRSQ EQU   C'D'-X'40'   =X'84' - PREMIERE SERIE                             
DEGPPR1Q EQU   C'E'-X'40'   =X'85' - PREMIERE 1                                 
DEGPPR2Q EQU   C'F'-X'40'   =X'86' - PREMIERE 2                                 
DEGPPR3Q EQU   C'G'-X'40'   =X'87' - PREMIERE 3                                 
DEGPPR4Q EQU   C'H'-X'40'   =X'88' - PREMIERE 4                                 
DEGPPR5Q EQU   C'I'-X'40'   =X'89' - PREMIERE 5                                 
DEGPPR6Q EQU   C'J'-X'40'   =X'91' - PREMIERE 6                                 
DEGPPR7Q EQU   C'K'-X'40'   =X'92' - PREMIERE 7                                 
DEGPPRNQ EQU   C'L'-X'40'   =X'93' - PREMIERE NOS                               
DEGPPNVQ EQU   C'M'-X'40'   =X'94' - TERRANOVA                                  
DEGPPNWQ EQU   C'N'-X'40'   =X'95' - NRW.TV                                     
DEGPCDMQ EQU   C'O'-X'40'   =X'96' - DMAX                                       
DEGPCHAQ EQU   C'P'-X'40'   =X'97' - CHAMPS TV                                  
DEGPCOMQ EQU   C'Q'-X'40'   =X'98' - COMEDY CENTRAL                             
DEGP13SQ EQU   C'R'-X'40'   =X'99' - 13TH STREET                                
DEGPSCFQ EQU   C'S'-X'40'   =X'A2' - SCIFI                                      
DEGPHISQ EQU   C'T'-X'40'   =X'A3' - HISTORY                                    
DEGPBIOQ EQU   C'U'-X'40'   =X'A4' - BIOGRAPHY                                  
DEGPARTQ EQU   C'V'-X'40'   =X'A5' - ARTE                                       
DEGPDRRQ EQU   C'W'-X'40'   =X'A6' - ERSTE IM GANZEN NORDEN (ARDNDRRB)          
DEGPAPLQ EQU   C'X'-X'40'   =X'A7' - ANIMAL PLANET                              
DEGPDHDQ EQU   C'Y'-X'40'   =X'A8' - DISCOVERY HD                               
DEGPDGSQ EQU   C'Z'-X'40'   =X'A9' - DISCOVERY GESCHICHTE                       
DEGPK1CQ EQU   C'_'         =X'6D' - KABLE1 CLASSICS                            
DEGPS1CQ EQU   C'-'         =X'60' - SAT1 COMEDY                                
DEGPSCNQ EQU   X'01'               - SKY CINEMA                                 
DEGPSC1Q EQU   X'02'               - SKY CINEMA +1                              
DEGPS24Q EQU   X'03'               - SKY CINEMA +24                             
DEGPSCHQ EQU   X'04'               - SKY CINEMA HITS                            
DEGPSKAQ EQU   X'05'               - SKY ACTION                                 
DEGPSKCQ EQU   X'06'               - SKY COMEDY                                 
DEGPSKEQ EQU   X'07'               - SKY EMOTION                                
DEGPSKNQ EQU   X'08'               - SKY NOSTALGIE                              
DEGPSKKQ EQU   X'09'               - SKY KRIMI                                  
DEGPSS1Q EQU   X'0A'               - SKY SPORT 1                                
DEGPSS2Q EQU   X'0B'               - SKY SPORT 2                                
DEGPSFBQ EQU   X'0C'               - SKY FUSBALL BUNDESLIGA                     
DEGPCANQ EQU   X'0D'               - CARTOON NETWORK                            
DEGPTNFQ EQU   X'0E'               - TNT FILM                                   
DEGPTNSQ EQU   X'0F'               - TNT SERIE                                  
DEGPBOOQ EQU   X'10'               - BOOMERANG                                  
DEGPANIQ EQU   X'11'               - ANIMAX                                     
DEGPAXNQ EQU   X'12'               - AXN                                        
DEGPMGMQ EQU   X'13'               - MGM                                        
DEGPSB2Q EQU   X'14'               - SKY FUSBALL BUNDESLIGA 2                   
DEGPSIXQ EQU   X'15'               - SIXX                                       
DEGPBONQ EQU   X'16'               - BONGUSTO                                   
DEGPSACQ EQU   X'17'               - SKY ACTION (HD)                            
DEGPSHIQ EQU   X'18'               - SKY CINEMA HITS (HD)                       
DEGPMOVQ EQU   X'19'               - MOTORVISION                                
DEGPSS3Q EQU   X'1A'               - SKY SPORT 3                                
DEGPSS4Q EQU   X'1B'               - SKY SPORT 4                                
DEGPSPGQ EQU   X'1C'               - SPIEGELG (SPIEGEL TV GESCHICHTE)           
DEGPSB6Q EQU   X'1D'               - SKY FUSBALL BUNDESLIGA 6                   
DEGPSB7Q EQU   X'1E'               - SKY FUSBALL BUNDESLIGA 7                   
DEGPANXQ EQU   X'1F'               - ANIXE                                      
*                                                                               
DEGPCLOD DS    XL2                 DATE LAST LOADED                             
DEGPCDLO DS    XL2                 EARLIEST PGM DETAIL DATA ON DMGFILE          
DEGPCDHI DS    XL2                 LATEST A/PGM DETAIL DATA ON DMGFILE          
DEGPCLLO DS    XL2                 LOWEST DATE DATA OF LAST LOAD                
DEGPCLHI DS    XL2                 HIGHEST DATE DATA OF LAST LOAD               
DEGPCLNQ EQU   *-DEGPCD                                                         
         EJECT                                                                  
***********************************************************************         
* TABLE DATES CONTROL ELEMENT - MEDZ                                  *         
***********************************************************************         
                                                                                
DETCD    DSECT                                                                  
DETCEL   DS    XL1       +00                                                    
DETCELLQ EQU   X'0F'               TABLE DATE CONTROL ELEMENT                   
DETCLEN  DS    XL1       +01                                                    
*                                  * DATES LAST AMENDED/ADDED *                 
DETCAUD  DS    XL4       +02       AUDIENCE NAME/NUM (ACTIVITY SECONDS)         
DETCSALE DS    XL4       +06       SALESHOUSE TABLE  (ACTIVITY SECONDS)         
DETCSSST DS    XL4       +10       SUPERSET STATION LIST (ACTY SECONDS)         
DETCBOPT DS    XL4       +14       BUY OPTIMISATION RULES                       
         DS    XL8       +18       SPARE                                        
DETCLNQ  EQU   *-DETCD                                                          
                                                                                
***********************************************************************         
* SPOT DATES LOADED CONTROL RECORD <MEDFILZ>                          *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
DEMSLODR DS    XL1                 RECORD TYPE                                  
*EMSLODQ EQU   X'EA'                                                            
DEMSLODQ EQU   X'95'                                                            
         DS    XL15                NULLS                                        
DEMSLIND DS    XL1                 INDICATOR                                    
DEMSLLIQ EQU   X'01'               - LIVE SPOTS                                 
DEMSLCNQ EQU   X'02'               - CONSOLIDATED SPOTS (NOT USED)              
DEMSLDAT DS    XL2                 SPOT DATA DATE                               
*                                                                               
         ORG   DEMMKSTC            PRIME STATUS USAGE                           
         ORG   DEMMKSTR            STATUS BYTE USAGE                            
DEMSLDAD DS    XL2                 DATE RECORD ADDED                            
                                                                                
***********************************************************************         
* 'SPOTS LOADED FOR THIS STATION' ELEMENT                             *         
***********************************************************************         
                                                                                
DESSD    DSECT                                                                  
DESSEL   DS    XL1                                                              
DESSELLQ EQU   X'10'               SPOTS FOR THIS STATION LOADED                
DESSLEN  DS    XL1                                                              
DESSARCH DS    0XL2                                                             
DESSAREA DS    XL1                 AREA                                         
DESSCHAN DS    XL1                 CHANNEL                                      
DESSLNQ  EQU   *-DESSEL                                                         
         EJECT                                                                  
***********************************************************************         
* BRAND OR PROGRAMME HEADER RECORD - <<MEDFILE>>                      *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
DEKHDRR  DS    XL1                 RECORD TYPE                                  
DEKHDRBQ EQU   X'B1'               BARB BRAND RECORD                            
DEKHDRPQ EQU   X'B3'               BARB PROGRAMME RECORD                        
DEKHDRAQ EQU   X'B7'               ADVANCE PROGRAMME RECORD                     
         DS    XL14                NULLS                                        
DEKHDRCY DS    XL1                 COUNTRY (PROG) - NULL IF UK                  
DEKHDRNO DS    0XL3                DEMPRO (BRAND), DEMPRG (PROGRAMME)           
DEKBALOQ EQU   100000              LOWEST UK BRAND/PROG 2002+                   
DEKBNFLQ EQU   888888          UK- DDS DUSTBIN BRAND.NO FILM ON FILE            
DEKBNFIQ EQU   88888          ROI- DDS DUSTBIN BRAND.NO FILM ON FILE            
DEKHUNKQ EQU   999999              ATR DUSTBIN BRAND                            
DEKHDRAS DS    XL1                 ADVANCE PGM DATA SOURCE (N+X'80')            
DEKAPRGQ EQU   X'80'               ADVANCE PROGRAMMING RECORD                   
DEKAPC4Q EQU   1+X'80'             ADVANCE PROGRAMMING FROM CHANNEL 4           
DEKAPC3Q EQU   2+X'80'             ADVANCE PROGRAMMING FROM CHANNEL 3           
DEKAPS4Q EQU   3+X'80'             ADVANCE PROGRAMMING FROM SIANEL 4            
DEKAPSKQ EQU   4+X'80'             ADVANCE PROGRAMMING FROM SKY                 
DEKAPFLQ EQU   5+X'80'             ADVANCE PROGRAMMING FROM FLEXTECH            
DEKAPC5Q EQU   6+X'80'             ADVANCE PROGRAMMING FROM CHANNEL 5           
DEKHDRAN DS    XL2                 ADVANCE PGM DEMPRG                           
*                                                                               
         ORG   DEMMKEY                                                          
         DS    XL2                 AGYMED (00)/ RECORD TYPE                     
DEKHDPBQ EQU   X'B2'               BRAND RECORD PASSIVE                         
DEKHDPPQ EQU   X'B4'               PROGRAMME RECORD PASSIVE                     
         DS    XL6                 NULLS                                        
DEKHDRTY DS    XL1                 PASSIVE TYPE                                 
*DEAD* DEKHAGBQ EQU   C'A'  AGB BRAND/PROGRAMME CODE PASSIVE                    
DEKHEIRQ EQU   C'E'                EIRE BRAND/PROGRAMME CODE PASSIVE            
DEKHIBQ  EQU   C'I'                2003 IRISH BRAND                             
*DEAD* DEKHBRDQ EQU   C'B'  BRD PROGRAMME CODE PASSIVE                          
DEKHTOPQ EQU   C'T'                GENRE  -> DEMPRG PASSIVE                     
DEKHPGEQ EQU   C'P'                DEMPRG -> GENRE  PASSIVE                     
DEKHGENQ EQU   C'G'                USED ONLY AS 'G'ENRE PREFIX                  
DEKHCODE DS    0CL8                PASSIVE CODE                                 
*        ORG   DEKHCODE                                                         
*DEAD* DEKHAGBB DS    CL5                 AGB BRAND CODE                        
         ORG   DEKHCODE                                                         
DEKHEIRB DS    CL4                 EIRE BRAND CODE - PRE 2003                   
         ORG   DEKHCODE                                                         
DEKHIBC  DS    XL3                 2003 EIRE BRAND CODE                         
         ORG   DEKHCODE                                                         
DEKHAGBP DS    CL6                 AGB PROGRAMME CODE                           
         ORG   DEKHCODE                                                         
*DEAD* DEKHBRDP DS    CL6    BRD PROGRAMME CODE                                 
         ORG   DEKHCODE                                                         
DEKHEIRP DS    CL6                 EIRE PROGRAMME CODE (=DEMPRG)                
         ORG   DEKHCODE                                                         
         DS    CL4                 SPACES IF GENRE CODE                         
DEKHGENR DS    CL4                 PROGRAMME GENRE CODE                         
         ORG   DEKHCODE+L'DEKHCODE                                              
DEKAGBDP DS    XL3                 COMPLEMENTED DEMPRO/G FOR THIS USAGE         
*                                                                               
         ORG   DEKHCODE                                                         
DEKHPDP  DS    XL3                 REGULAR DEMPRG (DEKHPGEQ)                    
*DEAD* DEKHPGEN DS    CL3    PROGRAMME GENRE CODE (DEKHPGEQ)                    
*DEAD* DEKHPBRD DS    XL3    BINARY BRD CODE                                    
DEKHPGNR DS    CL4                 PROGRAMME GENRE CODE                         
*DEAD* DEKHPBCD DS    XL3   BINARY BRD CODE                                     
*                                                                               
                                                                                
         ORG   DEKHDRR                                                          
DEKHBTYP DS    XL1                                                              
DEKHBTYQ EQU   X'BF'                                                            
DEKHBSTY DS    XL1                 SUBTYPE                                      
DEKHBSBQ EQU   C'B'                - BARB                                       
DEKHBCOD DS    XL5                 PAS CODE NOW XL5 FOR P123456789              
         DS    CL5                 SPARE                                        
         ORG   DEKAGBDP                                                         
DEKHBDPR DS    XL3                 DEMPRG, AS DEKAGBDP                          
         EJECT                                                                  
***********************************************************************         
* GROUP PASSIVES                                                      *         
***********************************************************************         
                                                                                
         ORG   DEMMKEY                                                          
         DS    XL2                 AGYMED (00)/ RECORD TYPE                     
DEKHDPGQ EQU   X'B6'               MREG/IRISH GROUP PASSIVE                     
         DS    XL4                 NULLS                                        
DEKHDGTY DS    X                   TYPE, AS DEKGRPTY (EXCEPT BELOW)             
DEKHGPCD DS    0CL4                GROUP CODE                                   
         ORG   DEKHGPCD                                                         
DEKHMRGC DS    0CL3                MREG GROUP CODE                              
         ORG   DEKHGPCD                                                         
DEKHEIRC DS    0CL4                IRISH GROUP CODE                             
         ORG   DEKHGPCD                                                         
DEKHMMSC DS    0CL2                MMS GROUP CODE (1ST LEVEL)                   
         ORG   DEKHGPCD+L'DEKHGPCD                                              
DEKHGPS1 DS    X                   MAJOR GROUP SEQUENCE NO.                     
DEKHGPS2 DS    X                   MINOR GROUP SEQUENCE NO. (MMS ONLY)          
DEKHGPDP DS    XL3                 DEMPRO                                       
DEKHEIBR DS    CL(L'DEHBREIR)      IRISH BRAND CODE (IF RELEVANT)               
*                                                                               
         ORG   DEKHDGTY                                                         
         DS    XL1                                                              
DEKHDGPQ EQU   X'03'               DEMPRO/MREG GRP PASSIVE                      
DEKHDGDP DS    XL3                 DEMPRO                                       
DEKHDGCD DS    CL4                 MREG GROUP CODE (EG MOT)                     
DEKHDGS1 DS    X                   MAJOR SEQUENCE NUMBER                        
*                                                                               
         ORG   DEKHDGTY                                                         
         DS    XL1                                                              
DEKHGGOQ EQU   X'04'               MREG GRP (NO SUBGROUP) - DEMPRO PSV          
*                                  (SUBGROUP NULL)                              
         ORG   DEKHDGTY                                                         
         DS    XL1                                                              
DEKHDIPQ EQU   DEKGEIRQ+1          DEMPRO/IRISH GROUP PASSIVE                   
DEKHDIDP DS    XL3                 DEMPRO                                       
DEKHDICD DS    CL4                 IRISH GROUP CODE (EG 0101)                   
*                                                                               
         ORG   DEKHDGTY                                                         
         DS    XL1                                                              
DEKHMFBQ EQU   X'05'               FULL MMS GRP / DEMPRO PSV                    
DEKHMFGR DS    CL2                 GRP CODE                                     
DEKHMFSP DS    CL2                 SPACES                                       
DEKHMFS1 DS    X                   LVL1 SEQUENCE NUMBER                         
DEKHMFS2 DS    X                   LVL2 SEQUENCE NUMBER                         
DEKHMFDP DS    XL3                 DEMPRO                                       
*                                                                               
         ORG   DEKHDGTY                                                         
         DS    XL1                                                              
DEKHMBGQ EQU   X'06'               DEMPRO / FULL MMS GRP                        
DEKHMBDP DS    XL3                 DEMPRO                                       
DEKHMBGR DS    CL2                 GRP CODE                                     
DEKHMBSP DS    CL2                 SPACES                                       
DEKHMBS1 DS    X                   LVL1 SEQUENCE NUMBER                         
DEKHMBS2 DS    X                   LVL1 SEQUENCE NUMBER                         
*                                                                               
         ORG   DEKHDGTY                                                         
         DS    XL1                                                              
DEKHMGBQ EQU   X'07'               MMS GRP (TOP LEVEL ONLY) / DEMPRO            
DEKHMGGR DS    CL2                 GRP CODE (TOP LEVEL)                         
DEKHMGSP DS    CL2                 SPACES                                       
         DS    XL2                 NULL                                         
DEKHMGDP DS    XL3                 DEMPRO                                       
*                                                                               
         ORG   DEMMKSTC                                                         
DEMSLDTQ EQU   X'01'               BRAND HAS DEHLDEL WHOSE DATE IS              
*                                  HIGHER THAN DEKHDRDE                         
DEMSEIRQ EQU   X'02'               EIRE BRAND OR PROGRAMME                      
DEMSPNOQ EQU   X'04'               PROG HAS DATA ON DMO...  FILES               
DEMPMXFQ EQU   X'08'               PAS PGM MERGE ACROSS DMN/DMO FILES           
*        EQU   X'10'               SPARE                                        
DEMSMMSQ EQU   X'20'               MMS GROUP CODE ASSIGNED                      
*        EQU   X'40'               SPARE                                        
         ORG   DEMMKSTR            STATUS BYTE USAGE                            
DEKHDRDA DS    XL2                 CMPRSSD DATE OF FIRST TRANSMISSION           
*                                  NULL IF NEW BARB 2002 BRAND                  
*                                  FFFF=INACTIVE VIA AMENDMENTS                 
DEKHDRDE DS    XL2                 CMPRSSD DATE OF LAST TRANSMISSION            
*                                  NULL=INACTIVE NEW OR VIA AMENDS              
         DS    X                   SPARE                                        
DEKHDRLA DS    XL2                 MOST RECENT DATE (CMPRSSD) WHEN ANY          
*                                  TRANSMISSION OF THIS BRAND/PROG WAS          
*                                  AMENDED BY ATR INSERTS/DELETES.              
         EJECT                                                                  
***********************************************************************         
* BRAND HEADER ELEMENT                                                *         
***********************************************************************         
                                                                                
         ORG   DEMMFRST                                                         
DEHBREL  DS    XL1                                                              
DEHBRELQ EQU   X'10'                                                            
DEHBRLEN DS    XL1                                                              
DEHBRBRC DS    0CL6                DDS BRAND CODE                               
DEHBRTYP DS    CL1                 TYPE                                         
DEHBRAGQ EQU   C'A'                A=AGB                                        
DEHBREIQ EQU   C'E'                E=EIRE                                       
DEHBRIBQ EQU   C'I'                2003 STYLE IRISH BRAND                       
*                                                                               
DEHBRCOD DS    CL5                 BRAND CODE (TRAILING SPACES)                 
         ORG   DEHBRCOD                                                         
DEHBRAGB DS    CL5                 AGB BRAND CODE                               
         ORG   DEHBRCOD                                                         
DEHBREIR DS    CL4                 IRISH BRAND CODE                             
         ORG   DEHBRCOD                                                         
DEHBRIBC DS    XL3                 IRISH BRAND CODE (DEHBRIBQ)                  
         ORG   DEHBRCOD+L'DEHBRCOD                                              
DEHBRMGS DS    0XL5                MMS GROUP STRUCTURE                          
DEHBRMMS DS    0XL4                MMS GRP (NN.NN.NN)                           
DEHBRMMG DS    CL2                 NN (EBCDIC) GROUP                            
DEHBRMM1 DS    XL1                 NN (BINARY)                                  
DEHBRMM2 DS    XL1                 NN (BINARY)                                  
         DS    XL1                 SPARE                                        
DEHBRMRE DS    CL5                 MREG GROUP CODE (ABCNN). EBCDIC              
*                                  2 ABOVE ARE SPACES IF NOT UK BRAND           
DEHBRLNQ EQU   *-DEHBREL                                                        
                                                                                
***********************************************************************         
* PROGRAMME HEADER ELEMENT - BARB 91                                  *         
***********************************************************************         
                                                                                
         ORG   DEMMFRST                                                         
DEHPREL  DS    XL1                                                              
DEHPRELQ EQU   X'12'                                                            
DEHPRLEN DS    XL1                                                              
DEHPRPRC DS    0CL7                DDS PROGRAM CODE                             
DEHPRTYP DS    XL1                 TYPE                                         
DEHPRAGQ EQU   C'A'                A=AGB                                        
DEHPREIQ EQU   C'E'                E=EIRE (NIELSEN)                             
DEHPRAGB DS    0CL6                AGB PROGRAMME CODE                           
DEHPRCOD DS    CL6                 PROGRAMME CODE (TRAILING SPACES)             
DEHPREIR EQU   DEHPRCOD                                                         
*DEAD* DEHPRBRD DS    0CL6   BRD PROG CODE (AGB ONLY)                           
DEHPRCLA DS    CL6                 IS CLASSIFICATION FOR IRELAND                
DEHPRGEN DS    CL3                 TOPS GENRE CODE (AGB ONLY)                   
DEHPRLNQ EQU   *-DEHPREL                                                        
                                                                                
***********************************************************************         
* PROGRAMME HEADER ELEMENT - BARB 2002                                *         
***********************************************************************         
                                                                                
DEHPDELD DSECT                                                                  
DEHPDEL  DS    XL1                                                              
DEHPDELQ EQU   X'14'                                                            
DEHPDLEN DS    XL1                                                              
DEHPDCOD DS    XL5                 PAS CODE NOW XL5 FOR P123456789              
DEHIPSOS DS    XL2                 LATEST IPSOS CHANGE (TYPE4/XPAM)             
         DS    CL3                 SPARE                                        
DEHPDGST DS    CL4                 GENRE CODE - STRAND                          
DEHPDGPR DS    CL4                 GENRE CODE - PROGRAMME                       
*                                  AMENDED BY IPSOS MF CHANGES                  
DEHPDLNQ EQU   *-DEHPDEL                                                        
                                                                                
***********************************************************************         
* CHANNEL ACTIVITY ELEMENT - BRANDS/PROGRAMMES/ADVANCED PROGRAMMES    *         
***********************************************************************         
                                                                                
DEHCHD   DSECT                                                                  
DEHCHEL  DS    X                                                                
DEHCHELQ EQU   X'13'                                                            
DEHCHLEN DS    X                                                                
DEHCHAN  DS    XL2                 MASK SHOWING ACTIVE CHANNELS                 
DEHCHLNQ EQU   *-DEHCHD            ELEMENT LENGTH                               
DEHCH1Q  EQU   X'0001'             - CHANNEL 1 (BBC1) (PROGS ONLY)              
DEHCH2Q  EQU   X'0002'             - CHANNEL 2 (BBC2) (PROGS ONLY)              
DEHCH3Q  EQU   X'0004'             - ITV                                        
DEHCHGMQ EQU   X'0008'             - TVAM/GMTV                                  
DEHCH4Q  EQU   X'0010'             - CHANNEL 4                                  
*EHCHO4Q EQU   X'0020'             - OLD STYLE TVAM4                            
*EHCHSAQ EQU   X'0040'             - SATELLITE                                  
DEHCHMCQ EQU   X'0040'             - MULTICHANNEL                               
DEHCH5Q  EQU   X'0080'             - CHANNEL 5                                  
*                                                                               
DEHCHR1Q EQU   X'0100'             - RTE1                                       
DEHCHR2Q EQU   X'0200'             - RTE2                                       
DEHCHT3Q EQU   X'0400'             - TV3 (AS OF 21/9/98)                        
DEHCHTNQ EQU   X'0800'             - TNAG                                       
DEHCHT6Q EQU   X'1000'             - CH 6                                       
DEHCHIUQ EQU   X'4000'             - RULSTER                                    
DEHCHICQ EQU   X'8000'             - RC4                                        
DEHCHURQ EQU   X'0020'             - ULSTER VIEWING ROI                         
* THESE NOW SIMPLY SET AS DEHCHMCQ                                              
*EHCHI4Q EQU   X'1000'             - IE4                                        
*EHCHISQ EQU   X'2000'             - ISKY1/ISKYN                                
*EHCHMTQ EQU   X'0020'             - MTV                                        
*EHCHNKQ EQU   X'0040'             - NICK                                       
                                                                                
***********************************************************************         
* LATEST LIVE SPOT DATE ELEMENT - UK BRANDS ONLY                      *         
***********************************************************************         
                                                                                
DEHLDD   DSECT                                                                  
DEHLDEL  DS    X                                                                
DEHLDELQ EQU   X'16'                                                            
DEHLDLEN DS    X                                                                
DEHLDDAT DS    XL2                 LATEST LIVE DATE                             
DEHLDLNQ EQU   *-DEHLDD                                                         
                                                                                
***********************************************************************         
* BRAND/PROGRAMME/GROUP NAME ELEMENT                                  *         
***********************************************************************         
                                                                                
DEHNMD   DSECT                                                                  
DEHNMEL  DS    XL1                                                              
DEHNMELQ EQU   X'20'                                                            
DEHNMLEN DS    XL1                                                              
DEHNMLNQ EQU   *-DEHNMD                                                         
DEHNMNAM DS    0C                  NAME                                         
DEHNMAGB DS    0CL20               AGB BRAND NAME                               
DEHNMITV DS    0CL35               ITV (ATTRIBUTION) BRAND NAME                 
DEHNMEIR EQU   DEHNMAGB            IRISH BRAND NAME                             
DEHNMPOB DS    0CL30               POINTER BRAND NAME                           
DEHNMGRP DS    0CL30               BRAND GROUP NAME                             
DEHNMAGP DS    0CL20               AGB PROGRAMME NAME                           
DEHNMATR DS    0CL40               ATR (BARB 2002) PROGRAMME NAME               
DEHNMGER DS    0CL60               GERMAN PROGRAMME NAME                        
DEHNMGNR DS    0CL50               FULL GENRE NAME (SEE DEKGNRR)                
DEHNMMMC DS    0CL50               MMS CAT/GROUP CLASSIFICATION NAME            
                                                                                
***********************************************************************         
* GROUP ELEMENT IF IRISH BRAND                                        *         
***********************************************************************         
                                                                                
DEHTGD   DSECT                                                                  
DEHTGEL  DS    XL1                                                              
DEHTGELQ EQU   X'30'                                                            
DEHTGLEN DS    XL1                                                              
DEHTGFLD DS    CL4                 GROUP CODE                                   
DEHTGLDQ EQU   *-DEHTGD                                                         
                                                                                
***********************************************************************         
* UPDATE DATE ELEMENT (BARB 2002 ONWARDS). ADDED / UPDATED BY         *         
* DEMOUPD                                                             *         
***********************************************************************         
                                                                                
DEHUPD   DSECT                                                                  
DEHUPEL  DS    XL1                                                              
DEHUPELQ EQU   X'32'                                                            
DEHUPLEN DS    XL1                                                              
DEHUPDAT DS    XL2                                                              
DEHUPLNQ EQU   *-DEHUPD                                                         
                                                                                
***********************************************************************         
* ATTRIBUTION ELEMENT IF NIELSEN BRAND                                *         
***********************************************************************         
                                                                                
DEHATD   DSECT                                                                  
DEHATEL  DS    XL1                 (CAN BE MULTIPLE ELEMENTS)                   
DEHATELQ EQU   X'31'                                                            
DEHATLEN DS    XL1                                                              
DEHATAGE DS    XL2                 ACCOUNT END DATE   (COMP + INVERTED)         
DEHATAGS DS    XL2                 ACCOUNT START DATE (COMP + INVERTED)         
DEHATAGC DS    CL5                 AGENCY CODE                                  
DEHATADC DS    CL6                 ADVERTISER CODE                              
DEHATLNQ EQU   *-DEHATD                                                         
                                                                                
***********************************************************************         
* PROGRAMME LONG-NAME ELEMENT (UK)                                    *         
***********************************************************************         
                                                                                
DEHLND   DSECT                                                                  
DEHLNEL  DS    XL1                                                              
DEHLNELQ EQU   X'35'                                                            
DEHLNLEN DS    XL1                                                              
DEHLNLNQ EQU   *-DEHLND                                                         
DEHLNNAM DS    0CL40               NAME                                         
                                                                                
***********************************************************************         
* MREG GROUP CODE AMENDMENT HISTORY ELEMENT. ADDED TO BRAND HEADER    *         
* RECORD EACH TIME NEW MREG CODE APPLIED BY US AS A RESULT OF         *         
* EXTRACTING BRAND DETAILS FROM OUR MREG FILES. AGB GROUP CODE        *         
* CHANGES REJECTED BY UPDATE/AMENDMENTS IF THIS ELEMENT PRESENT       *         
***********************************************************************         
                                                                                
DEHMRELD DSECT                                                                  
DEHMREL  DS    XL1                                                              
DEHMRELQ EQU   X'5D'                                                            
DEHMRLEN DS    CL1                                                              
DEHMRAFD DS    CL2                 DATE CHANGE APPLIED TO FILE (MEDZ)           
DEHMROLD DS    CL(L'DEHBRMRE)      PREVIOUS MREG GROUP CODE (CCCGG)             
DEHMRLNQ EQU   *-DEHMRELD                                                       
         EJECT                                                                  
***********************************************************************         
* GROUP RECORDS - HELD ON MEDFILZ OR AGENCY'S MEDFILE                 *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
DEKGRPAM DS    XL1                 AGYMED (00 IF NOT AGENCY GROUP)              
DEKGRPR  DS    XL1                 RECORD TYPE                                  
DEKGRPRQ EQU   X'B5'               BRAND GROUP                                  
DEKGRPFQ EQU   X'B6'               FILM GROUP                                   
DEKGRPPQ EQU   X'B9'               PROGRAMME GROUP                              
         DS    XL4                 NULLS                                        
DEKGRPTY DS    XL1                                                              
DEKGAGYQ EQU   0                   AGENCY GROUP                                 
DEKGMRGQ EQU   2                   MREG GROUP                                   
DEKGMMSQ EQU   5                   MMS  GROUP                                   
DEKGEIRQ EQU   X'80'               EIRE GROUP                                   
*                                                                               
DEKGRPCD DS    CL10                GROUP CODE                                   
         ORG   DEKGRPCD                                                         
DEKGAGYC DS    CL10                AGENCY BRAND GROUP CODE                      
         ORG   DEKGRPCD                                                         
DEKGSBGC DS    0CL10               PCPAKS SELECTION BRAND GROUP CODE            
DEKGSYY  DS    CL2                 YY                                           
DEKGSDDD DS    CL3                 DDD (1-366) DAY NUMBER                       
DEKGSSEC DS    CL5                 SECONDS REPRESENTATION OF HHMMSS             
         ORG   DEKGRPCD                                                         
DEKGMRGC DS    CL3                 MREG GROUP CODE                              
         ORG   DEKGRPCD                                                         
DEKGEIRC DS    CL4                 IRISH GROUP CODE                             
         ORG   DEKGRPCD                                                         
DEKGMMSC DS    CL2                 MMS TOP LEVEL GROUP CODE                     
         ORG   DEKGRPCD+L'DEKGRPCD                                              
DEKGRPS1 DS    XL1                 MAJOR GROUP SEQUENCE NUMBER                  
*                                  -AGY GRPS/MREG PROD. GRPS / MMS SUB1         
DEKGRPS2 DS    XL1                 MINOR GROUP SEQUENCE NUMBER                  
*                                  -AGY GRPS/MREG PROD. GRPS / MMS SUB2         
DEKGRPS3 DS    XL1                 DEMPRO/DEMPRG STRING SEQUENCE NUMBER         
*                                  (ALSO APPLIES TO AGY ATTR GRPS)              
         ORG   DEMMKSTC                                                         
DEMSTBSQ EQU   X'01'               GROUP CREATED BY PC BRAND SELECTION          
DEMSTATQ EQU   X'04'               BRAND GROUP HAS ATTRIBUTION ELTS             
DEMSTIRQ EQU   X'08'               MMS GROUP IS IRISH VIA NEILSEN MEDIA         
*                                  IF DEMSTATQ ON -                             
DEMSTAGQ EQU   X'08'               - GROUP CONTAINS AGENCIES                    
DEMSTNGQ EQU   X'10'               - GROUP CONTAINS ACNM GROUPS                 
DEMSTMGQ EQU   X'02'               - GROUP CONTAINS MMS GROUPS                  
DEMSTACQ EQU   X'20'               - GROUP CONTAINS ACNM ATTRIBS                
DEMSTFLQ EQU   X'40'               - GROUP CONTAINS FILMS                       
*                    NOT FLAGGED BUT GROUP MAY ALSO CONTAIN BRANDS              
*                                                                               
         ORG   DEMMKSTR                                                         
*                                  AGENCY GROUP RECORDS ONLY:                   
DEKGRPLA DS    XL2                 - COMP DATE LAST MAINTAINED                  
DEKGRPUS DS    XL2                 - COMP DATE LAST USED THIS GROUP             
DEKGRPOW DS    CL3                 - OWNER INITIALS                             
*                                                                               
         ORG   DEMMKSTR                                                         
DEKGRPND DS    XL2                 # DEMPROS/DEMPRGS IN THIS STRING             
*                                  RECORD (STRING RECORDS ONLY)                 
DEKGATMQ EQU   255                 MAX # ENTRIES IN AN ATTRIB GRP (OLD)         
DEKGASMQ EQU   500                 MAX # ENTRIES IN A SUPER ATTRIB GRP          
DEKGAFMQ EQU   255                 MAX # FILMS IN A SUPER ATTRIB GRP            
DEKGBRMQ EQU   3061                MAX # BRANDS IN BRAND GROUP (TVR6/7)         
* MAX BRANDS IN A GROUP DICTATED BY CAPACITY OF METVR06/07   **BUT**            
* IF INCREASE BEAR IN MIND DEMAND/DEMREG MAY HAVE A LIMIT TOO (4096?)           
                                                                                
* GROUP HEADER RECORDS (DEKGRPS3=00) HAVE DEHNMD NAME ELEMENT                   
                                                                                
***********************************************************************         
* DEMPRO/DEMPRG STRING ELEMENT                                        *         
***********************************************************************         
                                                                                
DEGSTD   DSECT                                                                  
DEGSTEL  DS    XL1                                                              
DEGSTELQ EQU   X'40'                                                            
DEGSTLEN DS    XL1                                                              
DEGSTSEQ DS    XL1                 ELT SEQUENCE (1-BASED)                       
DEGSTSMQ EQU   5                   MAX ALLOWED (DEMAND RESTRICTION)             
DEGSTLNQ EQU   *-DEGSTD                                                         
DEGSTNUM DS    64XL3               UP TO 64 DEMPRO/DEMPRG NUMBERS               
DEGSTLMQ EQU   *-DEGSTD                     PER ELEMENT                         
                                                                                
***********************************************************************         
* GROUP HEADER RECORDS (DEKGRPS3=00) MAY HAVE SAVED BUILD FILTERS     *         
***********************************************************************         
                                                                                
DEGBFD   DSECT                                                                  
DEGBFEL  DS    XL1                                                              
DEGBFELQ EQU   X'42'                                                            
DEGBFLEN DS    XL1                                                              
DEGBFSCE DS    XL1                 SOURCE OF FIELD                              
DEGBFFQ  EQU   X'01'               FROM THE FILTERS FIELD                       
DEGBFAQ  EQU   X'02'               FROM THE AREA    FIELD                       
DEGBFGQ  EQU   X'04'               FROM THE GROUP   FIELD                       
DEGBFLNQ EQU   *-DEGBFD                                                         
DEGBFTXT DS    0C                                                               
                                                                                
***********************************************************************         
* GROUP HEADER RECORDS (DEKGRPS3=00) HIGH DATE OF SPOT/PGM DATA       *         
***********************************************************************         
                                                                                
DEGHDD   DSECT                                                                  
DEGHDEL  DS    XL1                                                              
DEGHDELQ EQU   X'44'                                                            
DEGHDLEN DS    XL1                                                              
DEGHDATE DS    XL2                 HIGH DATE OF DATA                            
DEGHDLNQ EQU   *-DEGHDD                                                         
                                                                                
***********************************************************************         
* GROUP HEADER RECORDS (DEKGRPS3=00) PASSWORD ELEMENT                 *         
***********************************************************************         
                                                                                
DEGPWD   DSECT                                                                  
DEGPWEL  DS    XL1                                                              
DEGPWELQ EQU   X'46'                                                            
DEGPWLEN DS    XL1                                                              
DEGPWORD DS    XL2                   PASSWORD NUMBER                            
DEGPWLNQ EQU   *-DEGPWD                                                         
                                                                                
***********************************************************************         
* GROUP HEADER RECORDS (DEKGRPS1/2/3=00) TARGET AUDIENCE ELEMENT      *         
***********************************************************************         
                                                                                
DEGTAD   DSECT                                                                  
DEGTAEL  DS    XL1                                                              
DEGTAELQ EQU   X'54'                                                            
DEGTALEN DS    XL1                                                              
DEGTAUDS DS    0XL4                AUDIENCES                                    
DEGTAUD1 DS    XL2                 AUDIENCE 1 (AL.4 FLAG / AL.12 NUM)           
DEGTAUD2 DS    XL2                 AUDIENCE 2 (AL.4 FLAG / AL.12 NUM)           
DEGTALNQ EQU   *-DEGTAD                                                         
         EJECT                                                                  
***********************************************************************         
* FILM GROUP RECORDS - FILM ELEMENT                                   *         
***********************************************************************         
                                                                                
DEGFCD   DSECT                                                                  
DEGFCEL  DS    XL1                                                              
DEGFCELQ EQU   X'50'                                                            
DEGFCLEN DS    XL1                                                              
DEGFCLNQ EQU   *-DEGFCD                                                         
DEGFCODE DS    0CL18                                                            
                                                                                
***********************************************************************         
* ATTRIBUTION BASED GROUPS - ATTRIBUTION/BRAND ELEMENT                *         
***********************************************************************         
                                                                                
DEGATD   DSECT                                                                  
DEGATEL  DS    XL1                 ELEMENT CODE                                 
DEGATELQ EQU   X'52'                                                            
DEGATLEN DS    XL1                 LENGTH                                       
DEGATSEQ DS    XL1                 ELT SEQUENCE (1-BASED FROM TARGET)           
DEGATSMQ EQU   8                   MAX ALLOWED                                  
DEGATLNQ EQU   *-DEGATD            LENGTH OF FIXED PART                         
*                                                                               
DEGATVLS DS    0XL6                VALUES (ALL BAR FILMS)                       
DEGATTYP DS    XL1                 TYPE                                         
DEGATAGQ EQU   X'01'               AGENCY (BUYING)                              
DEGABRAQ EQU   X'02'               UK BRAND CODE                                
DEGATADQ EQU   X'04'               ADVERTISER                                   
DEGATHOQ EQU   X'08'               HOLDING COMPANY                              
DEGATIRQ EQU   X'10'               AGY/ADV/HOL IS IRISH                         
DEGATMGQ EQU   X'20'               MMS GROUP                                    
DEGATFLQ EQU   X'40'               FILM CODE                                    
DEGATCOD DS    0CL5                CODE (AGY/ADV/HOL) - EBCDIC                  
DEGATNCD DS    0CL3                CODE-ACNM GR (EBCDIC)                        
DEGATMCD DS    CL2                 CODE-MMS GROUP EBCDIC                        
         DS    CL1                 NULL IF MMS                                  
DEGATNSG DS    0CL2                ACNM SUB-GROUP (EBCDIC)                      
DEGATMS1 DS    XL1                 MMS MAJOR (BINARY)                           
DEGATMS2 DS    XL1                 MMS MINOR (BINARY)                           
         ORG   DEGATCOD                                                         
DEGABRA  DS    XL3                 HEX DEMPRO ON BRAND ENTRY                    
*                                                                               
DEGATMXQ EQU   40                  MAX NUMBER OF ENTRIES PER ELEMENT            
DEGATVLQ EQU   DEGATMXQ*L'DEGATVLS                                              
*                                                                               
         ORG   DEGATVLS                                                         
DEGAFVLS DS    0XL16               FILM VALUES                                  
         DS    XL1                 TYPE                                         
DEGAFLM  DS    CL15                FILM CODE (MAX POSSIBLE)                     
DEGAFMXQ EQU   DEGATVLQ/L'DEGAFVLS MAX #FILM ENTRIES PER ELEMENT                
*                                                                               
         EJECT                                                                  
***********************************************************************         
* ITVA FILM RECORD - <<MEDFILE>>                                      *         
***********************************************************************         
                                                                                
* MAX FILMS (A0+BA) WITHIN MEDEMHDR/MELDEXTBRC PEEL ENVIRONMENT                 
PMAXFLMQ EQU   700000                                                           
*                                                                               
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
DEKIFRR  DS    XL1                 RECORD TYPE                                  
DEKIFRRQ EQU   X'BA'               ITVA FILM RECORD                             
DEKIFRFC DS    CL18      C         ITVA FILM CODE                               
         ORG   DEKIFRFC                                                         
DEKIFRCD DS    0CL15     C         FILM CODE BARB 2002                          
         DS    0CL3      C         SPACES                                       
         ORG   DEKIFRCD+L'DEKIFRCD                                              
DEKIFRIR DS    CL1       C                                                      
DEKIFRIQ EQU   C'I'                I = IRISH FILM (SPACE FOR UK)                
*                                                                               
*        NB: - BARB 2002 FILM CODES ARE STILL SPACE PADDED TO 18                
         ORG   DEMMKSTC                                                         
DEMSFWBQ EQU   X'01'               FILM HAS WEB ADDRESS                         
DEMSFPHQ EQU   X'02'               FILM HAS PHONE NUMBER                        
DEMSFNOQ EQU   X'04'               FILM HAS SPOTS ON DMO... FILES               
         ORG   DEMMKSTR            STATUS BYTE USAGE                            
DEKIFRDA DS    XL2                 LOWEST ACTV DATE FOR ANY BRAND               
DEKIFRDE DS    XL2                 HIGHEST ACTV DATE FOR ANY BRAND              
         DS    XL1                 SPARE                                        
DEKIFRLA DS    XL2                 MOST RECENT DATE (CMPRSSD) WHEN ANY          
*                                  TRANSMISSION OF THIS FILM WAS                
*                                  AMENDED BY AGB AMENDMENT RECORD.             
                                                                                
         ORG   DEMMFRST                                                         
DEIFREL  DS    XL1                 ITVA FILM ELEMENT.                           
DEIFRELQ EQU   X'11'                                                            
DEIFRLEN DS    XL1                                                              
DEIFRLNQ EQU   *-DEIFREL                                                        
DEIFRNUM DS    0XL3                DEMPROS WITH XMSSNS FOR THIS FILM.           
                                                                                
***********************************************************************         
* FILM NAME ELEMENT AS OF BARB 2002                                   *         
* NAMES ETC. ARRIVE VIA THE ATTRIBUTION SERVICE, NOT FROM BARB        *         
***********************************************************************         
                                                                                
DEINMD   DSECT                                                                  
DEINMEL  DS    XL1                                                              
DEINMELQ EQU   X'20'                                                            
DEINMLEN DS    XL1                                                              
DEINMLNQ EQU   *-DEINMD                                                         
DEINMNAM DS    0CL50               NAME                                         
                                                                                
***********************************************************************         
* FILM PHONE NUMBER ELEMENT                                           *         
***********************************************************************         
                                                                                
DEIPHD   DSECT                                                                  
DEIPHEL  DS    XL1                                                              
DEIPHELQ EQU   X'30'                                                            
DEIPHLEN DS    XL1                                                              
DEIPHLNQ EQU   *-DEIPHD                                                         
DEIPHNUM DS    0CL30               PHONE NUMBER                                 
                                                                                
***********************************************************************         
* FILM WEB ADDRESS ELEMENT                                            *         
***********************************************************************         
                                                                                
DEIWBD   DSECT                                                                  
DEIWBEL  DS    XL1                                                              
DEIWBELQ EQU   X'40'                                                            
DEIWBLEN DS    XL1                                                              
DEIWBLNQ EQU   *-DEIWBD                                                         
DEIWBADD DS    0CL50               WEB ADDRESS                                  
         EJECT                                                                  
***********************************************************************         
* 2005 SPONSOR RECORD - <<MEDFILE>>                                   *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
DEKISRR  DS    XL1                 RECORD TYPE                                  
DEKISRRQ EQU   X'A0'               SPONSOR RECORD                               
DEKISRFC DS    CL15      C         SPONSOR CODE                                 
         ORG   DEKISRFC                                                         
DEKISRCD DS    0CL15     C         ITV SPONSOR CODE 2005                        
         DS    0CL3      C         SPACES                                       
*                                                                               
         ORG   DEMMKSTC                                                         
DEMSSNOQ EQU   X'04'               SPONSOR HAS NEWBARB SPOTS ON DMO...          
         ORG   DEMMKSTR            STATUS BYTE USAGE                            
DEKISRDA DS    XL2                 LOWEST ACTV DATE FOR ANY BRAND               
DEKISRDE DS    XL2                 HIGHEST ACTV DATE FOR ANY BRAND              
         DS    XL1                 SPARE                                        
DEKISRLA DS    XL2                 MOST RECENT AMENDED DAT                      
                                                                                
         ORG   DEMMFRST                                                         
DEISREL  DS    XL1                 SPONSOR BRAND ELEMENT.                       
DEISRELQ EQU   X'11'                                                            
DEISRLEN DS    XL1                                                              
DEISRLNQ EQU   *-DEISREL                                                        
DEISRNUM DS    0XL3                DEMPRO LINKED TO SPONSOR CODE                
                                                                                
         EJECT                                                                  
***********************************************************************         
* GENRE HEADER RECORD <<MEDFILE>>                                     *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
DEKGNRR  DS    XL1                 RECORD TYPE                                  
DEKGNRRQ EQU   X'D6'               GENRE HEADER                                 
         DS    XL14                SPARE                                        
DEKGNCOD DS    0CL4                GENRE CODE- BARB02                           
**         DS    XL1                                                            
**DEKGNCDE DS    0XL3                GENRE CODE                                 
**DEKGNCAT DS    XL1                  - CATEGORY                                
**DEKGNGRP DS    XL1                  - GROUP                                   
**DEKGNSUB DS    XL1                  - SUB GROUP                               
*                                                                               
         ORG   DEMMKSTC                                                         
         ORG   DEMMKSTR            STATUS BYTE USAGE                            
         DS    XL7                 SPARE                                        
                                                                                
         ORG   DEMMFRST                                                         
*                                  GENRE NAME ELEMENT - SEE DEHNMEL             
                                                                                
DESNMD   DSECT                     GENRE SHORT NAME ELEMENT                     
DESNMEL  DS    XL1                                                              
DESNMELQ EQU   X'22'                                                            
DESNMLEN DS    XL1                                                              
DESNMLNQ EQU   *-DESNMD                                                         
DESNMNAM DS    0C                  NAME                                         
DESNMGNR DS    0CL20               SHORT GENRE NAME                             
         EJECT                                                                  
***********************************************************************         
* SPONSOR / PROGRAMME RECORD       - <<MEDFILE>>                      *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
         DS    XL1                 REC TYPE                                     
DEKHDRSQ EQU   X'A2'               SPONSOR / EVENT RECORD                       
         DS    XL9                 NULLS                                        
DEKSHTYP DS    XL1                 TYPE                                         
DEKSHSRQ EQU   X'01' SPONSOR REC                                                
DEKSHERQ EQU   X'02' PROGM   REC                                                
DEKSHSEQ EQU   X'03' SPONSORED EVENT REC                                        
DEKSHSPC DS    XL3                 SPONSOR CODE                                 
DEKSHCHC DS    XL1                 CHANNEL                                      
DEKSHARC DS    XL1                 AREA                                         
DEKSHEVC DS    XL3                 PRGM/EV CODE                                 
*                                                                               
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
         DS    XL1                 REC TYPE                                     
DEKHDPSQ EQU   X'A2'               SPONSOR / EVENT RECORD NAME PASSIVE          
DEKSHPTP DS    XL1                 TYPE                                         
DEKSHSPQ EQU   X'01' SPONSOR REC                                                
DEKSHPPQ EQU   X'02' PROGRAMME                                                  
DEKSHSNM DS    CL14                NAME                                         
DEKSHPSP DS    XL3                 SPONSOR/PROGRAMME CODE                       
***********************************************************************         
* SPONSORED PROGRAMME/EVENT ELEMENT                                   *         
***********************************************************************         
                                                                                
DEHSPELD DSECT                                                                  
DEHSPEL  DS    XL1                                                              
DEHSPELQ EQU   X'66'                                                            
DEHSPLEN DS    CL1                                                              
DEHSPDF  DS    XL2                 DATE FROM                                    
DEHSPDT  DS    XL2                 DATE TO                                      
DEHSPDOW DS    XL1                 DOW MASK .MTWTFSS                            
DEHSPDUR DS    XL2                 DURATION                                     
DEHSPNUM DS    XL1                 N'TRANSMISSIONS                              
DEHSPTIM DS    XL2                 TIME                                         
DEHSPLNQ EQU   *-DEHSPELD                                                       
DEHSPCMT DS    0CL40               COMMENT                                      
                                                                                
***********************************************************************         
* SPONSOR / PROGRAMME SUPPLEMENTARY DATA ELEMENT                      *         
***********************************************************************         
                                                                                
DEHSAELD DSECT                                                                  
DEHSAEL  DS    XL1                                                              
DEHSAELQ EQU   X'67'                                                            
DEHSALEN DS    CL1                                                              
DEHSARML DS    CL5                 SPONSOR RML GROUP                            
DEHSAGEN DS    CL3                 PROGRAMME GENRE GROUP                        
DEHSALNQ EQU   *-DEHSAELD                                                       
DEHSADVR DS    0CL30               ADVERTISER                                   
                                                                                
***********************************************************************         
* SPONSORSHIP SALES HOUSE ELEMENT                                     *         
***********************************************************************         
                                                                                
DEHSHELD DSECT                                                                  
DEHSHEL  DS    XL1                                                              
DEHSHELQ EQU   X'68'                                                            
DEHSHLEN DS    CL1                                                              
DEHSHLNQ EQU   *-DEHSHELD                                                       
DEHSHSE  DS    0CL30                SALES HOUSE                                 
         EJECT                                                                  
***********************************************************************         
* SYSTEM NEWS RECORDS - <<MEDFILE>>                                             
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
         DS    XL1                 AGYMED (00)                                  
DEKNEWR  DS    XL1                 RECORD TYPE                                  
DEKNEWRQ EQU   X'EA'               NEW-IN-XYZ RECORD                            
         DS    XL13                NULLS                                        
DEKNEWDT DS    XL2                 INVERTED COMPRESSED DATE (REC ADDED)         
DEKNEWTM DS    XL3                 INVERTED COMPRESSED TIME (REC ADDED)         
*                                                                               
         ORG   DEMMKSTC                                                         
         ORG   DEMMKSTR            STATUS BYTE USAGE                            
DEKNEWST DS    XL1                                                              
DEKNWSHQ EQU   X'80'               - RECORD HIDDEN FROM USERS                   
DEKNEWPR DS    XL1                 PROGRAMME APPLIES TO (X'00'=ALL)             
DEKNWPTQ EQU   X'80'               - TARGET                                     
DEKNWPDQ EQU   X'40'               - DEN                                        
DEKNEWOD DS    XL2                 OVERRIDE DATE TO DISPLAY ON LIST             
DEKNEWHS DS    XL1                 HIGHEST SEQ NUMBERED ELEM                    
DEKNEWDF DS    XL1                 DATA APPLIES TO FLAG (X'00'=ALL)             
DEKNWDUQ EQU   X'80'               - UK (BARB DATA)                             
DEKNWDIQ EQU   X'40'               - IRELAND (NIELSEN DATA)                     
         DS    XL1                 SPARE                                        
                                                                                
         ORG   DEMMFRST                                                         
                                                                                
***********************************************************************         
* TITLE ELEMENT                                                       *         
***********************************************************************         
                                                                                
DENWTD   DSECT                     TITLE ELEMENT                                
DENWTEL  DS    XL1                                                              
DENWTELQ EQU   X'10'                                                            
DENWTLEN DS    XL1                                                              
DENWTLNQ EQU   *-DENWTEL                                                        
DENWTITL DS    0CL40               (UP TO 40 CHARS)                             
                                                                                
***********************************************************************         
* DETAIL TEXT ELEMENT                                                 *         
***********************************************************************         
                                                                                
DENWDD   DSECT                                                                  
DENWDEL  DS    XL1                                                              
DENWDELQ EQU   X'20'                                                            
DENWDLEN DS    XL1                                                              
DENWDSEQ DS    XL1                 RELATIVE LINE NUMBER (1 BASED)               
DENWDFLG DS    XL1                 FLAG INFO                                    
DENWDHIQ EQU   X'80'               - HIGH INTENSITY                             
DENWDLNQ EQU   *-DENWDD                                                         
DENWDET  DS    0CL78               TEXT LINE (UP TO 78 CHARS)                   
         EJECT                                                                  
***********************************************************************         
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                     *         
*        DEMOGRAPHIC RECORDS ON  D E M F I L E                        *         
*                                                                     *         
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMMKEY                                                          
DEMDKEY  DS    0XL20               DEMFILE KEY                                  
DEMDKYLQ EQU   L'DEMDKEY                                                        
DEMDKTYP DS    XL1                 RECORD TYPE                                  
DEMPASQ  EQU   X'80'               INDICATES KEY IS A PASSIVE POINTER           
         DS    XL19                                                             
DEMDKEND DS    0X                  END OF KEY                                   
                                                                                
DEMDKSTA DS    0XL8                DIRECTORY STATUS BYTES                       
DEMDKSTC DS    XL1                 DIR CONTROL STATUS                           
DEMSDELQ EQU   X'80'               STATUS = RECORD DELETED                      
DEMSCNXQ EQU   X'40'               STATUS = RECORD CANCELLED BY AGB             
DEMSFIDQ EQU   X'30'               STATUS = FILE ID (0,1,2,3)                   
*        EQU   X'10'               DMNDIR = DMNOLD FILE (0=DMNNEW)              
*        EQU   X'10'               DMODIR = DMO2FL FILE (0=DMO1FL)              
*        EQU   X'20'                        DMO3FL FILE                         
*        EQU   X'30'                        DMO4FL FILE                         
DEMSAGAQ EQU   X'08'               STATUS = RECORD AMENDED BY AGB               
*>> THIS WAS TO SHOW BLACK SUNDAY AMENDS WERE DDS NOT AGB - OH DEAR!            
*>>DEMSDDSQ EQU   X'04'               STATUS = RECORD AMENDED BY DDS            
*        EQU   X'07'               DAY OF WEEK (1=MON,7=SUN)                    
*                                           SLOT,PROG,SPOT RECORDS ONLY         
DEMDKSTR DS    XL7                 DIR STATUS BYTE 2-8                          
*                                                                               
DEMDKDA  DS    XL4                 DIRECTORY DISK ADDR                          
*                                                                               
DEMDDLNQ EQU   *-DEMDKEY           DIRECTORY RECORD LENGTH                      
                                                                                
         ORG   DEMDKEND                                                         
DEMDRLEN DS    XL2                 RECORD LENGTH                                
DEMMAXLQ EQU   4000                MAX RECORD LENGTH                            
DEMMXLNQ EQU   5000                MAX RECORD LENGTH (NEW NOV 2010)             
* !!                                                                            
DEMDIFKQ EQU   0                   NEW-OLD KEYLEN DIFFERENCE                    
DEMDIFSQ EQU   0                   NEW-OLD STATUS LEN DIFFERENCE                
* !!                                                                            
DEMDRSTA DS    0XL8                RECORD STATUS BYTES                          
DEMDRSTC DS    XL1                 REC CONTROL STATUS                           
DEMDRSTR DS    XL7                 REC STATUS BYTE 2-8                          
*                                                                               
DEMDCNTL DS    XL4                 RECORD LINKAGE                               
*                                                                               
DEMDFRST DS    0X                  FIRST ELEMENT ADDRESS                        
DEMDRLNQ EQU   *-DEMDKEY           DISP TO FIRST ELEMENT                        
                                                                                
DEMMXAOQ EQU   15                  # OVERNIGHT AUDS - BARB2002                  
DEMMXANQ EQU   80                  # AUDS FOR WHICH DATA-JULY 2001 ON           
*                                  (ONLY 71 USED)                               
DEMMXA1Q EQU   60                  # INCOMING AUDS - BARB2010                   
DEMMXABQ EQU   85                  # AUDS MAX BARB 2002 PHASE 2                 
DEMMXAGQ EQU   46                  # GERMAN AUDS FOR WHICH DATA                 
DEMMXGMQ EQU   68                  # GERMAN AUDS - SUMMER 2002 ON               
DEMMXGNQ EQU   80                  # GERMAN AUDS - WINTER 2002 ON               
*                                                                               
DEMMAMXQ EQU   DEMMXABQ            BIGGEST VALUE OF #AUDS                       
*                                                                               
DEMDSTDQ EQU   DEMDRSTA-DEMDKSTA   DISP DIFF BETWEEN DIR & REC STATUS           
         EJECT                                                                  
* DEMFILE  RECORD TYPE   DESCRIPTION                                            
* ELEMENT  -----------   -----------                                            
*                                                                               
*  X'01'   DMGR CONTROL  FILENAME AND DATE, CONTROL NUMBER AND ARCHIVE          
*                        CUT-OFF DATE                                           
*                                                                               
*  X'20'   QUARTER HOUR  QUARTER HOUR DETAIL                                    
*  X'20'   MINUTE        MINUTE BY MINUTE DETAIL                                
*                                                                               
*  X'30'   SLOT DETAIL   BREAK (SLOT) DETAIL                                    
*  X'31'   SLOT DETAIL   BLOCK DETAIL           (GERMAN/GFK ONLY)               
*  X'32'   SLOT DETAIL   BLOCK TOTAL            (GERMAN/GFK ONLY)               
*  X'33'   SLOT DETAIL   EXTRA INFO             (IRISH/NIELSEN ONLY)            
*  X'34'   SLOT DETAIL   WEEK MASK/RATE         (GERMAN/GFK ONLY)               
*                                                                               
*  X'40'   PROG DETAIL   PROGRAMME DETAIL                                       
*  X'41'   PROG DETAIL   BLOCK DETAIL           (GERMAN/GFK ONLY)               
*  X'45'   PROG DETAIL   PROGRAMME MISCELLANEOUS (UK ONLY)                      
*  X'48'   PROG DETAIL   TOTAL CHANNEL SHARE    (UK NETWORK PROGS ONLY)         
*  X'4F'   PROG DETAIL   AREA ACTIVITY          (UK NETWORK PROGS ONLY)         
*                                                                               
*  X'50'   SPOT DETAIL   BRAND (SPOT) DETAIL                                    
*  X'52'   SPOT DETAIL   SPOT MISCELLANEOUS INFO ELEMENT                        
*  X'54'   SPOT DETAIL   SALES HOUSE ELEMENT                                    
*  X'5C'   SPOT DETAIL   SPOT ITVA FILM ELEMENT                                 
*  X'5D'   PROG DETAIL   DAVID GRAHAM PROGRAMME AMENDMENT HISTORY               
*  X'5E'   SPOT DETAIL   (AGB) SPOT AMENDMENT HISTORY                           
*  X'5F'   SPOT DETAIL   ARTIST FEE ELEMENT                                     
*                                                                               
*  X'60'   BUCKET        PERIOD TOTALS                                          
         EJECT                                                                  
***********************************************************************         
* PERFORMANCE ELEMENT STRUCTURE.                                                
*                                                                               
* ON THE FILE, QUARTER HOUR, SLOT, PROGRAM, SPOT AND BUCKET ELEMENTS            
* APPEAR IN PAIRS WITH A TIMESHIFT ELEMENT FOLLOWING THE LIVE LEMENT.           
* DEXXXTSQ INDICATES WHICH ELEMENT IS WHICH, AND FORCES THE CORRECT             
* SEQUENCE. FOR ALL BUT BUCKET ELEMENTS, IF THE TIMESHIFT IMPRESSIONS           
* ARE ALL ZERO, THERE WILL BE NO TIMESHIFT ELEMENT. CONSOLIDATED                
* IMPRESSIONS ARE GIVEN BY ADDING LIVE AND TIMESHIFT IMPRESSIONS.               
*                                                                               
* QUARTER HOUR, SLOT, PROGRAM, SPOT AND BUCKET RECORDS ON THE FILE ARE          
* ALSO TRUNCATED TO THE MINIMUM LENGTH REQUIRED TO ENCLOSE THE LAST             
* NON- ZERO BYTE.                                                               
*                                                                               
* TO FURTHER SAVE SPACE, INDIVIDUAL IMPRESSIONS FIELDS ARE COMPRESSED           
* IF POSSIBLE. THE FIRST TWO BITS OF AN IMPRESSIONS FIELD GIVES ITS             
* LENGTH MINUS 1 IN BYTES.                                                      
*                                                                               
*    B'00XXXXXX'                            1 BYTE =  1 TO         63           
*    B'01XXXXXX XXXXXXXX'                   2 =      64 TO      16383           
*    B'10XXXXXX XXXXXXXX XXXXXXXX'          3 =   16384 TO    4194303           
*    B'11XXXXXX XXXXXXXX XXXXXXXX XXXXXXXX' 4 = 4194304 TO 1073741823           
*                                                                               
* IN THE ABOVE SCHEME, A ZERO ENTRY WOULD NORMALLY OCCUPY A SINGLE              
* BYTE. HOWEVER, BECAUSE IT IS QUITE LIKELY TO BE FOLLOWED BY AT LEAST          
* ONE OTHER ZERO ENTRY, THE COMPRESSION RULE IS EXTENDED SO THAT A ZERO         
* IS ALWAYS FOLLOWED BY ANOTHER BYTE CONTAINING THE NUMBER OF FURTHER           
* ZERO ENTRIES FOLLOWING. THIS ALLOWS ANY NUMBER OF CONSECUTIVE ZERO            
* IMPRESSIONS FIELDS, UP TO THE MAXIMUM OF DEMMXANQ, TO BE COMPRESSED           
* INTO 2 BYTES, ALTHOUGH A SINGLE ZERO ENTRY MUST ALSO OCCUPY 2 BYTES.          
*                                                                               
*    B'00000000 00001010'      ELEVEN CONSECUTIVE ZERO FIELDS (1+10).           
*    B'00000000 00000000'      ONE SINGLE ZERO FIELD (1+0).                     
*                                                                               
* DEMFILE RECORDS ARE ALWAYS ACCESSED VIA DEMAND. DEMAND RETURNS A PRE-         
* PROCESSED FORM OF THE RECORDS REQUESTED. THE ABOVE COMPRESSION SYSTEM         
* APPLIES ONLY TO FILE RECORDS AND NOT TO THOSE RETURNED BY DEMAND.             
*                                                                               
* - FOR SPOT AND BUCKET RECORDS DEMAND EXCLUDES ALL ELEMENTS WHICH DO           
*   NOT FIT THE REQUESTED FILTERS.                                              
* - ELEMENTS RETURNED BY DEMAND HAVE FIXED LENGTH IMPRESSIONS FIELDS            
*   FOR ONLY THOSE DDS AUDIENCES REQUESTED.                                     
* - THE LIST OF AUDIENCES REQUESTED CAN CONTAIN ANY COMBINATION OF UP           
*   TO 15 LIVE AND CONSOLIDATED AUDIENCES. DEMAND PERFORMS ALL                  
*   NECCESSARY DERIVATION OF THE DDS AUDIENCES FROM THE BARB AUDIENCES          
*   HELD IN THE ORIGINAL RECORD.                                                
* - DEMAND RETURNS SINGLE ELEMENTS, NOT LIVE/CONSOLIDATED PAIRS.                
*   IMPRESSIONS FOR THE REQUESTED AUDIENCES, WHETHER LIVE OR                    
*   CONSOLIDATED, APPEAR IN THE RETURNED ELEMENTS IN THE SEQUENCE IN            
*   WHICH THEY WERE SPECIFIED IN THE LIST OF REQUESTED AUDIENCES. THE           
*   ELEMENT LENGTH IS DICTATED BY THE NUMBER OF AUDIENCES REQUESTED.            
*   DEXXXTSQ HAS NO MEANING AND WILL BE OFF IN RETURNED ELEMENTS.               
         EJECT                                                                  
***********************************************************************         
* DATAMGR CONTROL RECORDS (HEADERS/TRAILERS) - <<DEMFILE>>            *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKDMGR  DS    XL1                 RECORD TYPE                                  
DEKDMGHQ EQU   X'00'               FILE HEADER (XL3'00')                        
DEKDMGTQ EQU   X'FC'               LOWEST FILE TRAILER (FC,FD,FE,FF)            
         DS    XL18                NULLS (HEADER), FFS (TRAILER)                
DEKDMGHF DS    XL1                 FILE CODE (HEADER), FF (TRAILER)             
*                                                                               
         ORG   DEMDFRST                                                         
DEGENEL  DS    XL1                                                              
DEGENELQ EQU   X'01'                                                            
DEGENLEN DS    XL1                                                              
DEGENLNQ EQU   128-(DEGENEL-DEMDKEY)-1                                          
         ORG   DEMDKEY+58                                                       
DEGENDTL DS    CL8'DD/MM/YY'  +58  DATE FILE LOADED                             
DEGENTML DS    CL6'HHMMSS'    +66  TIME FILE LOADED                             
         DS    XL4            +72                                               
         DS    C'FIL='        +76                                               
DEGENFIL DS    CL8'DEMXXXN '  +80  FILENAME                                     
DEGENNRC DS    F              +88  RECORD COUNT AT LOAD                         
DEGENNTR DS    H              +92  ADDRESS OF NEXT AVAILABLE TRACK              
         ORG   DEMDKEY+96          USER DATA                                    
DEGENNO  DS    XL3            +96  CONTROL NUMBER                               
DEGENACY DS    XL1            +99  ACTIVE YEAR.                                 
DEGENACW DS    XL1           +100  ACTIVE WEEK .                                
*                                  ON EACH FILE HEADER THIS IS THE YEAR         
*                                  AND WEEK OF THE EARLIEST DETAIL DATA         
*                                  ON THE FILE.                                 
DEGDFILO DS    XL2           +101  DATE OF EARLIEST DATA ON FILE                
DEGDFILS DS    XL2           +103  - EARLIEST SPOT                              
DEGDFILB DS    XL2           +105  - EARLIEST BUCKET                            
DEGDFILP DS    XL2           +107  - EARLIEST PROGRAMME                         
DEGDFILL DS    XL2           +109  - EARLIEST SLOT                              
DEGDFILF DS    XL2           +111  - EARLIEST 5 MINUTE                          
DEGDFILQ DS    XL2           +113  - EARLIEST QUARTER HOUR                      
DEGDFILM DS    XL2           +115  - EARLIEST MINUTE                            
DEGDFLNQ EQU   *-DEGDFILO                                                       
                                                                                
*                                  FOLLOWING ARE USED ON DMGFIL ONLY            
                                                                                
         ORG   DEGDFILO                                                         
DEGFFILO DS    XL2           +101  DATE OF EARLIEST GFK DATA ON FILE            
DEGFFIHI DS    XL2           +103  DATE OF LATEST GFK DATA ON FILE              
DEGFLALH DS    0XL4                DATE RANGE OF LATEST GFK LOAD                
DEGFLALO DS    XL2           +105  - LOWEST DATE                                
DEGFLAHI DS    XL2           +107  - HIGHEST DATE                               
                                                                                
DEGPFILO DS    XL2           +109  DATE OF EARLIEST PGM DATA ON FILE            
DEGPFIHI DS    XL2           +111  DATE OF LATEST (ADV)PGM DATA ON FILE         
DEGPLALH DS    0XL4                DATE RANGE OF LATEST PGM LOAD                
DEGPLALO DS    XL2           +113  - LOWEST DATE                                
DEGPLAHI DS    XL2           +115  - HIGHEST DATE                               
*                                                                               
DEGVDATS DS    0XL8          +117  DEBV RECORDS - BUILD DETAILS*DEAD*           
DEGVBALO DS    XL2           +117  - BASE PERIOD LOW DATE , YYMM                
DEGVBAHI DS    XL2           +119  - BASE PERIOD HIGH DATE, YYMM                
DEGVBULO DS    XL2           +121  - BUILD PERIOD LOW DATE, YYMM                
DEGVBUHI DS    XL2           +123  - BUILD PERIOD HIGH DATE, YYMM               
         ORG   DEGENEL+DEGENLNQ                                                 
DEGUPIND DS    XL1           +127  UPDATE IND (SEE GFKHDRUP)                    
DEGUCOMQ EQU   X'80'               - NEW FILE UPDATE COMPLETE                   
         EJECT                                                                  
***********************************************************************         
* QUARTER HOUR DETAIL RECORD - <<DEMFILE>>                            *         
*                                                                     *         
* - PRIME KEY IS AREA NUMBER, DATE AND END TIME OF Q/H.               *         
* - NO PASSIVE POINTER DEFINED.                                       *         
* - 1 RECORD PER QUARTER HOUR CONTAINS 1 LIVE/TIMESHIFT ELEMENT       *         
*   PAIR FOR EACH CHANNEL (1,2,3,4,5,OTHER,TOTAL - IN THE UK)         *         
* - NO OTHER ELEMENT TYPE PRESENT.                                    *         
* - NO HEADER RECORD ON MEDFILZ.                                      *         
* - NOTE - CHANNEL IS IN ELEMENTS, NOT RECORD KEY - UNLESS MCH        *         
* - NOTE - IRISH QUARTERS ALL HELD AS IF RTE1 (AREA 13)               *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKPERR  DS    XL1                 RECORD TYPE                                  
DEKPERRQ EQU   X'20'                                                            
         DS    XL3                 NULLS                                        
         DS    XL2                 PADDING                                      
DEKPERAC DS    0XL2                                                             
DEKPERAR DS    XL1                 AREA NUMBER                                  
DEKPERCH DS    XL1    TERRESTRIAL  SPARE (CHANNEL IN ELEMENTS)                  
*                     MCH          CHANNEL=STATION                              
         DS    XL2                 FOR FUTURE USE                               
DEKPERDT DS    XL2                 COMPRESSED DATE                              
DEKPERET DS    XL2                 END TIME (HHMM)                              
         DS    XL1                 FOR FUTURE USE                               
         ORG   DEKPERR+DEMDKYLQ-1                                               
DEKPERSQ DS    XL1                 SEQ. NO (IRISH QTRS ONLY FOR NOW)            
*                                                                               
         ORG   DEMDKSTC            STATUS BYTE USAGE                            
DEKPERIQ EQU   X'08'               INCOMPLETE (DAILY 11 LIVE AUDS)              
DEKPERDC DS    XL1                 DAYCODE (BITS 5-7)                           
         DS    X                                                                
DEMSTBIQ EQU   X'01'               IRISH QTRS. RECORD BECAME TOO BIG            
*                                  DURING DEMUP. PUTREC SKIPPED                 
DEKPERDP DS    XL1                 DAYPART (OF START) *NO MORE - FEB99*         
         DS    X                   SPARE                                        
DEKPERLM DS    XL1                 DURATION (15 MINUTES)                        
                                                                                
***********************************************************************         
* QUARTER HOUR DETAIL ELEMENT                                         *         
***********************************************************************         
                                                                                
DEPERD   DSECT                                                                  
DEPEREL  DS    XL1                                                              
DEPERELQ EQU   X'20'                                                            
DEPERDLQ EQU   X'21'               DUMMY CODE (FOR USE BY DAILY UPDATE)         
DEPERLEN DS    XL1                                                              
DEPERTM  DS    XL2                 TIME (HHMM)                                  
DEPERCH  DS    XL1                 CHANNEL                                      
*                                                                               
DEPERLN  DS    XL2                 LENGTH (15 MINUTES)                          
DEPERPHD DS    XL2                 HD PLATFORM INDICATOR                        
         DS    XL1                 SPARE                                        
*EPERWK  DS    XL1                 BARB WEEK NO. OF RECORD                      
DEPERET  DS    XL2                 END TIME (HHMM)                              
DEPERIND DS    XL1                 INDICATORS / TIMESHIFT FLAG                  
*DEAD* DEPERD3Q EQU   X'40'               DATA SOURCE WAS DB3                   
DEPERS4Q EQU   X'01'               ELEMENT IS S4C (DEPERCH = 4)                 
DEPERICQ EQU   X'08'               INCOMPLETE (OVERNIGHT AUDS)                  
*              FOLLOWING PRESENT ONLY ON DEMFILE - DROPPED BY DEMAND            
DEPERTSQ EQU   X'20'               ELEMENT CONTAINS TIMESHIFT DATA              
DEPERPLA DS    XL2                 PLATFORM INDICATOR, AS DESPMPLA              
DEPERLNQ EQU   *-DEPERD            LENGTH EXCLUDING IMPS                        
DEPERIMP DS    0XL3                IMPS IN 100S PER SELECTED AUDIENCES          
*                                  AS RETURNED BY DEMAND                        
*                                                                               
         DS    0X                  IMPS IN 100S PER DEMMXANQ AUDIENCES          
*                                  (+ EXTRA LIVE 'HOMES RECORDING' AUD)         
*                                  SEE UNDER ELEMENT LIST FOR FORMAT            
*                                                                               
*        SEE UNDER ELEMENT LIST FOR NOTES ON Q/H ELEMENT USAGE.                 
         EJECT                                                                  
***********************************************************************         
* MINUTE BY MINUTE DETAILS RECORD - <<DEMFILE>>.                      *         
* LAYOUT AS FOR QUARTER HOUR RECORDS. RECORDS COVER ONLY PART OF      *         
* EACH DAY                                                            *         
* - PRIME KEY IS AREA NUMBER, DATE AND MINUTE                         *         
* - NO PASSIVE POINTER DEFINED.                                       *         
* - 1 RECORD PER MINUTE CONTAINS 1 LIVE ELEMENT ONLY FOR EACH         *         
*   SUPPLIED CHANNEL                                                            
*   NO OTHER ELEMENT TYPE PRESENT.                                    *         
* - NO HEADER RECORD ON MEDFILZ.                                      *         
* - NOTE - CHANNEL IS IN ELEMENTS, NOT RECORD KEY.                    *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKMINR  DS    XL1                 RECORD TYPE                                  
DEKMINRQ EQU   X'2F'                                                            
         DS    XL3                 NULLS                                        
         DS    XL2                 PADDING                                      
DEKMINAC DS    0XL2                                                             
DEKMINAR DS    XL1                 AREA NUMBER                                  
DEKMINCH DS    XL1    TERRESTRIAL  SPARE (CHANNEL IN ELEMENTS)                  
*                     MCH          CHANNEL=STATION                              
         DS    XL2                 FOR FUTURE USE                               
*                                                                               
DEKMINDT DS    XL2                 COMPRESSED DATE                              
DEKMINTI DS    XL2                 TIME (HHMM)                                  
DEKMINET EQU   DEKMINTI                                                         
*                                                                               
         ORG   DEMDKSTC            STATUS BYTE USAGE                            
DEKMINDC DS    XL1                 DAYCODE (BITS 5-7)                           
         DS    X                   SPARE                                        
DEKMINDP DS    XL1                 DAYPART *NO MORE - FEB99*                    
         DS    X                   SPARE                                        
DEKMINLM DS    XL1                 DURATION (1 MINUTE)                          
                                                                                
***********************************************************************         
* MINUTE BY MINUTE DETAIL ELEMENT                                     *         
***********************************************************************         
                                                                                
DEMIND   DSECT                                                                  
DEMINEL  DS    XL1                                                              
DEMINELQ EQU   DEPERELQ                                                         
DEMINDLQ EQU   DEPERDLQ            DUMMY CODE (FOR USE BY DAILY UPDATE)         
DEMINLEN DS    XL1                                                              
DEMINTM  DS    XL2                 TIME (HHMM)                                  
DEMINCH  DS    XL1                 CHANNEL, AS NORMAL CHANNEL                   
DEMINLN  DS    XL2                 LENGTH (1 MINUTE)                            
DEMINPHD DS    XL2                 HD PLATFORM INDICATOR                        
         DS    XL1                 SPARE                                        
*EMINWK  DS    XL1                 BARB WEEK NO. OF RECORD                      
DEMINET  DS    XL2                 END TIME (HHMM)                              
DEMININD DS    XL1                 INDICATORS / TIMESHIFT FLAG                  
DEMINS4Q EQU   X'01'               ELEMENT IS S4C (DEPERCH = 4)                 
DEMINICQ EQU   X'08'               INCOMPLETE (DAILY 11 LIVE AUDS)              
DEMINPLA DS    XL2                 PLATFORM INDICATOR, AS DESPMPLA              
DEMINLNQ EQU   *-DEMIND            LENGTH EXCLUDING IMPS                        
DEMINIMP DS    0XL3                IMPS IN 100S PER SELECTED AUDIENCES          
*                                  AS RETURNED BY DEMAND                        
*                                                                               
         DS    0X                  IMPS IN 100S PER DEMMXANQ AUDIENCES          
*                                  (+ EXTRA LIVE 'HOMES RECORDING' AUD)         
*                                  SEE UNDER ELEMENT LIST FOR FORMAT            
*                                                                               
*        SEE UNDER ELEMENT LIST FOR NOTES ON ELEMENT USAGE.                     
         EJECT                                                                  
***********************************************************************         
* FIVE MINUTE DETAIL RECORD - <<DEMFILE>>                             *         
*                                                                     *         
* - PRIME KEY IS AREA NUMBER, DATE AND END TIME OF FIVE MIN.          *         
* - NO PASSIVE POINTER DEFINED.                                       *         
* - 1 RECORD PER FIVE MIN CONTAINS 1 LIVE/TIMESHIFT ELEMENT           *         
*   PAIR FOR EACH CHANNEL (1,2,3,4,5,OTHER,TOTAL - IN THE UK)         *         
* - NO OTHER ELEMENT TYPE PRESENT.                                    *         
* - NO HEADER RECORD ON MEDFILZ.                                      *         
* - NOTE - CHANNEL IS IN ELEMENTS, NOT RECORD KEY - UNLESS MCH        *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKFIVR  DS    XL1                 RECORD TYPE                                  
DEKFIVRQ EQU   X'21'                                                            
         DS    XL3                 NULLS                                        
         DS    XL2                 PADDING                                      
DEKFIVAC DS    0XL2                                                             
DEKFIVAR DS    XL1                 AREA NUMBER                                  
DEKFIVCH DS    XL1    TERRESTRIAL  SPARE (CHANNEL IN ELEMENTS)                  
*                     MCH          CHANNEL=STATION                              
         DS    XL2                 FOR FUTURE USE                               
DEKFIVDT DS    XL2                 COMPRESSED DATE                              
DEKFIVET DS    XL2                 END TIME (HHMM)                              
*                                                                               
         ORG   DEMDKSTC            STATUS BYTE USAGE                            
DEKFIVIQ EQU   X'08'               INCOMPLETE (DAILY ?? LIVE AUDS)              
DEKFIVDC DS    XL1                 DAYCODE (BITS 5-7)                           
         DS    XL3                 SPARE                                        
DEKFIVLM DS    XL1                 DURATION (5 MINUTES)                         
                                                                                
***********************************************************************         
* FIVE MINUTE DETAIL ELEMENT                                          *         
***********************************************************************         
                                                                                
DEFIVD   DSECT                                                                  
DEFIVEL  DS    XL1                                                              
DEFIVELQ EQU   DEPERELQ                                                         
DEFIVDLQ EQU   DEPERDLQ            DUMMY CODE (FOR USE BY DAILY UPDATE)         
DEFIVLEN DS    XL1                                                              
DEFIVTM  DS    XL2                 TIME (HHMM)                                  
DEFIVCH  DS    XL1                 CHANNEL                                      
*                                                                               
DEFIVLN  DS    XL2                 LENGTH (5 MINUTES)                           
DEFIVPHD DS    XL2                 HD PLATFORM                                  
         DS    XL1                 SPARE                                        
*EFIVWK  DS    XL1                 BARB WEEK NO. OF RECORD                      
DEFIVET  DS    XL2                 END TIME (HHMM)                              
DEFIVIND DS    XL1                 INDICATORS / TIMESHIFT FLAG                  
DEFIVS4Q EQU   X'01'               ELEMENT IS S4C (DEPERCH = 4)                 
DEFIVICQ EQU   X'08'               INCOMPLETE (DAILY ?? LIVE AUDS)              
*              FOLLOWING PRESENT ONLY ON DEMFILE - DROPPED BY DEMAND            
DEFIVTSQ EQU   X'20'               ELEMENT CONTAINS TIMESHIFT DATA              
DEFIVPLA DS    XL2                 PLATFORM INDICATOR, AS DESPMPLA              
DEFIVLNQ EQU   *-DEFIVD            LENGTH EXCLUDING IMPS                        
DEFIVIMP DS    0XL3                IMPS IN 100S PER SELECTED AUDIENCES          
*                                  AS RETURNED BY DEMAND                        
*                                                                               
         DS    0X                  IMPS IN 100S PER DEMMXANQ AUDIENCES          
*                                  (+ EXTRA LIVE 'HOMES RECORDING' AUD)         
*                                  SEE UNDER ELEMENT LIST FOR FORMAT            
*                                                                               
         EJECT                                                                  
***********************************************************************         
* COMMERCIAL BREAK (SLOT) DETAIL RECORD - <<DEMFILE>>                 *         
*                                                                     *         
* - PRIME KEY IS AREA NO., CHANNEL, DATE AND END TIME OF SLOT.        *         
* - NO PASSIVE POINTER DEFINED.                                       *         
* - 1 RECORD PER SLOT CONTAINS 1 LIVE/TIMESHIFT ELEMENT PAIR.         *         
*   NO OTHER ELEMENT TYPE PRESENT.                                    *         
* - NO HEADER RECORD ON MEDFILZ.                                      *         
* - PRESENT ONLY FOR COMMERCIAL CHANNELS, NOT BBC1 OR BBC2.           *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKSLTR  DS    XL1                 RECORD TYPE                                  
DEKSLTRQ EQU   X'30'               SLOT RECORD                                  
         DS    XL3                 NULLS                                        
         DS    XL2                 PADDING                                      
*                                                                               
DEKSLTAC DS    0XL2                                                             
DEKSLTAR DS    XL1                 AREA NUMBER                                  
DEKSLTCH DS    XL1                 CHANNEL CODE                                 
         ORG   DEKSLTAR                                                         
DEKSLTSR DS    XL1                 GERMANY - STATION REFERENCE #                
         DS    XL1                 GERMANY - SPARE                              
*                                                                               
         DS    XL2                 FOR FUTURE USE                               
DEKSLTDT DS    XL2                 COMPRESSED DATE                              
DEKSLTET DS    XL2                 END TIME (HHMM)                              
         DS    XL1                 FOR FUTURE USE                               
*                                                                               
         ORG   DEMDKSTC            STATUS BYTE USAGE                            
DEKSLTDC DS    XL1                 DAYCODE (BITS 5-7)                           
DEKSLTXT DS    XL1                 EXTRA STATUS INFO                            
DEKSLTGQ EQU   X'80'               GFK SLOT RECORD                              
DEKSLTDP DS    XL1                 DAYPART (OF START) *NO MORE - NOV98*         
DEKSLTLM DS    XL2                 DURATION (MINS, OR SECS BARB 2002)           
*                                  ZERO IF MULTI ELTS (2002 ON)                 
                                                                                
***********************************************************************         
* SLOT PERFORMANCE DETAIL ELEMENT                                     *         
***********************************************************************         
                                                                                
DESLTD   DSECT                                                                  
DESLTEL  DS    XL1                                                              
DESLTELQ EQU   X'30'                                                            
DESLTLEN DS    XL1                                                              
DESLTTM  DS    XL2                 START TIME (HHMM)                            
DESLTTS  DS    XL1                 START TIME (SS)                              
DESLTLN  DS    XL2                 LENGTH (MINS - SECS FROM 2002)               
DESLTIN2 DS    XL1                 (WAS DAYPART)                                
DESLTGIQ EQU   DESPTGIQ            BREAK TYPE - GOING IN                        
DESLTCBQ EQU   DESPTCBQ            BREAK TYPE- CENTRE BREAK                     
DESLTEBQ EQU   DESPTEBQ            BREAK TYPE- END BREAK                        
DESLTES  DS    XL1                 END TIME(SS) - WAS DAYCODE                   
         DS    XL1                 SPARE                                        
*ESLTWK  DS    XL1                 BARB WEEK NO. OF RECORD                      
DESLTET  DS    XL2                 END TIME (HHMM)                              
DESLTIND DS    XL1                 INDICATORS / TIMESHIFT FLAG                  
DESLTCXQ EQU   X'80'               CANCELLED BY AGB                             
*ESLTD3Q EQU   X'40'               DATA SOURCE WAS DB3                          
*              FOLLOWING PRESENT ONLY ON DEMFILE - DROPPED BY DEMAND            
DESLTTSQ EQU   X'20'               ELEMENT CONTAINS TIMESHIFT DATA              
DESLTAMD DS    XL2                 CMPRSD DATE OF AMEND/CANCEL BY AGB           
*                                  ZERO IF NOT AMENDED/DELETED                  
DESLTLNQ EQU   *-DESLTD            LENGTH EXCLUDING IMPS                        
*                                                                               
DESLTIMP DS    0XL3                IMPS IN 100S PER SELECTED AUDIENCES          
*                                  AS RETURNED BY DEMAND                        
*                                                                               
         DS    0X                  IMPS IN 100S PER DEMMXANQ AUDIENCES          
*                                  (+ EXTRA LIVE 'HOMES RECORDING' AUD)         
*                                  SEE UNDER ELEMENT LIST FOR FORMAT            
*                                                                               
*        SEE UNDER ELEMENT LIST FOR NOTES ON SLOT ELEMENT USAGE.                
                                                                                
***********************************************************************         
* SLOT DETAIL ELEMENT - EXTRA INFO (CURRENTLY EIRE ONLY)              *         
* NOTE - WE NO LONGER BUILD THESE (AS OF MID-2000)                    *         
***********************************************************************         
                                                                                
DESLXD   DSECT                                                                  
DESLXEL  DS    XL1                                                              
DESLXELQ EQU   X'33'                                                            
DESLXLEN DS    XL1                                                              
DESLXSTM DS    0XL3                SLOT START TIME                              
DESLXSHM DS    XL2                                                              
DESLXSSS DS    XL1                                                              
*                                                                               
DESLXETM DS    0XL3                SLOT END TIME                                
DESLXEHM DS    XL2                                                              
DESLXESS DS    XL1                                                              
*                                                                               
DESLXDUR DS    XL2                 DURATION IN SECONDS                          
DESLX#SP DS    XL1                 # SPOTS IN BREAK                             
DESLXLNQ EQU   *-DESLXD                                                         
                                                                                
***********************************************************************         
* SLOT MISCELLANEOUS ELEMENT                                          *         
***********************************************************************         
                                                                                
DESLMD   DSECT                                                                  
DESLMEL  DS    XL1                                                              
DESLMELQ EQU   X'35'                                                            
DESLMLEN DS    XL1                                                              
DESLMSTM DS    0XL3                SLOT START TIME                              
DESLMSHM DS    XL2                                                              
DESLMSSS DS    XL1                                                              
*                                                                               
DESLMETM DS    0XL3                SLOT END TIME                                
DESLMEHM DS    XL2                                                              
DESLMESS DS    XL1                                                              
*                                                                               
DESLMPLA DS    XL2                 PLATFORM INDICATOR, AS DESPMPLA              
DESLMLNQ EQU   *-DESLMD                                                         
DESLMPHD DS    XL2                 HD PLATFORM INDICATOR                        
DESLML2Q EQU   *-DESLMD                                                         
                                                                                
***********************************************************************         
* SLOT BLOCK DETAIL ELEMENT (GERMAN/GFK SLOTS ONLY)                   *         
* NOTE - THESE RELATE POSITIONALLY TO DESLTELS                        *         
***********************************************************************         
                                                                                
DESLBD   DSECT                                                                  
DESLBEL  DS    X                                                                
DESLBELQ EQU   X'31'                                                            
DESLBLEN DS    X                                                                
DESLBSTI DS    0XL3                TRUE START TIME HHMMSS                       
DESLBSHH DS    XL1                                                              
DESLBSMM DS    XL1                                                              
DESLBSSS DS    XL1                                                              
DESLBETI DS    0XL3                TRUE END TIME HHMMSS                         
DESLBEHH DS    XL1                                                              
DESLBEMM DS    XL1                                                              
DESLBESS DS    XL1                                                              
DESLBBNO DS    0XL4                BLOCK NUMBER - SEP 2002 ONWARDS              
DESLBBCC DS    X                   CATEGORY                                     
DESLBBGG DS    X                   GG                                           
DESLBBHH DS    X                   HH                                           
DESLBBNN DS    X                   NN                                           
DESLBBTX DS    CL4                 BLOCK TEXT                                   
DESLBTM  DS    XL2                 START TIME HHMM - FROM DESLTTM               
DESLBLNQ EQU   *-DESLBD                                                         
                                                                                
***********************************************************************         
* GFK BLOCK NUMBER PASSIVES, BUILT FROM DESLBEL'S                     *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKSLBR  DS    X                                                                
DEKSLBRQ EQU   X'D1'                                                            
DEKSLBSR DS    X                   STATION REFERENCE NUMBER                     
DEKSLBDT DS    XL2                 COMPRESSED DATE                              
DEKSLBNO DS    0XL4                BLOCK NUMBER - 2002 ONWARDS                  
DEKSLBNC DS    X                   CATEGORY                                     
DEKSLBNG DS    X                   GG                                           
DEKSLBNH DS    X                   HH (NULL)                                    
DEKSLBNN DS    X                   NN                                           
DEKSLBET DS    XL2                 END TIME (FOR UNIQUENESS)                    
         EJECT                                                                  
***********************************************************************         
* GERMAN BLOCK SUMMARY RECORDS - FIXED BASE PERIODS                   *         
* THESE RECORDS DISCARDED AND REBUILT EVERY TIME GFK SLOTS ARE LOADED *         
* TO DMGFIL. NEW ONES ARE GENERATED BY MEGFKTOTUP BY LOOKING AT THE   *         
* LATEST 4 WEEKS GFK SLOTS.                                           *         
* NOTES:                                                              *         
* - PASSIVES HAVE IDENTICAL KEY BUT TIME REPLACES BLOCK (DEMPASQ ON). *         
* - DEBTINCQ SET IN STATUS OF DEBTRL4Q AND DEBTRMPQ RECORDS IF SLOTS  *         
*   ARE NOT FOUND FOR ALL 4 WEEKS.                                    *         
* - IF SLOT NOT FOUND FOR LATEST WEEK DEBTRLWQ AND DEBTRMPQ RECORDS   *         
*   ARE NOT BUILT                                                     *         
* - MBASE TIMES ARE LEFT-ALIGNED (E.G. 0849 HELD AS 8490) TO ALLOW    *         
*   FOR TIME SEQUENCE NUMBERS (AVOIDS DUPLICATE KEYS IN PASSIVES)     *         
* RECORDS ARE ON GERMAN DEMFILE (DMGFIL) ONLY                         *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEBTR    DS    X                   RECORD TYPE                                  
DEBTRLWQ EQU   X'70'               - FROM LATEST WEEK'S SLOTS                   
DEBTRL4Q EQU   X'71'               - AVERAGE OF LATEST 4 WEEKS' SLOTS           
DEBTRMPQ EQU   X'72'               - MID POINT AVERAGE(LATEST 4+LATEST)         
*                                                                               
DEBTSREF DS    XL1                 STATION REFERENCE NUMBER                     
*                                                                               
DEBTAUDN DS    X                   AUDIENCE NUMBER                              
DEBTMDAY DS    X                   MONTH/DAY - AL.4(MONTH),AL.4(DAY)            
DEBTBLOK DS    0XL3                BLOCK CODE -                                 
DEBTBLCC DS    X                   TARIF CATEGORY, CC                           
DEBTBLGG DS    X                   TARIF GROUP   , GG                           
DEBTBLNN DS    X                                 , NN                           
         ORG   DEBTBLOK                                                         
DEBTBTIM DS    XL2                 REDEFINED AS MBASE TIME IN PASSIVES          
         DS    XL1                                                              
DEBTIMPS DS    XL3                 IMPRESSIONS IN HUNDREDS                      
DEBTIMXQ EQU   X'0FFFFF'           - MAX VALUE                                  
         ORG   DEBTIMPS                                                         
DEBTSEQN DS    AL.4                SEQUENCE NUMBER                              
         ORG   DEMDKSTC            STATUS BYTE USAGE                            
DEBTSTAT DS    X                   NORMAL STATUS VALUES                         
DEBTINCQ EQU   X'01'               DOESNT CONTAIN ALL 4 WEEKS                   
DEBTGFTQ EQU   X'02'               TIME IS GFK,NOT FROM MBASE                   
DEBTMBGQ EQU   X'04'               RECORD IS MBASE (NOT SLOT) GENERATED         
DEBTCOWQ EQU   X'08'               RECORD CONTAINS DEBWKELQ(S)                  
DEBTEURQ EQU   X'10'               COST IS IN EUROS                             
DEBTCOST DS    XL4                 COST                                         
                                                                                
***********************************************************************         
* SLOT BLOCK TOTAL ELEMENT                                            *         
* NOTE - DURATION IS REPLACED BY AVERAGE DURATION IF DEBTRL4Q/DEBTRMPQ*         
***********************************************************************         
                                                                                
DEBTELD  DSECT                                                                  
DEBTEL   DS    X                                                                
DEBTELQ  EQU   X'32'                                                            
DEBTELEN DS    X                                                                
DEBTETIM DS    XL2                 BLOCK START TIME (FROM MBASE)                
DEBTETSN DS    0AL.4               TIME SEQUENCE NUMBER                         
DEBTETMQ EQU   X'0F'               - MAX ALLOWED VALUE                          
DEBTSLNQ EQU   *-DEBTELD           SHORT ELEMENT LENGTH (DEBTMBGQ ON)           
*                                                                               
DEBTEGFT DS    XL2                 TRUE BLOCK START TIME (FROM GFK)             
DEBTEDUR DS    XL2                 BLOCK DURATION (SECONDS)                     
DEBTFLNQ EQU   *-DEBTELD           FULL ELEMENT LENGTH                          
DEBTLENQ EQU   DEBTFLNQ                                                         
                                                                                
***********************************************************************         
* WEEK MASK/RATE ELEMENT. AT LEAST 1 OF THESE IF DEBTMBGQ ON          *         
***********************************************************************         
                                                                                
DEBWKD   DSECT                                                                  
DEBWKEL  DS    XL1                                                              
DEBWKELQ EQU   X'34'                                                            
DEBWKLEN DS    XL1                                                              
DEBWKMA  DS    XL1                 WEEK MASK - SEE MEGFKMBLKD                   
DEBWKCOS DS    XL4                 COST FOR THE WEEK(S) IN DEBWKMA              
DEBWKLNQ EQU   *-DEBWKD            ELEMENT LENGTH                               
                                                                                
***********************************************************************         
* GERMAN BLOCK SUMMARY RECORDS - VARIABLE BASE PERIODS                *         
* SIMILAR TO DEBT RECORDS, THESE ARE GENERATED FOR MORE FUTURE MONTH  *         
* DAYS BY LOOKING AT PAST COMPLETE MONTHS OF GFK DATA. A SET OF       *         
* DEC97 RECORDS (E.G.) IS BUILT BY LOOKING AT JAN96, FEB96, ETC.      *         
* - UNLIKE DEBT RECORDS IMPS ARE HELD IN AN ELEMENT (NOT IN THE KEY)  *         
* - RECORDS ALSO CONTAIN A DEBTEL, AS ABOVE.                          *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEBVR    DS    X                   RECORD TYPE                                  
DEBVRVBQ EQU   X'7F'                                                            
*                                                                               
DEBVSREF DS    XL1                 STATION REFERENCE NUMBER                     
*                                                                               
DEBVBPER DS    0XL2                BASE PERIOD                                  
DEBVBYY  DS    X                   - BASE YEAR                                  
DEBVBMON DS    X                   - BASE MONTH                                 
DEBVFPER DS    0XL2                FUTURE PERIOD                                
DEBVFYY  DS    X                   - FUTURE YEAR                                
DEBVFMDY DS    X                   - FUTURE MONTH/DAY, AS DEBTMDAY              
DEBVBLOK DS    0XL3                BLOCK CODE -                                 
DEBVBLCC DS    X                   TARIF CATEGORY, CC                           
DEBVBLGG DS    X                   TARIF GROUP   , GG                           
DEBVBLNN DS    X                                 , NN                           
DEBVWKMA DS    X                   "WEEKS VALID" MASK (SEE MEGFKMBLKD)          
DEBVSEQN EQU   DEBVWKMA                                                         
         ORG   DEMDKSTC            STATUS BYTE USAGE                            
DEBVSTAT DS    X                   NORMAL STATUS VALUES                         
DEBVMBGQ EQU   DEBTMBGQ            RECRD IS MBASE GENERATED (ALWAYS ON)         
DEBV20MQ EQU   X'01'               RECORD BUILT WITH 20MIN WINDOW               
DEBV30MQ EQU   X'02'               RECORD BUILT WITH 30MIN WINDOW               
DEBVEURQ EQU   DEBTEURQ            COST IS IN EUROS                             
         DS    X                   SPARE                                        
DEBVCOST DS    XL3                 COST                                         
DEBVCMXQ EQU   X'FFFFFF'           - MAX VALUE                                  
                                                                                
***********************************************************************         
* PERFORMANCE ELEMENT.CONTAINS IMPRESSIONS FOR BASIC AUDIENCES ONLY   *         
***********************************************************************         
                                                                                
DEBPERFD DSECT                                                                  
DEBPEL   DS    X                                                                
DEBPELQ  EQU   X'40'                                                            
DEBPELEN DS    X                                                                
DEBPIMPS DS    0XL3                IMPRESSIONS (100'S)                          
         EJECT                                                                  
***********************************************************************         
* PROGRAMME DETAIL RECORD - <<DEMFILE>>                               *         
*                                                                     *         
* - PRIME KEY IS DDS PROGRAMME CODE (DEMPRG), AREA NUMBER,            *         
*   CHANNEL, COMPLEMENTED DATE AND START TIME OF TRANSMISSION.        *         
*   SO APPEAR IN REVERSE CHRONOLOGICAL SEQUENCE, LATEST FIRST.        *         
* - CHRONOLOGICAL PASSIVE POINTER BY AREA NUMBER, CHANNEL, DATE,      *         
*   END TIME AND DEMPRG - ALLOWS LOOKUP OF PROGRAMME SCHEDULE         *         
*   FOR STATION.                                                      *         
* - HISTORICAL PASSIVE POINTER BY DEMPRG, COMPLEMENTED DATE AND       *         
*   START TIME, AREA NUMBER AND CHANNEL - ALLOWING HISTORY OF A       *         
*   SINGLE PROGRAMME TO BE READ ACCROSS ALL STATIONS IN REVERSE       *         
*   CHRONOLOGICAL SEQUENCE, LATEST FIRST.                             *         
* - 1 RECORD PER TRANSMISSION CONTAINS 1 LIVE/TIMESHIFT ELEMENT       *         
*   PAIR. NO OTHER ELEMENT TYPE PRESENT.                              *         
* - PROGRAMME HEADER RECORD ON MEDFILZ, KEYED BY DEMPRG.              *         
* - PRESENT FOR ALL CHANNELS. BBC DATA IS HELD BY ITV AREA. BBC       *         
*   REGIONAL DATA, AND ITV BY BBC REGION, AVAILABLE ON BARB TAPE      *         
*   BUT DISCARDED.                                                    *         
*                                                                     *         
* NETWORK PROGRAMME RECORDS, AVAILABLE FOR DDS DATA AS-OF ??????      *         
* KEY MUCH THE SAME AS REGULAR PROGRAMME RECORDS ABOVE, APART FROM    *         
* FORMAT OF TIME AND CHRONO SEQUENCE                                  *         
* TIME IS HELD IN 1.5 BYTES, LEFT ALIGNED (EG 0600 IS X'2580), WITH   *         
* A 0-BASED SEQUENCE NUMBER IN THE REMAINING RIGHT-HAND 0.5 BYTE TO   *         
* AVOID DUPLICATE KEYS                                                *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKPRGR  DS    XL1                 RECORD TYPE                                  
DEKPRGRQ EQU   X'40'               PROGRAMME DETAIL RECORD                      
DEKPADVQ EQU   X'08'               RECORD IS 'ADVANCE'                          
DEKPRGAQ EQU   DEKPRGRQ+DEKPADVQ   ADVANCE PROGRAMME DETAIL RECORD              
         DS    XL2                 PADDING                                      
DEKPRGNO DS    0XL3                DEMPRG                                       
DEKPRGAS DS    XL1                 ADVANCE PGM SOURCE (SEE DEKHDRAS)            
DEKPRGAN DS    XL2                 ADVANCE PGM DEMPRG                           
DEKPALOQ EQU   100000              LOWEST DDS PROG - 2002 ON                    
*                                                                               
DEKPRGSR DS    0XL1                GERMANY - STATION REFERENCE #                
*                                                                               
DEKPRGAC DS    0XL2                                                             
DEKPRGAR DS    XL1                 AREA NUMBER                                  
DEKPRGNQ EQU   255                 - IS A 'NETWORK' PROGRAMME                   
DEKPRGCH DS    XL1                 CHANNEL CODE, SEE DEKSLTCH                   
DEKPBB1Q EQU   X'41'               - NET PROGS. BBC1                            
DEKPBB2Q EQU   X'42'               - NET PROGS. BBC2                            
DEKPITVQ EQU   X'03'               - NET PROGS. ITV                             
DEKPGMTQ EQU   X'83'               - NET PROGS. GMTV                            
DEKPCH4Q EQU   X'04'               - NET PROGS. C4                              
DEKPS4CQ EQU   X'44'               - NET PROGS. S4C                             
DEKPCH5Q EQU   X'05'               - NET PROGS. C5                              
         DS    XL2                 FOR FUTURE USE                               
*                                                                               
DEKPRGCD DS    XL2                 COMPLEMENTED COMPRESSED DATE                 
DEKPRGCS DS    XL2                 COMPLEMENTED START TIME (HHMM)               
         DS    XL1                 FOR FUTURE USE                               
         ORG   DEKPRGCS                                                         
*                                  NETWORK PROGRAMMES ONLY                      
DEKPRGNT DS    AL.12               LEFT-ALIGNED (REGULAR) START TIME            
DEKPRGSN DS    AL.4                TIME SEQUENCE NUMBER                         
DEKPRGMQ EQU   X'0F'               - MAX ALLOWED VALUE                          
                                                                                
         ORG   DEMDKEY                                                          
         DS    XL1                 ** CHRONOLOGICAL PASSIVES **                 
DEKPRCRQ EQU   X'C0'               - CHRONOLOGICAL PASSIVE                      
DEKPRCAQ EQU   DEKPRCRQ+DEKPADVQ   - ADVANCE CHRONOLOGICAL PASSIVE              
         DS    XL2                 PADDING                                      
*                                                                               
DEKPRCSR DS    0XL1                GERMANY - STATION REFERENCE NUMBER           
*                                                                               
DEKPRCAC DS    0XL2                                                             
DEKPRCAR DS    XL1                 AREA NUMBER                                  
DEKPRCCH DS    XL1                 CHANNEL CODE, SEE DEKSLTCH                   
         DS    XL2                 FOR FUTURE USE                               
DEKPRCDT DS    XL2                 COMPRESSED DATE                              
DEKPRCEF DS    0XL3                                                             
DEKPRCET DS    XL2                 END TIME (HHMM)                              
DEKPRCES DS    XL1                 END SECONDS (GIVES UNIQUENESS)               
*                                                                               
DEKPRCNO DS    0XL3                DEMPRG                                       
DEKPRCAS DS    XL1                 ADVANCE PGM SOURCE (SEE DEKHDRAS)            
DEKPRCAN DS    XL2                 ADVANCE PGM DEMPRG                           
         ORG   DEKPRCET                                                         
*                                  NETWORK PROGRAMMES ONLY                      
DEKPRCNT DS    AL.12               LEFT-ALIGNED TIME                            
DEKPRCSN DS    AL.4                TIME SEQUENCE NUMBER                         
                                                                                
         ORG   DEMDKEY                                                          
         DS    XL1                 ** HISTORY PASSIVES **                       
DEKPRHRQ EQU   X'C1'               - HISTORY PASSIVE                            
DEKPRHAQ EQU   DEKPRHRQ+DEKPADVQ   - ADVANCE HISTORY PASSIVE                    
         DS    XL2                 PADDING                                      
DEKPRHNO DS    0XL3                DEMPRG                                       
DEKPRHAS DS    XL1                 ADVANCE PGM SOURCE (SEE DEKHDRAS)            
DEKPRHAN DS    XL2                 ADVANCE PGM DEMPRG                           
DEKPRHCD DS    CL2                 COMPLEMENTED COMPRESSED DATE                 
DEKPRHCS DS    XL2                 COMPLEMENTED START TIME (HHMM)               
         DS    XL1                 FOR FUTURE USE                               
*                                                                               
DEKPRHSR DS    0XL1                GERMANY - STATION REFERENCE NUMBER           
*                                                                               
DEKPRHAC DS    0XL2                                                             
DEKPRHAR DS    XL1                 AREA NUMBER                                  
DEKPRHCH DS    XL1                 CHANNEL CODE, SEE DEKSLTCH                   
         DS    XL2                 FOR FUTURE USE                               
         ORG   DEKPRHCS                                                         
*                                  NETWORK PROGRAMMES ONLY                      
DEKPRHNT DS    AL.12               LEFT-ALIGNED TIME                            
DEKPRHSN DS    AL.4                TIME SEQUENCE NUMBER                         
         EJECT                                                                  
***********************************************************************         
* STATUS BYTE USAGE FOR ALL PROGRAMME RECORD TYPES                    *         
* NOTE - DEKPRGLN NULL IF RECORD CONTAINS ONLY AGB-DELETED ELEMENTS   *         
***********************************************************************         
                                                                                
         ORG   DEMDKSTC                                                         
DEKPRGDC DS    XL1                 DAYCODE (BITS 5-7)                           
DEKPRGDP DS    XL2         DPT BIT MASK (0=DP1,14=DP15) *NO MORE-OCT98*         
         ORG   DEKPRGDP                                                         
DEKPRG#A DS    XL1                 # AREAS (NET PGMS ONLY-SEE DEPRA#AC)         
         DS    XL1                                                              
DEKPRGLN DS    XL2                 LENGTH (MINUTES)                             
         EJECT                                                                  
***********************************************************************         
* PROGRAMME PERFORMANCE DETAIL ELEMENT                                *         
***********************************************************************         
                                                                                
DEPRGD   DSECT                                                                  
DEPRGEL  DS    XL1                                                              
DEPRGELQ EQU   X'40'                                                            
DEPRGLEN DS    XL1                                                              
DEPRGTM  DS    XL2                 START TIME (HHMM)                            
DEPRGTS  DS    X                   START TIME (SS)                              
DEPRGLN  DS    XL2                 LENGTH (MINUTES)                             
DEPRGES  DS    XL1                 END TIME (SS) - WAS DAYPART                  
         DS    XL1                 SPARE (WAS DAYCODE)                          
         DS    XL1                 SPARE                                        
*EPRGWK  DS    XL1                 BARB WEEK NO. OF RECORD                      
DEPRGET  DS    XL2                 END TIME (HHMM)                              
DEPRGIND DS    XL1                 INDICATORS / TIMESHIFT FLAG                  
* NOTE: X'10' USED TO BE SET TO SHOW NO FOLLOWING TIMESHIFT ELEMENT -           
* >> STILL APPEARS TO BE SET ????? 18/4/94 DLOW (NO MORE - CBLA)                
DEPRGCXQ EQU   X'80'               CANCELLED BY AGB                             
*EPRGD3Q EQU   X'40'               DATA SOURCE WAS DB3                          
*              FOLLOWING PRESENT ONLY ON DEMFILE - DROPPED BY DEMAND            
DEPRGSHQ EQU   X'10'               DATA SOURCE WAS DB3 SHUFFLE (DB1)            
DEPRGTSQ EQU   X'20'               ELEMENT CONTAINS TIMESHIFT DATA              
DEPRGAMD DS    XL2                 CMPRSD DATE OF AMEND/CANCEL BY AGB           
*                                  ZERO IF NOT AMENDED/DELETED                  
DEPRGLNQ EQU   *-DEPRGD            LENGTH EXCLUDING IMPS                        
*                                                                               
DEPRGIMP DS    0XL3                IMPS IN 100S PER SELECTED AUDIENCES          
*                                  AS RETURNED BY DEMAND                        
*                                                                               
         DS    0X                  IMPS IN 100S PER DEMMXANQ AUDIENCES          
*                                  (INCL XTRA LIVE 'HOMES REC"ING' AUD)         
*                                  SEE UNDER ELEMENT LIST FOR FORMAT            
*                                                                               
* NB - GERMAN PROG RECORDS DO NOT CARRY IMPS                                    
                                                                                
***********************************************************************         
* PROGRAMME AREA ACTIVITY ELEMENT (UK NETWORK PROGRAMMES ONLY)        *         
* BARB 2002:                                                          *         
* - CONTAINS ATR SUPPLIED BIT LIST                                    *         
* BARB 91:                                                            *         
* EACH ACTIVE AREA REPRESENTED BY C'Y' IN DEPRAMAP. SEE AGB FILE      *         
* SPEC FOR DESCRIPTION                                                *         
***********************************************************************         
                                                                                
DEPRAD   DSECT                                                                  
DEPRAEL  DS    XL1                                                              
DEPRAELQ EQU   X'4F'                                                            
DEPRALEN DS    XL1                                                              
DEPRA#AC DS    XL1                 #ACTIVE ENTRIES                              
DEPRABMP DS    XL2                 ATR-SUPPLIED BIT LIST                        
DEPRASLQ EQU   *-DEPRAD                                                         
*                                                                               
DEPRA#TO DS    XL1                 ..MAX #ENTRIES (UNUSED @ PRESENT)            
DEPRAMAP DS    CL13                AREA HIT LIST                                
DEPRAMAQ EQU   C'1'                - ACTIVE                                     
DEPRAMIQ EQU   C'0'                - INACTIVE                                   
DEPRALNQ EQU   *-DEPRAD                                                         
                                                                                
***********************************************************************         
* PROGRAMME TOTAL CHANNEL DATA (SHARE) ELEMENT (UK)                   *         
* IMPS ARE AS REGULAR DEPRGIMP, BUT IN FACT ONLY FOR SMALL SUBSET OF  *         
* STANDARD AUDIENCES - SEE AGB SPEC FOR DETAILS (PRE-2002).           *         
*                                                                     *         
* 2002 AND BEYOND, IT'S LIKE THIS ...  EVERY PROGRAMME, BE IT         *         
* NETWORK OR REGIONAL, POTENTIALLY HAS AT LEAST SOME OF THESE         *         
* ELEMENTS. ALL FIGURES ARE FOR THE DURATION OF THE PROGRAMME IN      *         
* QUESTION. TYPE 2'S ARE DEFUNCT FOR 2002 ONWARDS.                    *         
*                                                                     *         
* REGIONAL (EG ULSTER3) - TYPES 1 AND 3. VALUES ARE FOR TOTAL TV      *         
*                         ACTIVITY IN THAT REGION                     *         
* MCH      (EG SKY1)    - TYPES 1 AND 3. VALUES ARE FOR TOTAL PANEL   *         
*                         70 OR 71 ACTIVITY                           *         
* NETPROG               - TYPES 1 AND 3. VALUES ARE FOR TOTAL TV      *         
*                         ACTIVITY ACROSS THE NETWORK                 *         
*                       - TYPES 4 AND 5 ARE PRESENT ON PARTIALLY      *         
*                         NETWORKED NETPROGS ONLY. VALUES ARE FOR     *         
*                         ACTIVITY IN THE REGION(S) THE NETPROG IS    *         
*                         TRANSMITTED ON.                             *         
***********************************************************************         
                                                                                
DEPRTD   DSECT                                                                  
DEPRTEL  DS    XL1                                                              
DEPRTELQ EQU   X'48'                                                            
DEPRTLEN DS    XL1                                                              
DEPRTTYP DS    XL1                 SUBTYPE                                      
DEPRTTXQ EQU   1          - LIVE TOTAL TV AUD (EXCL PLAYBACK)                   
DEPRTTPQ EQU   2          - LIVE TOTAL TV AUD (INCL PLAYBACK). DEFUNCT!         
DEPRTTCQ EQU   3          - CONS TOTAL TV AUDIENCE                              
DEPRTTLQ EQU   4          - LIVE CHANNEL AUD (PARTIAL NET PROGS ONLY)           
DEPRTTTQ EQU   5          - CONS CHANNEL AUD (PARTIAL NET PROGS ONLY)           
DEPRTLNQ EQU   *-DEPRTD            LENGTH EXCLUDING IMPS                        
DEPRTIMP DS    0XL3                IMPS IN 100S                                 
                                                                                
***********************************************************************         
* PROGRAMME MISCELLANEOUS ELEMENT (2002+)                             *         
***********************************************************************         
                                                                                
DEPRMD   DSECT                                                                  
DEPRMEL  DS    XL1                                                              
DEPRMELQ EQU   X'49'                                                            
DEPRMLEN DS    XL1                                                              
DEPRMPHD DS    XL2                 HD PLATFORM INDICATOR - 2010                 
*DEPRMTDU DS    XL2                 DUR USED FOR SUPPLIED IMPS - 2002           
DEPRMPLA DS    XL2                 PLATFORM INDICATOR, AS DESPMPLA              
DEPRMBPN DS    CL20                BROADCASTERS PROG. NUMBER                    
DEPRMPSP DS    XL1                 PROGRAMME SPONSORED FLAG                     
DEPRMP1Q EQU   X'01'               YES, BUMPERS INCLUDED IN TIMES               
DEPRMP2Q EQU   X'02'               YES, BUMPERS NOT INCLUDED IN TIMES           
DEPRMP3Q EQU   X'03'               NOT SPONSORED                                
*                                                                               
DEPRMLNQ EQU   *-DEPRMD            L'FIXED PORTION                              
DEPRMSPN DS    0CL35               NAME OF SPONSOR (IF ANY)                     
                                                                                
***********************************************************************         
* PROG BLOCK DETAIL ELEMENTS (GERMANY ONLY)                           *         
***********************************************************************         
                                                                                
DEPRBD   DSECT                                                                  
DEPRBEL  DS    X                                                                
DEPRBELQ EQU   X'41'                                                            
DEPRBLEN DS    X                                                                
DEPRBLK  DS    0XL(DEPRBBLQ)       BLOCK DETAILS                                
DEPRBST  DS    0XL3                START TIME HHMMSS                            
DEPRBSH  DS    XL1                                                              
DEPRBSM  DS    XL1                                                              
DEPRBSS  DS    XL1                                                              
DEPRBET  DS    0XL3                END TIME HHMMSS                              
DEPRBEH  DS    XL1                                                              
DEPRBEM  DS    XL1                                                              
DEPRBES  DS    XL1                                                              
DEPRBNO  DS    0XL4                BLOCK NUMBER                                 
DEPRBNC  DS    X                   CC                                           
DEPRBNG  DS    X                   GG                                           
DEPRBNH  DS    X                   HH                                           
DEPRBNN  DS    X                   NN                                           
DEPRBBLQ EQU   *-DEPRBST                                                        
DEPRBLNQ EQU   *-DEPRBD                                                         
                                                                                
***********************************************************************         
* BLOCK NUMBER PASSIVES, BUILT FROM DEPRBEL'S                         *         
* NB SAME FORMAT AS DEKSLBQ                                           *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKPRBR  DS    X                                                                
DEKPRBRQ EQU   X'C2'                                                            
DEKPRBAQ EQU   X'CA'               ADVANCE                                      
*                                                                               
DEKPRBSR DS    XL1         +1      STATION REFERENCE NUMBER                     
DEKPRBDT DS    XL2         +2      COMPRESSED DATE                              
DEKPRBNO DS    0XL4                BLOCK NUMBER                                 
DEKPRBNC DS    X                   CC                                           
DEKPRBNG DS    X                   GG                                           
DEKPRBNH DS    X                   HH (NULL)                                    
DEKPRBNN DS    X                   NN                                           
DEKPRBET DS    XL2                 PROG END TIME (FOR UNIQUENESS)               
         EJECT                                                                  
***********************************************************************         
* BRAND DETAIL (SPOT) RECORD - <<DEMFILE>>                            *         
*                                                                     *         
* - PRIME KEY IS DDS BRAND CODE (DEMPRO), AREA NUMBER, CHANNEL,       *         
*   DATE OF TRANSMISSIONS AND A SEQUENCE NUMBER. TIME IS NOT          *         
*   PRESENT IN KEY.                                                   *         
* - CHRONOLOGICAL PASSIVE POINTER BY AREA NUMBER, CHANNEL, DATE,      *         
*   SEQUENCE NUMBER AND DEMPRO - ALLOWS LOOKUP OF SPOT SCHEDULE       *         
*   FOR STATION.                                                      *         
* - 1 OR MORE RECORDS PER DAY CONTAIN A LIVE/TIMESHIFT ELEMENT        *         
*   PAIR FOR EACH OF UP TO EIGHT SPOTS IN THE DAY. FURTHER SPOT       *         
*   DATA FOR THE SAME DAY IS HELD IN CONTINUATION RECORDS WITH        *         
*   NEXT HIGHER SEQUENCE NUMBER IN KEY.                               *         
* - EACH SPOT ELEMENT MAY HAVE ONE OR MORE SPOT MATCH ELEMENTS        *         
*   ASSOCIATED WITH IT.                                               *         
* - BRAND HEADER RECORD ON MEDFILZ, KEYED BY DEMPRO.                  *         
* - PRESENT ONLY FOR COMMERCIAL CHANNELS, NOT BBC1 OR BBC2.           *         
* - ALL BRAND SUMMARY DATA FOR SPOTS IS HELD IN BUCKET RECORDS.       *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKSPTR  DS    XL1                 RECORD TYPE                                  
DEKSPTRQ EQU   X'50'                                                            
         DS    XL2                 PADDING                                      
DEKSPTNO DS    XL3                 DEMPRO                                       
DEKSPTAC DS    0XL2                                                             
DEKSPTAR DS    XL1                 AREA NUMBER                                  
DEKSPTCH DS    XL1                 CHANNEL CODE                                 
         DS    XL2                 FOR FUTURE USE                               
DEKSPTDT DS    XL2                 COMPRESSED DATE                              
         ORG   DEMFILED+DEMDKYLQ-1                                              
DEKSPTSQ DS    XL1                 SEQUENCE NUMBER                              
                                                                                
         ORG   DEMDKEY                                                          
         DS    XL1                 CHRONOLOGICAL PASSIVE                        
DEKSPCRQ EQU   X'D0'                                                            
         DS    XL2                 PADDING                                      
DEKSPCAC DS    0XL2                                                             
DEKSPCAR DS    XL1                 AREA NUMBER                                  
DEKSPCCH DS    XL1                 CHANNEL CODE, SEE DEKSLTCH                   
         DS    XL2                 FOR FUTURE USE                               
DEKSPCDT DS    XL2                 COMPRESSED DATE                              
DEKSPCNO DS    XL3                 DEMPRO                                       
         ORG   DEMFILED+DEMDKYLQ-1                                              
DEKSPCSQ DS    XL1                 SEQUENCE NUMBER                              
*                                                                               
         ORG   DEMDKSTC            STATUS BYTE USAGE                            
                                                                                
* NOTE - DEKSPTDP/SL NULL IF RECORD CONTAINS ONLY AGB-DELETED                   
* ELEMENTS                                                                      
                                                                                
DEKSPTDC DS    XL1                 DAYCODE (BITS 5-7)                           
DEKSPTDP DS    XL2                 DAYPART BIT MASK (BIT 0=DP1,14=DP15)         
DEKSPTSL DS    XL2                 SPOTLEN IF ALL SPOTS SAME, ELSE MASK         
*                                  MASK BITS IN DEKSPTSL+0                      
DEKSMSLQ EQU   X'80'               ON IF DEKSPTSL IS A BIT MASK                 
DEKSOSLQ EQU   X'40'               ON IF ANY SPOTLEN BETWEEN BIT VALUES         
*                                  (WILL USE BIT FOR NEXT HIGHER LEN)           
DEKSS01Q EQU   X'20'               10 SECONDS PRESENT                           
DEKSS02Q EQU   X'10'               20 SECONDS PRESENT                           
DEKSS03Q EQU   X'08'               30 SECONDS PRESENT                           
DEKSS04Q EQU   X'04'               40 SECONDS PRESENT                           
DEKSS05Q EQU   X'02'               50 SECONDS PRESENT                           
DEKSS06Q EQU   X'01'               60 SECONDS PRESENT                           
*                                  MASK BITS IN DEKSPTSL+1                      
DEKSS07Q EQU   X'80'               70 SECONDS PRESENT                           
DEKSS08Q EQU   X'40'               80 SECONDS PRESENT                           
DEKSS09Q EQU   X'20'               90 SECONDS PRESENT                           
DEKSS10Q EQU   X'10'               100 SECONDS PRESENT                          
DEKSS11Q EQU   X'08'               110 SECONDS PRESENT                          
DEKSS12Q EQU   X'04'               120 SECONDS PRESENT                          
DEKSS24Q EQU   X'02'               240 SECONDS PRESENT                          
DEKSSOTQ EQU   X'01'               >240 SECONDS PRESENT                         
                                                                                
***********************************************************************         
* TRANSMISSION DETAIL ELEMENT                                         *         
***********************************************************************         
                                                                                
*DESPTMXQ EQU   06                 MAX SPOT EVENTS PER RECORD                   
DESPMXNQ EQU   63                  NEW MAX SPOT EVENTS PER RECORD               
* NOTE SOME IMTV SPOTS 2004 PACKED > 63 BY DEMXFER BUG DEC2005                  
* DEMAND NOT BOTHERED AND HARMLESS AS BEYOND MATCHING/AMENDING                  
                                                                                
DESPTD   DSECT                                                                  
DESPTEL  DS    XL1                                                              
DESPTELQ EQU   X'50'                                                            
DESPTLEN DS    XL1                                                              
DESPTTM  DS    XL2                 TIME (HHMM)                                  
DESPTTS  DS    XL1                 TIME (SS)                                    
DESPTSL  DS    XL2                 SPOT LENGTH                                  
DESPTDP  DS    XL1                 DAYPART CODE (1-15)                          
*                                                                               
DESPTIN2 DS    XL1                 BARB 2002                                    
DESPTTVQ EQU   X'01'               COMMERCIAL TYPE - TELESHOPPING               
*                                  NOT SET=REGULAR COMMERCIAL SPOT              
DESPTINQ EQU   X'02'               INTERACTIVE SPOT (SEE DESPMEL)               
DESPTGIQ EQU   X'04'               BREAK TYPE- GOING IN                         
DESPTCBQ EQU   X'08'               BREAK TYPE- CENTRE BREAK                     
DESPTEBQ EQU   X'10'               BREAK TYPE- END BREAK                        
DESPTANQ EQU   X'20'               DESPMPLA CONTAINS ANAL (WAS OLDSOCK)         
DESPTDDQ EQU   X'40'               BREAK TYPE SET BY DDS, NOT SUPPLIED          
DESPTDIQ EQU   X'80'               DESPMPLA CONTAINS DIGITAL                    
*                                                                               
*DESPTWK  DS    XL1                 BARB WEEK NO. OF SPOT                       
DESPTIN3 DS    XL1                 RE-USE OF DEFUNCT DESPTWK                    
DESPTSBQ EQU   X'80'               THIS ELEMENT=SPONSORSHIP BUMPER              
*                                                                               
DESPTNIB DS    XL1                 TOTAL NUMBER OF SPOTS IN BREAK               
DESPTPIB DS    XL1                 POSITION OF THIS SPOT IN BREAK               
DESPTIND DS    XL1                 INDICATORS / TIMESHIFT FLAG                  
DESPTCXQ EQU   X'80'               CANCELLED BY AGB                             
DESPTICQ EQU   X'40'               TAM 2010   (1DAY) - TAM  2010                
* (X'40' THEN MEANT 3DAYLIVE       INCOMPLETE (3DAY) - BARB 2002                
* (X'40' WAS DESPTD3Q - DATA SOURCE WAS DB3)                                    
DESPTTSQ EQU   X'20'               ELEMENT CONTAINS TIMESHIFT DATA              
*                                  (ON FILE BUT DROPPED BY DEMAND)              
*DESPTSHQ EQU   X'10' DEFUNCT        DATA SOURCE WAS DB3 SHUFFLE (DB1)          
DESPTPEQ EQU   X'08'               THIS IS EMPTY IRISH PSEUDO SPOT              
*              FOLLOWING ADDED TO ELEMENTS RETURNED BY DEMAND                   
DESPTELN EQU   X'0F' - PREB2002    SEQ NUMBER OF ELEMENT IN FILE RECORD         
DESPTE2N EQU   X'3F' - PREB2002    FOR NEW DESPTMXQ                             
DESPTAMD DS    XL2                 DATE OF AMEND/CANCEL/INSERT BY AGB           
*                                  ZERO IF NOT AMENDED/DELETED                  
DESPTLNQ EQU   *-DESPTD            LENGTH EXCLUDING IMPS                        
*                                                                               
DESMXDNQ EQU   DESPTLNQ+(DEMMXANQ*L'DESPTIMP)  NEW MAX LENGTH OF A              
*                                              DECOMPRESSED NON-BUCKET          
DESPTIMP DS    0XL3                IMPS IN 100S PER SELECTED AUDIENCES          
*                                  AS RETURNED BY DEMAND                        
*                                                                               
         DS    0X                  IMPS IN 100S PER DEMMXANQ AUDIENCES          
*                                  (+ EXTRA LIVE 'HOMES RECORDING' AUD)         
*                                  SEE UNDER ELEMENT LIST FOR FORMAT            
*                                                                               
*        SEE UNDER ELEMENT LIST FOR NOTES ON SPOT ELEMENT USAGE.                
***********************************************************************         
* COMMERCIAL SPOT MISCELLANEOUS INFO ELEMENT                          *         
***********************************************************************         
                                                                                
DESPMD   DSECT                                                                  
DESPMEL  DS    XL1                                                              
DESPMELQ EQU   X'52'                                                            
DESPMLEN DS    XL1                 LENGTH VARIABLE                              
DESPMTM  DS    XL2                 TIME (HHMM) = DESPTTM OF ASSOC. SPOT         
DESPMTS  DS    XL1                 TIME (SS)   = DESPTTS OF ASSOC. SPOT         
DESPMCSN DS    PL8                 COMMERCIAL SPOT NUMBER                       
DESPMPLA DS    XL2                 PLATFORM INDICATOR                           
DESPMATQ EQU   X'0001'             - ANALOGUE TERRESTRIAL                       
DESPMDTQ EQU   X'0002'             - DIGITAL TERRESTRIAL                        
DESPMASQ EQU   X'0004'             - ANALOGUE SATELLITE                         
DESPMDSQ EQU   X'0008'             - DIGITAL SATELLITE                          
DESPMACQ EQU   X'0010'             - ANALOGUE CABLE                             
DESPMDCQ EQU   X'0020'             - DIGITAL CABLE                              
DESPMOTQ EQU   X'0040'             - OTHER (PC/IPLAYERS/ ETC...)                
DESPMAPQ EQU   X'7F'               - ALL PLATFORMS                              
DESPMUKQ EQU   0                   (UNCODED, IMPLIES ALL)                       
DESPMANQ EQU   DESPMATQ+DESPMASQ+DESPMACQ                                       
DESPMDIQ EQU   DESPMDTQ+DESPMDSQ+DESPMDCQ                                       
*                                                                               
DESPMMIB DS    XL1                 MISC INDICATOR BYTE                          
DESPGFWQ EQU   X'08'               NEW ELEMENT FORMAT FROM MAY 2008             
DESPMJPQ EQU   X'80'               COM INTERACTIVE TYPE- JUMP                   
DESPMTGQ EQU   X'40'               COM INTERACTIVE TYPE- TAG                    
DESPMSFQ EQU   X'20'               COM INTERACTIVE TYPE- STORE & FORWD          
DESPMTUQ EQU   X'01'               COM INTERACTIVE TYPE- UNKNOWN                
*<>                                                                             
DESPMCTL DS    XL1                 LENGTH OF COMMERCIAL TITLE (0 TO 35)         
DESPMLNQ EQU   *-DESPMD            L'FIXED PORTION                              
*THE END OF THIS ELEMENT HAS BEEN USELESS AND WRONG SINCE 1JAN2002              
*1 DESPMCMT WAS THE BROADCASTERS PRODUCT TITLE, A USELESS THING                 
*           AS EACH STATION HAD DIFFERING (OR NO) VALUE.                        
*2 ICON     WAS SET AT FIXED DISPLACEMENT BUT L'15 WAS ADDED                    
*           TO VARIABLE ELEN=BUG1 IN MEDEMOUPD+MEAMENDSU,                       
*           SO CONTENT OF DESPMICO TRUNCATED/MISSING !                          
*           IN ANY CASE INCOMING WAS A 20 BYTE FIELD (BUG2)                     
*<>                                                                             
*           GOING FWDS, NO LONGER SET THESE FIELDS AND                          
*           REDEFINE FROM DESPMCTL ONWARDS FOR OTHER USE.                       
*<>                                                                             
DESPMCMT DS    CL35                COMMERCIAL TITLE (VARIABLE LENGTH)           
*                                  THEN ICON DESCRIPTOR (IF SUPPLIED)           
DESPMICO DS    CL15                ICON DESCRIPTOR                              
*<>                                                                             
         ORG   DESPMCTL                                                         
DESPMHDP DS    XL2                 HD PLATFORM INDICATOR                        
DESPML2Q EQU   *-DESPMD            NEW FIXED LENGTH FROM MAY08                  
         ORG                                                                    
                                                                                
                                                                                
***********************************************************************         
* SALES HOUSE ELEMENT - AS OF?????? 2004                              *         
***********************************************************************         
                                                                                
DESHD    DSECT                                                                  
DESHEL   DS    XL1                                                              
DESHELQ  EQU   X'54'                                                            
DESHLEN  DS    XL1                                                              
DESHTM   DS    XL2                 TIME (HHMM) OF ASSOC. SPOT                   
DESHTS   DS    XL1                 TIME (SS)   OF ASSOC. SPOT                   
DESHCODE DS    XL1                 SEE MEATRSALE FOR VALUES                     
DESHLNQ  EQU   *-DESHD                                                          
                                                                                
***********************************************************************         
* TRANSMISSION ITVA FILM ELEMENT                                      *         
***********************************************************************         
                                                                                
DESPFD   DSECT                                                                  
DESPFEL  DS    XL1                                                              
DESPFELQ EQU   X'5C'                                                            
DESPFLEN DS    XL1                 LENGTH VARIABLE                              
DESPFTM  DS    XL2                 TIME (HHMM) = DESPTTM OF ASSOC. SPOT         
DESPFTS  DS    XL1                 TIME (SS)   = DESPTTS OF ASSOC. SPOT         
DESPFLNQ EQU   *-DESPFD                                                         
DESPFFC  DS    0CL20               ITVA FILM CODE (EVT FILM CODE)               
*                                                                               
* AN ITVA FILM ELEMENT IS USED TO ASSOCIATE AN ITVA FILM CODE WITH A            
* COMMERCIAL TRANSMISSION. EACH SPOT FOR WHICH BARB GIVES AN ITVA FILM          
* CODE WILL HAVE AN SPF ELEMENT ASSOCIATED WITH IT.  IF A FILM CODE IS          
* NOT GIVEN FOR A SPOT NO FILM ELEMENT WILL BE PRESENT. A SPOT CANNOT           
* HAVE MORE THAN ONE ITVA FILM CODE, SO CANNOT HAVE MORE THAN ONE FILM          
* ELEMENT.                                                                      
*                                                                               
* ITVA FILM CODES SHOULD BE OF THE FORM 'AAA/CCPPFFF/SSS'. 'AAA' IS THE         
* AGENCY IPA CODE, 'CCPPFFF' IS THE AGENCYS CHOSEN CLIENT CODE, PRODUCT         
* CODE AND COMMERCIAL NUMBER, AND 'SSS' IS THE SECONDS LENGTH. THE              
* INPUT CODES WILL NORMALLY HAVE ALL SPECIAL CHARACTERS REMOVED,                
* INCLUDING AMPERSANDS FORMING PART OF THE AGENCY CODE. THE CODES ALSO          
* NEED NOT FOLLOW THE PATTERN ABOVE.  BECAUSE OF THIS, THE FORMAT OF            
* THE CODE CANNOT BE RELIED UPON, AND IT IS HELD EXACTLY AS RECIEVED            
* FROM AGB.                                                                     
                                                                                
***********************************************************************         
* DAVID GRAHAM PROGRAMME AMENDMENT HISTORY ELEMENT. ADDED TO          *         
* PROGRAMME HEADER RECORD EACH TIME DGRA CHANGE APPLIED.              *         
***********************************************************************         
                                                                                
DEPDGELD DSECT                                                                  
DEPDGEL  DS    XL1                                                              
DEPDGELQ EQU   X'5D'                                                            
DEPDGLEN DS    CL1                                                              
DEPDGAFD DS    CL2                 DATE CHANGE APPLIED TO FILE (MEDZ)           
DEPDGWKN DS    XL2                 WEEK NO OF DGRA FILE                         
DEPDGDAY DS    XL1                 DAY NO OF DGRA FILE                          
DEPDGIND DS    XL1                 TYPES OF CHANGE                              
DEPDGGCQ EQU   X'01'               - GENRE CODE CHANGE                          
DEPDGNMQ EQU   X'02'               - NAME CHANGE                                
*DEAD* DEPDGBRQ EQU   X'04'  - BRD CODE CHANGE                                  
DEPDGLNQ EQU   *-DEPDGELD                                                       
                                                                                
***********************************************************************         
* TRANSMISSION HISTORY ELEMENTS ARE A RECORD OF AMENDMENTS TO A       *         
* PARTICULAR SPOT. A SPOT WITHOUT AN SPHEL CAN BE ASSUMED TO BE AN    *         
* ORIGINAL SPOT LOADED FROM A DAILY OR WEEKLY SPOT FILE AND NEVER     *         
* SUBSEQUENTLY CHANGED. EACH AMENDMENT TO A SPOT HAS A LOG ENTRY IN   *         
* THE SPOT'S SPHEL.                                                   *         
***********************************************************************         
                                                                                
DESPHD   DSECT                     TRANSMISSION HISTORY ELEMENT                 
DESPHEL  DS    XL1                                                              
DESPHELQ EQU   X'5E'                                                            
DESPHLEN DS    XL1                                                              
DESPHTM  DS    XL2                 TIME (HHMM) = DESPTTM OF ASSOC. SPOT         
DESPHTS  DS    XL1                 TIME (SS)   = DESPTTS OF ASSOC. SPOT         
DESPHLNQ EQU   *-DESPHD            MIN LENGTH PLUS AT LEAST 1 LOG ENTRY         
DESPHAEL DS    0XL5                AMENDMENT LOG ENTRY                          
DESPHAFD DS    XL2                 DATE ACTION APPLIED TO FILE                  
DESPHACT DS    XL1                 ACTION: I=INSERT, A=AMEND, D=DELETE          
DESPHAID DS    XL2                 DATE OF SPOT FILE CONTAINING AMEND           
                                                                                
***********************************************************************         
* ARTIST FEE TVR ELEMENT                                              *         
***********************************************************************         
                                                                                
DESPAD   DSECT                                                                  
DESPAEL  DS    XL1                                                              
DESPAELQ EQU   X'5F'                                                            
DESPALEN DS    XL1                                                              
DESPAFTS DS    XL4                 'ALL INDIV/C' NETWORK TVRS, 4 D.P.           
*                                                                               
DESPALNQ EQU   *-DESPAD                                                         
*                                                                               
* IF GDAFTVRS = Y IN DEMAND BLOCK, DEMAND BUILDS AND ADDS AN ARTIST FEE         
* TVR ELEMENT TO EACH SPOT RECORD IT RETURNS. THIS ELEMENT DOES NOT             
* EXIST ON THE DEMO FILE.                                                       
*                                                                               
         EJECT                                                                  
***********************************************************************         
* BUCKET RECORD - <<DEMFILE>>                                         *         
*                                                                     *         
* - NO PASSIVE POINTER DEFINED.                                       *         
* - NO HEADER RECORD ON MEDFILZ.                                      *         
* - PRESENT ONLY FOR COMMERCIAL CHANNELS, NOT BBC1 OR BBC2.           *         
* - BUCKET RECORDS EXIST ONLY FOR SPOT DATA.                          *         
***********************************************************************         
                                                                                
DEMFILED DSECT                                                                  
         ORG   DEMDKEY                                                          
DEKNUBR  DS    XL1                 RECORD TYPE                                  
*                                                                               
DEKNUB0Q EQU   X'10'               BY SPOTLEN/DAYPART                           
DEKNUB2Q EQU   DEKNUB0Q+DEKBADPQ   ALL DAYPARTS BY SPOTLEN                      
DEKNUB4Q EQU   DEKNUB0Q+DEKBASLQ   ALL SPOTLENS BY DAYPART                      
DEKNUB6Q EQU   DEKNUB2Q+DEKBASLQ   ALL SPOTLENS, ALL DAYPARTS                   
*                                                                               
DEKNUB8Q EQU   DEKNUB0Q+DEKBCVPQ   CVE/PIB VERSIONS OF THE ABOVE                
DEKNUBAQ EQU   DEKNUB2Q+DEKBCVPQ                                                
DEKNUBCQ EQU   DEKNUB4Q+DEKBCVPQ                                                
DEKNUBEQ EQU   DEKNUB6Q+DEKBCVPQ                                                
*                                                                               
DEKBADPQ EQU   X'02'               ALL DAYPARTS                                 
DEKBASLQ EQU   X'04'               ALL SPOTLENGTHS                              
DEKBCVPQ EQU   X'08'               CVE/PIB BUCKETS                              
*                                                                               
DEKNUBLQ EQU   DEKNUB0Q            LOWEST BUCKET                                
DEKNUBHQ EQU   DEKNUBEQ            HIGHEST BUCKET                               
*                                                                               
         DS    XL2                 PADDING                                      
DEKNUBAC DS    0XL2                                                             
DEKNUBAR DS    XL1                 AREA NUMBER                                  
DEKNUBCH DS    XL1                 CHANNEL CODE, SEE DEKSLTCH                   
         DS    XL2                 FOR FUTURE USE                               
DEKNUBDT DS    XL2                 COMPRESSED DATE                              
DEKNUBOT DS    0XL4                                                             
DEKNUBSL DS    XL2                 SPOTLEN (OR NULL)                            
DEKNUBDP DS    XL1                 DAYPART (OR NULL)                            
DEKNUBSH DS    XL1                 SALESHOUSE (OR NULL)                         
*                                                                               
         ORG   DEMDKSTC            STATUS BYTE USAGE                            
DEKNUBDC DS    XL1                 DAY CODE, BITS 5-7                           
DEKNUBS1 DS    XL1                 STATUS BYTE 1                                
DEKNUBSQ EQU   X'01'               BUCKET CONTAINS ONLY SPONSORSHIP             
         ORG                                                                    
                                                                                
***********************************************************************         
* BUCKET (PERIOD TOTALS) ELEMENT                                      *         
***********************************************************************         
                                                                                
DEBCKD   DSECT                                                                  
DEBCKEL  DS    XL1                                                              
DEBCKELQ EQU   X'60'                                                            
DEBCKDCQ EQU   X'61'               DUMMY CVE ELEMENT                            
DEBCKPBQ EQU   X'62'               PIB ELEMENT                                  
DEBCKDPQ EQU   X'63'               DUMMY PIB ELEMENT                            
DEBCKLEN DS    XL1                                                              
DEBCKIN2 DS    XL1                 INDICATOR BYTE 2                             
DEBCKGIQ EQU   DESPTGIQ            BREAK TYPE - GOING IN                        
DEBCKCBQ EQU   DESPTCBQ            BREAK TYPE- CENTRE BREAK                     
DEBCKEBQ EQU   DESPTEBQ            BREAK TYPE- END BREAK                        
* WITHIN PIB BUCKET ELEMENTS                                                    
DEBCKP1Q EQU   X'01'               FIRST                                        
DEBCKP2Q EQU   X'02'               2ND                                          
DEBCKP3Q EQU   X'04'               3RD                                          
DEBCKPLQ EQU   X'08'               LAST                                         
DEBCKPOQ EQU   X'10'               OTHER                                        
DEBCKPPQ EQU   X'20'               PENULTIMATE                                  
*                                                                               
         DS    XL3                 SPARE                                        
DEBCKIND DS    XL1                 INDICATORS / TIMESHIFT FLAG                  
DEBCKICQ EQU   DESPTICQ            INCOMPLETE (3 DAY) - BARB2002                
DEBCKTVQ EQU   DESPTTVQ            TELESHOPPING, AS DESPTIN2                    
DEBCKINQ EQU   DESPTINQ            INTERACTIVE, AS DESPTIN2                     
DEBCKSBQ EQU   DESPTSBQ            SPONSORSHIP, AS DESPTIN3                     
*              FOLLOWING PRESENT ONLY ON DEMFILE - DROPPED BY DEMAND            
DEBCKTSQ EQU   DESPTTSQ            ELEMENT CONTAINS TIMESHIFT DATA              
DEBCKPEQ EQU   DESPTPEQ                                                         
*                                                                               
DEBCKTRN DS    XL2                 NUMBER OF TRANSMISSIONS                      
DEBCKLNQ EQU   *-DEBCKD            LENGTH EXCLUDING IMPS                        
*                                                                               
DEBCKIMP DS    0XL4                IMPS IN 100S PER SELECTED AUDIENCES          
*                                  AS RETURNED BY DEMAND                        
*                                                                               
         DS    0X                  IMPS IN 100S PER DEMMXANQ AUDIENCES          
*                                  (+ EXTRA LIVE 'HOMES RECORDING' AUD)         
*                                  SEE UNDER ELEMENT LIST FOR FORMAT            
*                                              DECOMPRESSED BUCKET ELT          
DEBMXDNQ EQU   DEBCKLNQ+(DEMMXANQ*L'DEBCKIMP)  NEW MAXIMUM LENGTH OF A          
*                                              DECOMPRESSED BUCKET ELT          
*                                                                               
         EJECT                                                                  
***********************************************************************         
* SUNDRY EQUATES FOR GENERAL DEMO USE                                 *         
***********************************************************************         
                                                                                
DEROIPFQ EQU   C'R'                PREFIX FOR SHOWING ROI CODES (IRISH)         
DEROIP2Q EQU   C'I'                PREFIX FOR SHOWING 2003+ ROI CODES           
DEACNPFQ EQU   C'N'                PREFIX FOR SHOWING ACNM CODES                
DEMMSPFQ EQU   C'M'                PREFIX FOR SHOWING MMS CODES                 
DEUSRPFQ EQU   C'*'                PREFIX FOR SHOWING USER DEFINED CDES         
*EANGSPD EQU   DT_EASTQ            ANGLIA SPLIT DATE - 04/09/00                 
DESPTCUQ EQU   90                  RECYCLED SPOTS TURNED INTO INSERTS           
*                                   AFTER THIS MANY DAYS FROM HIGH DATE         
         EJECT                                                                  
* MEARCHEQUS                       MEDIA AREA/CHANNEL EQUATES                   
       ++INCLUDE MEARCHEQUS                                                     
