*          DATA SET MEFILFNMEL AT LEVEL 002 AS OF 12/22/99                      
***********************************************************************         
* FULL NAME ELEMENT - MEFILFNMEL                                      *         
***********************************************************************         
DFNM     DSECT                                                                  
FNMEL    DS    CL1       B         ELEMENT CODE                                 
FNMELQ   EQU   X'8F'               FULL NAME ELEMENT                            
FNMLEN   DS    CL1       B         ELEMENT LENGTH                               
FNMNAME  DS    0C        A         VARIABLE LENGTH NAME                         
