*          DATA SET MEFILTXTEL AT LEVEL 086 AS OF 01/06/12                      
***********************************************************************         
* GENERAL PURPOSE TEXT ELEMENT  - MEFILTXTEL                          *         
***********************************************************************         
DTXT     DSECT                                                                  
TXTEL    DS    CL1       B         ELEMENT CODE                                 
TXTELQ   EQU   X'9B'               TEXT ELEMENT                                 
TXTLEN   DS    CL1       B         ELEMENT LENGTH                               
TXTTYPE  DS    CL1       A         TYPE CODE                                    
TXTSORDQ EQU   X'01'               SUPPLIER ORDER# (UK INTERNET BUY)            
TXTCTACQ EQU   X'02'               CONTACT (UK INTERNET BUY)                    
TXTFPAGQ EQU   X'03'               FREEFORM PAGE (UK INTERNET BUY)              
TXTFPOSQ EQU   X'04'               FREEFORM POSITION (UK INTERNET BUY)          
TXTTOBCQ EQU   X'05'               TOB RECORD COMMISSION TEXT (GER)             
TXTMEASQ EQU   X'06'               MEASLES CLI/PROS XCLUDED (MEDIA REC)         
TXTVDZQ  EQU   X'07'               VDZ-CODE   (PRINT-SUPPLIER REC)              
TXTPZOQ  EQU   X'08'               PZO-CODE OR ZIS (PRINT-SUP REC)              
TXTTDMSQ EQU   X'09'               TANDEM SEQUENCE# (GER BROADCAST BUY)         
TXTBGRPQ EQU   X'10'               BRAND GROUP (UK TV CAMPGN: TYPE+GRP)         
TXTAON   EQU   X'11'               AGENCY ORDER NUMBER                          
TXTPONQ  EQU   X'12'               PURCHASE ORDER NUMBER                        
TXTPTOBQ EQU   X'13'               PARTICIPATION TOB FORMULA                    
TXTNMRVQ EQU   X'14'               NMR VOUCH DATA                               
TXTSEPAQ EQU   X'15'               SEPA: IBAN AND BIC                           
TXTPLTIQ EQU   X'16'               PLACEMENT ID - IDESK (INTERNET BUY)          
TXTMSWQ  EQU   X'17'               MSW-CODE: MS WASMUTH (PRINT-SUP REC)         
TXTPLMTQ EQU   X'18'               PLACEMENT (INTERNET BUY)                     
TXTLSONQ EQU   X'19'               GER-STN ORDER#(LONG)/UK-PO# ON BUY           
TXTCURRQ EQU   X'1A'               CURRENCY CODE                                
TXTOBSVQ EQU   X'1B'               OBS - STATUS-DATE/TIME                       
TXTPGM1Q EQU   X'1C'               PROGRAMME 1 (BEFORE)                         
TXTPGM2Q EQU   X'1D'               PROGRAMME 2 (AFTER)                          
TXTMDSCQ EQU   X'1E'               MEDIA DISCOUNT RATE (SUPPLIER)               
TXTXINDQ EQU   X'1F'               EXTRA INDICATORS (BUY)                       
TXTXBCDQ EQU   X'20'               BOOKING CATEGORY DATES                       
TXTBCCOQ EQU   X'21'               COMMISSION & FORMULA PER BOOK CAT            
TXTAXLOQ EQU   X'22'               TAX LOCATION (CLIENT/PRODUCT)                
TXTBCSGQ EQU   X'23'               BOOKING CAT SECURITY GROUP (BCAT)            
TXTBCFLQ EQU   X'24'               BOOKING CATEGORY FILTER                      
TXTGATKQ EQU   X'25'               GAP TOKEN                                    
TXTGGTKQ EQU   X'26'               GAP GROUP TOKEN                              
TXTGBRFQ EQU   X'27'               GAP BRIEF ID                                 
TXTEMLIQ EQU   X'28'               EMAIL ID(S) N X 2BYTES                       
TXTEEMIQ EQU   X'29'               ESCALATION EMAIL ID(S) N X 2BYTES            
TXTRJCMQ EQU   X'2A'               REJECTION COMMENTS (BOOKING CONF)            
TXTCARSQ EQU   X'2B'            CARIA STATION (SUPPLIER - MEDZ TV ONLY)         
TXTBPAYQ EQU   X'2C'               BILL/PAY SYSTEM                              
TXTPALQ  EQU   X'2D'               PAYEE LABEL (FOLIO RECORD)                   
TXTPACQ  EQU   X'2E'               PAYEE CODE (FOLIO RECORD)                    
TXTPANQ  EQU   X'2F'               PAYEE NAME (FOLIO RECORD)                    
TXTGUIDQ EQU   X'30'               ASDML GUID (BUYING AGENCY RECORD)            
TXTMFLNM EQU   X'31'               MEDIA FOREIGN LONG NAME                      
TXTCENFQ EQU   X'32'               CENTRAL FOLIO CODE (FOLIO RECORD)            
TXTBACQ  EQU   C'A'                BANK A/C # (FOLIO RECORD)                    
TXTCNTCQ EQU   C'B'                CONTACT (SUPPLIER RECORD)                    
TXTCLRFQ EQU   C'C'                CLIENT REFERENCE (CAMPAIGN RECORD)           
TXTCIRCQ EQU   C'C'                CIRCULATION (SUPPLIER RECORD)                
TXTCLR2Q EQU   C'D'                CLIENT REF LINE 2 (CAMPAIGN RECORD)          
TXTBSCQ  EQU   C'E'                BANK SORT CODE (FOLIO RECORD)                
TXTTFAXQ EQU   C'F'                TELEFAX NUMBER (SUPPLIER RECORD)             
TXTCTFXQ EQU   C'G'                TELEFAX COPY   (SUPPLIER RECORD)             
TXTSPWDQ EQU   C'H'                PASSWORD (SUPPLIER GROUP RECORD)             
TXTINITQ EQU   C'I'                OWNER INITIALS                               
TXTPRODQ EQU   C'J'                PRODUCTION CLIENT/PRODUCT CODE               
TXTSNAMQ EQU   C'K'                SHORT NAME (FILTER TYPE/VALUE)               
TXTSLAVQ EQU   C'L'                SLAVE LIST DESCRIPTION (MAX 30 CH)           
TXTBNMQ  EQU   C'M'                BANK NAME (FOLIO RECORD)                     
TXTBANQ  EQU   C'N'                BANK A/C NAME (FOLIO RECORD)                 
TXTMEMQ  EQU   C'O'                ONLINE MEMO (FOLIO RECORD)                   
TXTPHONQ EQU   C'P'                TELEPHONE NUMBER (SUPPLIER RECORD)           
TXTCPHOQ EQU   C'Q'                TELEPHONE COPY   (SUPPLIER RECORD)           
TXTBSRQ  EQU   C'R'                BS ROLL NUMBER (FOLIO RECORD)                
TXTSOCQ  EQU   C'S'                ORDER COMMENT (SUPPLIER RECORD)              
TXTSTYPQ EQU   C'T'                STATION LIST TYPE (LIST HEADER REC)          
TXTITXTQ EQU   C'T'                INFO TEXT (CLI & PROD RECORD)                
TXTDSC2Q EQU   C'U'                2ND 60 CHAR DESCRIPTION(ADV,PON REC)         
TXTVATQ  EQU   C'V'                VAT REGISTRATION NO. (MAX 18 CH)             
TXTWGTQ  EQU   C'W'                WEIGHTING SET CODE (TV-O RECORD)             
TXTWRKQ  EQU   C'W'                WORKCODE OPTION (AGENCY RECORD)              
TXTBILLQ EQU   C'X'                BILL COMMENT  (BILL RECORD)                  
TXTBIL2Q EQU   C'Y'                BILL COMMENT LINE 2 (BILL RECORD)            
TXTCABQ  EQU   C'Z'                CABLE OPTION (AGENCY RECORD)                 
TXTEMALQ EQU   C'1'                EMAIL ADDRESS (SUPPLIER RECORD)              
TXTISDNQ EQU   C'2'                ISDN NUMBER (SUPPLIER RECORD)                
TXTCCOMQ EQU   C'3'                CAMPAIGN COMMENT LINE 1                      
TXTCCO2Q EQU   C'4'                CAMPAIGN COMMENT LINE 2                      
TXTURLQ  EQU   C'5'                URL (SUPPLIER RECORD)                        
TXTURLRQ EQU   C'6'                URL-RATECARD (SUPPLIER RECORD)               
TXTTAXQ  EQU   C'7'                TAX NUMBER (2ND VAT REG NO)                  
TXTCEMLQ EQU   C'8'                COPY EMAIL ADDRESS (SUPPLIER REC)            
TXTFIXLQ EQU   *-DTXT              L'FIXED PART OF ANY TXTEL                    
TXTTEXT  DS    0C        A         VARIABLE LENGTH TEXT                         
* FOR TXTSEPAQ:                                                                 
TXTTIBAN DS    CL34                MAX IBAN                                     
TXTTBIC  DS    CL11                MAX BIC                                      
TXTSEPAL EQU   *-DTXT                                                           
TXTTCTRY DS    CL2                 COUNTRY CODE                                 
TXTSEPAX EQU   *-DTXT                                                           
         ORG   TXTTEXT                                                          
* FOR TXTCURRQ:                                                                 
TXTCCODE DS    CL3                 CURRENCY ISO CODE                            
TXTCVALU DS    XL4                 CURRENVY AMOUNT VALUE                        
TXTCRATE DS    XL7                 EXCHANGE RATE BLOCK                          
TXTCSTAT DS    XL1                 STATUS BYTE                                  
TXTCCBSQ EQU   X'80'               - CURRENCY BUDGET SET EXCH. RATE             
TXTCBBSQ EQU   X'40'               - BURST    BUDGET SET EXCH. RATE             
TXTCLENQ EQU   *-DTXT                                                           
         ORG   TXTTEXT                                                          
* FOR TXTPGM2Q:                                                                 
TXTPGMN2 DS    CL10                PROGRAMME NAME 2                             
         ORG   TXTTEXT                                                          
* FOR TXTPGM1Q:                                                                 
TXTPGMTY DS    XL1                 TYPE (ALSO APPLIES TO TXTPGMN2)              
TXTPAPRQ EQU   C'A'                APROG                                        
TXTPBRBQ EQU   C'B'                BARB                                         
TXTPSALQ EQU   C'S'                SALESHOUSE                                   
TXTPUSRQ EQU   C'U'                USER INPUT                                   
TXTPGMN1 DS    CL10                PROGRAMME NAME 1                             
         ORG   TXTTEXT                                                          
* FOR TXTMDSCQ:                                                                 
TXTMDSQN DS    XL1                 SEQUENCE NUMBER                              
TXTMDRAT DS    XL2                 MEDIA DISCOUNT RATE (2DP)                    
TXTMDRAD EQU   X'FFFF'             ..DEFAULT RATE - RATE IS IN PUBDISC          
TXTMDL1Q EQU   *-DTXT              L'FIXED PORTION                              
TXTMDDES DS    0X                  DESCRIPTION                                  
         ORG   TXTTEXT                                                          
* FOR TXTBCCOQ:                                                                 
TXTCBCAT DS    XL2                 BOOKING CATEGORY NUMBER                      
TXTCBCAG DS    XL1                 CREATIVE AGENCY (OPTIONAL)                   
TXTCBCCR DS    0XL6                COMMISSION VALUES                            
TXTCBCT1 DS    XL1                 (SEE CLICOMTY)                               
TXTCBCR1 DS    XL2                 (SEE CLICOMRT)                               
TXTCBCT2 DS    XL1                 (SEE CLICOMT2)                               
TXTCBCR2 DS    XL2                 (SEE CLICOMR2)                               
TXTCLN1Q EQU   *-DTXT                                                           
TXTCBCFM DS    CL10                FORMULA IF TXTCBCT1 = 20                     
TXTCLN2Q EQU   *-DTXT                                                           
         ORG   TXTTEXT                                                          
* FOR TXTXBCDQ:                                                                 
TXTBCEDT DS    XL2                 BOOKING CATEGORY EFFECTIVE DATE              
TXTBCBDT DS    XL2                 BOOK CAT BILLING EFFECTIVE DATE              
TXTBCDLQ EQU   *-DTXT                                                           
         ORG   TXTTEXT                                                          
* FOR TXTBCSGQ:                                                                 
TXTBCSGR DS    XL2                 SECURITY GROUP NUMBER (SAAGCNUM)             
TXTBCSLQ EQU   *-DTXT              LENGTH IF SINGLE GROUP                       
TXTBCSGX DS    0XL(L'TXTBCSGR)     ADDITIONAL SECURITY GROUP NUMBER(S)          
         ORG   TXTTEXT                                                          
* FOR TXTXINDQ:                                                                 
TXTXIND1 DS    XL1                 EXTRA INDICATOR 1                            
TXTMXCPQ EQU   X'80'               MX CONTROLS PRINTING (GERMANY)               
TXTXIND2 DS    XL1                 EXTRA INDICATOR 2                            
TXTXIND3 DS    XL1                 EXTRA INDICATOR 3                            
TXTXIDLQ EQU   *-TXTTEXT           DATA LENGTH                                  
TXTXINLQ EQU   *-DTXT                                                           
         ORG   TXTTEXT                                                          
* FOR TXTEMLIQ/TXTEEMIQ:                                                        
TXTEMI   DS    0XL2                #=(TXTLEN-TXTFIXLQ)/L'TXTEMI                 
         ORG   TXTTEXT                                                          
* FOR TXTCARSQ:                                                                 
TXTCSTN  DS    XL3                 CARIA STATION NUMBER                         
TXTCSLQ  EQU   *-DTXT              LENGTH IF SINGLE NUMBER                      
TXTCSTX  DS    0XL(L'TXTCSTN)      ADDITIONAL CARIA STATION NUMBERS             
TXTCSMXQ EQU   5                   MAXIMUM TOTAL CARIA NUMBERS                  
                                                                                
* FOR TXTPALQ/TXTPACQ/TXTPANQ:                                                  
TXTPAMLQ EQU   254                 MAXIMUM LENGTH OF THESE FIELDS               
TXTPA1LQ EQU   250                 MAX LEN IN FIRST PAYEE ELEMENT               
         ORG   TXTTEXT                                                          
* FOR TXTCENFQ:                                                                 
TXTCENFO DS    CL5                 CENTRAL FOLIO CODE                           
         ORG   TXTTEXT                                                          
* FOR TXTGUIDQ:                                                                 
TXTGUIDD DS    XL2                 GUID EFFECTIVE DATE                          
TXTGUID  DS    XL16                GUID                                         
TXTGUIDL EQU   *-DTXT                                                           
