*          DATA SET MEFILULAEL AT LEVEL 034 AS OF 12/23/11                      
***********************************************************************         
* MEDIA RECORD ACCOUNT CROSS-REFERENCE ELEMENT - MEFILULAEL           *         
***********************************************************************         
DULA     DSECT                                                                  
ULAEL    DS    CL1       B         ELEMENT CODE                                 
ULAELQ   EQU   X'96'               ACCOUNT CROSS-REFERENCE ELEMENT              
ULALEN   DS    CL1       B         ELEMENT LENGTH                               
ULATYPE  DS    CL1       A         TYPE                                         
ULATVTIQ EQU   X'01'               VAT INPUT (13B)                              
ULATVTOQ EQU   X'02'               VAT OUTPUT (13B)                             
ULATASBQ EQU   X'03'               ASBOF/LEVY                                   
ULATASIQ EQU   X'04'               ASAI - IRISH LEVY                            
ULATDCSQ EQU   X'05'               DEMEDA CREATIVE SPLIT SMV                    
ULATSMIQ EQU   X'06'               DEMEDA SMV INCOME ACCOUNT                    
ULATSMCQ EQU   X'07'               DEMEDA SMV INCOME COST ANAL ACCOUNT          
ULATSMAQ EQU   X'08'               DEMEDA SMV INCOME ACCRUAL ACCOUNT            
ULATDIFQ EQU   C'A'                DIFFERENCE INCOME                            
ULATDFCQ EQU   C'B'                DIFFERENCE COSTING                           
ULATFACQ EQU   C'C'                FACTORING CO                                 
ULATDSCQ EQU   C'D'                DISCOUNT ULA                                 
ULATDCOQ EQU   C'E'                DISCOUNT COSTING                             
ULATFEEQ EQU   C'F'                SERVICE FEE                                  
ULATRCVQ EQU   C'G'                RECEIVABLE ACCOUNT (FOR OUTLETS)             
ULATSBSQ EQU   C'H'                UNIT S SUBSTITUTE A/C                        
ULATINCQ EQU   C'I'                INCOME (REPLACES MEDCOMM IN MEDEL)           
ULATM10Q EQU   C'J'                ME10 FORMAT X ACCOUNT                        
ULATMCOQ EQU   C'K'                ME10 FORMAT X COSTING ACCOUNT                
ULATMCMQ EQU   C'L'                MASTER COMMISSION                            
ULATSMVQ EQU   C'M'                SMVG SI AC/NO                                
ULATSCMQ EQU   C'N'                SPECIAL COMMISSION ACCOUNT                   
ULATCDOQ EQU   C'O'                COSTING DIFFS (OVERPAYMENT)                  
ULATPAYQ EQU   C'P'                PAY-COMPANY ACCOUNT                          
ULATMCCQ EQU   C'Q'                MASTER COMM. COST A/C                        
ULATRBTQ EQU   C'R'                REBATE ULA                                   
ULATSURQ EQU   C'S'                SURCHARGE                                    
ULATRCOQ EQU   C'T'                REBATE COSTING                               
ULATCDUQ EQU   C'U'                COSTING DIFFS (UNDERPAYMENT)                 
ULATSVXQ EQU   C'V'                SV/SX A/C FOR CREDITOR POSTINGS              
ULATSVAQ EQU   C'W'                SV/SX ACCRUAL                                
ULATSCOQ EQU   C'X'                SURCHARGE COSTING                            
ULATFECQ EQU   C'Y'                SERVICE FEE COSTING                          
ULATCDZQ EQU   C'Z'                COSTING DIFFS (UNCLAIMED BALANCE)            
ULATSB1Q EQU   C'1'                UNIT 1 SUBSTITUTE A/C                        
ULATACAQ EQU   C'2'                O/RIDE ACCRUAL COMMISSION A/C                
ULATMCAQ EQU   C'3'                MASTER COMMISSION ACCRUAL                    
ULATSIAQ EQU   C'4'                SPECIAL INCOME (SPOT) ACCRUAL                
ULATSICQ EQU   C'5'                SPECIAL INCOME (SPOT) COSTING                
ULATSCAQ EQU   C'6'                SPECIAL INCOME CUT-OFF ACCRUAL               
ULATDEMQ EQU   C'7'                DEMEDA SPECIAL ACCOUNT                       
ULATDE2Q EQU   C'8'                DEMEDA SPECIAL ACCOUNT 2                     
ULATMMCQ EQU   C'9'                MULTIMEDIA CREDITOR                          
ULAULA   DS    0CL14               UNIT/LEDGER/ACCOUNT                          
ULAUNIT  DS    CL1                 UNIT                                         
ULALEDG  DS    CL1                 LEDGER                                       
ULAACC   DS    CL12                ACCOUNT                                      
ULALENQ  EQU   *-DULA              ELEMENT LENGTH                               
