*          DATA SET MEFILREMEL AT LEVEL 003 AS OF 09/06/06                      
*              DSECT TO COVER REMARKS ELEMENT                                   
*                                                                               
* VERY IMPORTANT! THE MAXIMUM LENGTH OF REMARKS TEXT IS 15                      
*                                                       ==                      
DREM     DSECT                                                                  
REMEL    DS    CL1       B         ELEMENT CODE X'26'                           
REMELQ   EQU   X'26'                                                            
REMLEN   DS    CL1       B         ELEMENT LENGTH (L'REMARKS+2)                 
REMARKS  DS    0C        A         REMARKS                                      
REMXLENQ EQU   17                  MAX LENGTH OF A REMARKS ELEMENT              
*                                                                               
