*          DATA SET MEFILFMLEL AT LEVEL 003 AS OF 07/22/02                      
*              DSECT TO COVER CLI/PRO/CAM/AD/BUY SCHEME POINTER ELEMENT         
*                                                                               
DFML     DSECT                                                                  
FMLEL    DS    CL1       B         ELEMENT CODE X'4B'                           
FMLELQ   EQU   X'4B'                                                            
FMLLEN   DS    CL1       B         ELEMENT LENGTH  X'0F' AL1(15)                
FMLAGY   DS    CL1       B         AGENCY CODE     X'n0'                        
FMLFORM  DS    CL10      C         FORMULA SCHEME CODE (CLI/PRO/CAM)            
*                                  RESPONSE COUNT SCHEME CODE (AD/BUY)          
FMLCODE  DS    CL1       B         RESPONSE CODE SCHEME NUMBER (AD/BUY)         
         DS    CL1                 SPARE                                        
FMLLENQ  EQU   *-DFML              ELEMENT LENGTH                               
