*          DATA SET MEFILCAGEL AT LEVEL 002 AS OF 12/22/99                      
*              DSECT TO COVER CREATIVE AGENCY ELEMENT                           
*                                                                               
DCAG     DSECT                                                                  
CAGEL    DS    CL1       B         ELEMENT CODE X'48'                           
CAGELQ   EQU   X'48'                                                            
CAGLEN   DS    CL1       B         ELEMENT LENGTH X'0E' A(14)                   
CAGCOMM  DS    CL12      C         SQ ACCOUNT CODE FOR COMMISSION               
CAGLENQ  EQU   *-DCAG                                                           
