*          DATA SET MEFILAFOEL AT LEVEL 004 AS OF 07/08/09                      
*              DSECT TO COVER AGENCY OVERRIDE FOLIO CODE ELEMENT                
*                                                                               
DAFOEL   DSECT                                                                  
AFOEL    DS    CL1       B         ELEMENT CODE                                 
AFOELQ   EQU   X'37'                                                            
AFOLEN   DS    CL1       B         ELEMENT LENGTH X'08' A(08)                   
AFOAGY   DS    CL1       B         AGENCY CODE X'N0', (N=1-F)                   
AFOFOLIO DS    CL5       C         FOLIO CODE                                   
AFOLENQ  EQU   *-AFOEL                                                          
AFOALPH  DS    CL2       C         AGENCY ALPHA ID                              
AFOLEN1Q EQU   *-AFOEL                                                          
