*          DATA SET MESRCHPGFD AT LEVEL 010 AS OF 03/13/02                      
* MMCA 010   MAR02 - ADDED DSPGMGNR TO REPLACE DSPGMGEN                         
* CBLA 009 10JAN01 - TIDY UP                                                    
*                                                                               
* DEFINITION OF CONTENTS OF 'SBFILT' DURING MEDIA PROGRAMME SEARCH              
*                                                                               
DSPGFILT DS    0C                  PROGRAMME SEARCH FILTER                      
DSPGMGNR DS    0CL4                PROGRAMME GENRE FILTER (BARB 2002)           
         DS    CL1                                                              
DSPGMGEN DS    CL3                 PROGRAMME GENRE FILTER                       
DSPGMFST DS    CL3                 PROGRAMME START VALUE                        
DSPGMFEN DS    CL3                 PROGRAMME END VALUE                          
DSPGMFTS DS    CL2                 PROGRAMME TRANSMISSION START DATE            
DSPGMFTE DS    CL2                 PROGRAMME TRANSMISSION END DATE              
DSPGMFGR DS    CL11                PROGRAMME GROUP (NEW SIZE - GSUM)            
DSPGMFG1 DS    XL1                 PROGRAMME MAJOR GROUP                        
DSPGMFG2 DS    XL1                 PROGRAMME MINOR GROUP                        
DSPGMFEI DS    XL1                 PROGRAMME EIRE=YES/NO/ONLY FILTER            
DSPGFLNQ EQU   *-DSPGFILT          PROGRAMME FILTER LENGTH                      
