*          DATA SET MPGENQSSV  AT LEVEL 032 AS OF 09/11/87                      
*                                                                               
*        MEDIA PLANNING - CROSS TAB SYSTEM RECORDS                              
*        -----------------------------------------                              
*                                                                               
*        SUB-SYSTEM CODE 'Q'                                                    
*                                                                               
*        RECORD PASSIVE  PRE-                                                   
*         CODE  POINTER  FIX  DESCRIPTION                                       
*        ------ -------  ---  -----------                                       
*          24            QSD  SURVEY DEFINITION                                 
*          24            QSP  QSPEC RECORDS                                     
*          25            QTG  TARGET DEFINITIONS                                
*          26            QAC  AGENCY/CLIENT ACCESS LIMITS                       
*          27            QRF  RESPONSE FUNCTION RECORDS                         
*          28            QPT  'PRE-TABBED' QSPECS                               
*                                                                               
*          31            QXT  TABLE DEFINTION RECORD                            
*          32            QRS  ROWSET DEFINITION                                 
*          33            QCS  COLSET DEFINITION                                 
*                                                                               
*          41            QVT  QUESTIONNAIRE FILE INVERTED RECORDS               
*                             (ON INDIVIDUAL SURVEY FILES)                      
*                                                                               
*       CONTROL BYTE USAGE - X'80' = DELETED                                    
*                            X'08' = DIRECTORY DATA REC (NOT A POINTER)         
*                            X'01' = PASSIVE POINTER                            
*                                                                               
*                                                                               
QKEYL    EQU   32            KEY LENGTH                                         
QDCNTL   EQU   32            DIRECTORY CONTROL BYTES DISPLACEMENT               
QFCNTL   EQU   34            FILE CONTROL BYTES DISPLACEMENT                    
QRLEN    EQU   32            RECORD LENGTH DISPLACEMENT                         
QELSTRT  EQU   42            START OF FIRST ELEM                                
         EJECT                                                                  
*                                  SURVEY FILE DEFINITION RECORD                
*                                  -----------------------------                
QSDREC   DSECT                                                                  
QSDKEY   DS    0XL32                                                            
QSDKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QSDKAGY  DS    CL2                 AGENCY OR SOURCE                             
QSDKRCD  DS    XL1'24'             RECORD CODE                                  
QSDKFCD  DS    CL8                 FILE CODE                                    
         DS    XL20                SPARE                                        
*                                                                               
QSDRLEN  DS    XL2                 RECORD LENGTH                                
QSDCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QSDELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*        TEXT ELEMENT USAGE                                                     
*                                              MAX    KEY                       
*        CODE   USAGE                  NUMBER LENGTH LENGTH                     
*        ----   -----                  ------ ------ ------                     
*        X'C1'  SURVEY TITLE            1       30     1                        
*        X'C4'  SOURCE FOOTNOTE         0-2     60     1                        
         SPACE 2                                                                
QSDEFEL  DS    XL1'10'             SURVEY DESCRIPTION ELEMENT                   
         DS    AL1(30)                                                          
QSDNCRDS DS    XL2                 CARDS PER RESP.                              
QSDNCOLS DS    XL2                 COLS PER CARD                                
QSDCDCOL DS    XL2                 COLUMN FOR CARD NO.                          
QSDCDLEN DS    XL1                 LENGTH OF CARD NO FIELD                      
QSDRSCOL DS    XL2                 COLUMN FOR RESPONDENT NO.                    
QSDRSLEN DS    XL1                 LENGTH OF RESP. NO.                          
QSDRMETH DS    CL1                 READERSHIP METHOD (1,2)                      
QSDWMRGE DS    CL1                 WAVES MERGED (YN)                            
         DS    XL16                SPARE                                        
         SPACE 2                                                                
QSDWGTEL DS    XL1'12'             WEIGHT DEFINITION ELEM                       
         DS    AL1(20)             LENGTH                                       
QSDWGTCD DS    CL4                 WEIGHT CODE                                  
QSDWPRE  DS    XL1                 PRECISION                                    
*                                  (X'02'=100'S, X'82'=.00, ETC)                
QSDWBLN  DS    XL1                 BINARY DATA LENGTH                           
*                                  (BASED ON FIELD LENGTH)                      
QSDWCRD  DS    XL2                 CARD NO.                                     
QSDWCOL  DS    XL2                 COLUMN NO.                                   
QSDWFLN  DS    XL1                 FIELD LENGTH                                 
QSDWDFLT DS    CL1                 Y=THIS IS DEFAULT WEIGHT                     
         DS    XL6                 SPARE                                        
         SPACE 2                                                                
QSDWAVEL DS    XL1'13'             WAVE DEFINITION ELEM                         
         DS    XL1                 VARIABLE LENGTH- 60+L'SPEC                   
QSDWVDAT DS    XL2                 DATE OF WAVE                                 
QSDWVDN  DS    CL8                 DIRECTORY NAME                               
QSDWVFN  DS    CL8                 FILE NAME                                    
QSDWVRC  DS    XL4                 RESPONDENT COUNT                             
QSDWVPOP DS    XL4                 POPULATION USING DEFAULT WEIGHT              
QSDWVSOV DS    CL8                 SURVEY CODE OVERRIDE                         
QSDWVDSC DS    CL15                DESCRIPTION                                  
         DS    CL9                 SPARE                                        
QSDWVSPC DS    0C                  SPEC                                         
         EJECT                                                                  
*                                  QSPEC RECORD                                 
*                                  ------------                                 
QSPREC   DSECT                                                                  
QSPKEY   DS    0XL32                                                            
QSPKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QSPKAGY  DS    CL2                 AGENCY OR SOURCE                             
QSPKRCD  DS    XL1'24'             RECORD CODE                                  
QSPKFCD  DS    CL8                 FILE CODE                                    
         DS    XL7                 SPARE                                        
QSPKNOD  DS    XL4                 NODE - NULL FOR SURVEY DEFINITION            
QSPKCOD  DS    CL8                 CODE                                         
         DS    XL1                 SPARE                                        
*                                                                               
QSPRLEN  DS    XL2                 RECORD LENGTH                                
QSPCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QSPELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*        NOTE- ALL QSPEC RECORDS HAVE VARIOUS NODIO CONTROL                     
*              ELEMENTS (X'B0' - X'BF').                                        
*              THEY ALSO ALL HAVE A QSPELEM (X'10')                             
*              OTHER ELEMENTS DEPEND ON QSPEC TYPE.                             
*                                                                               
QSPELEM  DS    X'10'               QSPEC TYPE ELEM                              
         DS    AL1(60)                                                          
QSPTYP   DS    CL1                 TYPE- T=TOPIC,Q=QUEST,A=ANS                  
QSPSTAT  DS    XL1                 STATUS  X'80' = DDS ONLY                     
QSPQTYP  DS    CL1                 FOR QUESTIONS- N=NUMERIC FIELD               
QSPCOMPW DS    CL1                 COMPONENT WEIGHT TYPE- BLANK=NO,             
*                                  A=ADDITIVE,M=MULTIPLICATIVE                  
QSPCWPRE DS    XL1                 PRECISION FOR COMP WEIGHT                    
*                                  (X'02'=100'S, X'82'=.00, ETC)                
QSPCWDLN DS    XL1                 BINARY DATA LENGTH FOR WGT VECTOR            
*                                  (BASED ON PRECISION)                         
         DS    XL4                 SPARE                                        
QSPCBPG  DS    CL6                 CODE BOOK PAGE                               
QSPQUPG  DS    CL6                 QUESTIONAIRE PAGE                            
QSPSAM   DS    XL4                 SAMPLE COUNT (IF MERGED WAVE)                
         DS    XL4                 SPARE                                        
QSPAVAL  DS    XL4                 ARITHMETIC VALUE OF ANS (FOR MEANS)          
QSPACLAS DS    CL1                 ANSWER CLASS                                 
         DS    XL24                SPARE                                        
         SPACE 2                                                                
QSPPTBEL DS     X'40'              PRE-TAB CONTROL ELEM                         
         DS    AL1(8)                                                           
QSPPTWDT DS    XL2                 WAVE DATE OF PRE-TAB                         
QSPPTDAT DS    XL2                 DATE PRE-TABBING DONE                        
         DS    XL2                 SPARE                                        
         SPACE 2                                                                
QSPWGTEL DS    X'25'               WEIGHT ELEMENT                               
         DS    AL1(30)                                                          
QSPWCOD  DS    XL1                 WEIGHT NO. (ALSO IN SPEC ELEMS)              
QSPWGT   DS    XL4                 WEIGHT                                       
QSPWDSC  DS    CL10                DESCRIPTION                                  
QSPWSAM  DS    XL4                 SAMPLE SIZE                                  
         DS    XL9                 SPARE                                        
         SPACE 2                                                                
*                                                                               
*                                  TOPIC RECORD                                 
*                                  ------------                                 
*                                                                               
*        TEXT ELEMENT USAGE                                                     
*                                              MAX    KEY                       
*        CODE   USAGE                  NUMBER LENGTH LENGTH                     
*        ----   -----                  ------ ------ ------                     
*        X'C1'  TOPIC TITLE             1-2     20     1                        
*        X'28'  TOPIC BASE DESCRIPTION  0-2     20     1                        
*        X'52'  TOPIC BASE SPEC         0-1     60     3  WAVE(2)               
*               (AS ENTERED)                              +SPARE                
*                                                                               
*                                  QUESTION RECORD                              
*                                  ---------------                              
*                                                                               
*        TEXT ELEMENT USAGE                                                     
*                                               MAX    KEY                      
*        CODE   USAGE                  NUMBER  LENGTH LENGTH                    
*        ----   -----                  ------  ------ ------                    
*        X'C1'  QUESTION TITLE          1-2      20     1                       
*        X'27'  FULL TEXT               1-4      60     1                       
*        X'28'  QUEST. BASE DESC.       0-2      20     1                       
*        X'52'  QUEST. BASE SPEC        0-1      60     3 WAVE(2)               
*               (AS ENTERED)                              +SPARE                
*        X'51'  NUMERIC FIELD DEF.      0-1      60     3 WAVE(2)               
*               (FOR NUMERIC Q'S)                         +SPARE                
*                                                                               
*                                  ANSWER RECORD                                
*                                  -------------                                
*                                                                               
*        TEXT ELEMENT USAGE                                                     
*                                              MAX    KEY                       
*        CODE   USAGE                  NUMBER LENGTH LENGTH                     
*        ----   -----                  ------ ------ ------                     
*        X'C1'  ANSWER TEXT             1-3     20     1                        
*        X'C2'  COLUMN HEADS            0-5      8     1                        
*        X'51'  ANSWER SPEC             1-2     60     3 WAVE(2)                
*               (AS ENTERED)                             +SPARE                 
         EJECT                                                                  
*                                  TARGET DEFINITION RECORD                     
*                                  ------------------------                     
QTGREC   DSECT                                                                  
QTGKEY   DS    0XL32                                                            
QTGKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QTGKAGY  DS    CL2                 AGENCY OR SOURCE                             
QTGKRCD  DS    XL1'25'             RECORD CODE                                  
QTGKFCD  DS    CL8                 FILE CODE                                    
         DS    XL11                SPARE                                        
QTGKTRG  DS    CL8                 TARGET CODE                                  
         DS    XL1                 SPARE                                        
*                                                                               
QTGRLEN  DS    XL2                 RECORD LENGTH                                
QTGCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QTGELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*        TEXT ELEMENT USAGE                                                     
*                                               MAX    KEY                      
*        CODE   USAGE                  NUMBER  LENGTH LENGTH                    
*        ----   -----                  ------  ------ ------                    
*        X'C1'  TARGET TITLE            1-2      30     1                       
*        X'C2'  COLUMN HEADS            0-5       8     1                       
*        X'C4'  FULL DESCRIPTION        0-3      60     1                       
*        X'C5'  OWNER                   0-1      20     1                       
*        X'51'  TARGET SPEC (AS INPUT)  0-2      60     3 SPARE(2)              
*                                                         +WGT CODE(1)          
         SPACE 2                                                                
QTGELEM  DS    X'10'               TARGET CONTROL ELEMENT                       
         DS    AL1(20)                                                          
QTGSAM   DS    XL4                 SAMPLE COUNT (IF ONE FILE)                   
         DS    XL4                 SPARE                                        
QTGCOMPW DS    CL1                 COMPONENT WEIGHT TYPE- BLANK=NO,             
*                                  A=ADDITIVE,M=MULTIPLICATIVE                  
QTGCWPRE DS    XL1                 PRECISION FOR COMP WEIGHT                    
*                                  (X'02'=100'S, X'82'=.00, ETC)                
QTGCWDLN DS    XL1                 BINARY DATA LENGTH FOR WGT VECTOR            
*                                  (BASED ON PRECISION)                         
         DS    XL7                 SPARE                                        
         SPACE 2                                                                
QTGWGTEL DS    X'25'               WEIGHT ELEMENT                               
         DS    AL1(30)                                                          
QTGWCOD  DS    XL1                 WEIGHT NO. (ALSO IN SPEC ELEMS)              
QTGWGT   DS    XL4                 WEIGHT                                       
QTGWDSC  DS    CL10                DESCRIPTION                                  
QTGWSAM  DS    XL4                 SAMPLE SIZE (IF WAVES MERGED)                
         DS    XL9                 SPARE                                        
         SPACE 2                                                                
QTGPTBEL DS     X'40'              PRE-TAB CONTROL ELEM                         
         DS    AL1(8)                                                           
QTGPTFDT DS    XL2                 SURVEY DATE OF PRE-TAB                       
QTGPTDAT DS    XL2                 DATE PRE-TABBING DONE                        
         DS    XL2                 SPARE                                        
         EJECT                                                                  
*                                  SURVEY ACCESS CONTROL RECORD                 
*                                  ----------------------------                 
QACREC   DSECT                                                                  
QACKEY   DS    0XL32                                                            
QACKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QACKAGY  DS    CL2                 AGENCY OR SOURCE                             
QACKRCD  DS    XL1'26'             RECORD CODE                                  
QACKFCD  DS    CL8                 FILE CODE                                    
         DS    XL20                SPARE                                        
*                                                                               
QACRLEN  DS    XL2                 RECORD LENGTH                                
QACCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QACELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
QACELEM  DS    X'22'               ACCESS CONTROL ELEM                          
         DS    AL1(15)                                                          
QACMOD   DS    CL1                 ENTERED AS + OR -                            
         DS    XL2                 SPARE                                        
QACBITS  DS    XL10                80 POSITIONAL ACCESS BITS                    
         SPACE 2                                                                
QACSZFEL DS    XL1'14'             SIZE FLAG ELEMENT                            
         DS    AL1                 VARIABLE LENGTH                              
QACSZFFL DS    CL2                 FLAG SYMBOL                                  
QACSZCNT DS    XL4                 THRESHHOLD COUNT                             
         DS    XL4                 SPARE                                        
QACSZFMS DS    0X                  FLAG MESSAGE                                 
         EJECT                                                                  
*                                  RESPONSE FUNCTION RECORDS                    
*                                  -------------------------                    
QRFREC   DSECT                                                                  
QRFKEY   DS    0XL32                                                            
QRFKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QRFKAGY  DS    CL2                 AGENCY OR SOURCE                             
QRFKRCD  DS    XL1'27'             RECORD CODE                                  
         DS    XL20                SPARE                                        
QRFKCOD  DS    CL8                 FUNCTION CODE                                
*                                                                               
QRFRLEN  DS    XL2                 RECORD LENGTH                                
QRFCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QRFELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*        TEXT ELEMENT USAGE                                                     
*                                               MAX    KEY                      
*        CODE   USAGE                  NUMBER  LENGTH LENGTH                    
*        ----   -----                  ------  ------ ------                    
*        X'C1'  FUNCTION DESCRIPTION    1        60     1                       
*        X'C5'  OWNER                   0-1      20     1                       
         SPACE 2                                                                
QRFELEM  DS    X'26'               TARGET CONTROL ELEMENT                       
         DS    AL1(14)                                                          
QRFLO    DS    XL2                 LOW END OF RANGE                             
QRFHI    DS    XL2                 HIGH END OF RANGE                            
QRFWGT   DS    XL4                 WEIGHT FOR RANGE (.000)                      
         DS    XL4                 SPARE                                        
         EJECT                                                                  
*                                  TABLE DEFINITION RECORD                      
*                                  -----------------------                      
QXTREC   DSECT                                                                  
QXTKEY   DS    0XL32                                                            
QXTKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QXTKAGY  DS    CL2                 AGENCY OR SOURCE                             
QXTKRCD  DS    XL1'31'             RECORD CODE                                  
QXTKFCD  DS    CL8                 FILE CODE (SURVEY)                           
         DS    XL11                SPARE                                        
QXTKTBC  DS    CL8                 TABLE CODE                                   
         DS    XL1                 SPARE                                        
*                                                                               
QXTRLEN  DS    XL2                 RECORD LENGTH                                
QXTCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QXTELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*        TEXT ELEMENT USAGE                                                     
*                                               MAX    KEY                      
*        CODE   USAGE                  NUMBER  LENGTH LENGTH                    
*        ----   -----                  ------  ------ ------                    
*        X'A1'  REPORT TITLE            1-3      60     0                       
*        X'A4'  WAVE LIST (AS INPUT)    0-1      60     0                       
*        X'A5'  OWNER                   0-1      20     0                       
*        X'A8'  OPTIONS (AS INPUT)      0-2      60     0                       
*                                                                               
         SPACE 2                                                                
QXTELEM  DS    X'10'               TABLE ELEMENT                                
         DS    AL1(50)                                                          
QXTBASE  DS    CL8                 TARGET CODE FOR BASE                         
QXTRSET  DS    CL8                 ROWSET CODE                                  
QXTCSET  DS    CL8                 COLSET CODE                                  
         DS    XL24                SPARE                                        
         EJECT                                                                  
*                                  ROWSET DEFINITION RECORD                     
*                                  ------------------------                     
QXRREC   DSECT                                                                  
QXRKEY   DS    0XL32                                                            
QXRKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QXRKAGY  DS    CL2                 AGENCY OR SOURCE                             
QXRKRCD  DS    XL1'32'             RECORD CODE                                  
QXRKFCD  DS    CL8                 FILE CODE (SURVEY)                           
         DS    XL11                SPARE                                        
QXRKRSC  DS    CL8                 ROWSET CODE                                  
         DS    XL1                 SPARE                                        
*                                                                               
QXRRLEN  DS    XL2                 RECORD LENGTH                                
QXRCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QXRELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*        TEXT ELEMENT USAGE                                                     
*                                               MAX    KEY                      
*        CODE   USAGE                  NUMBER  LENGTH LENGTH                    
*        ----   -----                  ------  ------ ------                    
*        X'C1'  TITLE                   1        20     0                       
*        X'C5'  OWNER                   0-1      20     0                       
*        X'C2'  ANNOTATION              1        30     3                       
*        X'51'  SPECIFICATION           1        40     3                       
*               (AS ENTERED)                                                    
*                                                                               
*        NOTE- THE SPECIFICATION AND ANNOTATION ELEMENTS ARE KEYED              
*              BY LINE(2) AND SPARE(1). EACH LINE CONSTITUTES A                 
*              ROW DEFINITION AND MAY CONSIST OF SEVERAL SUBLINES.              
*              SUBLINE NUMBERS ARE SEQUENCE NUMBERS WHICH FOLLOW                
*              THE KEY IN THE ELEMENT. THEY START WITH 1.                       
*                                                                               
         EJECT                                                                  
*                                  COLSET DEFINITION RECORD                     
*                                  ------------------------                     
QXCREC   DSECT                                                                  
QXCKEY   DS    0XL32                                                            
QXCKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QXCKAGY  DS    CL2                 AGENCY OR SOURCE                             
QXCKRCD  DS    XL1'33'             RECORD CODE                                  
QXCKFCD  DS    CL8                 FILE CODE (SURVEY)                           
         DS    XL11                SPARE                                        
QXCKCSC  DS    CL8                 COLSET CODE                                  
         DS    XL1                 SPARE                                        
*                                                                               
QXCRLEN  DS    XL2                 RECORD LENGTH                                
QXCCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QXCELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*        TEXT ELEMENT USAGE                                                     
*                                               MAX    KEY                      
*        CODE   USAGE                  NUMBER  LENGTH LENGTH                    
*        ----   -----                  ------  ------ ------                    
*        X'C1'  TITLE                   1        20     0                       
*        X'C5'  OWNER                   0-1      20     0                       
*        X'51'  SPECIFICATION           1        40     3                       
*               (AS ENTERED)                                                    
*                                                                               
*        NOTE- THE SPECIFICATION ELEMENTS ARE KEYED                             
*              BY LINE(2) AND SPARE(1). EACH LINE CONSTITUTES A                 
*              COLUMN DEFINITION AND MAY CONSIST OF SEVERAL SUBLINES.           
*              SUBLINE NUMBERS ARE SEQUENCE NUMBERS WHICH FOLLOW                
*              THE KEY IN THE ELEMENT. THEY START WITH 1.                       
*                                                                               
         SPACE 2                                                                
QXCCHDEL DS    X'C2'               COLUMN HEAD ELEMENT                          
         DS    AL1(17)                                                          
QXCCHLIN DS    XL2                 LINE NUMBER                                  
         DS    XL1                 SPARE                                        
QXCCHSUB DS    XL1                 SUB-LINE                                     
QXCCHPOS DS    XL1                 POSITION (1,2,3) WITHIN SUB-LINE             
QXCCHD   DS    CL10                HEADING                                      
         EJECT                                                                  
*                                  PRE-TABBED QSPEC VECTOR RECORD               
*                                  ------------------------------               
QPTRECD  DSECT                                                                  
QPTREC   DS    0X                                                               
QPTKEY   DS    0XL32                                                            
QPTKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QPTKAGY  DS    CL2                 AGENCY OR SOURCE                             
QPTKRCD  DS    XL1'28'             RECORD CODE                                  
QPTKFCD  DS    CL8                 FILE CODE                                    
QPTKWDT  DS    XL2                 WAVE DATE                                    
         DS    XL5                 SPARE                                        
QPTKNOD  DS    XL4                 NODE OF QSPEC                                
QPTKCOD  DS    CL8                 CODE OF QSPEC (LAST LEVEL)                   
QPTKSEQ  DS    XL1                 SEQUENCE WITHIN SET                          
*                                                                               
QPTRLEN  DS    XL2                 RECORD LENGTH                                
QPTCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QPTELS   DS    0X                  START OF FIRST ELEMENT                       
*                                                                               
         SPACE 2                                                                
*        NOTE- QVTCNTEL - CONTROL ELEM,                                         
*              QVTSTREL - DATA STRING ELEMENT, AND                              
*              QVTRPTEL - DATA REPETITION ELEMENT                               
*              ARE INCLUDED UNDER QVTREC                                        
*                                                                               
         EJECT                                                                  
*                                  QUESTIONNAIRE VECTOR RECORD                  
*                                  ---------------------------                  
QVTRECD  DSECT                                                                  
QVTREC   DS    0X                                                               
QVTKEY   DS    0XL32                                                            
QVTKSYS  DS    CL1'Q'              SUB-SYSTEM CODE                              
QVTKAGY  DS    CL2                 AGENCY                                       
QVTKRCD  DS    XL1'41'             RECORD CODE                                  
QVTKFCD  DS    CL8                 FILE CODE                                    
QVTKWDT  DS    XL2                 WAVE DATE                                    
         DS    XL12                SPARE                                        
QVTKCRD  DS    XL2                 CARD NUMBER                                  
QVTKCOL  DS    XL2                 COLUMN NUMBER                                
QVTKTYP  DS    XL1                 PUNCH CODE (F0-F9,X,Y)                       
*                                  (OR NUMERIC FIELD LENGTH 0-F)                
QVTKSEQ  DS    XL1                 SEQUENCE WITHIN SET                          
*                                                                               
QVTRLEN  DS    XL2                 RECORD LENGTH                                
QVTCNTL  DS    XL4                 CONTROL                                      
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
QVTELS   DS    0X                  START OF FIRST ELEMENT                       
*                                                                               
         SPACE 2                                                                
QVTCNTEL DS    XL1'01'             CONTROL ELEM                                 
         DS    AL1(10)                                                          
QVTCDLEN DS    XL1                 LENGTH IN BYTES OF RESP DATA                 
*                                  (0 = BIT STRING)                             
QVTCOUNT DS    XL4                 COUNT OF 'YESES'                             
*                                  OR SUM OF NUMERIC VALUES                     
QVTACC   DS    XL1                 ACCESS LIMIT CODE                            
         DS    XL2                 SPARE                                        
         SPACE 2                                                                
QVTSTREL DS    XL1'02'             DATA STRING ELEM                             
         DS    AL1                 ELEM LENGTH = STRING LENGTH +2               
QVTSTR   DS    0X                                                               
         SPACE 2                                                                
QVTRPTEL DS    XL1'03'             REPEAT ELEMENT                               
         DS    AL1                 ELEM LENGTH = REPETEND LENGTH +4             
QVTRPTNO DS    XL2                 NUMBER OF REPITIONS                          
QVTRPTND DS    0X                  REPETEND - LENGTH = 1,2,3,4                  
         SPACE 2                                                                
         EJECT                                                                  
*                                                                               
*                                  GENERAL PURPOSE TEXT ELEMENT                 
*                                  -----------------------------                
PTXTELD  DSECT                                                                  
PTXTEL   DS    XL1                 ELEM CODE - VARIES WITH RECORD TYPE          
         DS    AL1                 ELEM LENGTH (DATA LEN + KEY LEN + 3)         
PTXTKEY  DS    0X                  'KEY' - USE VARIES WITH REC AND ELEM         
PTXTSEQ  DS    XL1                 SEQUENCE BYTE                                
PTXTTXT  DS    0X                  TEXT                                         
         SPACE 3                                                                
*                                  EXPIRATION DATE ELEMENT                      
*                                  -----------------------                      
PEXPELD  DSECT                                                                  
PEXPEL   DS    X'F2'               ELEM CODE                                    
         DS    AL1(7)              ELEM LENGTH                                  
PEXPDAT  DS    XL3                 EXPIRATION DATE                              
         DS    XL2                 SPARE                                        
