*          DATA SET MPPCMDDGP  AT LEVEL 003 AS OF 11/12/85                      
*                                                                               
*        MEDIA PLANNING- READERSHIP REPORT PROCESSING COMMAND DSECT             
*                                                                               
PCMDD    DSECT                                                                  
PCLNTH   DS    X                   LENGTH OF ENTRY                              
PCBASE   DS    X                   BASE                                         
PCQUAL   DS    X                   QUALIFIER                                    
PCWGT    DS    X                   WEIGHT CONTROL                               
*                                  X'80'= RESPONSE FUNCTION WEIGHTS             
*                                  X'40'= IMPACT FACTOR WEIGHTS                 
PCSFX    DS    XL2                 SUFFIX                                       
*                                    REACH REPORT- ISSUE COUNT                  
*                                    VXV REPORT- REL. NO. OF 2ND V              
*                                    SCHEDULES- RCH-N AND UNIQ-N,               
*                                               N= FREQUENCY LEVEL              
PCTYP    DS    C                   'D'=DATA VECTOR VALUE                        
PCWHERE  DS    XL4                  DISPL INTO DATA VECTOR                      
*                                                                               
PCMDL    EQU   *-PCMDD                                                          
