*          DATA SET MPRDR90D   AT LEVEL 004 AS OF 07/31/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T51090D      DATE 07/31/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6   A    P    N         T         Y           
VELSURH  DS    CL8                                                              
VELSUR   DS    CL8      5   10    8   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL6      5   20    6   A    P    N         T         Y           
VELTRGH  DS    CL8                                                              
VELTRG   DS    CL8      5   28    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      6    2    7   A    P    N         T         Y           
VELOPTH  DS    CL8                                                              
VELOPT   DS    CL60     6   10   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    7    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12     8   22   12   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12     8   42   12   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1      9    5    1   A    P    N         T         Y           
VELNAMH  DS    CL8                                                              
VELNAM   DS    CL12     9    7   12   A    U    N         T         Y           
VELISS1H DS    CL8                                                              
VELISS1  DS    CL17     9   22   17   A    U    N         T         Y           
VELISS2H DS    CL8                                                              
VELISS2  DS    CL17     9   42   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     10    5    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    10    7   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    10   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    10   42   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     11    5    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    11    7   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    11   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    11   42   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     12    5    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    12    7   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    12   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    12   42   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13    5    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    13    7   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    13   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    13   42   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     14    5    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    14    7   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    14   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    14   42   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     15    5    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    15    7   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    15   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    15   42   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16    5    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    16    7   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    16   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    16   42   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16   78    1   A    P    N         T         Y           
VELLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
VELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 843  BYTES                            
