*          DATA SET MPRDRAFD   AT LEVEL 001 AS OF 01/14/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T510AFD      DATE 01/14/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     5    2   18  A   P    N         T        Y              
SCCFROMH DS    CL8                                                              
SCCFROM  DS    CL8      5   22    8  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  A   P    N         T        Y              
SCCTOH   DS    CL8                                                              
SCCTO    DS    CL8      7   22    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
SCCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 96   BYTES                            
