*          DATA SET MPRXPCMDD  AT LEVEL 002 AS OF 08/21/85                      
*                                                                               
*        MEDIA PLANNING- READERSHIP REPORT PROCESSING COMMAND DSECT             
*                                                                               
PCMDD    DSECT                                                                  
PCBASE   DS    X                   BASE                                         
PCQUAL   DS    X                   QUALIFIER                                    
PCSFX    DS    XL2                 SUFFIX                                       
PCTYP    DS    C                   'D'=DATA VECTOR VALUE                        
PCWHERE  DS    XL4                 FOR 'D'= DISPL INTO DATA VECTOR              
*                                                                               
PCMDL    EQU   *-PCMDD                                                          
