*          DATA SET MPSRFD     AT LEVEL 003 AS OF 11/13/84                      
*                                                                               
SRFD     DSECT                     DSECT FOR MPSRFCOMP PARAMETERS               
*                                                                               
SRFC1    DS    F                   C1 - AVG ISSUE READERSHIP                    
SRFC2    DS    F                   C2 - TWO ISSUE READERSHIP                    
SRFPOP   DS    F                   POPULATION                                   
SRFISS   DS    F                   COUNT - NUMBER OF ISSUES                     
*                                                                               
SRFRT    DS    A                   A(REACH TABLE)                               
SRFFT    DS    A                   A(FREQ DIST TABLE)                           
*                                                                               
SRFPF1   DS    F                   PREC FACTOR1 (TEST ONLY)                     
SRFPF2   DS    F                   PREC FACTOR2 (TEST ONLY)                     
SRFDL    EQU   *-SRFD                                                           
