*          DATA SET MPVTABDGP  AT LEVEL 003 AS OF 11/13/85                      
*                                                                               
*              MEDIA PLANNING - DSECT FOR DATA VECTOR TABLE                     
*                                                                               
VTABD    DSECT                                                                  
*                                                                               
VTFDTA   DS    0C                  FIXED VEHICLE DATA                           
*                                  ------------------                           
VTLEN    DS    XL2                 TOTAL VECTOR LENGTH                          
VTTYPE   DS    C                   ENTRY TYPE                                   
VTFLAGS  DS    X                   FLAGS                                        
VTENTNO  DS    XL2                 ENTRY NO.                                    
VTVEHD   DS    0X                  VEHICLE DATA                                 
VTQID    DS    CL8                 Q CODE                                       
VTVID    DS    CL12                VEHICLE ID                                   
VTVSNAM  DS    CL16                SHORT NAME                                   
VTVLNAM  DS    CL40                LONG NAME                                    
VTCIRC   DS    XL4                 CIRC                                         
VTCOST   DS    XL4                 COST                                         
VTCADJ   DS    XL4                 CIRC ADJUSTMENT        (.000)                
VTIMPF   DS    XL4                 IMPACT FACTOR          (.000)                
VTPRODUP DS    XL4                 DUPE FACTOR FOR PROTOS (.000)                
VTINS    DS    XL2                 INSERT COUNT                                 
VTWVBL   DS    XL2                 POSITIONAL BIT LIST OF ACTIVE WAVES          
VTERR    DS    XL1                 ERROR CODE                                   
VTERRP   DS    XL2                 2ND PUB OF PAIR ERROR                        
VTSAMF   DS    CL2                 SAMPLE SIZE FLAG                             
VTICOD   DS    C                   INTEREST CODE                                
VTFCOD   DS    C                   FREQ CODE                                    
VTELEN   EQU   *-VTABD                                                          
*                                                                               
VTVDATA  DS    0X                  START OF VARIABLE DATA                       
*                                                                               
