*          DATA SET MPXCOND    AT LEVEL 002 AS OF 04/18/83                      
*                   MEDIA PLANNING                                              
*                   XTAB FIEL CONDITION SPEC DSECT                              
MPXCOND  DSECT                                                                  
MPXCCARD DS    XL2                 'CARD' NUMBER                                
MPXCCOL  DS    XL2                 'COLUMN' NUMBER                              
MPXCPNCH DS    XL1                 PUNCH CONDITON (F0-F9,-,&)                   
MPXCNLEN EQU   MPXCPNCH            OR LENGTH OF NUMERIC                         
*                                  DATA FIELD (01-0F)                           
*                                                                               
