*          DATA SET MXCLI2D    AT LEVEL 018 AS OF 12/22/99                      
***********************************************************************         
*  MEDIA SYSTEM EXTRACT - CLIENT RECORD                               *         
***********************************************************************         
         SPACE 1                                                                
MXCLID   DSECT                     CLIENT RECORD                                
MXCLILEN DS    CL4                 CLIENT RECORD LENGTH                         
MXCLITYP DS    CL5     R CHAR      CLIENT RECORD TYPE                           
         DS    C                                                                
MXCLIACT DS    CL1     R CHAR      ACTION (A/C/D/L)                             
         DS    C                                                                
MXCLIDAT DS    CL8     R DATE      ACTION DATE YYYYMMDD                         
         DS    C                                                                
MXCLITIM DS    CL6     R TIME      ACTION TIME HHMMSS                           
         DS    C                                                                
MXCLIAGY DS    CL2     R CHAR      AGENCY ALPHA ID                              
*                                                                               
         DS    C                                                                
MXCLIMED DS    CL3     K TINYINT   CLIENT MEDIA                                 
         DS    C                                                                
MXCLICDE DS    CL5     K CHAR      CLIENT CODE                                  
         DS    C                                                                
MXCLISHR DS    CL12    O CHAR      CLIENT SHORT NAME                            
         DS    C                                                                
MXCLIFL1 DS    CL1     O CHAR      CLIENT FILTER 1                              
         DS    C                                                                
MXCLIFL2 DS    CL1     O CHAR      CLIENT FILTER 2                              
         DS    C                                                                
MXCLIFL3 DS    CL1     O CHAR      CLIENT FILTER 3                              
         DS    C                                                                
MXCLICAG DS    CL3     O TINYINT   CLIENT CREATIVE AGENCY                       
         DS    C                                                                
MXCLIBAG DS    CL3     O TINYINT   CLIENT BUYING AGENCY                         
         DS    C                                                                
MXCLIBG  DS    CL2     O CHAR      CLIENT BILLING GROUP                         
         DS    C                                                                
MXCLIOSC DS    CL4     O CHAR      CLIENT OUTLET SCHEME CODE                    
         DS    C                                                                
MXCLINAM DS    CL30    O CHAR      CLIENT NAME                                  
         DS    C                                                                
MXCLIAD1 DS    CL30    O CHAR      CLIENT ADDRESS 1                             
         DS    C                                                                
MXCLIAD2 DS    CL30    O CHAR      CLIENT ADDRESS 2                             
         DS    C                                                                
MXCLIAD3 DS    CL30    O CHAR      CLIENT ADDRESS 3                             
         DS    C                                                                
MXCLIAD4 DS    CL30    O CHAR      CLIENT ADDRESS 4                             
*                                                                               
         DS    C                                                                
MXCLICOM DS    CL20    O CHAR      INVOICABLE COMMISSION RATE                   
         DS    C                                                                
MXCLIVTY DS    CL8     O CHAR      VAT TYPE                                     
         DS    C                                                                
MXCLIFML DS    CL10    O CHAR      FORMULA SCHEME CODE                          
*                                                                               
MXCLIDX  DS    CL2                 RECORD END                                   
MXCLIDL  EQU   *-MXCLID            RECORD LENGTH                                
