*          DATA SET MXDFTBLS   AT LEVEL 011 AS OF 08/19/91                      
*---------------------------------------------------*                           
* NOTE THESE TABLES ARE INCLUDED IN ACTRA05/ACTRA03 *                           
*---------------------------------------------------*                           
         SPACE                                                                  
* DEFAULT FOR PROF MAINT                                                        
*                                                                               
DFLTBL   DS    0CL20              LENGTH OF EACH VALUE                          
         DC    CL20' '            DDS ACC FILE                                  
         DC    CL20' '            DDS MEDIA FILE                                
         DC    C'N',CL19' '       DDS MAKE POSTINGS                             
         DC    CL20' '                                                          
         DC    C'N',CL19' '       CHECK FOR SJ PRODUCT                          
         DC    C'N',CL19' '       CHECK FOR PRODUCT LVL 1C                      
         DC    CL20' '            SPECIAL DELIMITER                             
         DC    CL2'00',CL18' '    MOS BACK-UP DATE                              
         DC    CL2'00',CL18' '    MOS FORWARD DATE                              
         DC    C'N',CL19' '       MAKE POSTINGS                                 
         DC    C'N',CL19' '       CC= IN USE/OR LEVEL                           
         DC    CL20' '            PRODUCT GROUP SCHEME                          
         DC    X'FF'                                                            
*                                                                               
* DEFAULT FOR RPROF MAINT                                                       
*                                                                               
DFLTBLR  DS    0CL20              LENGTH OF EACH VALUE                          
         DC    CL20' '            UNIT 3 LEDGER                                 
         DC    CL20' '            UNIT 3 LEVEL                                  
         DC    C'N',CL19' '       RCVBL ACCOUNT IS ON UNIT 3 PART               
         DC    C'N',CL19' '       RCVBL ACCOUNT IS ON UNIT 3 PART               
         DC    X'FF'                                                            
*                                                                               
* DEFAULT FOR PPROF MAINT                                                       
*                                                                               
DFLTBLP  DS    0CL20              LENGTH OF EACH VALUE                          
         DC    C'N',CL19' '       POST RCVBL TO PROD INV(SJ)                    
         DC    CL20' '            WORK CODE - PROD INV (SJ)                     
         DC    CL20' '            JOB CODE FOR SEPERATE CD(SJ)                  
         DC    C'OSUS',CL16' '    SUSPENSE SUFFIX                               
         DC    C'OREB',CL16' '    REBATE SUFFIX                                 
         DC    C'N',CL19' '       POST TO CLT LVL RCVBL                         
         DC    X'FF'                                                            
         EJECT                                                                  
