*          DATA SET MXRECID    AT LEVEL 015 AS OF 01/19/00                      
***********************************************************************         
* MEDIA SQL EXTRACT RECORD TYPE EQUATES FOR HARP 2                    *         
***********************************************************************         
          SPACE 2                                                               
MXAGYDQ   DC   CL5'05200'          AGENCY                                       
MXAUDDQ   DC   CL5'05201'          AUDIENCE                                     
MXBURDQ   DC   CL5'05202'          BURST                                        
MXBUYDQ   DC   CL5'05203'          BUY                                          
MXBOSDQ   DC   CL5'05204'          BUY OUTLET SCHEME                            
MXBPRDQ   DC   CL5'05205'          BUY PRESS                                    
MXBTVDQ   DC   CL5'05206'          BUY TV                                       
MXBTRDQ   DC   CL5'05207'          BUY TV RATING                                
MXBYRDQ   DC   CL5'05208'          BUYER                                        
MXCAMDQ   DC   CL5'05209'          CAMPAIGN                                     
MXCLIDQ   DC   CL5'05210'          CLIENT                                       
MXFOLDQ   DC   CL5'05211'          FOLIO                                        
MXFTVDQ   DC   CL5'05212'          FOLIO TV                                     
MXMEDDQ   DC   CL5'05213'          MEDIA                                        
MXOUTDQ   DC   CL5'05214'          OUTLET                                       
MXOULDQ   DC   CL5'05215'          OUTLET LINK                                  
MXPRODQ   DC   CL5'05216'          PRODUCT                                      
MXSCHDQ   DC   CL5'05217'          OUTLET SCHEME                                
MXSUPDQ   DC   CL5'05218'          SUPPLIER                                     
MXSTVDQ   DC   CL5'05219'          SUPPLIER TV                                  
MXTVADQ   DC   CL5'05220'          TV AREA                                      
MXEQUDQ   DC   CL5'05221'          EQUIV_FACTOR                                 
MXEPRDQ   DC   CL5'05222'          EQUIV_FACTOR_PRO_RATA                        
MXBPTDQ   DC   CL5'05223'          BUY PRINT                                    
MXBBRDQ   DC   CL5'05224'          BUY BROADCAST                                
MXBRCDQ   DC   CL5'05225'          BUY RECRUITMENT                              
MXBINDQ   DC   CL5'05226'          BUY INTERNATIONAL                            
MXBXRDQ   DC   CL5'05227'          BUY EXTRA RATES                              
MXBCODQ   DC   CL5'05228'          BUY COMMENTS                                 
MXBPVDQ   DC   CL5'05229'          BUY PRINT VOUCHERING                         
MXBBVDQ   DC   CL5'05230'          BUY BROADCAST VOUCHERING                     
MXBQRDQ   DC   CL5'05231'          BUY QRP RATINGS                              
