*          DATA SET MXTBDSECT  AT LEVEL 053 AS OF 12/18/07                      
*                                                                               
*        SORT KEY DSECT                                                         
*                                                                               
SRTKEYD  DSECT                                                                  
*                                                                               
SRTLEN   DS    XL4                 SORTER RECORD LENGTH                         
SRTKEY   DS    0CL16                                                            
SRTOID   DS    XL2                 NUMERIC ID FOR WORKER FILE                   
SRTID    DS    CL2                 ALPHA ID FOR WORKER FILE                     
SRTINV   DS    CL6                 BILL INV #                                   
SRTSEQ   DS    XL1                 SORT SEQUENCE NUMBER                         
SRTSBOT  EQU   X'01'               SINK BELOW SORT RECS W/ NO SEQ#              
         DS    CL5                 SPARE                                        
SRTKEYLQ EQU   *-SRTKEYD                                                        
         SPACE 2                                                                
