*          DATA SET NAVDSECTS  AT LEVEL 199 AS OF 10/01/20                      
*                                                                               
*  GLOBBER LAYOUT FOR THE DRAFT/ADD/CHANGE ACTIONS                              
*  THIS LAYOUT IS SHARED BETWEEN THE NENAV SYSTEM                               
*  AND THE NEBUY SYSTEM.  IF ANY CHANGES ARE MADE                               
*  TO THIS DSECT YOU MUST RELINK THE BUY AS WELL                                
*  AS THE NAV SYSTEMS.                                                          
*                                                                               
*                                                                               
* DRAFT BUY RECORD                                                              
*                                                                               
BUYDRFTD DSECT                                                                  
RDRSEQ   DS    CL1                  SEQUENCE NUMBER (NOT FOR DRAFT)             
RDRTYPE  DS    CL2                  REQUEST TYPE                                
*                                   DR-DRAFT BUY                                
RDRCLI   DS    CL3                  CLIENT                                      
RDREST   DS    CL3                  ESTIMATE                                    
RDRNET   DS    CL4                  NETWORK                                     
RDRPACK  DS    CL3                  PACKAGE                                     
RDRPCODE DS    CL6                  PROGRAM CODE                                
RDRBDATE DS    CL8                  BUY DATE                                    
RDRSLINE DS    CL3                  LINE NUMBER                                 
RDRREAS  DS    CL3                  REASON CODE                                 
RDRWEEKS DS    CL2                  # WEEKS                                     
RDRPWEEK DS    CL3                  UNITS PER WEEK                              
*                                                                               
RDRTIME  DS    CL4                  OVERRIDE TIME                               
RDRTIMEL DS    CL1                  START TIME LENGTH (CHECK FOR INPUT)         
RDRDAY   DS    CL1                  OVERRIDE DAY                                
RDRLEN   DS    CL1                  OVERRIDE LENGTH                             
RDRSTAT  DS    XL1                  X'20' = DEMOS ESTIMATE NO GUARANTEE         
*                                   X'10' = DEMOS ACTUAL                        
*                                   X'08' = RTG 30 SECOND EQUIV                 
*                                   X'04' = RTG NO EQUIV                        
*                                   X'02' = IMP 30 SECOND EQUIV                 
*                                   X'01' = IMP NO EQUIV                        
*                                                                               
*                                                                               
RDRDEMS  DS    CL75                 REQUESTED DEMO CATEGORIES                   
RDRDATES DS    CL104                MAX OF 52 DATES                             
RDRSTAT2 DS    CL1                  DEMO INFO                                   
*                                   01 ACT COLUMN 2                             
*                                   02 EST COLUMN 2                             
*                                   04 EST GUARANTEE COLUMN 2                   
*                                                                               
RDRRCLEN EQU   *-RDRTYPE                                                        
         EJECT                                                                  
*                                                                               
*                                                                               
* UPLOAD BUY RECORD                                                             
*                                                                               
BUYUPLDD DSECT                                                                  
RUPSEQ   DS    CL1                  SEQUENCE NUMBER                             
*                                                                               
RUPTYPE  DS    CL2                  REQUEST TYPE                                
*                                   CH-CHANGE BUY                               
*                                   BU-BUY UNIT                                 
*                                   CD-CHANGE DEMO                              
*                                   DE-DELETE UNIT                              
*                                   RD-REFRESH DEMO                             
RUPCLI   DS    CL3                  CLIENT                                      
RUPEST   DS    CL3                  ESTIMATE                                    
RUPNET   DS    CL4                  NETWORK                                     
RUPPACK  DS    CL3                  PACKAGE                                     
RUPPCODE DS    CL6                  PROGRAM CODE                                
RUPBDATE DS    CL8                  BUY DATE                                    
RUPSLINE DS    CL3                  LINE NUMBER                                 
RUPREAS  DS    CL3                  REASON CODE                                 
*                                                                               
RUPWEEKS DS    CL2                  # WEEKS                                     
RUPPWEEK DS    CL3                  UNITS PER WEEK                              
*                                                                               
RUPNPRDL DS    XL1                  NEW PRODUCT LENGTH                          
RUPNPRD  DS    XL8                  NEW PRODUCT                                 
RUPOPRDL DS    XL1                  ORIGINAL PRODUCT LENGTH                     
RUPOPRD  DS    XL8                  ORIGINAL PRODUCT                            
*                                                                               
RUPST1   DS    XL1                  UNIT STATUS                                 
*                                   X'80' = UNIT SENT UP VIA HUB                
RUPRPLEN EQU   *-RUPSEQ                                                         
*                                                                               
RUPNACTL DS    XL1                  NEW ACTUAL COST LENGTH                      
RUPNACT  DS    XL4                  NEW ACTUAL COST                             
RUPOACTL DS    XL1                  ORIGINAL ACTUAL COST LENGTH                 
RUPOACT  DS    XL4                  ORIGINAL ACTUAL COST                        
*                                                                               
RUPNASSL DS    XL1                  NEW ASSIGNED COST LENGTH                    
RUPNASS  DS    XL4                  NEW ASSIGNED COST                           
RUPOASSL DS    XL1                  ORIGINAL ASSIGNED COST LENGTH               
RUPOASS  DS    XL4                  ORIGINAL ASSIGNED COST                      
RUPASLEN EQU   *-RUPSEQ                                                         
*                                                                               
RUPNINTL DS    XL1                  NEW INTEGRATION COST LENGTH                 
RUPNINT  DS    XL4                  NEW INTEGRATION COST                        
RUPOINTL DS    XL1                  ORIGINAL INTEGRATION COST LENGTH            
RUPOINT  DS    XL4                  ORIGINAL INTEGRATION COST                   
*                                                                               
RUPNDAYL DS    XL1                  NEW DAY LENGTH                              
RUPNDAY  DS    XL1                  NEW DAY                                     
RUPODAYL DS    XL1                  ORIGINAL DAY LENGTH                         
RUPODAY  DS    XL1                  ORIGINAL DAY                                
*                                                                               
RUPNROTL DS    XL1                  NEW ROTATION LENGTH                         
RUPNROT  DS    XL1                  NEW ROTATION                                
RUPOROTL DS    XL1                  ORIGINAL ROTATION LENGTH                    
RUPOROT  DS    XL1                  ORIGINAL ROTATION                           
*                                                                               
RUPNATML DS    XL1                  NEW AFFID TIME LENGTH                       
RUPNATM  DS    XL2                  NEW AFFID TIME                              
RUPOATML DS    XL1                  OLD AFFID TIME LENGTH                       
RUPOATM  DS    XL2                  OLD AFFID TIME                              
*                                                                               
RUPNTIML DS    XL1                  NEW TIME LENGTH                             
RUPNTIM  DS    XL4                  NEW TIME                                    
RUPOTIML DS    XL1                  ORIGINAL TIME LENGTH                        
RUPOTIM  DS    XL4                  ORIGINAL TIME                               
*                                                                               
RUPNREPL DS    XL1                  NEW SPECIAL REP LENGTH                      
RUPNREP  DS    XL2                  NEW SPECIAL REP                             
RUPOREPL DS    XL1                  ORIGINAL SPECIAL REP LENGTH                 
RUPOREP  DS    XL2                  ORIGINAL SPECIAL REP                        
*                                                                               
RUPNDAT  DS    XL2                  NEW BUY DATE                                
*                                                                               
RUPNLENL DS    XL1                  NEW UNIT LENGTH (LENGTH)                    
RUPNLEN  DS    XL1                  NEW UNIT LENGTH                             
RUPOLENL DS    XL1                  ORIGINAL UNIT LENGTH (LENGTH)               
RUPOLEN  DS    XL1                  ORIGINAL UNIT LENGTH                        
*                                                                               
RUPNNTIL DS    XL1                  NEW NTI LENGTH                              
RUPNNTI  DS    XL2                  NEW NTI                                     
RUPONTIL DS    XL1                  ORIGINAL NTI LENGTH                         
RUPONTI  DS    XL2                  ORIGINAL NTI                                
*                                                                               
RUPNHUTL DS    XL1                  NEW HUT LENGTH                              
RUPNHUT  DS    XL2                  NEW HUT                                     
RUPOHUTL DS    XL1                  ORIGINAL HUT LENGTH                         
RUPOHUT  DS    XL2                  ORIGINAL HUT                                
*                                                                               
RUPNSHRL DS    XL1                  NEW SHARE LENGTH                            
RUPNSHR  DS    XL2                  NEW SHARE                                   
RUPOSHRL DS    XL1                  ORIGINAL SHARE LENGTH                       
RUPOSHR  DS    XL2                  ORIGINAL SHARE                              
*                                                                               
RUPNHRTL DS    XL1                  NEW HOMES RATING LENGTH                     
RUPNHRT  DS    XL2                  NEW HOMES RATING                            
RUPOHRTL DS    XL1                  ORIGINAL HOMES RATING LENGTH                
RUPOHRT  DS    XL2                  ORIGINAL HOMES RATING                       
*                                                                               
RUPNHIML DS    XL1                  NEW HOMES INPRESSION LENGTH                 
RUPNHIM  DS    XL4                  NEW HOMES IMPRESSION                        
*                                                                               
RUPNPNML DS    XL1                  NEW PROGRAM NAME LENGTH                     
RUPNPNM  DS    XL16                 NEW PROGRAM NAME                            
*                                                                               
RUPNCBO  DS    XL4                  COMBO CODE                                  
RUPNPOD  DS    XL3                  POD CODE                                    
*                                                                               
RUPNMGDL DS    XL1                  NEW M/G DEMO LENGTH                         
RUPNMGD  DS    XL1                  NEW M/G DEMO                                
RUPNPREL DS    XL1                  NEW PRE-EMPT LENGTH                         
RUPNPRE  DS    XL1                  NEW PRE-EMPT                                
RUPNBYTL DS    XL1                  NEW BUY TYPE LENGTH                         
RUPNBYT  DS    XL1                  NEW BUY TYPE                                
RUPNADUL DS    XL1                  NEW ADU LENGTH                              
RUPNADU  DS    XL1                  NEW ADU                                     
RUPNBLBL DS    XL1                  NEW BILLBOARD LENGTH                        
RUPNBLB  DS    XL1                  NEW BILLBOARD                               
RUPNSDPL DS    XL1                  SUB DAYPART LENGTH                          
RUPNSDP  DS    XL1                  SUB DAYPART                                 
*                                                                               
RUPPRTGL DS    CL1                  PROGRAM RATING LENGTH                       
RUPPRTGC DS    CL2                  PROGRAM RATING                              
RUPPTIRL DS    CL1                  PROGRAM TIER LENGTH                         
RUPPTIER DS    CL1                  PROGRAM TIER                                
RUPPCNTL DS    CL1                  PROGRAM CONTENT LENGTH                      
RUPPCONT DS    CL6                  PROGRAM CONTENT                             
RUPPNEWL DS    CL1                  PROGRAM NEW SWITCH LENGTH                   
RUPPNEW  DS    CL1                  PROGRAM NEW SWITCH                          
*                                                                               
RUPGAPAL DS    XL1                  GAP AFFID LENGTH                            
RUPGAPAF DS    XL2                  GAP AFFID TIME                              
*                                                                               
RUPSTAT  DS    XL1                                                              
RS1ESTY  EQU   X'80'                X'80' = EST=Y                               
RS1ACF   EQU   X'40'                X'40' = SET ASS COST TO UNFROZEN            
RS1ESTNG EQU   X'20'                X'20' = DEMOS ESTIMATE NO GUARANTEE         
RS1ACT   EQU   X'10'                X'10' = DEMOS ACTUAL                        
RS1R30   EQU   X'08'                X'08' = RTG 30 SECOND EQUIV                 
RS1RNOEQ EQU   X'04'                X'04' = RTG NO EQUIV                        
RS1I30   EQU   X'02'                X'02' = IMP 30 SECOND EQUIV                 
RS1INOEQ EQU   X'01'                X'01' = IMP NO EQUIV                        
*                                                                               
RUPPALEN EQU   *-RUPSEQ                                                         
RUPCOMT1 DS    CL60                 BUY COMMENTS LINE 1                         
RUPCOMT2 DS    CL60                 BUY COMMENTS LINE 2                         
RUPSPLEN EQU   *-RUPSEQ                                                         
*                                                                               
RUPMISS  DS    CL60                 MISSED UNIT INFORMATION                     
RUPMISSL DS    XL1                  MISSED UNIT INFORMATION                     
*  RUPMISS HOLDS THE PACKU FIELDS                                               
RUPPKUI  EQU   RUPMISS              PACKU INDICATOR C'PACKU'                    
RUPVSTR  EQU   RUPMISS+6            VIEWING STREAM (V TYPE)                     
RUPPKFLT EQU   RUPMISS+9            PACKAGE FILTER                              
RUPUNIV  EQU   RUPMISS+16           UNIVERSE CODE                               
RUPUNIVL EQU   RUPMISS+21           UNIVERSE CODE LENGTH                        
RUPANME  EQU   RUPMISS+22           AUDIT NAME                                  
RUPACDE  EQU   RUPMISS+38           AUDIT CODE                                  
RUPHTADJ EQU   RUPMISS+43           HUT ADJUSTMENT PCT                          
RUPHADJL EQU   RUPMISS+46           HUT ADJUSTMENT PCT LENGTH                   
RUPUNPCT EQU   RUPMISS+47           UNIVERSE PERCENT                            
RUPUNPCL EQU   RUPMISS+50           UNIVERSE PERCENT LENGTH                     
*  RUPMISS HOLDS THE SPLIT TABLE                                                
RUPSPLTB EQU   RUPMISS              SPLIT UNIT LENGTH TABLE                     
*                                                                               
RUPDEMOS DS    XL420                DEMOS OVERIDE INFO UP TO 20 CATS.           
*                                   BYTES 1-3-DEMO CATEGORY                     
         ORG   RUPDEMOS                                                         
RUPINV   DS    CL17                 INVOICE NUMBER (MATCHMAKER)                 
RUPINVTP DS    CL1                  INVOICE TYPE T=TIME,I=INT,B=BOTH            
         ORG                                                                    
*                                   BYTES 4-7-DEMO AMOUNT                       
RUPSTAT2 DS    CL1                  DEMO INFO                                   
RS2ACT   EQU   X'01'                01 ACT COLUMN 2                             
RS2EST   EQU   X'02'                02 EST COLUMN 2                             
RS2ESTNG EQU   X'04'                04 EST GUARANTEE COLUMN 2                   
RS2CPYSP EQU   X'08'                08 UNIT IS A COPYSPLIT                      
RS2NONFD EQU   X'10'                10 UNIT HAS NO NATIONAL FEED                
*                                                                               
RUPNHRAL DS    XL1                  NEW HOMES RATING LENGTH                     
RUPNHRA  DS    XL2                  NEW HOMES RATING                            
*                                                                               
RUPDEMOA DS    XL420                ACTUAL DEMOS OVERIDE INFO 20 CATS.          
*                                                                               
RUPSPCHR DS    5XL21                SPECIAL CHARGE BUFFER MAX 5 ENTRYS          
RUPSPCHL EQU   21                   LENGTH OF TABLE ENTRY                       
*                                                                               
RUPCSPCT DS    6XL7                 COPY SPLIT PERCENT TABLE                    
RUPCSFD  DS    XL30                 COPY SPLIT FEED TABLE                       
* ABOVE TABLE HAS 6 ENTRIES   BYTES EACH ENTRY                                  
*                                                                               
RUPRCLEN EQU   *-RUPSEQ                                                         
RUPBUFLN EQU   RUPRCLEN*100                                                     
RUPDEMS  DS    CL75                 REQUESTED DEMO CATEGORIES                   
RUPCDEMS DS    CL160                REQUESTED COMSCORE DEMO NAME LIST           
RUPPRSID DS    CL20                 PRISMA ID                                   
RUPLEN   EQU   *-RUPSEQ                                                         
*                                                                               
RUPNWINL DS    XL1                  NEW WINDOW DATE LENGTH                      
RUPNWIN  DS    XL2                  NEW WINDOW DATE                             
RUPOWINL DS    XL1                  ORIGINAL WINDOW DATE LENGTH                 
RUPOWIN  DS    XL2                  ORIGINAL WINDOW DATE                        
*                                                                               
RUPNCS#L DS    XL1                  NEW COMSCORE SERIES # LENGTH                
RUPNCS#  DS    CL10                 NEW COMSCORE SERIES #                       
RUPOCS#L DS    XL1                  ORIGINAL COMSCORE SERIES # LENGTH           
RUPOCS#  DS    CL10                 ORIGINAL COMSCORE SERIES #                  
*                                                                               
RUPOAIRL DS    XL1                  NEW AIR NETWORK INFO LENGTH                 
RUPNAIR  DS    CL10                 NEW AIR NETWORK INFO                        
RUPNAIRL DS    XL1                  ORIGINAL AIR NETWORK INFO LENGTH            
RUPOAIR  DS    CL10                 ORIGINAL AIR NETWORK INFO                   
RUPLEN2  EQU   *-RUPSEQ                                                         
RUPNCBO2 DS    CL6                  NEW COMBO CODE (SPEC-43030)                 
RUPLEN3  EQU   *-RUPSEQ                                                         
         EJECT                                                                  
*  DSECT FOR SPECIAL CHARGE ENTRIES                                             
SPCHRTAB DSECT                                                                  
SPCHRSEQ DS    XL1                  SEQUENCE NUMBER                             
SPCHRACT DS    CL1                  ACTION A,C,D                                
SPCHRTYP DS    CL1                  SPECIAL CHARGE TYPE                         
SPCHRAMT DS    XL4                  AMOUNT                                      
SPCHRREP DS    CL3                  REP                                         
SPCHRCOM DS    CL1                  COMMISSION                                  
SPCHRSTA DS    CL4                  STATION                                     
SPCHRBPR DS    CL3                  BILLING PROD                                
SPCHRTPR DS    CL3                  TRAFFIC PROD                                
         EJECT                                                                  
*  DSECT FOR PRODUCT PERCENT COPY SPLIT TABLE (RUPCSPCT)                        
CPYSPPCT DSECT                                                                  
CPYSPPRD DS    CL3                  COPY SPLIT PRODUCT                          
CPYSP1PT DS    XL2                  COPY SPLIT 1ST PRODUCT PERCENT              
CPYSPFPT DS    XL2                  COPY SPLIT FEED PERCENT                     
CPYSPPLN EQU   *-CPYSPPRD                                                       
*  DSECT FOR FEED COPY SPLIT TABLE (RUPCSFD)                                    
CPYSFEED DSECT                                                                  
CPYFPROD DS    CL1                  DISPLACEMENT INTO CPYSPPRD TABLE            
CPYFFEED DS    CL4                  COPY SPLIT FEED CODE                        
CPYSPFLN EQU   *-CPYSFEED                                                       
*                                                                               
*                                                                               
* UPLOAD PACKAGE                                                                
*                                                                               
PKGUPLDD DSECT                                                                  
RPKSEQ   DS    CL1                  SEQUENCE NUMBER                             
*                                                                               
RPKTYPE  DS    CL2                  REQUEST TYPE                                
*                                   PB-PACKAGE BUY                              
*                                   PC-PACKAGE CHANGE                           
*                                   PD-PACKAGE DELETE                           
RPKCLI   DS    CL3                  CLIENT                                      
RPKEST   DS    CL3                  ESTIMATE                                    
RPKNET   DS    CL4                  NETWORK                                     
RPKPACK  DS    CL3                  PACKAGE                                     
*                                                                               
RPKCODE  DS    CL6                  PROGRAM CODE (NOT USED)                     
RPKBDATE DS    CL8                  BUY DATE (NOT USED)                         
RPKSLINE DS    CL3                  LINE NUMBER (NOT USED)                      
RPKREAS  DS    CL3                  REASON CODE (NOT USED)                      
RPKWEEKS DS    CL2                  # WEEKS (NOT USED)                          
RPKWEEK  DS    CL3                  UNITS PER WEEK (NOT USED)                   
*                                                                               
RPKNAM1  DS    CL16                 NAME 1                                      
RPKNAM2  DS    CL16                 NAME 2                                      
RPKBTYP  DS    CL1                  BUY TYPE (U,S,O)                            
RPKDBSE  DS    CL1                  DEMO BASE                                   
RPKINTG  DS    CL10                 INTEGRATION                                 
RPKCOST  DS    CL4                  PACKAGE COST                                
RPKMPRD  DS    CL3                  MASTER PRODUCT                              
RPKDPT   DS    CL2                  DAYPART                                     
RPKUNIV  DS    CL4                  UNIVERSE                                    
RPKHAVG  DS    CL2                  HUT AVERAGE                                 
RPKHCTYP DS    CL1                  HUT CALANDER TYPE                           
RPKHADJ  DS    CL2                  HUT ADJUSTMENT                              
RPKHSCHM DS    CL1                  HUT SCHEME                                  
RPKAGRP  DS    CL4                  AUDIT GROUP                                 
RPKANAM  DS    CL16                 AUDIT GROUP NAME                            
RPKSREP  DS    CL3                  SPECIAL REP                                 
RPKFILT  DS    CL6                  PACKAGE FILTER                              
RPKVTYPE DS    CL3                  V TYPE                                      
RPKSTAT  DS    CL8                  STATUS                                      
RPKOPTS  DS    CL60                 OPTIONS                                     
RPKFPCTG DS    CL2                  FEED PERCENT                                
RPKLENTH DS    CL3                  DEFAULT LENGTH                              
RPKIMPCT DS    CL2                  IMPACT PERCENT                              
RPKPKCPM DS    CL4                  PACKAGE CPM                                 
RPKUPCTG DS    CL2                  UNIVERSE PERCENTAGE                         
*                                                                               
* FIELD CHANGE INDICATOR SWITCHES C'Y' MEANS FIELD CHANGED                      
RPKVTYPC DS    CL1                  V TYPE                                      
RPKINTGC DS    CL1                  INTEGRATION                                 
RPKFILTC DS    CL1                  PACKAGE FILTER                              
RPKBTYPC DS    CL1                  BUY TYPE                                    
RPKUNIVC DS    CL1                  UNIVERSE INPUT                              
RPKANAMC DS    CL1                  AUDIT GROUP NAME                            
RPKAGRPC DS    CL1                  AUDIT GROUP                                 
RPKHADJC DS    CL1                  HUT ADJUSTMENT                              
RPKUPCTC DS    CL1                  UNIVERSE PERCENTAGE                         
RPKSREPC DS    CL1                  SPECIAL REP                                 
RPKCVTYP DS    CL2                  COMSCORE VIEWING TYPE                       
RPKPRSID DS    CL20                 PRISMA ID                                   
RPKGDEM  DS    XL3                  GUARANTEE DEMO                              
RPKLENQ  EQU   *-RPKSEQ                                                         
         EJECT                                                                  
*                                                                               
* COPY OR TRANSFER UNIT                                                         
*                                                                               
CPYUPLDD DSECT                                                                  
CPUSEQ   DS    CL1                  SEQUENCE NUMBER                             
CPUTYPE  DS    CL2                  REQUEST TYPE                                
*                                   CU-COPY UNIT                                
*                                                                               
* TO UNIT INFO                                                                  
CPTCLI   DS    CL3                  TO CLIENT                                   
CPTEST   DS    CL3                  TO ESTIMATE                                 
CPTNET   DS    CL4                  TO NETWORK                                  
CPTPACK  DS    CL3                  TO PACKAGE                                  
CPTPCODE DS    CL6                  TO PROGRAM CODE                             
CPTBDATE DS    CL8                  TO BUY DATE                                 
CPTSLINE DS    CL3                  TO LINE NUMBER                              
CPUREAS  DS    CL3                  REASON CODE                                 
*                                                                               
* FROM UNIT INFO                                                                
CPUCLI   DS    CL3                  FROM CLIENT                                 
CPUEST   DS    CL3                  FROM ESTIMATE                               
CPUNET   DS    CL4                  FROM NETWORK                                
CPUPACK  DS    CL3                  FROM PACKAGE                                
CPUPCODE DS    CL6                  FROM PROGRAM CODE                           
CPUBDATE DS    CL8                  FROM BUY DATE                               
CPUSLINE DS    CL3                  FROM LINE NUMBER                            
CPTREAS  DS    CL3                  REASON CODE (DUMMY FIELD)                   
*                                                                               
*                                                                               
CPUSTAT1 DS    CL1                  COPY STATUS 1                               
*                                   X'80' = COPY TRAFFIC INFO                   
*                                   X'40' = COPY PRODUCT                        
*                                   X'20' = ONLY ZERO DOLLAR UNITS              
*                                   X'10' = EXCLUDE ZERO DOLLAR UNITS           
*                                                                               
CPUSTDAT DS    CL8                  START DATE                                  
CPUENDAT DS    CL8                  END DATE                                    
CPUPROD  DS    CL3                  PRODUCT FILTER                              
CPULEN   DS    CL3                  LENGTH FILTER                               
CPURECLN EQU   *-CPUSEQ                                                         
         EJECT                                                                  
*                                                                               
* UPLOAD UNIT  (FRONTRUNNER)                                                    
*                                                                               
         SPACE 3                                                                
NPURECD  DSECT                                                                  
NPURSEQ  DS    CL1                 SEQUENCE NUMBER                              
*                                                                               
NPURTYPE DS    CL2                 REQUEST TYPE                                 
*                                  FB-BUY UNITS FRONTRUNNER                     
NPUCLI   DS    CL3                 CLIENT                                       
NPUEST   DS    CL3                 ESTIMATE                                     
NPUNET   DS    CL4                 NETWORK                                      
NPUPACK  DS    CL3                 PACKAGE                                      
*                                                                               
NPUCODE  DS    CL6                 PROGRAM CODE (NOT USED)                      
NPUBDATE DS    CL8                 BUY DATE (NOT USED)                          
NPUSLINE DS    CL3                 LINE NUMBER (NOT USED)                       
NPUREAS  DS    CL3                 REASON CODE                                  
NPUWEEKS DS    CL2                 # WEEKS (NOT USED)                           
NPUWEEK  DS    CL3                 UNITS PER WEEK (NOT USED)                    
*                                                                               
***NPUKEY   DS    0CL20               KEY                                       
***NPUKTYPE DS    XL1                 TYPE X'22'                                
***NPUKAM   DS    XL1                 AGENCY/MEDIA                              
***NPUKCLT  DS    XL2                 CLIENT                                    
***NPUKNET  DS    CL4                 NETWORK                                   
***NPUKDPT  DS    XL1                 DAYPART                                   
***NPUKPLAN DS    CL4                 PLAN CODE (SPACE FILLED)                  
***NPUKPROG DS    CL6                 PROGRAM CODE (SPACE FILLED)               
***NPUKPERQ DS    CL1                 QUARTER NO (0-3) FOR WEEKLY PLANS         
         SPACE 1                                                                
***NPURLEN  DS    XL2                 RECORD LENGTH                             
***NPURSTAT DS    XL1                 CONTROL STATUS (X'80' = DELETED)          
***NPURDA   DS    XL4                 DISK ADDRESS                              
***      SPACE 3                                                                
***            PROGRAM DATA ELEMENT                                             
***      SPACE 2                                                                
***NPGDEL   DS    XL1                 ELEMENT CODE X'01'                        
***NPGDLENN DS    XL1                 ELEMENT LENGTH (18)                       
NPGDSTAT DS    XL1                 X'80'=FIRST RECORD                           
NPGDTYP  DS    CL2                 PROGRAM TYPE                                 
NPGDSTYP DS    CL4                 SUB PROGRAM TYPE                             
NPGDTIER DS    CL1                 TIER                                         
NPGDNEW  DS    CL1                 NEW OR RETURNING SHOW                        
NPGDCNT  DS    CL2                 CONTENT                                      
NPGDSDPT DS    CL2                 SUB DAYPART                                  
NPGDPERT DS    CL1                 PERIOD TYPE W,M,Q                            
NPGDROT  DS    CL1                 ROTATION                                     
         DS    CL2                 SPARE                                        
         SPACE 3                                                                
****          UNIT ASSIGNMENT ELEMENT                                           
****                                                                            
***NPUBEL   DS    XL1                 ELEMENT CODE X'12'                        
***NPUBLEN  DS    XL1                 ELEMENT LENGTH (64)                       
NPUBPER  DS    XL2                 PERIOD (FIRST BYTE=YEAR)                     
*                                         (SECOND=MONTH/QUARTER NO.)            
*                                  OR COMPRESSED DATE FOR WEEKLY                
NPUBLNS  DS    XL8                 LENGTHS                                      
NPUBUNS  DS    XL16                NUMBER OF UNITS FOR 1-8 LENGTHS              
NPUBSHR  DS    XL2                 SHARE  (1 DEC PLACE)                         
NPUBHUT  DS    XL2                 HUT    (1 DEC PLACE)                         
NPUBRTG  DS    XL2                 RATING (1 DEC PLACE)                         
NPUBOVRD DS    XL1                 OVERRIDES X'80'=SHARE X'40'=HUT              
*                                            X'20'=RTG   X'10'=VPH(S)           
NPUBLNK  DS    CL1                 LINK TO VPH ELEMENT                          
NPUBBOOK DS    XL2                 BINARY YW FROM BOOK ELEMENTS                 
NPUBAMT  DS    XL40                ACT DOLLARS/INDICATOR FOR 1-8 LNGTHS         
         DS    CL2                 SPARE                                        
         SPACE 3                                                                
****                                                                            
****              VPH ELEMENT                                                   
NPUCEL   DS    XL1                 FIRST TIME SWITCH                            
***NPUCLEN  DS    XL1                 ELEMENT LENGTH (N'VPH*2)+3=119            
***         DS    XL1                 SPARE                                     
NPUCVPHS DS    CL116               LIST OF 2 BYTE VPHS                          
*                                  00=WOMEN    01=MEN      02=ADULT             
*                                  03=WM18-34  04=MN18-34  05=AD18-34           
*                                  06=WM18-49  07=MN18-49  08=AD18-49           
*                                  09-WM25-49  10=MN25-49  11=AD25-49           
*                                  12=WM25-54  13=MN25-54  14=AD25-54           
*                                  15=WM55-64  16=MN55-64  17=AD55-64           
*                                  18=55+      19=MN55+    20=AD55+             
*                                  21=WM TEEN  22=MN TEEN  23=TEENS             
*                                  24=CH2-5    25=CH6-11   26=CH2-11            
*                                  27=LOH      28=WKWOMEN  29=ALL (2+)          
*                                  30=WM35-64  31=MN35-64  32=AD35-64           
**  NEW DEMO CATEGORIES                                                         
*                                  33=WM2-11   34=MN2-11                        
*                                  35=WM6-11   36=MN6-11                        
*                                  37-WM15-24  38=MN15-24  39=AD15-24           
*                                  40=SPARE    41=SPARE    42=SPARE             
*                                  43=WM21-49  44=MN21-49  45=AD21-49           
*                                  46=WM21-54  47=MN21-54  48=AD21-54           
*                                  49=WM21+    50=MN21+    51=AD21+             
*                                  52=AD9-11   53=AD9-14                        
*                                  54=SPARE    55=WW18-49  56=WW25-54           
*                                  57=MOMS                                      
         DS    CL2                 DO NOT USE                                   
         SPACE 3                                                                
****              OVERRIDE DEMO ELEMENT                                         
****                                                                            
***NPUND    DS    XL1                 X'16'                                     
***NPUNDLEN DS    XL1                 153 (25 OVERRIDES)                        
* OVERRIDE TABLE 25 ENTRIES                                                     
*  BYTES 1-2 CATEGORY/DEMO NUMBER                                               
*  BYTES 3-6 DEMO OVERRIDE VALUE                                                
NPUNDVPH DS    CL150                                                            
         SPACE 3                                                                
****              PACKAGE/PLAN LEVEL INFORNMATION                               
****                                                                            
***NPAKND   DS    XL1                 X'18'                                     
***NPAKGLN  DS    XL1                 19                                        
NPAKGUA  DS    CL4                 PACKAGE GUARANTEE                            
NPAKDCAT DS    CL3                 DEMO GUARANTEE CATEGORY                      
NPAKDGUA DS    CL4                 DEMO GUARANTEE                               
NPAKSTRT DS    CL2                 FIRST DATE                                   
NPAKEND  DS    CL2                 LAST DATE                                    
NPAKTVQ  DS    CL2                 TVQ BOOK                                     
         SPACE 3                                                                
****              BOOK ELEMENT HERE (ELEMENT CODE X'5D')                        
****                                                                            
***NPBKD    DS    XL1                 X'5D'                                     
***NPBKDLEN DS    XL1                 7                                         
***NPBKEVN  DS    XL3                 CL'EVN'                                   
***NPUNDDEM DS    CL2                 BOOK 580E                                 
*                                                                               
*                                                                               
NPURRLEN EQU   *-NPURSEQ                                                        
NPURBFLN EQU   NPURRLEN*175                                                     
LNCSTUN  DS    XL6                 HOLD AREA FOR LENGTH/COST/# UNITS            
         EJECT                                                                  
*                                                                               
*  ERROR RECORD PASSED FROM BUY TO NAVIGATOR                                    
*                                                                               
ERRDATA  DSECT                                                                  
ERMSSEQN DS    XL1                  SEQUENCE NUMBER IF DRAFT = 0                
ERNUMBR  DS    XL1                  ERROR NUMBER                                
ERMXFLD  DS    XL6                                                              
ERMXTRA  DS    XL54                                                             
ERCLINT  DS    CL3                                                              
ERESTMT  DS    CL1                                                              
ERNTWK   DS    CL4                                                              
ERPKGE   DS    CL1                                                              
ERPROG   DS    CL6                                                              
ERDATE   DS    CL2                                                              
ERLNGTH  DS    CL1                                                              
         EJECT                                                                  
*                                                                               
*  TSAR RECORD LAYOUT FOR THE MULTI BUY DRAFT                                   
*  RECORD ADD.                                                                  
*                                                                               
DRAFRECD DSECT                                                                  
DRFKEY   DS    0XL1                                                             
DRFSEQN  DS    CL1                  RECORD SEQUENCE NUMBER                      
DRFKEYX  EQU   *                                                                
*                                                                               
DRFNUM   DS    CL1                  NUMBER OF RECORDS                           
DRFDATE  DS    CL2                  BUY DATE                                    
DRFDAY   DS    CL1                  DAY                                         
         ORG   DRFNUM                                                           
DRFCOPY  DS    XL4                  NUMBER OF RECORDS COPIED                    
DRFTIME  DS    CL4                  TIME                                        
DRFLEN   DS    CL1                  LENGTH                                      
DRFINT   DS    CL4                  INTEGRATION                                 
DRFPNAM  DS    CL16                 PROGRAM NAME                                
DRFNTI   DS    CL2                  NTI NUMBER                                  
DRFBTYP  DS    CL1                  BUY TYPE                                    
DRFSLN   DS    CL1                  SUB LINE NUMBER                             
DRFROT   DS    CL1                  ROTATION                                    
DRFDPT   DS    CL1                  DAYPART                                     
DRFSQTR  DS    CL1                  START QUARTER HOUR                          
DRFDEMS  DS    CL200               UP TO 25 DEMO SETS                           
*                                      BYTES 1-2=VPH                            
*                                      BYTES 3-4=GRP(1DEC PLACE)                
*                                      BYTES 5-8=IMPS                           
*                                                                               
DRFHOMSH DS    CL2                  HOMES SHARE                                 
DRFHOMHT DS    CL2                  HOMES HUT                                   
DRFHOMRT DS    CL2                  HOMES RATING                                
DRFHOMIM DS    CL4                  HOMES IMPRESSIONS                           
*  SECOND STREAM STORAGE AREA                                                   
DRFDEMO2 DS    CL1                 CL'Y' SECOND DEMO COLUMN                     
DRFDEMS2 DS    CL200               UP TO 25 DEMO SETS                           
*                                      BYTES 1-2=VPH                            
*                                      BYTES 3-4=GRP(1DEC PLACE)                
*                                      BYTES 5-8=IMPS                           
*                                                                               
DRFHOMS2 DS    CL2                  HOMES SHARE                                 
DRFHOMH2 DS    CL2                  HOMES HUT                                   
DRFHOMR2 DS    CL2                  HOMES RATING                                
DRFHOMI2 DS    CL4                  HOMES IMPRESSIONS                           
DRFSTAT  DS    XL1                  STATUS BYTE                                 
*                                   X'80' REFRESH CHANGE REQUEST                
*                                   X'40' 2 DECIMAL PRECISION                   
DRFMEDTP DS    CL1                  MEDIA TYPE                                  
DRFPSTTP DS    CL1                  POSTING TYPE                                
DRFRESLT DS    CL2                  RESULT CODE (ACTUAL DEMOS)                  
DRFDEMBS DS    CL1                  DEMO BASE                                   
DRFRECLN EQU   *-DRFKEY             RECORD LENGTH                               
         EJECT                                                                  
*                                                                               
*  TSAR RECORD LAYOUT CABLE PROGRAM RECORD CREATE                               
*                                                                               
CPRGRECD DSECT                                                                  
CPRSEQN  DS    CL1                  RECORD SEQUENCE NUMBER                      
*                                                                               
CPRRTYPE DS    CL2                 REQUEST TYPE                                 
*                                  CP-ADD CABLE PROGRAM RECORD                  
CPRPNET  DS    CL4                  NETWORK                                     
CPRPNAM  DS    CL16                 PROGRAM NAME                                
CPRSTIM  DS    CL2                  TIME                                        
CPRETIM  DS    CL2                  TIME                                        
CPRROT   DS    CL7                  ROTATION                                    
CPRMIR   DS    CL1                  MIRROR                                      
CPRRLEN  EQU   *-CPRSEQN                                                        
         EJECT                                                                  
*                                                                               
*  TSAR RECORD LAYOUT FOR PHEADER/EHEADER REQUEST VIA STEWARD                   
*                                                                               
PHEADST  DSECT                                                                  
*                                                                               
PHEADSEQ DS    XL1                  SEQUENCE NUMBER                             
*                                                                               
PHEDTYPE DS    CL1                  REQUEST TYPE                                
*                                   P-PHEADRE,E-EHEADER                         
PHEDPRNT DS    CL8                  PRINT TYPE SOON,XXX OR NOW,XXX              
PHEDDEST DS    CL8                  DESTINATION                                 
*                                                                               
PHEDCLT  DS    CL8                  CLIENT                                      
PHEDEST  DS    CL8                  ESTIMATE                                    
PHEDNET  DS    CL8                  NETWORK                                     
PHEDPKG  DS    CL8                  PACKAGE                                     
*                                                                               
PHEDDEMS DS    CL64                 DEMOS                                       
PHEDCOM1 DS    CL50                 COMMENT LINE 1                              
PHEDCOM2 DS    CL50                 COMMENT LINE 2                              
PHEDCOM3 DS    CL50                 COMMENT LINE 3                              
PHEDCOM4 DS    CL50                 COMMENT LINE 4                              
PHEDCOM5 DS    CL50                 COMMENT LINE 5                              
PHEDCOM6 DS    CL50                 COMMENT LINE 6                              
PHEDDEAL DS    CL10                 DEAL                                        
PHEDCONT DS    CL10                 CONTRACT                                    
PHEDLEN  EQU   *-PHEDTYPE                                                       
PHEDLEN2 EQU   *-PHEDTYPE-250       SECOND GLOBBER MOVE                         
         PRINT OFF                                                              
