*          DATA SET NEASTDAT   AT LEVEL 007 AS OF 12/17/92                      
*              ACCSTACK DATA TABLE FOR STACK DEFINITION                         
         SPACE 3                                                                
ASDATTAB DS    0C                  EXPRESSION TABLE                             
         DC    CL7'ASSIGN ',AL1(142)  %                                         
         DC    CL7'ASS+INT',AL1(002)                                            
         DC    CL7'ASS+INT',AL1(150)  %                                         
****     DC    CL7'TIME   ',AL1(003)                                            
         DC    CL7'TIME   ',AL1(141)  %                                         
         DC    CL7'TIM+INT',AL1(004)                                            
         DC    CL7'TIM+INT',AL1(149)  %                                         
         DC    CL7'COMM   ',AL1(012)                                            
         SPACE 1                                                                
         DC    CL7'ORD TIM',AL1(021)                                            
         DC    CL7'ORD ASS',AL1(001)                                            
         DC    CL7'ORD INT',AL1(022)                                            
         DC    CL7'ORD SPC',AL1(023)                                            
         DC    CL7'ORD CUT',AL1(024)                                            
         DC    CL7'ORD BLK',AL1(025)                                            
         DC    CL7'ORD C-S',AL1(026)                                            
         DC    CL7'ORD OTH',AL1(027)                                            
         DC    CL7'ORD TOT',AL1(030)                                            
         DC    CL7'ORD TIS',AL1(028)                                            
         SPACE 1                                                                
         DC    CL7'ORN TIM',AL1(031)                                            
         DC    CL7'ORN INT',AL1(032)                                            
         DC    CL7'ORN SPC',AL1(033)                                            
         DC    CL7'ORN CUT',AL1(034)                                            
         DC    CL7'ORN BLK',AL1(035)                                            
         DC    CL7'ORN C-S',AL1(036)                                            
         DC    CL7'ORN OTH',AL1(037)                                            
         DC    CL7'ORN TOT',AL1(040)                                            
         DC    CL7'ORN TIS',AL1(038)                                            
         SPACE 1                                                                
         DC    CL7'CLR TIM',AL1(041)                                            
         DC    CL7'CLR INT',AL1(042)                                            
         DC    CL7'CLR SPC',AL1(043)                                            
         DC    CL7'CLR CUT',AL1(044)                                            
         DC    CL7'CLR BLK',AL1(045)                                            
         DC    CL7'CLR C-S',AL1(046)                                            
         DC    CL7'CLR OTH',AL1(047)                                            
         DC    CL7'CLR TOT',AL1(050)                                            
         DC    CL7'CLR TIS',AL1(048)                                            
         SPACE 1                                                                
         DC    CL7'CLN TIM',AL1(051)                                            
         DC    CL7'CLN INT',AL1(052)                                            
         DC    CL7'CLN SPC',AL1(053)                                            
         DC    CL7'CLN CUT',AL1(054)                                            
         DC    CL7'CLN BLK',AL1(055)                                            
         DC    CL7'CLN C-S',AL1(056)                                            
         DC    CL7'CLN OTH',AL1(057)                                            
         DC    CL7'CLN TOT',AL1(060)                                            
         DC    CL7'CLN TIS',AL1(058)                                            
         SPACE 1                                                                
         DC    CL7'PBG TIM',AL1(061)                                            
         DC    CL7'PBG INT',AL1(062)                                            
         DC    CL7'PBG SPC',AL1(063)                                            
         DC    CL7'PBG CUT',AL1(064)                                            
         DC    CL7'PBG BLK',AL1(065)                                            
         DC    CL7'PBG C-S',AL1(066)                                            
         DC    CL7'PBG OTH',AL1(067)                                            
         DC    CL7'PBG TOT',AL1(070)                                            
         DC    CL7'PBG TIS',AL1(155)                                            
         SPACE 1                                                                
         DC    CL7'PBN TIM',AL1(071)                                            
         DC    CL7'PBN INT',AL1(072)                                            
         DC    CL7'PBN SPC',AL1(073)                                            
         DC    CL7'PBN CUT',AL1(074)                                            
         DC    CL7'PBN BLK',AL1(075)                                            
         DC    CL7'PBN C-S',AL1(076)                                            
         DC    CL7'PBN OTH',AL1(077)                                            
         DC    CL7'PBN TOT',AL1(080)                                            
         DC    CL7'PBN TIS',AL1(156)                                            
         SPACE 1                                                                
         DC    CL7'BIL TIM',AL1(081)                                            
         DC    CL7'BIL INT',AL1(082)                                            
         DC    CL7'BIL SPC',AL1(083)                                            
         DC    CL7'BIL CUT',AL1(084)                                            
         DC    CL7'BIL BLK',AL1(085)                                            
         DC    CL7'BIL C-S',AL1(086)                                            
         DC    CL7'BIL OTH',AL1(087)                                            
         DC    CL7'BIL TOT',AL1(090)                                            
         DC    CL7'BIL TIS',AL1(088)                                            
         SPACE 1                                                                
         DC    CL7'BLN TIM',AL1(091)                                            
         DC    CL7'BLN INT',AL1(092)                                            
         DC    CL7'BLN SPC',AL1(093)                                            
         DC    CL7'BLN CUT',AL1(094)                                            
         DC    CL7'BLN BLK',AL1(095)                                            
         DC    CL7'BLN C-S',AL1(096)                                            
         DC    CL7'BLN OTH',AL1(097)                                            
         DC    CL7'BLN TOT',AL1(100)                                            
         DC    CL7'BLN TIS',AL1(098)                                            
         SPACE 1                                                                
         DC    CL7'BBG TIM',AL1(101)                                            
         DC    CL7'BBG INT',AL1(102)                                            
         DC    CL7'BBG SPC',AL1(103)                                            
         DC    CL7'BBG CUT',AL1(104)                                            
         DC    CL7'BBG BLK',AL1(105)                                            
         DC    CL7'BBG C-S',AL1(106)                                            
         DC    CL7'BBG OTH',AL1(107)                                            
         DC    CL7'BBG TIS',AL1(108)                                            
         SPACE 1                                                                
         DC    CL7'BBN TIM',AL1(111)                                            
         DC    CL7'BBN INT',AL1(112)                                            
         DC    CL7'BBN SPC',AL1(113)                                            
         DC    CL7'BBN CUT',AL1(114)                                            
         DC    CL7'BBN BLK',AL1(115)                                            
         DC    CL7'BBN C-S',AL1(116)                                            
         DC    CL7'BBN OTH',AL1(117)                                            
         DC    CL7'BBN TOT',AL1(120)                                            
         DC    CL7'BBN TIS',AL1(109)                                            
         SPACE 1                                                                
         DC    CL7'CLR COM',AL1(126)                                            
         DC    CL7'PBL COM',AL1(127)                                            
         DC    CL7'BIL COM',AL1(128)                                            
         DC    CL7'BBL COM',AL1(129)                                            
         DC    CL7'ORD ASS',AL1(134)                                            
         DC    CL7'BIL ASS',AL1(135)                                            
         DC    CL7'BBL ASS',AL1(136)                                            
         DC    CL7'NET ASS',AL1(151)                                            
         DC    CL7'NET A+I',AL1(152)                                            
         SPACE 1                                                                
         DC    CL7'TIME   ',AL1(201)                                            
         DC    CL7'INTEG  ',AL1(202)                                            
         DC    CL7'SPECIAL',AL1(203)                                            
         DC    CL7'CUT-IN ',AL1(204)                                            
         DC    CL7'BLACK  ',AL1(205)                                            
         DC    CL7'C-SPLIT',AL1(206)                                            
         DC    CL7'OTHER  ',AL1(207)                                            
         DC    CL7'TOTAL  ',AL1(210)                                            
         SPACE 1                                                                
         DC    CL7'NET TIM',AL1(211)                                            
         DC    CL7'NET T+I',AL1(14)                                             
         DC    CL7'NET INT',AL1(212)                                            
         DC    CL7'NET SPC',AL1(213)                                            
         DC    CL7'NET CUT',AL1(214)                                            
         DC    CL7'NET BLK',AL1(215)                                            
         DC    CL7'NET C-S',AL1(216)                                            
         DC    CL7'NET OTH',AL1(217)                                            
         DC    CL7'NET TOT',AL1(220)                                            
         SPACE 1                                                                
         DC    CL7'ORDERED',AL1(221)                                            
         DC    CL7'CLEARED',AL1(222)                                            
         DC    CL7'CLEARED',AL1(144)   %                                        
         DC    CL7'PAYABLE',AL1(223)                                            
         DC    CL7'PAYABLE',AL1(148)   %                                        
         DC    CL7'BILLED ',AL1(224)                                            
         DC    CL7'BILLED ',AL1(143)   %                                        
         DC    CL7'BILLBLE',AL1(225)                                            
         DC    CL7'BILLBLE',AL1(147)   %                                        
         SPACE 1                                                                
         DC    CL7'NET ORD',AL1(226)                                            
         DC    CL7'NET CLR',AL1(227)                                            
         DC    CL7'NET PBL',AL1(228)                                            
         DC    CL7'NET BIL',AL1(229)                                            
         DC    CL7'NET BBL',AL1(230)                                            
         SPACE 1                                                                
         DC    CL7'PERCENT',AL1(249)                                            
         DC    X'00'                                                            
         DC    CL6'       ',AL1(251)                                            
         DC    CL7'INDEX  ',AL1(252)                                            
         DC    CL7'DIFF   ',AL1(253)                                            
         DC    CL7'       ',X'FF'                                               
         SPACE 1                                                                
SUMDTTAB DS    0C                  SECONDARY EXPRESSION TABLE                   
         DC    CL7'GROSS  ',AL1(028)                                            
         DC    CL7'NET    ',AL1(038)                                            
         DC    CL7'       ',X'FF'                                               
         SPACE 1                                                                
