*          DATA SET NEASTTAB   AT LEVEL 024 AS OF 06/07/91                      
*              ACCSTACK TABLES                                                  
         SPACE 3                                                                
ASEXPTAB DS    0C                  EXPRESSION TABLE                             
         DC    CL7'INTEG  ',AL1(202)                                            
         DC    CL7'INT    ',AL1(202)                                            
         DC    CL7'SPECIAL',AL1(203)                                            
         DC    CL7'SPEC   ',AL1(203)                                            
         DC    CL7'CUTIN  ',AL1(204)                                            
         DC    CL7'CUT    ',AL1(204)                                            
         DC    CL7'BLK    ',AL1(205)                                            
         DC    CL7'CSPLIT ',AL1(206)                                            
         DC    CL7'CS     ',AL1(206)                                            
         DC    CL7'OTHER  ',AL1(207)                                            
         DC    CL7'OTH    ',AL1(207)                                            
         DC    CL7'TIS    ',AL1(28)    TIME/INTEG/SPECIAL                       
         SPACE 1                                                                
         DC    CL7'ASS    ',AL1(1)                                              
         DC    CL7'ASS+   ',AL1(2)      ASS+INTEG                               
         DC    CL7'TIME   ',AL1(201)    ACTUAL                                  
         DC    CL7'TIME+  ',AL1(4)                                              
         DC    CL7'TIM+   ',AL1(4)      ACT+INTEG                               
         DC    CL7'COMM   ',AL1(12)                                             
         SPACE 1                                                                
         SPACE 1                                                                
         DC    CL7'TIMN   ',AL1(211)   ACTUAL NET                               
         DC    CL7'TIMEN  ',AL1(211)   ACTUAL NET                               
         DC    CL7'TIMN+  ',AL1(14)    (ACT+INTEG)NET                           
         DC    CL7'TIMEN+ ',AL1(14)    (ACT+INTEG)NET                           
         DC    CL7'ASSN   ',AL1(151)                                            
         DC    CL7'ASSN+  ',AL1(152)                                            
         DC    CL7'INTN   ',AL1(212)                                            
         DC    CL7'SPECN  ',AL1(213)                                            
         DC    CL7'CUTN   ',AL1(214)                                            
         DC    CL7'BLACKN ',AL1(215)                                            
         DC    CL7'CSPLITN',AL1(216)                                            
         DC    CL7'CSN    ',AL1(216)                                            
         DC    CL7'OTHERN ',AL1(217)                                            
         DC    CL7'OTHN   ',AL1(217)                                            
         DC    CL7'TISN   ',AL1(38)                                             
***      DC    CL7'TOTALN ',AL1(220)                                            
         SPACE 1                                                                
         DC    CL7'ORDERED',AL1(221)                                            
         DC    CL7'CLEARED',AL1(222)                                            
         DC    CL7'PAYABLE',AL1(223)                                            
         DC    CL7'BILLED ',AL1(224)                                            
         DC    CL7'BILLBLE',AL1(225)                                            
         SPACE 1                                                                
         DC    CL7'OR     ',AL1(221)                                            
         DC    CL7'CL     ',AL1(222)                                            
         DC    CL7'PB     ',AL1(223)                                            
         DC    CL7'BL     ',AL1(224)                                            
         DC    CL7'BB     ',AL1(225)                                            
         SPACE 1                                                                
         DC    CL7'ORN    ',AL1(226)                                            
         DC    CL7'CLN    ',AL1(227)                                            
         DC    CL7'PBN    ',AL1(228)                                            
         DC    CL7'BLN    ',AL1(229)                                            
         DC    CL7'BBN    ',AL1(230)                                            
         SPACE 1                                                                
         DC    CL7'PERCENT',AL1(249)   = ASTPCT                                 
         DC    CL7'PCT    ',AL1(254)   =ASTPPCT (PCT OF PREV COL/ROW)           
         SPACE 1                                                                
         DC    CL7'SPACE  ',AL1(251)                                            
         DC    CL7'SP     ',AL1(251)                                            
         DC    CL7'INDEX  ',AL1(252)                                            
         DC    CL7'IX     ',AL1(252)                                            
         DC    CL7'DIFF   ',AL1(253)                                            
         DC    X'FF'                                                            
         EJECT                                                                  
*              COMBINATION TABLE                                                
         SPACE 3                                                                
ASCOMTAB DS    0C                                                               
         DC    AL1(201),AL1(221),AL1(21)     TIME (GROSS)                       
         DC    AL1(201),AL1(222),AL1(41)                                        
         DC    AL1(201),AL1(223),AL1(61)                                        
         DC    AL1(201),AL1(224),AL1(81)                                        
         DC    AL1(201),AL1(225),AL1(101)                                       
         DC    AL1(201),AL1(226),AL1(31)                                        
         DC    AL1(201),AL1(227),AL1(51)                                        
         DC    AL1(201),AL1(228),AL1(71)                                        
         DC    AL1(201),AL1(229),AL1(91)                                        
         DC    AL1(201),AL1(230),AL1(111)                                       
         SPACE 1                                                                
         DC    AL1(211),AL1(221),AL1(31)     TIME (NET)                         
         DC    AL1(211),AL1(222),AL1(51)                                        
         DC    AL1(211),AL1(223),AL1(71)                                        
         DC    AL1(211),AL1(224),AL1(91)                                        
         DC    AL1(211),AL1(225),AL1(111)                                       
         DC    AL1(211),AL1(226),AL1(31)                                        
         DC    AL1(211),AL1(227),AL1(51)                                        
         DC    AL1(211),AL1(228),AL1(71)                                        
         DC    AL1(211),AL1(229),AL1(91)                                        
         DC    AL1(211),AL1(230),AL1(111)                                       
         SPACE 1                                                                
         DC    AL1(202),AL1(221),AL1(22)     INTEG (GROSS)                      
         DC    AL1(202),AL1(222),AL1(42)                                        
         DC    AL1(202),AL1(223),AL1(62)                                        
         DC    AL1(202),AL1(224),AL1(82)                                        
         DC    AL1(202),AL1(225),AL1(102)                                       
         DC    AL1(202),AL1(226),AL1(32)                                        
         DC    AL1(202),AL1(227),AL1(52)                                        
         DC    AL1(202),AL1(228),AL1(72)                                        
         DC    AL1(202),AL1(229),AL1(92)                                        
         DC    AL1(202),AL1(230),AL1(112)                                       
         SPACE 1                                                                
         DC    AL1(212),AL1(221),AL1(32)     INTEG (NET)                        
         DC    AL1(212),AL1(222),AL1(52)                                        
         DC    AL1(212),AL1(223),AL1(72)                                        
         DC    AL1(212),AL1(224),AL1(92)                                        
         DC    AL1(212),AL1(225),AL1(112)                                       
         DC    AL1(212),AL1(226),AL1(32)                                        
         DC    AL1(212),AL1(227),AL1(52)                                        
         DC    AL1(212),AL1(228),AL1(72)                                        
         DC    AL1(212),AL1(229),AL1(92)                                        
         DC    AL1(212),AL1(230),AL1(112)                                       
         SPACE 1                                                                
         DC    AL1(203),AL1(221),AL1(23)    SPECIAL (GROSS)                     
         DC    AL1(203),AL1(222),AL1(43)                                        
         DC    AL1(203),AL1(223),AL1(63)                                        
         DC    AL1(203),AL1(224),AL1(83)                                        
         DC    AL1(203),AL1(225),AL1(103)                                       
         DC    AL1(203),AL1(226),AL1(33)                                        
         DC    AL1(203),AL1(227),AL1(53)                                        
         DC    AL1(203),AL1(228),AL1(73)                                        
         DC    AL1(203),AL1(229),AL1(93)                                        
         DC    AL1(203),AL1(230),AL1(113)                                       
         SPACE 1                                                                
         DC    AL1(213),AL1(221),AL1(33)     SPECIAL (NET)                      
         DC    AL1(213),AL1(222),AL1(53)                                        
         DC    AL1(213),AL1(223),AL1(73)                                        
         DC    AL1(213),AL1(224),AL1(93)                                        
         DC    AL1(213),AL1(225),AL1(113)                                       
         DC    AL1(213),AL1(226),AL1(33)                                        
         DC    AL1(213),AL1(227),AL1(53)                                        
         DC    AL1(213),AL1(228),AL1(73)                                        
         DC    AL1(213),AL1(229),AL1(93)                                        
         DC    AL1(213),AL1(230),AL1(113)                                       
         SPACE 1                                                                
         DC    AL1(204),AL1(221),AL1(24)     CUTIN (GROSS)                      
         DC    AL1(204),AL1(222),AL1(44)                                        
         DC    AL1(204),AL1(223),AL1(64)                                        
         DC    AL1(204),AL1(224),AL1(84)                                        
         DC    AL1(204),AL1(225),AL1(104)                                       
         DC    AL1(204),AL1(226),AL1(34)                                        
         DC    AL1(204),AL1(227),AL1(54)                                        
         DC    AL1(204),AL1(228),AL1(74)                                        
         DC    AL1(204),AL1(229),AL1(94)                                        
         DC    AL1(204),AL1(230),AL1(114)                                       
         SPACE 1                                                                
         DC    AL1(214),AL1(221),AL1(34)     CUTIN (NET)                        
         DC    AL1(214),AL1(222),AL1(54)                                        
         DC    AL1(214),AL1(223),AL1(74)                                        
         DC    AL1(214),AL1(224),AL1(94)                                        
         DC    AL1(214),AL1(225),AL1(114)                                       
         DC    AL1(214),AL1(226),AL1(34)                                        
         DC    AL1(214),AL1(227),AL1(54)                                        
         DC    AL1(214),AL1(228),AL1(74)                                        
         DC    AL1(214),AL1(229),AL1(94)                                        
         DC    AL1(214),AL1(230),AL1(114)                                       
         SPACE 1                                                                
         DC    AL1(205),AL1(221),AL1(25)     BLACK (GROSS)                      
         DC    AL1(205),AL1(222),AL1(45)                                        
         DC    AL1(205),AL1(223),AL1(65)                                        
         DC    AL1(205),AL1(224),AL1(85)                                        
         DC    AL1(205),AL1(225),AL1(105)                                       
         DC    AL1(205),AL1(226),AL1(35)                                        
         DC    AL1(205),AL1(227),AL1(55)                                        
         DC    AL1(205),AL1(228),AL1(75)                                        
         DC    AL1(205),AL1(229),AL1(95)                                        
         DC    AL1(205),AL1(230),AL1(115)                                       
         SPACE 1                                                                
         DC    AL1(215),AL1(221),AL1(35)     BLACK (NET)                        
         DC    AL1(215),AL1(222),AL1(55)                                        
         DC    AL1(215),AL1(223),AL1(75)                                        
         DC    AL1(215),AL1(224),AL1(95)                                        
         DC    AL1(215),AL1(225),AL1(115)                                       
         DC    AL1(215),AL1(226),AL1(35)                                        
         DC    AL1(215),AL1(227),AL1(55)                                        
         DC    AL1(215),AL1(228),AL1(75)                                        
         DC    AL1(215),AL1(229),AL1(95)                                        
         DC    AL1(215),AL1(230),AL1(115)                                       
         SPACE 1                                                                
         DC    AL1(206),AL1(221),AL1(26)     C-S (GROSS)                        
         DC    AL1(206),AL1(222),AL1(46)                                        
         DC    AL1(206),AL1(223),AL1(66)                                        
         DC    AL1(206),AL1(224),AL1(86)                                        
         DC    AL1(206),AL1(225),AL1(106)                                       
         DC    AL1(206),AL1(226),AL1(36)                                        
         DC    AL1(206),AL1(227),AL1(56)                                        
         DC    AL1(206),AL1(228),AL1(76)                                        
         DC    AL1(206),AL1(229),AL1(96)                                        
         DC    AL1(206),AL1(230),AL1(116)                                       
         SPACE 1                                                                
         DC    AL1(216),AL1(221),AL1(36)     C-S (NET)                          
         DC    AL1(216),AL1(222),AL1(56)                                        
         DC    AL1(216),AL1(223),AL1(76)                                        
         DC    AL1(216),AL1(224),AL1(96)                                        
         DC    AL1(216),AL1(225),AL1(116)                                       
         DC    AL1(216),AL1(226),AL1(36)                                        
         DC    AL1(216),AL1(227),AL1(56)                                        
         DC    AL1(216),AL1(228),AL1(76)                                        
         DC    AL1(216),AL1(229),AL1(96)                                        
         DC    AL1(216),AL1(230),AL1(116)                                       
         SPACE 1                                                                
         DC    AL1(207),AL1(221),AL1(27)     OTHER (GROSS)                      
         DC    AL1(207),AL1(222),AL1(47)                                        
         DC    AL1(207),AL1(223),AL1(67)                                        
         DC    AL1(207),AL1(224),AL1(87)                                        
         DC    AL1(207),AL1(225),AL1(107)                                       
         DC    AL1(207),AL1(226),AL1(37)                                        
         DC    AL1(207),AL1(227),AL1(57)                                        
         DC    AL1(207),AL1(228),AL1(77)                                        
         DC    AL1(207),AL1(229),AL1(97)                                        
         DC    AL1(207),AL1(230),AL1(117)                                       
         SPACE 1                                                                
         DC    AL1(217),AL1(221),AL1(37)     OTHER (NET)                        
         DC    AL1(217),AL1(222),AL1(57)                                        
         DC    AL1(217),AL1(223),AL1(77)                                        
         DC    AL1(217),AL1(224),AL1(97)                                        
         DC    AL1(217),AL1(225),AL1(117)                                       
         DC    AL1(217),AL1(226),AL1(37)                                        
         DC    AL1(217),AL1(227),AL1(57)                                        
         DC    AL1(217),AL1(228),AL1(77)                                        
         DC    AL1(217),AL1(229),AL1(97)                                        
         DC    AL1(217),AL1(230),AL1(117)                                       
         SPACE 1                                                                
         DC    AL1(1),AL1(221),AL1(1)     ASSIGNED (GROSS)                      
         DC    AL1(1),AL1(222),AL1(41)                                          
         DC    AL1(1),AL1(223),AL1(68)                                          
         DC    AL1(1),AL1(224),AL1(135)                                         
         DC    AL1(1),AL1(225),AL1(139)                                         
         DC    AL1(1),AL1(226),AL1(151)                                         
         DC    AL1(1),AL1(227),AL1(51)                                          
         DC    AL1(1),AL1(228),AL1(78)                                          
         DC    AL1(1),AL1(229),AL1(91)                                          
         DC    AL1(1),AL1(230),AL1(118)                                         
         SPACE 1                                                                
         DC    AL1(151),AL1(221),AL1(151)    ASSIGNED (NET)                     
         DC    AL1(151),AL1(222),AL1(51)                                        
         DC    AL1(151),AL1(223),AL1(78)                                        
         DC    AL1(151),AL1(224),AL1(91)                                        
         DC    AL1(151),AL1(225),AL1(118)                                       
         DC    AL1(151),AL1(226),AL1(151)                                       
         DC    AL1(151),AL1(227),AL1(51)                                        
         DC    AL1(151),AL1(228),AL1(78)                                        
         DC    AL1(151),AL1(229),AL1(91)                                        
         DC    AL1(151),AL1(230),AL1(118)                                       
         SPACE 1                                                                
         DC    AL1(2),AL1(221),AL1(2)     ASSIGNED+INTG (GROSS)                 
         DC    AL1(2),AL1(222),AL1(15)                                          
         DC    AL1(2),AL1(223),AL1(79)                                          
         DC    AL1(2),AL1(224),AL1(17)                                          
         DC    AL1(2),AL1(225),AL1(136)                                         
         DC    AL1(2),AL1(226),AL1(152)                                         
         DC    AL1(2),AL1(227),AL1(60)                                          
         DC    AL1(2),AL1(228),AL1(69)                                          
         DC    AL1(2),AL1(229),AL1(100)                                         
         DC    AL1(2),AL1(230),AL1(119)                                         
         SPACE 1                                                                
         DC    AL1(152),AL1(221),AL1(152)    ASSIGNED+INTG  (NET)               
         DC    AL1(152),AL1(222),AL1(60)                                        
         DC    AL1(152),AL1(223),AL1(69)                                        
         DC    AL1(152),AL1(224),AL1(100)                                       
         DC    AL1(152),AL1(225),AL1(119)                                       
         DC    AL1(152),AL1(226),AL1(152)                                       
         DC    AL1(152),AL1(227),AL1(60)                                        
         DC    AL1(152),AL1(228),AL1(69)                                        
         DC    AL1(152),AL1(229),AL1(100)                                       
         DC    AL1(152),AL1(230),AL1(119)                                       
         SPACE 1                                                                
         DC    AL1(4),AL1(221),AL1(4)     ACTUAL+INTG (GROSS)                   
         DC    AL1(4),AL1(222),AL1(15)                                          
         DC    AL1(4),AL1(223),AL1(70)                                          
         DC    AL1(4),AL1(224),AL1(17)                                          
         DC    AL1(4),AL1(225),AL1(18)                                          
         DC    AL1(4),AL1(226),AL1(14)                                          
         DC    AL1(4),AL1(227),AL1(60)                                          
         DC    AL1(4),AL1(228),AL1(80)                                          
         DC    AL1(4),AL1(229),AL1(100)                                         
         DC    AL1(4),AL1(230),AL1(120)                                         
         SPACE 1                                                                
         DC    AL1(14),AL1(221),AL1(14)    ACTUAL+INTG  (NET)                   
         DC    AL1(14),AL1(222),AL1(60)                                         
         DC    AL1(14),AL1(223),AL1(80)                                         
         DC    AL1(14),AL1(224),AL1(100)                                        
         DC    AL1(14),AL1(225),AL1(120)                                        
         DC    AL1(14),AL1(226),AL1(14)                                         
         DC    AL1(14),AL1(227),AL1(60)                                         
         DC    AL1(14),AL1(228),AL1(80)                                         
         DC    AL1(14),AL1(229),AL1(100)                                        
         DC    AL1(14),AL1(230),AL1(120)                                        
         SPACE 1                                                                
         DC    AL1(28),AL1(221),AL1(28)     TIS   (GROSS)                       
         DC    AL1(28),AL1(222),AL1(48)                                         
         DC    AL1(28),AL1(223),AL1(155)                                        
         DC    AL1(28),AL1(224),AL1(88)                                         
         DC    AL1(28),AL1(225),AL1(108)                                        
         DC    AL1(28),AL1(226),AL1(38)                                         
         DC    AL1(28),AL1(227),AL1(58)                                         
         DC    AL1(28),AL1(228),AL1(156)                                        
         DC    AL1(28),AL1(229),AL1(98)                                         
         DC    AL1(28),AL1(230),AL1(109)                                        
         SPACE 1                                                                
         DC    AL1(38),AL1(221),AL1(38)     TIS   (NET)                         
         DC    AL1(38),AL1(222),AL1(58)                                         
         DC    AL1(38),AL1(223),AL1(156)                                        
         DC    AL1(38),AL1(224),AL1(98)                                         
         DC    AL1(38),AL1(225),AL1(109)                                        
         DC    AL1(38),AL1(226),AL1(38)                                         
         DC    AL1(38),AL1(227),AL1(58)                                         
         DC    AL1(38),AL1(228),AL1(156)                                        
         DC    AL1(38),AL1(229),AL1(98)                                         
         DC    AL1(38),AL1(230),AL1(109)                                        
         SPACE 1                                                                
         SPACE 1                                                                
         DC    AL1(210),AL1(221),AL1(30)     TOTAL (GROSS)                      
         DC    AL1(210),AL1(222),AL1(50)                                        
         DC    AL1(210),AL1(223),AL1(70)                                        
         DC    AL1(210),AL1(224),AL1(90)                                        
         DC    AL1(210),AL1(225),AL1(110)                                       
         DC    AL1(210),AL1(226),AL1(40)                                        
         DC    AL1(210),AL1(227),AL1(60)                                        
         DC    AL1(210),AL1(228),AL1(80)                                        
         DC    AL1(210),AL1(229),AL1(100)                                       
         DC    AL1(210),AL1(230),AL1(120)                                       
         SPACE 1                                                                
         DC    AL1(220),AL1(221),AL1(40)     TOTAL (NET)                        
         DC    AL1(220),AL1(222),AL1(60)                                        
         DC    AL1(220),AL1(223),AL1(80)                                        
         DC    AL1(220),AL1(224),AL1(100)                                       
         DC    AL1(220),AL1(225),AL1(120)                                       
         DC    AL1(220),AL1(226),AL1(40)                                        
         DC    AL1(220),AL1(227),AL1(60)                                        
         DC    AL1(220),AL1(228),AL1(80)                                        
         DC    AL1(220),AL1(229),AL1(100)                                       
         DC    AL1(220),AL1(230),AL1(120)                                       
         SPACE 1                                                                
         DC    AL1(000),AL1(221),AL1(30)     TOTAL (GROSS)                      
         DC    AL1(000),AL1(222),AL1(50)                                        
         DC    AL1(000),AL1(223),AL1(70)                                        
         DC    AL1(000),AL1(224),AL1(90)                                        
         DC    AL1(000),AL1(225),AL1(110)                                       
         DC    AL1(000),AL1(226),AL1(40)                                        
         DC    AL1(000),AL1(227),AL1(60)                                        
         DC    AL1(000),AL1(228),AL1(80)                                        
         DC    AL1(000),AL1(229),AL1(100)                                       
         DC    AL1(000),AL1(230),AL1(120)                                       
         SPACE 1                                                                
         DC    AL1(000),AL1(221),AL1(40)     TOTAL (NET)                        
         DC    AL1(000),AL1(222),AL1(60)                                        
         DC    AL1(000),AL1(223),AL1(80)                                        
         DC    AL1(000),AL1(224),AL1(100)                                       
         DC    AL1(000),AL1(225),AL1(120)                                       
         DC    AL1(000),AL1(226),AL1(40)                                        
         DC    AL1(000),AL1(227),AL1(60)                                        
         DC    AL1(000),AL1(228),AL1(80)                                        
         DC    AL1(000),AL1(229),AL1(100)                                       
         DC    AL1(000),AL1(230),AL1(120)                                       
         SPACE 1                                                                
         DC    AL1(001),AL1(249),AL1(142)    ASS    + %  = ASS%                 
         DC    AL1(002),AL1(249),AL1(150)    ASS+   + %  = ASS+%                
         DC    AL1(201),AL1(249),AL1(141)    ACT    + %  = ACT%                 
         DC    AL1(004),AL1(249),AL1(149)    ACT+   + %  = ACT+%                
         DC    AL1(018),AL1(249),AL1(147)    BBLE   + %  = BB%  ACT+INT         
         DC    AL1(225),AL1(249),AL1(147)    BBLE   + %  = BB%                  
         DC    AL1(017),AL1(249),AL1(143)    BILL   + %  = BILL% ACT+I          
         DC    AL1(224),AL1(249),AL1(143)    BILL   + %  = BILL%                
         DC    AL1(015),AL1(249),AL1(144)    CLEAR  + %  = CLEAR% ACT+I         
         DC    AL1(222),AL1(249),AL1(144)    CLEAR  + %  = CLEAR%               
         DC    AL1(202),AL1(249),AL1(145)    INTEG  + %  = INT%                 
         DC    AL1(016),AL1(249),AL1(148)    PB     + %  = PB%    ACT+I         
         DC    AL1(223),AL1(249),AL1(148)    PB     + %  = PB%                  
         DC    AL1(028),AL1(249),AL1(146)    TIS    + %  = TIS%                 
         SPACE 1                                                                
         DC    AL1(012),AL1(221),AL1(012)    COMM + OR   = COMM                 
         DC    AL1(012),AL1(222),AL1(126)    COMM + CL   = CLCM                 
         DC    AL1(012),AL1(223),AL1(127)    COMM + PB   = PBCM                 
         DC    AL1(012),AL1(224),AL1(128)    COMM + BL   = BLCM                 
         DC    AL1(012),AL1(225),AL1(129)    COMM + BB   = BBCM                 
         DC    X'FF'                                                            
