*          DATA SET NEBUYF1D   AT LEVEL 010 AS OF 01/21/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311F1D      DATE 01/21/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
DEMSHRH  DS    CL8                                                              
DEMSHR   DS    CL5     10   15    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   27    3  A  P N             T        Y              
DEMHUTH  DS    CL8                                                              
DEMHUT   DS    CL7     10   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   50    6  A  P N             T        Y              
DEMRATH  DS    CL8                                                              
DEMRAT   DS    CL7     10   61    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
DEMHAVEH DS    CL8                                                              
DEMHAVE  DS    CL2     11   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   27   10  A  P N             T        Y              
DEMHSCH  DS    CL8                                                              
DEMHSC   DS    CL2     11   38    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   50    8  A  P N             T        Y              
DEMHADJH DS    CL8                                                              
DEMHADJ  DS    CL6     11   61    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
DEMUCODH DS    CL8                                                              
DEMUCOD  DS    CL8     12   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   27    8  A  P N             T        Y              
DEMNTIH  DS    CL8                                                              
DEMNTI   DS    CL5     12   38    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   50    8  A  P N             T        Y              
DEMIMPH  DS    CL8                                                              
DEMIMP   DS    CL6     12   61    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
DEMUPCTH DS    CL8                                                              
DEMUPCT  DS    CL8     13   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   27    6  A  P N             T        Y              
DEMCOVH  DS    CL8                                                              
DEMCOV   DS    CL6     13   38    6  A  U N             T        Y              
DEMRESH  DS    CL8                                                              
DEMRES   DS    CL22    13   50   22  A  P N             T        Y              
DEMPTYPH DS    CL8                                                              
DEMPTYP  DS    CL2     13   74    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    14   15   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    14   47   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    15   15   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    15   47   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
DEMEIHMH DS    CL8                                                              
DEMEIHM  DS    CL8     16   23    8  A  U N             T        Y              
DEMHOMH  DS    CL8                                                              
DEMHOM   DS    CL38    16   32   38  A  P N             T        Y              
DEMARHMH DS    CL8                                                              
DEMARHM  DS    CL7     16   71    7  A  U N             T        Y              
DEMNAM1H DS    CL8                                                              
DEMNAM1  DS    CL10    17    2   10  A  P N             T        Y              
DEMEVWH  DS    CL8                                                              
DEMEVW   DS    CL7     17   15    7  A  P N             T        Y              
DEMEIMPH DS    CL8                                                              
DEMEIMP  DS    CL8     17   23    8  A  U H             T        Y              
DEMEUNIH DS    CL8                                                              
DEMEUNI  DS    CL6     17   32    6  A  P N             T        Y              
DEMERTGH DS    CL8                                                              
DEMERTG  DS    CL7     17   39    7  A  P N             T        Y              
DEMAVWH  DS    CL8                                                              
DEMAVW   DS    CL6     17   47    6  A  U H             T        Y              
DEMAIMPH DS    CL8                                                              
DEMAIMP  DS    CL8     17   55    8  A  U H             T        Y              
DEMAUNIH DS    CL8                                                              
DEMAUNI  DS    CL6     17   64    6  A  P N             T        Y              
DEMARTGH DS    CL8                                                              
DEMARTG  DS    CL7     17   71    7  A  U H             T        Y              
DEMNAM2H DS    CL8                                                              
DEMNAM2  DS    CL10    18    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   15    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   23    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     18   32    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   39    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   47    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   55    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     18   64    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   71    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10    19    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   15    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   23    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     19   32    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   39    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   47    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     19   55    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     19   64    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   71    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   15    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   23    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     20   32    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   39    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   47    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   55    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     20   64    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   71    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10    21    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   15    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   23    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     21   32    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   39    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   47    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     21   55    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     21   64    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   71    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10    22    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   15    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   23    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     22   32    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   39    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   47    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     22   55    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     22   64    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   71    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10    23    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   15    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   23    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     23   32    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   39    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   47    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     23   55    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     23   64    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   71    7  A  U H             T        Y              
DEMGUARH DS    CL8                                                              
DEMGUAR  DS    CL45    24   15   45  A  P N             T        Y              
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1624 BYTES                            
