*          DATA SET NEBUYE2D   AT LEVEL 014 AS OF 05/11/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311E2D      DATE 05/11/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
INUDAYH  DS    CL8                                                              
INUDAY   DS    CL10    10   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   27    4  A  P N             T        Y              
INUTIMEH DS    CL8                                                              
INUTIME  DS    CL11    10   38   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   52    7  A  P N             T        Y              
INUPROGH DS    CL8                                                              
INUPROG  DS    CL16    10   63   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
INULENH  DS    CL8                                                              
INULEN   DS    CL8     11   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   27   10  A  P N             T        Y              
INUPRODH DS    CL8                                                              
INUPROD  DS    CL8     11   38    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   52    8  A  P N             T        Y              
INUACTH  DS    CL8                                                              
INUACT   DS    CL12    11   63   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
INUSTATH DS    CL8                                                              
INUSTAT  DS    CL8     12   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   27    5  A  P N             T        Y              
INUDTEH  DS    CL8                                                              
INUDTE   DS    CL8     12   38    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   52    5  A  P N             T        Y              
INUBUYRH DS    CL8                                                              
INUBUYR  DS    CL8     12   63    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    14    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    14   52   25  A  P N             T        Y              
INUDAT1H DS    CL8                                                              
INUDAT1  DS    CL78    15    2   78  A  P N             T        Y              
INUDAT2H DS    CL8                                                              
INUDAT2  DS    CL78    16    2   78  A  P N             T        Y              
INUDAT3H DS    CL8                                                              
INUDAT3  DS    CL78    17    2   78  A  P N             T        Y              
INUDAT4H DS    CL8                                                              
INUDAT4  DS    CL78    18    2   78  A  P N             T        Y              
INUDAT5H DS    CL8                                                              
INUDAT5  DS    CL78    19    2   78  A  P N             T        Y              
INUDAT6H DS    CL8                                                              
INUDAT6  DS    CL78    20    2   78  A  P N             T        Y              
INUDAT7H DS    CL8                                                              
INUDAT7  DS    CL78    21    2   78  A  P N             T        Y              
INUDAT8H DS    CL8                                                              
INUDAT8  DS    CL78    22    2   78  A  P N             T        Y              
INUDAT9H DS    CL8                                                              
INUDAT9  DS    CL78    23    2   78  A  P N             T        Y              
INUDATAH DS    CL8                                                              
INUDATA  DS    CL78    24    2   78  A  P N             T        Y              
INULAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
INUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1216 BYTES                            
