*          DATA SET NEBUYF5D   AT LEVEL 003 AS OF 05/14/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311F5D      DATE 05/14/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SPRHED1H DS    XL8                                                              
SPRHED1  DS    CL65    10    2   65  A  P N             T        Y              
SPRHED2H DS    XL8                                                              
SPRHED2  DS    CL65    11    2   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    1    1  A  P N             T        Y              
SPRTYP1H DS    XL8                                                              
SPRTYP1  DS    CL2     12    3    2  A  U N             T        Y              
SPRLIT1H DS    XL8                                                              
SPRLIT1  DS    CL10    12    7   10  A  P H             T        Y              
SPRAMT1H DS    XL8                                                              
SPRAMT1  DS    CL10    12   20   10  A  U N             T        Y              
SPRREP1H DS    XL8                                                              
SPRREP1  DS    CL3     12   33    3  A  U N             T        Y              
SPRCOM1H DS    XL8                                                              
SPRCOM1  DS    CL1     12   39    1  A  U N             T        Y              
SPRCST1H DS    XL8                                                              
SPRCST1  DS    CL4     12   45    4  A  U N             T        Y              
SPRBPR1H DS    XL8                                                              
SPRBPR1  DS    CL3     12   53    3  A  U N             T        Y              
SPRTPR1H DS    XL8                                                              
SPRTPR1  DS    CL8     12   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    1    1  A  P N             T        Y              
SPRTYP2H DS    XL8                                                              
SPRTYP2  DS    CL2     13    3    2  A  U N             T        Y              
SPRLIT2H DS    XL8                                                              
SPRLIT2  DS    CL10    13    7   10  A  P H             T        Y              
SPRAMT2H DS    XL8                                                              
SPRAMT2  DS    CL10    13   20   10  A  U N             T        Y              
SPRREP2H DS    XL8                                                              
SPRREP2  DS    CL3     13   33    3  A  U N             T        Y              
SPRCOM2H DS    XL8                                                              
SPRCOM2  DS    CL1     13   39    1  A  U N             T        Y              
SPRCST2H DS    XL8                                                              
SPRCST2  DS    CL4     13   45    4  A  U N             T        Y              
SPRBPR2H DS    XL8                                                              
SPRBPR2  DS    CL3     13   53    3  A  U N             T        Y              
SPRTPR2H DS    XL8                                                              
SPRTPR2  DS    CL8     13   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    1    1  A  P N             T        Y              
SPRTYP3H DS    XL8                                                              
SPRTYP3  DS    CL2     14    3    2  A  U N             T        Y              
SPRLIT3H DS    XL8                                                              
SPRLIT3  DS    CL10    14    7   10  A  P H             T        Y              
SPRAMT3H DS    XL8                                                              
SPRAMT3  DS    CL10    14   20   10  A  U N             T        Y              
SPRREP3H DS    XL8                                                              
SPRREP3  DS    CL3     14   33    3  A  U N             T        Y              
SPRCOM3H DS    XL8                                                              
SPRCOM3  DS    CL1     14   39    1  A  U N             T        Y              
SPRCST3H DS    XL8                                                              
SPRCST3  DS    CL4     14   45    4  A  U N             T        Y              
SPRBPR3H DS    XL8                                                              
SPRBPR3  DS    CL3     14   53    3  A  U N             T        Y              
SPRTPR3H DS    XL8                                                              
SPRTPR3  DS    CL8     14   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    1    1  A  P N             T        Y              
SPRTYP4H DS    XL8                                                              
SPRTYP4  DS    CL2     15    3    2  A  U N             T        Y              
SPRLIT4H DS    XL8                                                              
SPRLIT4  DS    CL10    15    7   10  A  P H             T        Y              
SPRAMT4H DS    XL8                                                              
SPRAMT4  DS    CL10    15   20   10  A  U N             T        Y              
SPRREP4H DS    XL8                                                              
SPRREP4  DS    CL3     15   33    3  A  U N             T        Y              
SPRCOM4H DS    XL8                                                              
SPRCOM4  DS    CL1     15   39    1  A  U N             T        Y              
SPRCST4H DS    XL8                                                              
SPRCST4  DS    CL4     15   45    4  A  U N             T        Y              
SPRBPR4H DS    XL8                                                              
SPRBPR4  DS    CL3     15   53    3  A  U N             T        Y              
SPRTPR4H DS    XL8                                                              
SPRTPR4  DS    CL8     15   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    1    1  A  P N             T        Y              
SPRTYP5H DS    XL8                                                              
SPRTYP5  DS    CL2     16    3    2  A  U N             T        Y              
SPRLIT5H DS    XL8                                                              
SPRLIT5  DS    CL10    16    7   10  A  P H             T        Y              
SPRAMT5H DS    XL8                                                              
SPRAMT5  DS    CL10    16   20   10  A  U N             T        Y              
SPRREP5H DS    XL8                                                              
SPRREP5  DS    CL3     16   33    3  A  U N             T        Y              
SPRCOM5H DS    XL8                                                              
SPRCOM5  DS    CL1     16   39    1  A  U N             T        Y              
SPRCST5H DS    XL8                                                              
SPRCST5  DS    CL4     16   45    4  A  U N             T        Y              
SPRBPR5H DS    XL8                                                              
SPRBPR5  DS    CL3     16   53    3  A  U N             T        Y              
SPRTPR5H DS    XL8                                                              
SPRTPR5  DS    CL8     16   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    1    1  A  P N             T        Y              
SPRTYP6H DS    XL8                                                              
SPRTYP6  DS    CL2     17    3    2  A  U N             T        Y              
SPRLIT6H DS    XL8                                                              
SPRLIT6  DS    CL10    17    7   10  A  P H             T        Y              
SPRAMT6H DS    XL8                                                              
SPRAMT6  DS    CL10    17   20   10  A  U N             T        Y              
SPRREP6H DS    XL8                                                              
SPRREP6  DS    CL3     17   33    3  A  U N             T        Y              
SPRCOM6H DS    XL8                                                              
SPRCOM6  DS    CL1     17   39    1  A  U N             T        Y              
SPRCST6H DS    XL8                                                              
SPRCST6  DS    CL4     17   45    4  A  U N             T        Y              
SPRBPR6H DS    XL8                                                              
SPRBPR6  DS    CL3     17   53    3  A  U N             T        Y              
SPRTPR6H DS    XL8                                                              
SPRTPR6  DS    CL8     17   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    1    1  A  P N             T        Y              
SPRTYP7H DS    XL8                                                              
SPRTYP7  DS    CL2     18    3    2  A  U N             T        Y              
SPRLIT7H DS    XL8                                                              
SPRLIT7  DS    CL10    18    7   10  A  P H             T        Y              
SPRAMT7H DS    XL8                                                              
SPRAMT7  DS    CL10    18   20   10  A  U N             T        Y              
SPRREP7H DS    XL8                                                              
SPRREP7  DS    CL3     18   33    3  A  U N             T        Y              
SPRCOM7H DS    XL8                                                              
SPRCOM7  DS    CL1     18   39    1  A  U N             T        Y              
SPRCST7H DS    XL8                                                              
SPRCST7  DS    CL4     18   45    4  A  U N             T        Y              
SPRBPR7H DS    XL8                                                              
SPRBPR7  DS    CL3     18   53    3  A  U N             T        Y              
SPRTPR7H DS    XL8                                                              
SPRTPR7  DS    CL8     18   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    1    1  A  P N             T        Y              
SPRTYP8H DS    XL8                                                              
SPRTYP8  DS    CL2     19    3    2  A  U N             T        Y              
SPRLIT8H DS    XL8                                                              
SPRLIT8  DS    CL10    19    7   10  A  P H             T        Y              
SPRAMT8H DS    XL8                                                              
SPRAMT8  DS    CL10    19   20   10  A  U N             T        Y              
SPRREP8H DS    XL8                                                              
SPRREP8  DS    CL3     19   33    3  A  U N             T        Y              
SPRCOM8H DS    XL8                                                              
SPRCOM8  DS    CL1     19   39    1  A  U N             T        Y              
SPRCST8H DS    XL8                                                              
SPRCST8  DS    CL4     19   45    4  A  U N             T        Y              
SPRBPR8H DS    XL8                                                              
SPRBPR8  DS    CL3     19   53    3  A  U N             T        Y              
SPRTPR8H DS    XL8                                                              
SPRTPR8  DS    CL8     19   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    1    1  A  P N             T        Y              
SPRTYP9H DS    XL8                                                              
SPRTYP9  DS    CL2     20    3    2  A  U N             T        Y              
SPRLIT9H DS    XL8                                                              
SPRLIT9  DS    CL10    20    7   10  A  P H             T        Y              
SPRAMT9H DS    XL8                                                              
SPRAMT9  DS    CL10    20   20   10  A  U N             T        Y              
SPRREP9H DS    XL8                                                              
SPRREP9  DS    CL3     20   33    3  A  U N             T        Y              
SPRCOM9H DS    XL8                                                              
SPRCOM9  DS    CL1     20   39    1  A  U N             T        Y              
SPRCST9H DS    XL8                                                              
SPRCST9  DS    CL4     20   45    4  A  U N             T        Y              
SPRBPR9H DS    XL8                                                              
SPRBPR9  DS    CL3     20   53    3  A  U N             T        Y              
SPRTPR9H DS    XL8                                                              
SPRTPR9  DS    CL8     20   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    1    1  A  P N             T        Y              
SPRTYPAH DS    XL8                                                              
SPRTYPA  DS    CL2     21    3    2  A  U N             T        Y              
SPRLITAH DS    XL8                                                              
SPRLITA  DS    CL10    21    7   10  A  P H             T        Y              
SPRAMTAH DS    XL8                                                              
SPRAMTA  DS    CL10    21   20   10  A  U N             T        Y              
SPRREPAH DS    XL8                                                              
SPRREPA  DS    CL3     21   33    3  A  U N             T        Y              
SPRCOMAH DS    XL8                                                              
SPRCOMA  DS    CL1     21   39    1  A  U N             T        Y              
SPRCSTAH DS    XL8                                                              
SPRCSTA  DS    CL4     21   45    4  A  U N             T        Y              
SPRBPRAH DS    XL8                                                              
SPRBPRA  DS    CL3     21   53    3  A  U N             T        Y              
SPRTPRAH DS    XL8                                                              
SPRTPRA  DS    CL8     21   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    1    1  A  P N             T        Y              
SPRTYPBH DS    XL8                                                              
SPRTYPB  DS    CL2     22    3    2  A  U N             T        Y              
SPRLITBH DS    XL8                                                              
SPRLITB  DS    CL10    22    7   10  A  P H             T        Y              
SPRAMTBH DS    XL8                                                              
SPRAMTB  DS    CL10    22   20   10  A  U N             T        Y              
SPRREPBH DS    XL8                                                              
SPRREPB  DS    CL3     22   33    3  A  U N             T        Y              
SPRCOMBH DS    XL8                                                              
SPRCOMB  DS    CL1     22   39    1  A  U N             T        Y              
SPRCSTBH DS    XL8                                                              
SPRCSTB  DS    CL4     22   45    4  A  U N             T        Y              
SPRBPRBH DS    XL8                                                              
SPRBPRB  DS    CL3     22   53    3  A  U N             T        Y              
SPRTPRBH DS    XL8                                                              
SPRTPRB  DS    CL8     22   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    1    1  A  P N             T        Y              
SPRTYPCH DS    XL8                                                              
SPRTYPC  DS    CL2     23    3    2  A  U N             T        Y              
SPRLITCH DS    XL8                                                              
SPRLITC  DS    CL10    23    7   10  A  P H             T        Y              
SPRAMTCH DS    XL8                                                              
SPRAMTC  DS    CL10    23   20   10  A  U N             T        Y              
SPRREPCH DS    XL8                                                              
SPRREPC  DS    CL3     23   33    3  A  U N             T        Y              
SPRCOMCH DS    XL8                                                              
SPRCOMC  DS    CL1     23   39    1  A  U N             T        Y              
SPRCSTCH DS    XL8                                                              
SPRCSTC  DS    CL4     23   45    4  A  U N             T        Y              
SPRBPRCH DS    XL8                                                              
SPRBPRC  DS    CL3     23   53    3  A  U N             T        Y              
SPRTPRCH DS    XL8                                                              
SPRTPRC  DS    CL8     23   59    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24    1    1  A  P N             T        Y              
SPRTYPDH DS    XL8                                                              
SPRTYPD  DS    CL2     24    3    2  A  U N             T        Y              
SPRLITDH DS    XL8                                                              
SPRLITD  DS    CL10    24    7   10  A  P H             T        Y              
SPRAMTDH DS    XL8                                                              
SPRAMTD  DS    CL10    24   20   10  A  U N             T        Y              
SPRREPDH DS    XL8                                                              
SPRREPD  DS    CL3     24   33    3  A  U N             T        Y              
SPRCOMDH DS    XL8                                                              
SPRCOMD  DS    CL1     24   39    1  A  U N             T        Y              
SPRCSTDH DS    XL8                                                              
SPRCSTD  DS    CL4     24   45    4  A  U N             T        Y              
SPRBPRDH DS    XL8                                                              
SPRBPRD  DS    CL3     24   53    3  A  U N             T        Y              
SPRTPRDH DS    XL8                                                              
SPRTPRD  DS    CL8     24   59    8  A  U N             T        Y              
SPRLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
