*          DATA SET NEBUYWRKS  AT LEVEL 145 AS OF 11/11/99                      
* ERROR MESSAGE EQUATES                                                         
*                                                                               
MISERR   EQU   1                   MISSING INPUT FIELD                          
INVERR   EQU   2                   INVALID INPUT FIELD                          
NUMERR   EQU   3                   NON-NUMERIC INPUT FIELD                      
SUBERR   EQU   5                   SUB-LINE MAXIMUM EXCEEDED                    
HELPMSG  EQU   6                   HELP MESSAGE                                 
DATCHERR EQU   11                  DATE CANNOT BE CHANGED                       
DAYCGERR EQU   12                  DAY CANNOT BE CHANGED                        
DATERR   EQU   13                  INVALID DATE                                 
COVERR   EQU   14                  PROGRAM DAY(S) DO NOT COVER UNIT DAY         
DAYERR   EQU   15                  INVALID DAY                                  
TIMERR   EQU   16                  INVALID TIME                                 
NOTFOUND EQU   53                  RECORD NOT FOUND                             
RECDEL   EQU   56                  RECORD IS DELETED                            
CLLOKERR EQU   59                  CLIENT IS LOCKED (UPDATIVE SOON)             
STERR    EQU   61                  DATE IS BEFORE ESTIMATE START                
ENDERR   EQU   62                  DATE IS AFTER ESTIMATE END                   
SEQERR   EQU   63                  DATE SEQUENCE ERROR                          
CBLPLERR EQU   64                  CABLE PLANS CAN'T BE TRANSFERRED             
REPDERR  EQU   101                 CANNOT DELETE SP. REP ON PAID UNIT           
REPCHERR EQU   102                 CANNOT CHANGE SP. REP ON PAID UNIT           
PRESTERR EQU   106                 BRAND ESTIMATE NOT ON FILE                   
ALLCHERR EQU   107                 ALLOCATION CANNOT BE CHANGED IF PAID         
UNALLERR EQU   108                 CANNOT UNALLOCATE BILLED/PAID UNIT           
PRDERR   EQU   109                 INVALID PRODUCT CODE                         
DELERR   EQU   129                 CANNOT DELETE MISSING/MAKE-GOOD UNIT         
MGNFERR  EQU   131                 MAKE-GOOD REFERENCE NOT FOUND                
MGINVERR EQU   132                 INVALID MAKE-GOOD REFERENCE                  
PREERR   EQU   133                 CANNOT PRE-EMPT MADE-GOOD UNIT               
ENEWERR  EQU   158                 ONLY 'NEW' ESTIMATES ALLOWED                 
ELOCKERR EQU   159                 ESTIMATE HEADER IS LOCKED                    
CLIFRERR EQU   160                 CANNOT ADD CLIENT FROZEN                     
PROGERR  EQU   172                 PROGRAM RECORD NOT FOUND                     
PGNEWERR EQU   173                 NEW PROGRAM RECORDS ONLY                     
TOOLARGE EQU   175                 RECORD SIZE HAS OVERFLOWED MAXIMUM           
SCTYERR  EQU   178                 ACCESS TO CLIENT NOT AUTHORIZED              
UCBLKERR EQU   179                 CANNOT ADD UNITS PACKAGE CABLE\LOCK          
CLOCKERR EQU   180                 PACKAGE HAS UNIT(S) - CANT CBL LOCK          
PKDELERR EQU   181                 PACKAGE HAS UNIT(S) - CANNOT DELETE          
DPCHGERR EQU   182                 CANNOT CHANGE PACKAGE DAYPART                
LOCKERR  EQU   183                 CANNOT LOCK PACK. W BILLD/PD. UNITS          
PAKFERR  EQU   185                 PACKAGE IS FROZEN                            
PAKLERR  EQU   186                 PACKAGE IS LOCKED                            
DUPPACK  EQU   187                 BP DUPLICATE PACKAGE #                       
DAYDTEMT EQU   188                 DAY & DATE MUST MATCH                        
PAYCHGNA EQU   189                 CHANGING RATE AFTE PAY NOT ALLOWED           
INTGNF   EQU   190                 INTEGRATION NOT FOUND                        
NOESTPRD EQU   192                 NO PRD THIS EST (COPYU)                      
PGNOSHR  EQU   193                 IF PACK GUAR. NO SHARE/HUT/RTG CHG           
INVPMETR EQU   194                 INVALID POSTING DATA                         
PUPPACC  EQU   195                 PACKAGE RECORD GHANGED                       
CPLXERR  EQU   196                 COMPLEX MUST BE Y/N                          
DUPFEDC  EQU   200                 DUPLICATE FEED CODE                          
FEDCNDEL EQU   201                 FEED CODE CAN'T BE DELETED                   
FEEDCERR EQU   221                 FEED CODE NOT FOUND                          
PREUPWAR EQU   230                 SOME QTRS PREVIOUSLY UPLOADED                
REPERR   EQU   232                 REP NOT FOUND                                
ADUERR   EQU   233                 NO ACT OR INT COST ALLOWED                   
CLIERR   EQU   236                 CLIENT NOT FOUND                             
ESTERR   EQU   237                 ESTIMATE NOT FOUND                           
NETERR   EQU   238                 NETWORK NOT FOUND                            
PAKERR   EQU   239                 PACKAGE NOT FOUND                            
UNIVERR  EQU   240                 UNIVERSE NOT FOUND                           
PUPPACA  EQU   241                 PUP PACKAGE ADD                              
ALLUTRNS EQU   242                 ALL UNITS TRANSFERED                         
PRGUTRNS EQU   243                 1 PROGRAM UNITS TRANSFER (NEXT PRG)          
PKGDIS   EQU   244                 PACKAGE DISPLAYED                            
UNTNOTAD EQU   245                 UNITS ON PUP NOT ALL ADDED                   
AFFIDLCK EQU   246                 AFFID SEEDED CANOT CHANGE FIELD              
AUDITERR EQU   247                 REASON CODE INPUT ERROR                      
INVREASN EQU   248                 INVALID REASON CODE                          
MAXIOERR EQU   249                 MAXIMUM IO'S EXCEEDED                        
AUDACTER EQU   250                 NO DELETE ACTION WHEN AUDIT SET              
USERERR  EQU   255                 USER SUPPLIED ERROR MESSAGE                  
         EJECT                                                                  
* I/O EQUATES                                                                   
*                                                                               
READ     EQU   1                   READ ON DIRECTORY                            
SEQ      EQU   2                   SEQUENTIAL READ ON DIRECTORY                 
HIGH     EQU   3                   READ HIGH ON DIRECTORY OR IS FILE            
WRITE    EQU   4                   WRITE TO DIRECTORY                           
ADD      EQU   5                   ADD TO DIRECTORY                             
GET      EQU   6                   GETREC ON DIRECT ACCESS FILE                 
PUT      EQU   7                   PUTREC ON DIRECT ACCESS FILE                 
ADDREC   EQU   8                   ADDREC ON DIRECT ACCESS FILE                 
SPT      EQU   16                  SPOT FILE/DIRECTORY                          
UNT      EQU   32                  UNIT FILE/DIRECTORY                          
STA      EQU   48                  STATION FILE/DIRECTORY                       
TRF      EQU   64                  TRAFFIC FILE/DIRECTORY                       
DIR      EQU   X'80'               READ DIRECTORY                               
FILE     EQU   X'00'               READ FILE                                    
PASSDEL  EQU   X'0100'             RETURN DELETED RECORDS                       
UPDATE   EQU   X'0200'             READ FOR UPDATE - LOCKS RECORD               
*                                                                               
NEBLOCKL EQU   NBBLKEND-NETBLOCK+1 NETBLOCK LENGTH                              
PAGELEN  EQU   2304                LENGTH OF TWA PAGE (OVLY TWA SPACE)          
BASETWA  EQU   5000                BASE PROGRAM TWA STORAGE                     
IOLEN    EQU   3072                LENGTH OF IOAREAS                            
NDIRPTRS EQU   2                   NUMBER OF PASSIVE POINTERS                   
SUBMAX   EQU   X'C0'               MAXIMUM SUB-LINE NUMBER                      
NDIRLEN  EQU   L'NUKEY+L'NUKSTAT+L'NUDA LENGTH OF DIRECTORY ENTRY               
NDIRCTL  EQU   NUKSTAT-NUKEY       DISPLACEMENT TO DIR. CONTROL BYTE            
NDIRDA   EQU   NUDA-NUKEY          DISPLACEMENT TO DIR. DISK ADDRESS            
NDIRLCTL EQU   L'NUKSTAT           LENGTH OF CONTROL BYTE                       
NDIRLDA  EQU   L'NUDA              LENGTH OF DISK ADDRESS                       
*                                                                               
YES      EQU   C'Y'                                                             
NO       EQU   C'N'                                                             
COMMA    EQU   C','                                                             
STAR     EQU   C'*'                                                             
DASH     EQU   C'-'                                                             
         SPACE 2                                                                
* ACTION EQUATES                                                                
*                                                                               
BP       EQU   1                   BUY OR OPEN PACKAGE                          
DP       EQU   2                   DISPLAY PACKAGE                              
CP       EQU   3                   CHANGE PACKAGE                               
DELP     EQU   4                   DELETE PACKAGE                               
COPYP    EQU   5                   COPY PACKAGE                                 
*                                                                               
B        EQU   11                  BUY SINGLE UNIT                              
D        EQU   12                  DISPLAY SINGLE UNIT                          
C        EQU   13                  CHANGE SINGLE UNIT                           
DEL      EQU   14                  DELETE SINGLE UNIT                           
*                                                                               
BM       EQU   21                  BUY MULTIPLE UNITS                           
DM       EQU   22                  DISPLAY MULTIPLE UNITS                       
CM       EQU   23                  CHANGE MULTIPLE UNITS                        
CAL      EQU   26                  CALENDARIZE UNITS (CREATE SCHEDULE)          
*                                                                               
DSR      EQU   31                  DISPLAY SPECIAL RATE                         
CSR      EQU   32                  CHANGE SPECIAL RATE                          
*                                                                               
DPR      EQU   35                  DISPLAY PRODUCTS                             
CPR      EQU   36                  CHANGE PRODUCTS                              
*                                                                               
DH       EQU   38                  DISPLAY HISTORY RECORDS                      
*                                                                               
COPYU    EQU   91                  COPY UNITS FOR A PACKAGE                     
PACKU    EQU   93                  PACKAGE UPDATE                               
TRANU    EQU   95                  TRANSFER UNITS FOR A PACKAGE                 
UPLOAD   EQU   98                  UPLOAD UNITS FROM A PC                       
*                                                                               
DD       EQU   32                  DEMO DISPLAY                                 
CD       EQU   33                  CHANGE DEMOS                                 
*                                                                               
PT       EQU   61                  PUP TRANSFER                                 
PA       EQU   71                  PUP PACHAGE ADD                              
PD       EQU   62                  PUP DISPLAY                                  
PC       EQU   63                  PUP PACKAGE CHANGE                           
*                                                                               
IP       EQU   41                  PACKAGE INFO                                 
IU       EQU   51                  UNIT INFO                                    
AUDIT    EQU   81                  AUDIT TRAIL DISPLAY                          
HELP     EQU   99                  GENERAL HELP FOR ACTIONS                     
*                                                                               
DEFAULT  EQU   X'01'               BASE FIELD HAS DEFAULT VALUE                 
OPTIONAL EQU   X'02'               BASE FIELD IS OPTIONAL                       
NOEDIT   EQU   X'04'               EDIT OF BASE FIELD SHOULD BE SKIPPED         
ISINGLE  EQU   X'08'               SINGLE NUMBER OR ALPHA VALID                 
IRANGE   EQU   X'10'               RANGE OF NUMBERS VALID                       
IALL     EQU   X'20'               'ALL' VALID                                  
IFILTER  EQU   X'40'               FILTER VALID                                 
*                                                                               
DDSONLY  EQU   X'01'               ACTION VALID FOR DDS ONLY                    
FSTCURS  EQU   X'02'               BASE SETS CURSOR/EXITS FIRST TIME            
SETPROGR EQU   X'04'               HANDLE PROGRAM ERRORS IN BASE                
READONLY EQU   X'08'               THIS ACTION IS READ ONLY                     
*                                                                               
PASSEQ   EQU   X'80'               SELF ASSIGN PACK(BP,PD,PT)                   
PUPTRNS  EQU   X'40'               PUP TRANSFER (PACKAGE VALIDATE RTN)          
VPHBASE  EQU   X'20'               PROGRAM IS VPH BASED                         
LOKCHEK  EQU   X'10'               CHECK FOR LOCKED (UPDATIVE SOON)             
FRZCHK   EQU   X'08'               CLIENT FROZEN CHECK                          
         SPACE 2                                                                
* MODE EQUATES                                                                  
*                                                                               
DISPLAY  EQU   X'01'                                                            
CHANGE   EQU   X'02'                                                            
FIRST    EQU   X'80'               FIRST TIME FOR ACTION                        
         SPACE 2                                                                
* UNIT DATA FIELD EQUATES (USED BY GENERAL DISPLAY AND EDIT MODULES)            
*                                                                               
UPRD     EQU   1                   PRODUCT CODE(S)                              
UP1SHR   EQU   2                   FIRST BRAND SHARE                            
UPRGN    EQU   5                   UNIT PROGRAM NAME                            
ULEN     EQU   6                   SECONDS LENGTH                               
UDAY     EQU   7                   DAY                                          
UTIME    EQU   8                   START, END TIME (MILITARY)                   
UAFFID   EQU   9                   AFFIDAVIT TIME (MILITARY)                    
UASS     EQU   10                  ASSIGNED COST                                
UACT     EQU   11                  ACTUAL COST                                  
USTAT    EQU   12                  UNIT STATUS                                  
UINT     EQU   20                  INTEGRATION RATE                             
UFEED    EQU   21                  FEED COVERAGE PERCENTAGE                     
UIMP     EQU   22                  IMPACT PERCENTAGE                            
UNTI     EQU   23                  NTI CODE                                     
UNSI     EQU   24                  NSI CODE                                     
UUNCD    EQU   25                  UNIVERSE CODE                                
UUNPC    EQU   26                  UNIVERSE PERCENTAGE                          
UROT     EQU   27                  ROTATION                                     
UHAVE    EQU   28                  HUT AVERAGE                                  
UHSC     EQU   29                  HUT SCHEME                                   
UHUTADJ  EQU   30                  HUT ADJUSTMENT PERCENTAGE                    
USREP    EQU   31                  SPECIAL REP                                  
UFEEDCD  EQU   32                  FEED CODE (TRAFFIC)                          
UBB      EQU   33                  BILLBOARD (TRAFFIC)                          
UMGPC    EQU   40                  MAKE-GOOD FOR PROGRAM CODE                   
UMGDAT   EQU   41                  MAKE-GOOD FOR DATE/SUB-LINE                  
UPRE     EQU   42                  PRE-EMPTION (Y/N)                            
UMISS    EQU   43                  MISSING UNIT (MADE-GOOD BY DATA)             
USCHG    EQU   44                  SPECIAL CHARGES INDICATOR                    
UDHI     EQU   45                  DELETE HOMES IMPRESSION OVERRIDE             
UHUT     EQU   50                  ESTIMATED HUT                                
USHR     EQU   51                  ESTIMATED SHARE                              
URAT     EQU   52                  ESTIMATED RATING HOMES                       
UPG      EQU   55                  PACKAGE GUARANTEE FACTOR                     
UPF      EQU   56                  PACKAGE FILTER                               
UDG      EQU   57                  DEMO GUARANTEE FACTOR                        
URES     EQU   60                  ACTUAL DEMO RESULT CODE                      
UBUYD    EQU   70                  BUY CREATION DATE                            
ULSTA    EQU   72                  LAST ACTIVITY DATE                           
UDA      EQU   74                  UNIT RECORD DISK ADDRESS                     
UOTHER   EQU   76                  "OTHER" INFO                                 
UBILL    EQU   81                  BILLING ACTIVITY                             
UPAY     EQU   82                  PAYING ACTIVITY                              
UOTH     EQU   86                  OTHER SPECIAL EDITS                          
         EJECT                                                                  
* DSECT TO COVER ACTION TABLE ENTRIES                                           
*                                                                               
ACTTABD  DSECT                                                                  
ACTCODE  DS    CL6                 ACTION CODE                                  
ACTMINL  DS    X                   MINIMUM LENGTH FOR CODE COMPARE              
ACTN     DS    X                   ACTION NUMBER (SAVED IN TWA)                 
ACTOV    DS    X                   OVERLAY FOR ACTION                           
ACTSCR   DS    X                   SCREEN FOR ACTION                            
ACTIND   DS    X                   INDICATORS (E.G. HELP SUPPORTED)             
ACTCLI   DS    X                   CLIENT FIELD EDIT CONTROL                    
ACTCLID  DS    XL2                 CLIENT FIELD DEFAULT VALUE                   
ACTEST   DS    X                   ESTIMATE FIELD EDIT CONTROL                  
ACTESTD  DS    XL2                 ESTIMATE DEFAULT                             
ACTNET   DS    X                   NETWORK FIELD EDIT CONTROL                   
ACTNETD  DS    CL4                 NETWORK DEFAULT                              
ACTPACK  DS    X                   PACKAGE FIELD EDIT CONTROL                   
ACTPACKD DS    X                   PACKAGE DEFAULT                              
ACTPROG  DS    X                   PROGRAM FIELD EDIT CONTROL                   
ACTPROGD DS    CL6                 PROGRAM DEFAULT                              
ACTOP    DS    X                   ACTION OPTIONS                               
         DS    CL2                 SPARE                                        
ACTINDES DS    CL8                 ACTION FIELD INPUT DESCRIPTION               
ACTDESC  DS    CL22                ACTION DESCRIPTION                           
ACTNTRL  EQU   (*-ACTTABD)                                                      
         EJECT                                                                  
* DSECT TO COVER BLOCK FOR GENERAL UNIT EDIT/RECORD MAINTENANCE                 
*                                                                               
UNBLOCKD DSECT                                                                  
UNBLOCK  DS    0CL80                                                            
UNAGLOB  DS    A                   A(GLOBAL WORKING STORAGE)                    
UNFLDH   DS    A                   A(FIELD HEADER TO BE EDITED)                 
UNAREC   DS    A                   A(UNIT RECORD)                               
UNALOCAL DS    A                   A(LOCAL WORKING STORAGE FOR MODULE)          
UNAMISS  DS    A                   A(MISSING UNIT RECORD)                       
UNINGTBL DS    A                   A(INTG TABLE)                                
UNLUPVPH DS    CL1                 FORCE LOOK UP OF NEW DEMO'S                  
UNBITOPT DS    CL1                 USE BITS FOR OPTIONS                         
*                                  BIT 0=ALLOW CHANGE IF PAYED                  
*                                  BIT 1=PACKAGE GUAR. EXITS                    
*                                  BIT 2=COPYU HUY TYPE LOOK UP DEMOS           
         DS    CL2                 SPARE                                        
*                                                                               
UNEDATA  DS    X                   DATA TYPE TO BE EDITED                       
UNERROR  DS    X                   ERROR NUMBER                                 
UNACTSW  DS    C                   ACTION SWITCH (A=ADD, C=CHANGE)              
UNESTLK  DS    C                   FORCE LOOKUP OF ESTIMATED DEMOS              
*                                  ON CHANGE (Y/N)                              
UNNOLOOK DS    C                   SUPPRESS ESTIMATED LOOKUP ON CHANGE          
*                                  (Y/N) - FOR MISSING UNITS                    
UNBILLSW DS    C                   BILLED UNIT SWITCH (Y/N)                     
UNPAYSW  DS    C                   PAID UNIT SWITCH (Y/N)                       
UNACTION DS    X                   ACTION NUMBER (SEE EQUATES)                  
*                                                                               
UNDEMS   DS    0XL6                ESTIMATED HOMES DEMOS                        
UNSHR    DS    XL2                 SHARE                                        
UNHUT    DS    XL2                 HUT                                          
UNRAT    DS    XL2                 RATING                                       
*                                                                               
UNDATE   DS    XL2                 COMPRESSED AIR DATE                          
UNSQH    DS    X                   START QUARTER HOUR                           
*                                                                               
UNOVALS  DS    0XL5                ORIGINAL RECORD VALUES (POINTERS)            
UNODATE  DS    XL2                 ORIGINAL DATE                                
UNOSUB   DS    X                   ORIGINAL SUB-LINE                            
UNOTIME  DS    X                   ORIGINAL START QH                            
UNODAY   DS    X                   ORIGINAL DAY                                 
*                                                                               
         DS    CL(L'UNBLOCK-(*-UNBLOCK)) SPARE                                  
         EJECT                                                                  
* NEBLOCK                                                                       
         PRINT OFF                                                              
NEBLOCKD DSECT                                                                  
       ++INCLUDE NETBLOCKD                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* DEDBLOCK                                                                      
         PRINT OFF                                                              
DBLOCKD  DSECT                                                                  
       ++INCLUDE DEDBLOCK                                                       
         PRINT ON                                                               
         SPACE 2                                                                
* EXDBLOCK                                                                      
         PRINT OFF                                                              
       ++INCLUDE DEDBEXTRAD                                                     
         PRINT ON                                                               
         SPACE 2                                                                
* NEGENPACK                                                                     
         PRINT OFF                                                              
       ++INCLUDE NEGENPACK                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* NEGENUNIT                                                                     
         PRINT OFF                                                              
       ++INCLUDE NEGENUNIT                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* NEGENHIST                                                                     
         PRINT OFF                                                              
       ++INCLUDE NEGENHIST                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* NEGENUSER                                                                     
         PRINT OFF                                                              
       ++INCLUDE NEGENUSER                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* SPGENPROG                                                                     
         PRINT OFF                                                              
       ++INCLUDE SPGENPROG                                                      
         PRINT ON                                                               
* SPGENREAS                                                                     
         PRINT OFF                                                              
       ++INCLUDE SPGENREAS                                                      
         PRINT ON                                                               
         EJECT                                                                  
* DSECT TO COVER BUY PROGRAM GLOBAL WORKING STORAGE                             
*                                                                               
BUYWRKD  DSECT                                                                  
DUB      DS    D                   GENERAL WORK AREAS FOR ALL MODULES           
DUB2     DS    D                                                                
FULL     DS    F                                                                
FULL2    DS    F                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
BYTE     DS    C                                                                
THREE    DS    CL3                                                              
DMCB     DS    6F                                                               
DMCB2    DS    6F                                                               
WORK     DS    CL60                                                             
SPACES   DS    CL133                                                            
ELCODE   DS    X                                                                
*                                  PARAMETER LIST OF SYSTEM FACILITIES          
APARM    DS    A                   A(PARAM LIST)                                
ATIA     DS    A                   A(TERMINAL INPUT AREA)                       
ATWA     DS    A                   A(TERMINAL WORK AREA)                        
ACOMFACS DS    A                   A(COMMON FACILITIES LIST)                    
         DS    2A                                                               
*                                  BASE SAVE ADDRESSES                          
BRELO    DS    A                   BASE PROGRAM RELOCATION FACTOR               
AWORK    DS    A                   BASE PROGRAM SAVED RD VALUE                  
BASE1    DS    A                   FIRST BASE REGISTER                          
BASE2    DS    A                   SECOND BASE REGISTER                         
BASE3    DS    A                   SECOND BASE REGISTER                         
         DS    1A                                                               
*                                  TWA VALUES                                   
DDS      DS    C                   Y=DDS TERMINAL                               
AUTH     DS    XL2                 AUTHORIZATION BITS                           
TERM     DS    XL2                 TERMINAL NUMBER                              
USERID   DS    XL2                 USER-ID NUMBER                               
AGYALPH  DS    CL2                 AGENCY ALPHA ID                              
         DS    CL3                 SPARE                                        
         SPACE 1                                                                
*                                                                               
COMFACS  DS    0F                  MODULE ADDRESSES FROM COMFACS                
VDATAMGR DS    V                                                                
VCALLOV  DS    V                                                                
VGETMSG  DS    V                                                                
VHELLO   DS    V                                                                
VSCANNER DS    V                                                                
VUNSCAN  DS    V                                                                
VHEXOUT  DS    V                                                                
VCASHVAL DS    V                                                                
VDATVAL  DS    V                                                                
VDATCON  DS    V                                                                
VADDAY   DS    V                                                                
VGETDAY  DS    V                                                                
VGETPROF DS    V                                                                
VDEMOUT  DS    V                                                                
VGLOBBER DS    V                                                                
VTIA     DS    V                                                                
         DS    4V                                                               
         SPACE 1                                                                
*                                                                               
COREFACS DS    0F                  CORE-RESIDENT MODULE ADDRESSES               
VDAYVAL  DS    V                                                                
VTIMVAL  DS    V                                                                
VUNDAY   DS    V                                                                
VUNTIME  DS    V                                                                
VCLPACK  DS    V                                                                
VCLUNPK  DS    V                                                                
VDEMOCON DS    V                                                                
VNETIO   DS    V                                                                
VNETVAL  DS    V                   V(NETVALUE)                                  
VNETWEEK DS    V                                                                
VGETNUN  DS    V                   V(GETNUN) - GET NETWORK UNIVERSES            
VGETHUT  DS    V                   V(GETHUT) - GET ESTIMATED HUT                
VXSORT   DS    V                                                                
VGETFACT DS    V                                                                
         DS    6V                                                               
*                                                                               
BASEFACS DS    0F                  BASE PROGRAM MODULE ADDRESSES                
VMSPACK  DS    V                                                                
AIO      DS    A                                                                
AFVAL    DS    A                                                                
         DS    5A                                                               
         SPACE 1                                                                
BASECOM  DS    0F                  COMMONLY ENTERED BASE SUB-ROUTINES           
VGETFLD  DS    A                                                                
VERROR   DS    A                                                                
VEXIT    DS    A                                                                
VCLEARF  DS    A                   CLEAR AND FOUT FIELDS                        
VGETPROG DS    A                   GET APPLICABLE PROGRAM RECORD                
VDISPROG DS    A                   BASE SCREEN PROGRAM DATA DISPLAY             
VBLDFLD  DS    A                   DYNAMIC FIELD BUILDING                       
VCENFLD  DS    A                   CENTRALIZE FIELDS ON SCREEN LINE             
VGETNADS DS    A                   GETS THE NAD CATEGORIES                      
VCKREASN DS    A                   CHECK FOR VALID REASON CODE                  
VBLDRQST DS    A                   BUILD TURNAROUND REQUEST                     
         DS    4A                  SPARE                                        
         DS    3A                  ADDITIONAL SPARE                             
*                                                                               
AIOAREA1 DS    A                   ADCONS FOR EXTENDED WORKING                  
AIOAREA2 DS    A                   STORAGE ADDRESSABILITY                       
AIOAREA3 DS    A                                                                
AIOAREA4 DS    A                                                                
AOVWORK  DS    A                                                                
AACTNTRY DS    A                   A(ACTION TABLE ENTRY)                        
ABUYVALS DS    A                   A(BASE PROGRAM GLOBAL VALUES)                
APROGREC DS    A                   A(PROGRAM RECORD)                            
APACKREC DS    A                   A(PACKAGE RECORD)                            
APROGEL  DS    A                   A(PROGRAM ELEMENT)                           
ABOOKEL  DS    A                   A(EVN BOOK ELEMENT)                          
APAKFEL  DS    A                   A(PACKAGE FILTER ELEMENT)                    
APAKAEL  DS    A                   A(PACKAGE AUDIT ELEMENT)                     
         DS    8A                  SPARE                                        
*                                                                               
TODAYC   DS    XL2                 TODAY'S DATE - COMPRESSED                    
XTRA     DS    CL24                OPTIONAL EXTRA MESSAGE                       
BUYPROF  DS    CL16                BUY PROGRAM PROFILE (N1)                     
DEMFRST  DS    C                   FIRST TIME DEMO LOOKUP SWITCH (Y/N)          
BUYPROF2 DS    CL16                BUY PROGRAM PROFILE (EXTENSION)              
NETPROF  DS    CL16                NETWORK PROFILE (N0)                         
BUYUNFR  DS    C                   UNFROZEN BUY IF SET TO Y                     
DEMPREC  DS    CL14                DEMO PRECISION TABLE FOR OVERRIDES           
*                                  BYTE 1=CATEGORY, BYTE TO PREC FORMAT         
REGESAV  DS    CL4                 SAVE REGISTER 'E' AREA                       
USERIDSV DS    CL8                 PERSONAL ID SAVE AREA                        
SECAGY   DS    CL2                 SECURITY AGENCY                              
SVPASSWD DS    CL2                 PERSONAL ID                                  
         DS    CL16                SPARE                                        
*                                                                               
         DS    0F                  BLDFLD BLOCK                                 
BLDROW   DS    H                   SCREEN ROW                                   
BLDCOL   DS    H                   SCREEN COLUMN                                
BLDTWAS  DS    A                   TWA START POINT (OPTIONAL)                   
BLDTWAX  DS    X                   TWA END POINT                                
         DS    CL16                SPARE                                        
BLDLIST  DS    CL44                8 BYTE ENTRIES PLUS 4 BYTE EOL               
         DS    CL2                 SPARE                                        
INTGTBL  DS    0CL17               INTG INF FOR EDIT MODULE                     
INTGREAD DS    X                   INTEGRATION ALREADY READ IN                  
INTGAIO  DS    A                   A(IO AREA (RATES RETURNED HERE ALSO)         
INTGSTDT DS    H                   START DATE                                   
INTGEDDT DS    H                   END DATE                                     
INTHLDIT DS    A                   (ADDRESS OF INT TABLE LOOKUP VALUES)         
INTDKA   DS    A                   LAST DISK ADDRESS READ FOR INTEG             
         DS    CL5                 SPARE                                        
*                                  FIELD VALIDATION STORAGE                     
FERN     DS    X                   FIELD ERROR NUMBER (USER SET)                
FNDX     DS    X                   FIELD INDEX (USER SET)                       
FADDR    DS    A                   A(FIELD HEADER)                              
FMAX     DS    X                   OPTIONAL MAXIMUN SCAN LENGTH                 
FLAST    DS    AL3                 A(LAST STRING) OR ZERO                       
FLEN     DS    X                   LENGTH OF LAST STRING OR ZERO                
FTERM    DS    XL6                 LIST OF SCAN TERMINATORS                     
         DS    X                                                                
FLDH     DS    XL8                 FIELD HEADER CONSTRUCTED BY FVAL             
FLD      DS    CL79                EXTRACTED DATA (SPACE FILLED)                
FSTOP    DS    X                   STOP CHARACTER OR X'FF'                      
         DS    CL10                SPARE                                        
         SPACE 1                                                                
*                                  I/O ROUTINE WORKING STORAGE                  
IOFLAG   DS    0X                  COMMAND/FILE PASSED TO ROUTINE               
AIOAREA  DS    A                   A(I/O BUFFER FOR RECORD)                     
KEY      DS    CL32                                                             
KEYSAVE  DS    CL32                KEY PASSED TO DATAMGR                        
DMINBITS DS    X                   DATAMGR BITS (UPDATE READ, DELETES)          
NDXDA    DS    XL4                 RECORD DISK ADDRESS                          
AUDREASN DS    CL4                 REASON CODE WHEN AUDIT IS SET                
         DS    CL12                SPARE                                        
         DS    0D                                                               
DMWORK   DS    12D                 DATAMGR WORK AREA                            
*                                                                               
HUTBLK   DS    CL128               HUT LOOKUP BLOCK AREA                        
*                                                                               
         DS    0D                                                               
DBLOCKA  DS    XL(L'DBLOCK)                                                     
NEBLOCKA DS    XL(NEBLOCKL)                                                     
         DS    0D                                                               
IOAREA1  DS    CL(IOLEN)                                                        
IOAREA2  DS    CL(IOLEN)                                                        
IOAREA3  DS    CL(IOLEN)                                                        
IOAREA4  DS    CL(IOLEN)                                                        
*                                                                               
PROGREC  DS    CL1000              PROGRAM RECORD AREA                          
*                                                                               
OVWORK   DS    CL2400              LOCAL STORAGE FOR OVERLAYS                   
BUYWRKX  EQU   *                                                                
         EJECT                                                                  
* DSECT TO COVER BUY PROGRAM GLOBAL VALUES (SIZE OF BUYVALS AREA IS             
* SAME AS I/O AREA)                                                             
*                                                                               
BUYVALD  DSECT                                                                  
BUYVALS  DS    CL(PAGELEN)                                                      
         ORG   BUYVALS                                                          
AGYVALS  DS    0C                  AGENCY RECORD VALUES                         
AGYMED   DS    X                   AGENCY/MEDIA                                 
AGYPRO   DS    CL20                                                             
AGYVALSX EQU   *                                                                
*                                                                               
CLIVALS  DS    0C                  CLIENT RECORD VALUES                         
CLI      DS    CL3                 CLIENT CODE INPUT                            
CLIPK    DS    XL2                 PACKED CLIENT CODE                           
CLIPRO   DS    CL15                CLIENT PROFILE                               
CLIEXTRA DS    CL15                CLIENT EXTRA PROFILE                         
CLILIST  DS    220XL4              PRODUCT LIST                                 
CLIOPT2  DS    XL1                 OPTION 2                                     
CLICOST2 DS    XL4                 SECOND COST PCT X.XXXXXX                     
CLIFPGRP DS    XL8                 FP GROUP FOR T/A REQUEST                     
         DS    CL47                SPARE                                        
CLIVALSX EQU   *                                                                
*                                                                               
ESTVALS  DS    0C                                                               
ESTTYP   DS    X                   ESTIMATE INPUT SYNTAX                        
EST      DS    XL3                 ESTIMATE NUMBERS INPUT                       
         DS    CL6                 SPARE                                        
ESTSTART DS    CL6                 ESTIMATE START (YYMMDD)                      
ESTEND   DS    CL6                 ESTIMATE END (YYMMDD)                        
ESTS     DS    XL2                 ESTIMATE START DATE (COMPRESSED)             
ESTE     DS    XL2                 ESTIMATE END DATE (COMPRESSED)               
ESTBOOK  DS    XL2                 HUT BOOK                                     
ESTFILT  DS    CL3                 ESTIMATE FILTERS                             
ESTNDEMS DS    X                   NUMBER OF DEMOS                              
ESTWLST  DS    XL20                WEIGHTING LIST FOR DEMOS                     
ESTUSNS  DS    CL28                USER DEMO NAMES                              
ESTWNAM  DS    CL7                 WEIGHTED DEMO NAME                           
ESTDEMS  DS    XL60                DEMO LIST                                    
         DS    X                                                                
ESTSREP  DS    XL2                 SPECIAL REP                                  
ESTRATE  DS    XL1                 ESTIMATE RATE TYPE                           
ESTRATEC DS    XL1                 ESTIMATE RATE COSTS T=ACTUAL                 
ESTCOST2 DS    XL4                 SECOND COST PCT X.XXXXXX                     
ESTFLAG1 DS    XL1                 ESTIMATE FLAGS                               
         DS    XL51                SPARE                                        
ESTVALSX EQU   *                                                                
*                                                                               
NETVALS  DS    0C                  NETWORK RECORD VALUES                        
NETTYP   DS    X                   NETWORK INPUT SYNTAX                         
NET      DS    CL4                 NETWORK INPUT                                
         DS    CL4                 SPARE                                        
NETMARK  DS    XL2                 MARKET NUMBER (PACKED)                       
         DS    CL30                SPARE                                        
NETVALSX EQU   *                                                                
*                                                                               
PACKTYP  DS    X                   TYPE OF PACKAGE INPUT                        
PACK     DS    X                   PACKAGE                                      
         DS    CL6                 SPARE                                        
*                                                                               
PROGTYP  DS    X                   TYPE OF PROGRAM INPUT                        
PROG     DS    CL6                                                              
         DS    CL6                 SPARE                                        
*                                                                               
PACKREC  DS    0C                  PACKAGE RECORD                               
         EJECT                                                                  
* DSECT TO COVER BUY PROGRAM SCREENS                                            
*                                                                               
       ++INCLUDE FATWA                                                          
         SPACE 1                                                                
         ORG   TWAUSER                                                          
         SPACE 1                                                                
* GLOBAL SAVE FIELDS                                                            
*                                                                               
MODE     DS    X                   PROCESSING MODE - DISPLAY,CHANGE             
AGENCY   DS    CL2                 AGENCY                                       
CLIENT   DS    XL2                 PACKED CLIENT CODE                           
ESTIMATE DS    XL3                                                              
NETWORK  DS    CL4                                                              
PACKAGE  DS    X                                                                
PROGRAM  DS    CL6                                                              
ACTION   DS    X                   OVERLAY ACTION                               
SCREEN   DS    X                   SCREEN NUMBER                                
PAGES    DS    X                   NUMBER OF SAVED TWA PAGES                    
         DS    CL26                SPARE                                        
         EJECT                                                                  
       ++INCLUDE NEBUYFFD                                                       
