*          DATA SET NEBUYFCND  AT LEVEL 002 AS OF 05/24/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311FCD      DATE 05/24/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
UNTMGFH  DS    CL8                                                              
UNTMGF   DS    CL55    10   11   55  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10   68    9  A   P    N         T        Y              
UNTCOMH  DS    CL8                                                              
UNTCOM   DS    CL1     10   78    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    N         T        Y              
UNTMISSH DS    CL8                                                              
UNTMISS  DS    CL55    11   11   55  A   P    N         T        Y              
UNTDAH   DS    CL8                                                              
UNTDA    DS    CL11    11   68   11  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    N         T        Y              
UNTPREH  DS    CL8                                                              
UNTPRE   DS    CL1     12   11    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   P    N         T        Y              
UNTDAYH  DS    CL8                                                              
UNTDAY   DS    CL4     13   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   27    4  A   P    N         T        Y              
UNTTIMEH DS    CL8                                                              
UNTTIME  DS    CL11    13   38   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   52    7  A   P    N         T        Y              
UNTPROGH DS    CL8                                                              
UNTPROG  DS    CL16    13   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A   P    N         T        Y              
UNTLENH  DS    CL8                                                              
UNTLEN   DS    CL8     14   15    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   27   10  A   P    N         T        Y              
UNTPRDH  DS    CL8                                                              
UNTPRD   DS    CL8     14   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     14   52    9  A   P    N         T        Y              
UNTP1PCH DS    CL8                                                              
UNTP1PC  DS    CL6     14   63    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  A   P    N         T        Y              
UNTASSH  DS    CL8                                                              
UNTASS   DS    CL8     15   15    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   27    8  A   P    N         T        Y              
UNTACTH  DS    CL8                                                              
UNTACT   DS    CL10    15   38   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   52    8  A   P    N         T        Y              
UNTINTH  DS    CL8                                                              
UNTINT   DS    CL8     15   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A   P    N         T        Y              
UNTSHRH  DS    CL8                                                              
UNTSHR   DS    CL5     16   15    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   27    3  A   P    N         T        Y              
UNTHUTH  DS    CL8                                                              
UNTHUT   DS    CL7     16   38    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     16   52    6  A   P    N         T        Y              
UNTRATH  DS    CL8                                                              
UNTRAT   DS    CL7     16   63    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    17    2   11  A   P    N         T        Y              
UNTHAVEH DS    CL8                                                              
UNTHAVE  DS    CL3     17   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   27   10  A   P    N         T        Y              
UNTHSCH  DS    CL8                                                              
UNTHSC   DS    CL2     17   38    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   52    8  A   P    N         T        Y              
UNTHADJH DS    CL8                                                              
UNTHADJ  DS    CL6     17   63    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     18    2    9  A   P    N         T        Y              
UNTUCODH DS    CL8                                                              
UNTUCOD  DS    CL4     18   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18   27    8  A   P    N         T        Y              
UNTROTH  DS    CL8                                                              
UNTROT   DS    CL12    18   38   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18   52    8  A   P    N         T        Y              
UNTIMPH  DS    CL8                                                              
UNTIMP   DS    CL6     18   63    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A   P    N         T        Y              
UNTUPCTH DS    CL8                                                              
UNTUPCT  DS    CL6     19   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   27    4  A   P    N         T        Y              
UNTFEEDH DS    CL8                                                              
UNTFEED  DS    CL6     19   38    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   52    5  A   P    N         T        Y              
UNTAFFH  DS    CL8                                                              
UNTAFF   DS    CL8     19   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   P    N         T        Y              
UNTNTIH  DS    CL8                                                              
UNTNTI   DS    CL5     20   15    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20   27    8  A   P    N         T        Y              
UNTNSIH  DS    CL8                                                              
UNTNSI   DS    CL5     20   38    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     20   52    9  A   P    N         T        Y              
UNTSREPH DS    CL8                                                              
UNTSREP  DS    CL3     20   63    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A   P    N         T        Y              
UNTOTHH  DS    CL8                                                              
UNTOTH   DS    CL60    21   15   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A   P    N         T        Y              
UNTBUYDH DS    CL8                                                              
UNTBUYD  DS    CL9     22   15    9  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     22   27    9  A   P    N         T        Y              
UNTACTDH DS    CL8                                                              
UNTACTD  DS    CL8     22   38    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     22   52    6  A   P    N         T        Y              
UNTSTATH DS    CL8                                                              
UNTSTAT  DS    CL3     22   63    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  A   P    N         T        Y              
UNTCOM1H DS    CL8                                                              
UNTCOM1  DS    CL60    23   15   60  A   U    N         T        Y              
UNTCOM2H DS    CL8                                                              
UNTCOM2  DS    CL60    24   15   60  A   U    N         T        Y              
UNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
UNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1280 BYTES                            
