*          DATA SET NEBUYF9CD  AT LEVEL 004 AS OF 12/07/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311F9D      DATE 12/07/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
COPFCLTH DS    CL8                                                              
COPFCLT  DS    CL3     10   21    3  A  U N             T        Y              
COPFCLDH DS    CL8                                                              
COPFCLD  DS    CL20    10   28   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  A  P N             T        Y              
COPFESTH DS    CL8                                                              
COPFEST  DS    CL3     11   21    3  A  U N             T        Y              
COPFESDH DS    CL8                                                              
COPFESD  DS    CL40    11   28   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
COPFRPKH DS    CL8                                                              
COPFRPK  DS    CL3     12   21    3  A  U N             T        Y              
COPFPKDH DS    CL8                                                              
COPFPKD  DS    CL25    12   28   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
COPFSTRH DS    CL8                                                              
COPFSTR  DS    CL8     13   21    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   33   12  A  P N             T        Y              
COPFENDH DS    CL8                                                              
COPFEND  DS    CL8     13   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
COPFRPRH DS    CL8                                                              
COPFRPR  DS    CL3     14   21    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
COPFRLNH DS    CL8                                                              
COPFRLN  DS    CL3     15   21    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
COPFRPAH DS    CL8                                                              
COPFRPA  DS    CL1     16   21    1  A  U N             T        Y              
COPFRPCH DS    CL8                                                              
COPFRPC  DS    CL17    16   28   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    17    2   18  A  P N             T        Y              
COPFRTRH DS    CL8                                                              
COPFRTR  DS    CL1     17   21    1  A  U N             T        Y              
COPFRTCH DS    CL8                                                              
COPFRTC  DS    CL16    17   28   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19    2   10  A  P N             T        Y              
COPTOPKH DS    CL8                                                              
COPTOPK  DS    CL3     19   21    3  A  U N             T        Y              
COPTPKDH DS    CL8                                                              
COPTPKD  DS    CL25    19   28   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
COPYESH  DS    CL8                                                              
COPYES   DS    CL3     20   21    3  A  U N             T        Y              
COPPRDSH DS    CL8                                                              
COPPRDS  DS    CL25    20   28   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21    2   11  A  P N             T        Y              
COPNPRGH DS    CL8                                                              
COPNPRG  DS    CL6     21   21    6  A  U N             T        Y              
COPTABH  DS    CL8                                                              
COPTAB   DS    CL1     22   21    1  A  U N             T        Y              
COPSUMH  DS    CL8                                                              
COPSUM   DS    CL60    24   15   60  A  P N             T        Y              
COPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
COPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 680  BYTES                            
