*          DATA SET NEBUYE3D   AT LEVEL 003 AS OF 06/26/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311E3D      DATE 06/26/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL41    10   13   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    10   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  P N             T        Y              
PRON0P1H DS    XL8                                                              
PRON0P1  DS    CL63    11   11   63  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  P N             T        Y              
PRON1P1H DS    XL8                                                              
PRON1P1  DS    CL63    12   11   63  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  P N             T        Y              
PRON2P1H DS    XL8                                                              
PRON2P1  DS    CL63    13   11   63  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 344  BYTES                            
