*          DATA SET NEBUYE1D   AT LEVEL 004 AS OF 10/30/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311E1D      DATE 10/30/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6     10    6    6  A  P N             T        Y              
UNTLENH  DS    XL8                                                              
UNTLEN   DS    CL5     10   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   40    6  A  P N             T        Y              
UNTACTH  DS    XL8                                                              
UNTACT   DS    CL10    10   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    6   10  A  P N             T        Y              
UNTCSPH  DS    XL8                                                              
UNTCSP   DS    CL1     11   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   40   11  A  P N             T        Y              
UNTINTH  DS    XL8                                                              
UNTINT   DS    CL8     11   53    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    6    7  A  P N             T        Y              
UNTOPTH  DS    XL8                                                              
UNTOPT   DS    CL50    12   20   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL58    14    6   58  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    15    6   70  A  P N             T        Y              
UNTPRD1H DS    XL8                                                              
UNTPRD1  DS    CL4     16    6    4  A  U N             T        Y              
UNTPCT1H DS    XL8                                                              
UNTPCT1  DS    CL6     16   17    6  A  U N             T        Y              
UNTFED1H DS    XL8                                                              
UNTFED1  DS    CL7     16   28    7  A  U N             T        Y              
UNTTFD1H DS    XL8                                                              
UNTTFD1  DS    CL35    16   40   35  A  U N             T        Y              
UNTPRD2H DS    XL8                                                              
UNTPRD2  DS    CL4     17    6    4  A  U N             T        Y              
UNTPCT2H DS    XL8                                                              
UNTPCT2  DS    CL6     17   17    6  A  U N             T        Y              
UNTFED2H DS    XL8                                                              
UNTFED2  DS    CL7     17   28    7  A  U N             T        Y              
UNTTFD2H DS    XL8                                                              
UNTTFD2  DS    CL35    17   40   35  A  U N             T        Y              
UNTPRD3H DS    XL8                                                              
UNTPRD3  DS    CL4     18    6    4  A  U N             T        Y              
UNTPCT3H DS    XL8                                                              
UNTPCT3  DS    CL6     18   17    6  A  U N             T        Y              
UNTFED3H DS    XL8                                                              
UNTFED3  DS    CL7     18   28    7  A  U N             T        Y              
UNTTFD3H DS    XL8                                                              
UNTTFD3  DS    CL35    18   40   35  A  U N             T        Y              
UNTPRD4H DS    XL8                                                              
UNTPRD4  DS    CL4     19    6    4  A  U N             T        Y              
UNTPCT4H DS    XL8                                                              
UNTPCT4  DS    CL6     19   17    6  A  U N             T        Y              
UNTFED4H DS    XL8                                                              
UNTFED4  DS    CL7     19   28    7  A  U N             T        Y              
UNTTFD4H DS    XL8                                                              
UNTTFD4  DS    CL35    19   40   35  A  U N             T        Y              
UNTPRD5H DS    XL8                                                              
UNTPRD5  DS    CL4     20    6    4  A  U N             T        Y              
UNTPCT5H DS    XL8                                                              
UNTPCT5  DS    CL6     20   17    6  A  U N             T        Y              
UNTFED5H DS    XL8                                                              
UNTFED5  DS    CL7     20   28    7  A  U N             T        Y              
UNTTFD5H DS    XL8                                                              
UNTTFD5  DS    CL35    20   40   35  A  U N             T        Y              
UNTPRD6H DS    XL8                                                              
UNTPRD6  DS    CL4     21    6    4  A  U N             T        Y              
UNTPCT6H DS    XL8                                                              
UNTPCT6  DS    CL6     21   17    6  A  U N             T        Y              
UNTFED6H DS    XL8                                                              
UNTFED6  DS    CL7     21   28    7  A  U N             T        Y              
UNTTFD6H DS    XL8                                                              
UNTTFD6  DS    CL35    21   40   35  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23    6    7  A  P N             T        Y              
UNTCOM1H DS    XL8                                                              
UNTCOM1  DS    CL60    23   15   60  A  U N             T        Y              
UNTCOM2H DS    XL8                                                              
UNTCOM2  DS    CL60    24   15   60  A  U N             T        Y              
UNTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
UNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1000 BYTES                            
