*          DATA SET NEBUYF7D   AT LEVEL 001 AS OF 06/05/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311F7D      DATE 06/05/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
INUHED1H DS    CL8                                                              
INUHED1  DS    CL78    10    2   78   A    P    N         T         Y           
INUHED2H DS    CL8                                                              
INUHED2  DS    CL78    11    2   78   A    P    N         T         Y           
INUDAT1H DS    CL8                                                              
INUDAT1  DS    CL78    12    2   78   A    P    N         T         Y           
INUDAT2H DS    CL8                                                              
INUDAT2  DS    CL78    13    2   78   A    P    N         T         Y           
INUDAT3H DS    CL8                                                              
INUDAT3  DS    CL78    14    2   78   A    P    N         T         Y           
INUDAT4H DS    CL8                                                              
INUDAT4  DS    CL78    15    2   78   A    P    N         T         Y           
INUDAT5H DS    CL8                                                              
INUDAT5  DS    CL78    16    2   78   A    P    N         T         Y           
INUDAT6H DS    CL8                                                              
INUDAT6  DS    CL78    17    2   78   A    P    N         T         Y           
INUDAT7H DS    CL8                                                              
INUDAT7  DS    CL78    18    2   78   A    P    N         T         Y           
INUDAT8H DS    CL8                                                              
INUDAT8  DS    CL78    19    2   78   A    P    N         T         Y           
INUDAT9H DS    CL8                                                              
INUDAT9  DS    CL78    20    2   78   A    P    N         T         Y           
INUDATAH DS    CL8                                                              
INUDATA  DS    CL78    21    2   78   A    P    N         T         Y           
INUDATBH DS    CL8                                                              
INUDATB  DS    CL78    22    2   78   A    P    N         T         Y           
INUDATCH DS    CL8                                                              
INUDATC  DS    CL78    23    2   78   A    P    N         T         Y           
INUDATDH DS    CL8                                                              
INUDATD  DS    CL78    24    2   78   A    P    N         T         Y           
INULAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
INUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1293 BYTES                            
