*          DATA SET NEBUYFDDS  AT LEVEL 029 AS OF 04/08/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311FDD      DATE 04/08/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4     10    2    4  A  P N             T        Y              
PAKNAMEH DS    CL8                                                              
PAKNAME  DS    CL16    10   15   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   39    6  A  P N             T        Y              
PAKNAM2H DS    CL8                                                              
PAKNAM2  DS    CL16    10   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
PAKDPNH  DS    CL8                                                              
PAKDPN   DS    CL8     11   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   39    7  A  P N             T        Y              
PAKGCPMH DS    CL8                                                              
PAKGCPM  DS    CL8     11   53    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
PAKSTATH DS    CL8                                                              
PAKSTAT  DS    CL8     12   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
PAKOPTH  DS    CL8                                                              
PAKOPT   DS    CL60    13   15   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  P N             T        Y              
PAKCOSTH DS    CL8                                                              
PAKCOST  DS    CL8     14   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16    2   11  A  P N             T        Y              
PAKINTH  DS    CL8                                                              
PAKINT   DS    CL10    16   15   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    16   31   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17    2   10  A  P N             T        Y              
PAKHSCH  DS    CL8                                                              
PAKHSC   DS    CL2     17   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   31    9  A  P N             T        Y              
PAKDBSEH DS    CL8                                                              
PAKDBSE  DS    CL1     17   45    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   60    6  A  P N             T        Y              
PAKFILTH DS    CL8                                                              
PAKFILT  DS    CL6     17   70    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
PAKHADJH DS    CL8                                                              
PAKHADJ  DS    CL6     18   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   31    6  A  P N             T        Y              
PAKLENH  DS    CL8                                                              
PAKLEN   DS    CL3     18   45    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19    2    9  A  P N             T        Y              
PAKUPCTH DS    CL8                                                              
PAKUPCT  DS    CL10    19   15   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   31   11  A  P N             T        Y              
PAKHAVEH DS    CL8                                                              
PAKHAVE  DS    CL3     19   45    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20    2    9  A  P N             T        Y              
PAKFPCTH DS    CL8                                                              
PAKFPCT  DS    CL10    20   15   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   31    8  A  P N             T        Y              
PAKHTYPH DS    CL8                                                              
PAKHTYP  DS    CL1     20   45    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21    2   12  A  P N             T        Y              
PAKMALLH DS    CL8                                                              
PAKMALL  DS    CL5     21   15    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   31    9  A  P N             T        Y              
PAKUCODH DS    CL8                                                              
PAKUCOD  DS    CL5     21   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22    2   11  A  P N             T        Y              
PAKSREPH DS    CL8                                                              
PAKSREP  DS    CL3     22   15    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   31   11  A  P N             T        Y              
PAKIMPCH DS    CL8                                                              
PAKIMPC  DS    CL7     22   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    23    2   12  A  P N             T        Y              
PAKPOSDH DS    CL8                                                              
PAKPOSD  DS    CL1     23   15    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   31   11  A  P N             T        Y              
PAKAUDGH DS    CL8                                                              
PAKAUDG  DS    CL4     23   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   53    4  A  P N             T        Y              
PAKAUDCH DS    CL8                                                              
PAKAUDC  DS    CL16    23   60   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    24    2   11  A  P N             T        Y              
PAKLSTAH DS    CL8                                                              
PAKLSTA  DS    CL30    24   15   30  A  P N             T        Y              
PAKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PAKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 896  BYTES                            
