*          DATA SET NEBUYFED   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311FED      DATE 12/01/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
HELHED1H DS    CL8                                                              
HELHED1  DS    CL78    10    2   78   A    P    N         T         Y           
HELHED2H DS    CL8                                                              
HELHED2  DS    CL78    11    2   78   A    P    N         T         Y           
HELLIN1H DS    CL8                                                              
HELLIN1  DS    CL78    12    2   78   A    P    N         T         Y           
HELLIN2H DS    CL8                                                              
HELLIN2  DS    CL78    13    2   78   A    P    N         T         Y           
HELLIN3H DS    CL8                                                              
HELLIN3  DS    CL78    14    2   78   A    P    N         T         Y           
HELLIN4H DS    CL8                                                              
HELLIN4  DS    CL78    15    2   78   A    P    N         T         Y           
HELLIN5H DS    CL8                                                              
HELLIN5  DS    CL78    16    2   78   A    P    N         T         Y           
HELLIN6H DS    CL8                                                              
HELLIN6  DS    CL78    17    2   78   A    P    N         T         Y           
HELLIN7H DS    CL8                                                              
HELLIN7  DS    CL78    18    2   78   A    P    N         T         Y           
HELLIN8H DS    CL8                                                              
HELLIN8  DS    CL78    19    2   78   A    P    N         T         Y           
HELLIN9H DS    CL8                                                              
HELLIN9  DS    CL78    20    2   78   A    P    N         T         Y           
HELLINAH DS    CL8                                                              
HELLINA  DS    CL78    21    2   78   A    P    N         T         Y           
HELLINBH DS    CL8                                                              
HELLINB  DS    CL78    22    2   78   A    P    N         T         Y           
HELLINCH DS    CL8                                                              
HELLINC  DS    CL78    23    2   78   A    P    N         T         Y           
HELLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1207 BYTES                            
