*          DATA SET NEBUYF6D   AT LEVEL 002 AS OF 04/16/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311F6D      DATE 04/16/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8     10    2    8   A    P    N         T         Y           
PUPNEWH  DS    CL8                                                              
PUPNEW   DS    CL60    10   15   60   A    U    H         T         Y           
         DS    CL8                                                              
         DS    CL8     12    2    8   A    P    N         T         Y           
PUPYESH  DS    CL8                                                              
PUPYES   DS    CL3     12   15    3   A    U    H         T         Y           
PUPPRGDH DS    CL8                                                              
PUPPRGD  DS    CL25    12   24   25   A    P    N         T         Y           
PUPSUMH  DS    CL8                                                              
PUPSUM   DS    CL60    14   15   60   A    P    N         T         Y           
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 215  BYTES                            
