*          DATA SET NEBUYF2D   AT LEVEL 004 AS OF 10/10/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T311F2D      DATE 10/10/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11    10    2   11  A   P    N         T        Y              
COPFCLTH DS    CL8                                                              
COPFCLT  DS    CL3     10   21    3  A   U    N         T        Y              
COPFCLDH DS    CL8                                                              
COPFCLD  DS    CL20    10   28   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  A   P    N         T        Y              
COPFESTH DS    CL8                                                              
COPFEST  DS    CL3     11   21    3  A   U    N         T        Y              
COPFESDH DS    CL8                                                              
COPFESD  DS    CL40    11   28   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A   P    N         T        Y              
COPFRPKH DS    CL8                                                              
COPFRPK  DS    CL3     12   21    3  A   U    N         T        Y              
COPFPKDH DS    CL8                                                              
COPFPKD  DS    CL25    12   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A   P    N         T        Y              
COPFRPRH DS    CL8                                                              
COPFRPR  DS    CL3     13   21    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    14    2   16  A   P    N         T        Y              
COPFRPAH DS    CL8                                                              
COPFRPA  DS    CL1     14   21    1  A   U    N         T        Y              
COPFRPCH DS    CL8                                                              
COPFRPC  DS    CL17    14   28   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  A   P    N         T        Y              
COPTOPKH DS    CL8                                                              
COPTOPK  DS    CL3     16   21    3  A   U    N         T        Y              
COPTPKDH DS    CL8                                                              
COPTPKD  DS    CL25    16   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     17    2    9  A   P    N         T        Y              
COPYESH  DS    CL8                                                              
COPYES   DS    CL3     17   21    3  A   U    N         T        Y              
COPPRDSH DS    CL8                                                              
COPPRDS  DS    CL25    17   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    18    2   11  A   P    N         T        Y              
COPFRU1H DS    CL8                                                              
COPFRU1  DS    CL12    18   21   12  A   U    N         T        Y              
COPFRU2H DS    CL8                                                              
COPFRU2  DS    CL12    18   35   12  A   U    N         T        Y              
COPFRU3H DS    CL8                                                              
COPFRU3  DS    CL12    18   49   12  A   U    N         T        Y              
COPFRU4H DS    CL8                                                              
COPFRU4  DS    CL12    18   63   12  A   U    N         T        Y              
COPFRU5H DS    CL8                                                              
COPFRU5  DS    CL12    19   21   12  A   U    N         T        Y              
COPFRU6H DS    CL8                                                              
COPFRU6  DS    CL12    19   35   12  A   U    N         T        Y              
COPFRU7H DS    CL8                                                              
COPFRU7  DS    CL12    19   49   12  A   U    N         T        Y              
COPFRU8H DS    CL8                                                              
COPFRU8  DS    CL12    19   63   12  A   U    N         T        Y              
COPFRU9H DS    CL8                                                              
COPFRU9  DS    CL12    20   21   12  A   U    N         T        Y              
COPFRUAH DS    CL8                                                              
COPFRUA  DS    CL12    20   35   12  A   U    N         T        Y              
COPFRUBH DS    CL8                                                              
COPFRUB  DS    CL12    20   49   12  A   U    N         T        Y              
COPFRUCH DS    CL8                                                              
COPFRUC  DS    CL12    20   63   12  A   U    N         T        Y              
COPFRUDH DS    CL8                                                              
COPFRUD  DS    CL12    21   21   12  A   U    N         T        Y              
COPFRUEH DS    CL8                                                              
COPFRUE  DS    CL12    21   35   12  A   U    N         T        Y              
COPFRUFH DS    CL8                                                              
COPFRUF  DS    CL12    21   49   12  A   U    N         T        Y              
COPTABH  DS    CL8                                                              
COPTAB   DS    CL1     22   21    1  A   U    N         T        Y              
COPSUMH  DS    CL8                                                              
COPSUM   DS    CL60    24   15   60  A   P    N         T        Y              
COPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
COPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 816  BYTES                            
