*          DATA SET NEDPTTAB   AT LEVEL 004 AS OF 05/11/06                      
*---------------------------------------------------------------------*         
*             TABLE OF 1-CHARACTER NETWORK DAYPARTS                   *         
*---------------------------------------------------------------------*         
                                                                                
* TABLE FORMAT:                                                                 
* CL2  - DAYPART CODE                                                           
* CL8  - DAYPART DESCRIPTION                                                    
                                                                                
DAYPARTS DS    0H                                                               
         DC    CL2'D ',CL8'DAYTIME'                                             
         DC    CL2'F ',CL8'FRINGE'                                              
         DC    CL2'P ',CL8'PRIME'                                               
         DC    CL2'K ',CL8'KIDS'                                                
         DC    CL2'S ',CL8'SPORTS'                                              
         DC    CL2'N ',CL8'NEWS'                                                
         DC    CL2'L ',CL8'LATE'                                                
         DC    CL2'Y ',CL8'YOUTH'                                               
         DC    CL2'E ',CL8'EARLY'                                               
         DC    CL2'T ',CL8'TEENS'                                               
         DC    CL2'C ',CL8'CABLE'                                               
         DC    CL2'X ',CL8'SYND'                                                
         DC    CL2'I ',CL8'SPECIAL'                                             
         DC    CL2'O ',CL8'OLYMPICS'                                            
         DC    CL2'W ',CL8'WEEKEND'                                             
         DC    CL2'U ',CL8'UNWIRED'                                             
         DC    CL2'V ',CL8'OVERNITE'                                            
         DC    CL2'W ',CL8'WKNDPM'                                              
         DC    CL2'M ',CL8'WKNDAM'                                              
         DC    CL2'H ',CL8'OTHER'                                               
         DC    CL2'B ',CL8'CBLSPORT'                                            
         DC    CL2'R ',CL8'RADIO'                                               
         DC    CL2'J ',CL8'PROMO-ID'                                            
         DC    CL2'A ',CL8'ACCESS'                                              
         DC    CL2'Q ',CL8'INTRACTV'                                            
         DC    XL1'FF',CL8' '      END OF TABLE                                 
