*          DATA SET NEEDICT    AT LEVEL 003 AS OF 06/10/92                      
          SPACE 1                                                               
* NETPAK'S MAP OF THE APPLICATION SPECIFIC PORTION OF THE EDICT RECORD          
* THIS AREA ORGS TO THE FIELD EDFAPPL IN DDEDICTFIL                             
         SPACE 1                                                                
NEEDAREA EQU   *                                                                
NEEDMED  DS    CL1                 MEDIA                                        
NEEDCLT  DS    CL3                 CLIENT                                       
NEEDEST  DS    CL3                 ESTIMATE                                     
NEEDNET  DS    CL4                 NETWORK                                      
NEEDPAK  DS    CL3                 PACKAGE                                      
NEEDREQ  DS    CL3                 REQUESTOR INITIALS                           
NEEDPRG  DS    CL2                 NETPAK PROGRAM REQUESTED                     
