*          DATA SET NEGENSEQ   AT LEVEL 002 AS OF 09/13/93                      
*                 *** NETPAK SEQUENCE RECORD ***                                
         SPACE 2                                                                
NESQREC  DSECT                                                                  
NESQKEY  DS    0XL20                                                            
NESQTYPE DS    XL1'30'             RECORD CODE                                  
NESQAM   DS    XL1                 AGENCY/MEDIA                                 
         DS    XL2                                                              
NESQNUM  DS    F                   SEQUENCE NUMBER                              
         DS    XL12                                                             
*                                                                               
NESQLEN  DS    XL2                 RECORD LENGTH                                
NESQCNTL DS    XL1                                                              
NESQLINK DS    XL4                                                              
         SPACE 2                                                                
*                                                                               
NESQELEM DS    0X                                                               
*                                                                               
*     '01' ELEMENT - ACTIVITY ELEMENT                                           
*                                                                               
NESQEL01 DS    XL1'01'             ELEMENT CODE                                 
NESQEL1L DS    XL1                 ELEMENT LENGTH                               
         DS    XL2                 SPARE                                        
NESQEL1Q EQU   *-NESQEL01                                                       
         SPACE 2                                                                
