*          DATA SET NEGENUNIT  AT LEVEL 071 AS OF 01/26/21                      
*        NET UNIT RECORD                                                        
*                                                                               
NURECD   DSECT                                                                  
NUKEY    DS    0CL20               ACTIVE KEY                                   
NUKTYPE  DS    CL1                 TYPE X'04'                                   
NUKTYPEQ EQU   X'04'                                                            
NUKAM    DS    CL1                 AGENCY/MEDIA                                 
NUKCLT   DS    CL2                 CLIENT                                       
NUKDATE  DS    CL2                 AIR DATE                                     
NUKTIME  DS    CL1                 START 1/4 HOUR                               
NUKNET   DS    CL4                 NETWORK                                      
NUKPROG  DS    CL6                 PROGRAM CODE                                 
NUKEST   DS    CL1                 ESTIMATE                                     
NUKSUB   DS    CL1                 SUB-LINE (X'C1' OR GREATER IS TRAFFC         
NUKSUBTQ EQU   X'C1'               1ST TRAFFIC UNIT                             
NUKDP    DS    CL1                 DAYPART                                      
*                                                                               
NUKSTAT  DS    CL1                                                              
NUKSTDEL EQU   X'80'               =DELETED                                     
NUKSTNET EQU   0                   =NETWORK                                     
NUKSTCAB EQU   X'01'               =CABLE                                       
NUKSTSYN EQU   X'02'               =SYNDICATION                                 
NUKSTOTH EQU   X'03'               =OTHER                                       
*                                                                               
NUDA     DS    CL4                 DISK ADDRESS                                 
*                                                                               
         ORG   NUKTYPE                                                          
NUKPKEY  DS    0CL20               PASSIVE KEY                                  
NUKPTYPE DS    CL1                 TYPE X'84'                                   
NUKPTYPQ EQU   X'84'                                                            
NUKPAM   DS    CL1                 AGENCY/MEDIA                                 
NUKPCLT  DS    CL2                 CLIENT                                       
NUKPNET  DS    CL4                 NETWORK                                      
NUKPPROG DS    CL6                 PROGRAM                                      
NUKPDATE DS    CL2                 AIR DATE                                     
NUKPEST  DS    CL1                 ESTIMATE                                     
NUKPSUB  DS    CL1                 SUB-LINE                                     
NUKPDP   DS    CL1                 DAYPART                                      
         DS    CL1                 SPARE                                        
*                                                                               
         ORG   NUKTYPE                                                          
NUKDKEY  DS    0CL20               DAY-TIME PASSIVE KEY                         
NUKDTYPE DS    CL1                 TYPE X'94'                                   
NUKDTYPQ EQU   X'94'                                                            
NUKDAM   DS    CL1                 AGENCY/MEDIA                                 
NUKDCLT  DS    CL2                 CLIENT                                       
NUKDEST  DS    CL1                 ESTIMATE                                     
NUKDNET  DS    CL4                 NETWORK                                      
NUKDDAY  DS    CL1                 DAY CODE                                     
*                                  X'01'-X'07' = MON .. SUN                     
*                                  X'08'       = M-F                            
*                                  X'09'       = M-SUN                          
*                                  X'0A'       = VARIOUS                        
NUKDTIME DS    CL1                 START QUARTER HOUR                           
NUKDPROG DS    CL6                 PROGRAM                                      
NUKDDATE DS    CL2                 AIR DATE                                     
NUKDSUB  DS    CL1                 SUB-LINE                                     
*                                                                               
NURLEN   DS    CL2                 RECORD LENGTH                                
NURSTAT  DS    CL1                 RECORD STATUS                                
NURSTDEL EQU   X'80'               =DELETED                                     
NURSTNET EQU   0                   =NETWORK                                     
NURSTCAB EQU   X'01'               =CABLE                                       
NURSTSYN EQU   X'02'               =SYNDICATION                                 
NURSTOTH EQU   X'03'               =OTHER                                       
*                                                                               
NURLINK  DS    CL4                 LINK FIELD                                   
NUDATA   DS    0C                                                               
*                                  RECORD ELEMENTS                              
*        DC    X'01'               MAIN UNIT DATA                               
*        DC    X'02'               ADDITIONAL DATA ELEMENT                      
*        DC    X'03'               SPECIAL RATE DATA                            
*        DC    X'04'               COMMENT                                      
*        DC    X'05'               UNIQUE ID ELEMENT                            
*        DC    X'06'               MAKE-GOOD/MISSED DATA                        
*        DC    X'08'               FILTER ELEMENT                               
*        DC    X'09'               AUDIT GROUP ELEMENT                          
*        DC    X'10'               BILLING ELEMENT                              
*        DC    X'12'               PAYING ELEMENT                               
*        DC    X'13'               BILLING FLIGHT ELEMENT                       
*        DC    X'14'               PRUDUCT ELEMENT                              
*        DC    X'15'               MAX COST ELEMENT                             
*        DC    X'16'               CUT-IN LIST                                  
*        DC    X'17'               CUT-IN COMMERCIAL ELEMENT (TRAFFIC)          
*        DC    X'18'               ADDITIONAL DATA ELEMENT                      
*        DC    X'19'               PRODUCT ELEMENT (EXP PROD CODE)              
*        DC    X'21'               TRAFFIC COMMERCIAL ASSIGNMENT                
*        DC    X'22'               TRAFFIC FEED (UNIT IS FEED)                  
*        DC    X'23'               TRAFFIC FEED(S) ON NATIONAL UNIT             
*        DC    X'31'               ESTIMATED UNIVERSES                          
*        DC    X'33'               ESTIMATED VPHS                               
*        DC    X'35'               ESTIMATED HUT/SHARE/RTG                      
*        DC    X'43'               ACTUAL VPHS                                  
*        DC    X'45'               ACTUAL HUT/SHARE/RTG                         
*        DC    X'5D'               EVN BOOK SPECIFICATION                       
*        DC    X'5E'               NTI BOOK SPECIFICATION                       
*        DC    X'60'               "OTHER" FIELD INFO ELEMENT                   
*        DC    X'62'               NAD INFORMATION ELEMENT                      
*        DC    X'68'               LAST ACTIVITY LOG ELEMENT                    
*        DC    X'71'               NET VALUES                                   
*        DC    X'74'               COS2 ELEMENT                                 
*        DC    X'75'               UPLOAD (SERIAL, CONTRACT, DEAL #'S)          
*        DC    X'76'               ASSIGNED COST CREDIT ELEMENT                 
*        DC    X'90'               NEW KEY ELEMENT ON DAY CHANGE                
*        DC    X'99'               ACTIVITY ELEMENT                             
*        DC    X'B1'               PACKAGE GUARANTEE FACTOR                     
*        DC    X'B2'               DEMO GUARANTEE FACTOR                        
*        DC    X'B3'               NEW PACKAGE GUARANTEE FACTOR                 
*        DC    X'B4'               NEW DEMO GUARANTEE FACTOR                    
*        DC    X'C1'               USER UNIVERSE ELEMENT                        
*        DC    X'C3'               USER VPH ELEMENT                             
*        DC    X'DD'               DEMO OVERRIDE/ESTIMATED DEMOS                
*        DC    X'DE'               DEMO OVERRIDE/MANUAL (ACTUALS)               
*                                                                               
*                                                                               
*        <   > MAIN DATA ELEMENT                                                
*                                                                               
NUMAINEL DS    CL1                 ELEMENT CODE X'01'                           
NUMAINEQ EQU   X'01'                                                            
NUMAINLN DS    CL1                 ELEMENT LENGTH 80                            
NUPACK   DS    CL1                 PACKAGE NUMBER                               
NUPACKST DS    CL1                 PACKAGE STATUS                               
NUPACKFR EQU   X'80'               =FROZEN                                      
NUPACKLO EQU   X'20'               =LOCKED                                      
NUPACKPR EQU   X'10'               =DO NOT PRINT                                
NUPACKNC EQU   X'04'               =NON-COM INTEG                               
NUPACKAO EQU   X'02'               =AUDIT IS ON                                 
NUPACKND EQU   X'01'               =NO-SHOW DELETE                              
*                                                                               
NUUNITST DS    CL1                 UNIT STATUS                                  
NUUNIMIN EQU   X'80'               =MINUS UNIT                                  
NUUNIPRE EQU   X'40'               =PREEMPT                                     
NUUNIACI EQU   X'20'               =ACTUAL COST INP.                            
NUUNIASN EQU   X'10'               =AUTO SEED NTI                               
NUUNIGCI EQU   X'08'               =ASSIGNED COST INP.                          
NUUINPFB EQU   X'04'               =PFB                                         
NUUNIMSD EQU   X'02'               =MISSED                                      
NUUINMGD EQU   X'01'               =MAKE-GOOD                                   
*                                                                               
NUPRD    DS    CL1                 ALLOCATED PRODUCT CODE                       
*                                  (0=UNALLOCATED)                              
NUPRD2   DS    CL1                 SECOND ALLOCATION                            
NUP1SHR  DS    CL2                 BRAND 1 SHARE (2 DEC)                        
NUPROGNM DS    CL16                PROGRAM NAME                                 
NUPRFILT DS    CL3                 PROGRAM FILTERS                              
NULEN    DS    CL1                 LENGTH IN SECONDS (TOTAL)                    
NUDAY    DS    CL1                 DAY BITS (0=SPARE 1=MON.. 7=SUN)             
NUDAYMOQ EQU   X'40'               =MONDAY                                      
NUDAYTUQ EQU   X'20'               =TUESDAY                                     
NUDAYWEQ EQU   X'10'               =WEDNESDAY                                   
NUDAYTHQ EQU   X'08'               =THURSDAY                                    
NUDAYFRQ EQU   X'04'               =FRIDAY                                      
NUDAYSAQ EQU   X'02'               =SATURDAY                                    
NUDAYSUQ EQU   X'01'               =SUNDAY                                      
*                                                                               
NUTIME   DS    CL4                 MILITARY START-END TIME                      
         ORG   NUTIME                                                           
NUTIMEST DS    XL2                 MILITARY START TIME                          
NUTIMEEN DS    XL2                 MILITARY END TIME                            
NUAFFTIM DS    CL2                 AFFIDAVIT MILITARY TIME                      
NUASSIGN DS    CL4                 ASSIGNED COST (CENTS)                        
NUACTUAL DS    CL4                 ACTUAL COST (CENTS)                          
NUINTEG  DS    CL4                 INTEGRATION (CENTS)                          
NUFEED   DS    CL2                 FEED U.S COVER (2 DEC)                       
NUUNIV   DS    CL2                 UNIVERSE PCT.(2 DEC)                         
NUIMPACT DS    CL2                 IMPACT PCT. (2 DEC)                          
NUNTI    DS    CL2                 NTI CODE                                     
NUNSI    DS    CL2                 NSI CODE                                     
NUUNCODE DS    CL2                 UNIVERSE CODE                                
NUFEEDMG DS    CL3                 FEED MKTGROUP ID/NUMBER                      
NUHUTAVE DS    CL1                 HUT AVERAGEING USED W/M/Q                    
NUHUTSCM DS    CL1                 HUT SCHEME (OR X'00')                        
NUHUTPCT DS    CL2                 HUT PERCENT OVERRIDE (2 DEC)                 
NUACTWHY DS    CL1                 REASON FOR LAST ACTIVITY                     
*                                  X'80'=NEW BUY                                
*                                  X'40'=BRAND ALLOCATION                       
*                                  X'20'=ASSIGNED COST CHANGE                   
*                                  X'10'=COMMENT CHANGE                         
*                                  X'08'=DEMOGRAPHIC OVERRIDE                   
*                                  X'04'=MAKE-GOOD                              
*                                  X'02'=CONVERSION PROGRAM                     
*                                  X'01'=COPIED UNIT                            
NUSUBPRT DS    XL1                 SUB-LINE PRINT - ZERO FOR FIRST              
*                                  AND ONLY ELSE SUB-LINE NUMBER                
NUUNST2  DS    CL1                 UNIT STATUS 2                                
NUST2GHD EQU   X'80'               X'80' = GET HUTS FROM DEMO FILE              
NUST252W EQU   X'40'               X'40' = 52 WEEK HUT CALENDAR                 
NUST2PFR EQU   X'20'               =PRODUCT ALLOCATION FROZEN                   
NUST2LFR EQU   X'10'               =LENGTH FROZEN FOR ALLOCATION                
NUST2UCU EQU   X'08'               X'08' = UNIT HAS CABLE UNIVERSES             
NUST2ZAL EQU   X'04'               =1ST PRD HAS 0 ALLOCATION                    
NUST2PUP EQU   X'02'               X'02' = PUP UNIT                             
NUST2MGD EQU   X'01'               X'01' = M/G DEMO RETRIEVAL                   
*                                                                               
NUMARKET DS    CL2                 'MARKET' NUMBER FOR PROG. READ               
NUALPHA  DS    CL2                 AGENCY ALPHA CODE FOR UNIV. READ             
NUSREP   DS    XL2                 SPECIAL REP CODE (BINARY)                    
NULEN1   DS    XL1                 LENGTH OF FIRST PARTNER OF PIGGY             
NUPOSTDT DS    CL1                 POSTING DATA TYPE --- D=DIARY                
*                                  A=ASCRIBED I=INTEGRATED C=CONFORMED          
NUXFRAGY DS    XL1                 ATT TRANSFER AGENCY #                        
NUHUTTYP DS    CL1                 HUT TYPE                                     
NUMAINLQ EQU   *-NUMAINEL                                                       
*                                                                               
*                                                                               
*        <   > SECONDARY STANDARD DATA ELEMENT                                  
*                                                                               
NUSDRD   DSECT                                                                  
NUSDREL  DS    CL1                 ELEMENT CODE X'02'                           
NUSDRELQ EQU   X'02'                                                            
NUSDRLEN DS    CL1                 ELEMENT LENGTH (20)                          
*                                                                               
NUSDST3  DS    CL1                 UNIT STATUS 3                                
NST3ACOQ EQU   X'80'               X'80' ASSIGNED COST OVERRIDE                 
NST3UCSQ EQU   X'40'               X'40' UNIT IS A COPY SPLIT                   
NST3SNTQ EQU   X'20'               X'20' SEED SEEDED NTI                        
NST3PUPQ EQU   X'10'               X'10' UNIT WAS CREATED IN PUP                
NST3WABQ EQU   X'08'               X'08' WINDOW BUY USE ALT BOOK                
NST3EDIQ EQU   X'04'               X'04' UNIT ADD BY CABLE UPLOAD               
NST3ADUQ EQU   X'02'               X'02' ADU UNIT (COST NOT ALLOWED)            
NST3FPQ  EQU   X'01'               X'01' FEED PCT. HITS IMPS,AND RTGS           
*                                                                               
NUSDHFL  DS    CL1                 HUT FLAVOR                                   
NUSDSRT  DS    CL1                 SPECIAL RATE CODE                            
NUACT2WY DS    CL1                 SECOND LAST ACTIVITY BYTE                    
*                                  X'80' CHANGE DAY                             
*                                  X'40' CHANGE DATE                            
*                                  X'20' CHANGE TIME                            
*                                  X'10' CHANGE ACTUAL COST                     
*                                  X'08' PREEMPTED UNIT                         
*                                  X'04' MISSED UNIT                            
NUSTATYP DS    CL1                 STATION TYPE N,C,S                           
NUSDSBMD DS    CL1                 SUB MEDIA N=NATIONAL,R=REGIONAL              
NUSDROT  DS    CL1                 ROTATION                                     
NUSDAFDT DS    CL2                 AFFIDAVITE DATE                              
NUSDRTCV DS    CL1                 RATE COVERAGE OF SPECIAL RATE CODE.          
*                                  A=ALL COSTS                                  
*                                  T=TIME ONLY                                  
*                                  I=TIME AND INTERGRATION ONLY                 
NUPOSTYP DS    CL1                 POSTING TYPE N,C,S                           
NUMIRTYP DS    CL1                 MIRROR CODE A=+4 HOURS                       
NUSDPT   DS    CL3                 SUB-DAYPART                                  
*                                                                               
NUSDST4  DS    CL1                 UNIT STATUS 4                                
NST4ICI  EQU   X'80'               X'80' INT COST INPUTTED                      
NST4USUS EQU   X'40'               X'40' UNIT SPLIT BY UTILS/STEWARD            
NST4USN  EQU   X'20'               X'20' UNIT STATUS IS NEW                     
NST4CPP  EQU   X'10'               X'10' CROSS PLATFORM PROGRAM                 
NST4UCF  EQU   X'08'               X'08' UNIT CREATED IN FRONTRNNR              
NST4LSCS EQU   X'04'               X'04' LIMIT SPECIAL CHARGE SCREEN            
NST4URES EQU   X'02'               X'02' UNIT RESTORED (TEMPORARY)              
NST4SCS  EQU   X'01'               X'01' SEED SEEDED COMSCORE SERIES            
*                                                                               
NUSTCAR  DS    CL1                 TCAR LEVEL 1-5                               
NUBKTYP  DS    CL1                 BOOK TYPE                                    
NUSDRL1Q EQU   *-NUSDREL                                                        
*                                                                               
*        <   > SPECIAL RATE ELEMENT                                             
*                                                                               
NUSPRD   DSECT                                                                  
NUSPREL  DS    CL1                 ELEMENT CODE X'03'                           
NUSPRELQ EQU   X'03'                                                            
NUSPRLEN DS    CL1                 ELEMENT LENGTH                               
*                                  (FIXED LENGTH EXCEPT FOR CUT-INS)            
*                                  (FIXED LENGTH FOR ALL 3/10/06)               
NUSPRSEQ DS    CL1                 SEQUENCE BYTE                                
NUSPRTYP DS    CL1                 SPECIAL RATE TYPE                            
NUSPRADM EQU   C'A'                A = ADMINISTRATION                           
NUSPRBLK EQU   C'B'                B = BLACKOUT                                 
NUSPRACT EQU   C'C'                C = ACTUAL COST TRADE CREDIT                 
NUSPRDEL EQU   C'D'                D = DELIVERY ADJUSTMENT                      
NUSPRSEC EQU   C'E'                E = SECTIONAL                                
NUSPRLAT EQU   C'L'                L = LATE CHARGE                              
NUPSROTH EQU   C'O'                O = OTHER                                    
NUSPRMDS EQU   C'M'                M = TRADE CREDIT (MIDAS) DO NOT CLR          
NUSPREAR EQU   C'Q'                Q = EARNED COST ADJ (EARNC-ACTUAL)           
NUSPRCSP EQU   C'S'                S = COPY-SPLIT                               
NUSPRCUT EQU   C'U'                U = CUT IN                                   
NUSPRTS  EQU   C'V'                V = TRADE SAVINGS (MIDAS)                    
NUSPRTAX EQU   C'X'                X = TAX                                      
*                                                                               
NUSPRCOM DS    CL1                 C=COMMISSION                                 
NUSPRAMT DS    XL4                 AMOUNT                                       
NUSPRREP DS    CL3                 SPECIAL REP                                  
NUSPRLN1 EQU   *-NUSPREL           OLD STYLE                                    
*                                                                               
NUSPRSTA DS    XL1                 STATUS                                       
NUSPRTCH EQU   X'80'               =TRAFFIC PRODUCT CHANGE                      
NUSPRCPD EQU   X'40'               =CHARGE HAS BEEN PAID                        
NUSPRPRE EQU   X'20'               =UNIT MISSED/PREEMPT                         
*                                                                               
NUSPRBPR DS    XL1                 BILLING PRODUCT                              
NUSPRTPR DS    XL1                 TRAFFIC PRODUCT                              
NUSPRLN2 EQU   *-NUSPREL           NON-CUTIN CHARGE                             
*                                                                               
NUSPRCIS DS    CL5                 CUT-IN STATION/MKT (PACKED)                  
*                                                                               
NUSPRREV DS    XL1                 REVISION # (CUT-INS ONLY)                    
NUSPRCMI DS    XL1                 COMMERCIAL INDEX # (CUT-INS ONLY)            
NUSPRLN3 EQU   *-NUSPREL                                                        
*                                                                               
NUSPRFED DS    CL4                 FEED CODE (1 - 4 BYTES CUT-INS ONLY)         
NUSPRBPC DS    CL3                 BILLING PRODUCT                              
NUSPRTPC DS    CL3                 TRAFFIC PRODUCT                              
NUSPRLN4 EQU   *-NUSPREL           FIXED LN FOR 3 CHAR PRDS 3/10/06             
*                                                                               
*                                                                               
*        <   > COMMENT ELEMENTS                                                 
*                                                                               
NUCOMD   DSECT                                                                  
NUCOMEL  DS    CL1                 ELEMENT CODE X'04'                           
NUCOMLEN DS    CL1                 ELEMENT LENGTH (L'COMMENT +4)                
NUCOMTYP DS    CL1                 TYPE C=CLIENT, I=INTERNAL                    
NUCOMLIN DS    CL1                 LINE                                         
NUCOMMNT DS    0C                  COMMENT                                      
*                                                                               
*                                                                               
*        <   > UNIQUE ID ELEMENT                                                
*                                                                               
NUIDD    DSECT                                                                  
NUIDEL   DS    CL1                 ELEMENT CODE X'05'                           
NUIDLEN  DS    CL1                 ELEMENT LENGTH (10)                          
NUID     DS    CL4                 UNIQUE ID                                    
         DS    CL4                 SPARE                                        
*                                                                               
*                                                                               
*        <   > MISSED/MAKE-GOOD DATA                                            
*                                                                               
NUMGD    DSECT                                                                  
NUMGEL   DS    CL1                 ELEMENT CODE X'06'=MISSED DETAILS            
*                                               X'07'=MAKE-GOOD DETAILS         
NUMGLEN  DS    CL1                 ELEMENT LENGTH (32)                          
NUMGPCOD DS    CL6                 PROGRAM CODE                                 
NUMGPNM  DS    CL16                PROGRAM NAME                                 
NUMGDATE DS    CL2                 DATE                                         
NUMGSUB  DS    CL1                 SUB-LINE                                     
NUMGSTAT DS    XL1                 UNIT STATUS                                  
*                                  X'04' = (MISSING UNIT IS PFB -               
*                                  -  X'06' ELEM ONLY)                          
*                                  X'02' = FORCED LOOKUP OF HUTS                
NUMGST3  DS    CL1                 UNIT STATUS 3                                
         DS    CL3                 SPARE                                        
*                                                                               
*                                                                               
*        <   > FILTER ELEMENT                                                   
*                                                                               
NUFILD   DSECT                                                                  
NUFILEL  DS    CL1                 ELEMENT CODE X'08'                           
NUFILLEN DS    CL1                 ELEMENT LENGTH (11)                          
NUFILSCM DS    CL1                 SCHEME CODE (P=PAY PROGRAM)                  
*                                              (K=PACKAGE FILTERS)              
NUFILTER DS    CL6                 FILTER VALUES                                
         DS    CL2                 SPARE                                        
NUFILELN EQU   *-NUFILD            SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        <   > AUDIT INFORMATION ELEMENT                                        
*                                                                               
NUAUDD   DSECT                                                                  
NUAUDEL  DS    CL1                 ELEMENT CODE X'09'                           
NUAUDLEN DS    CL1                 ELEMENT LENGTH                               
NUAUDGRP DS    CL4                 AUDIT GROUP                                  
NUAUDCOM DS    CL16                AUDIT COMMENT                                
NUAUDELN EQU   *-NUAUDD                                                         
*                                                                               
*                                                                               
*        <   > BILLING ELEMENT                                                  
*                                                                               
NUBILD   DSECT                                                                  
NUBILEL  DS    CL1                 ELEMENT CODE X'10'                           
NUBILELQ EQU   X'10'                                                            
NUBILLEN DS    CL1                 ELEMENT LENGTH (VARIABLE)                    
*                                                                               
NUBILTYP DS    CL1                 BILLING TYPE                                 
NUBILTTM EQU   C'T'                T=TIME                                       
NUBILTIN EQU   C'I'                I=INTEGRATION                                
NUBILTCI EQU   C'U'                U=CUT IN                                     
NUBILTBO EQU   C'B'                B=BLACKOUT                                   
NUBILTCS EQU   C'S'                S=COPY-SPLIT                                 
NUBILTAD EQU   C'A'                A=ADMINISTRATION                             
NUBILTSE EQU   C'E'                E=SECTIONAL                                  
NUBILTTX EQU   C'X'                X=TAX                                        
NUBILTOT EQU   C'O'                O=OTHER                                      
NUBILDAT DS    CL2                 DATE OF BILLING RUN                          
NUBILPRD DS    CL1                 PRODUCT CODE                                 
NUBILIDT DS    CL2                 DATE ON INVOICE                              
NUBILNUM DS    CL4                 BILL NUMBER                                  
NUBILGRS DS    CL4                 GROSS BILLING                                
NUBILNET DS    CL4                 NET BILLING                                  
NUBILST  DS    XL1                 STATUS                                       
NUBILRDQ EQU   X'80'               =REVERSED                                    
NUBILRLQ EQU   X'40'               =REVERSAL                                    
NUBILUBQ EQU   X'20'               =UNBILLED                                    
NUBILSCQ EQU   X'08'               =SEP COMMISSION BILL                         
NUBILSNQ EQU   X'04'               =NET BILL                                    
NUBILAMQ EQU   X'02'               =ACTUAL MINUS ASSIGNED BILL                  
*        EQU   X'01'               "FIXED" ELEMENT ON JUL30/01 (PZIR)           
*                                                                               
NUBILBTY DS    CL1                 BILLING TYPE                                 
NUBILGR2 DS    XL4                 2ND GROSS, 'CLIENT COSTS' IN                 
*                                  CARAT TYPE SITUATIONS)                       
*                                  ONLY IF ELEM LENGTH IS 28+                   
NUBILLN1 EQU   *-NUBILEL                                                        
NUBILPRC DS    CL3                 3CHAR PRODUCT                                
NUBILLN2 EQU   *-NUBILEL                                                        
NUBILFLT DS    CL10                WB FLIGHT NUMBER                             
* NUBILFLT IS ONLY ON THE 'VIRTUAL' BILL ELEMENT CREATED BY                     
* THE BILL READER - ELSE ELEMENT LENGTH IN NUBILLN1 OR NUBILLN2                 
NUBILLN3 EQU   *-NUBILEL                                                        
*                                                                               
*                                                                               
*        <   > PAYING ELEMENT                                                   
*                                                                               
NUPAYD   DSECT                                                                  
NUPAYEL  DS    CL1                 ELEMENT CODE X'12'                           
NUPAYELQ EQU   X'12'                                                            
NUPAYLEN DS    CL1                 ELEMENT LENGTH (24)                          
NUPAYTYP DS    CL1                 PAYING TYPE                                  
NUPAYTTM EQU   C'T'                T=TIME                                       
NUPAYTIN EQU   C'I'                I=INTEGRATION                                
NUPAYTCI EQU   C'U'                U=CUT IN                                     
NUPAYTBO EQU   C'B'                B=BLACKOUT                                   
NUPAYTCS EQU   C'S'                S=COPY-SPLIT                                 
NUPAYTAD EQU   C'A'                A=ADMINISTRATION                             
NUPAYTSE EQU   C'E'                E=SECTIONAL                                  
NUPAYTTX EQU   C'X'                X=TAX                                        
NUPAYTOT EQU   C'O'                O=OTHER                                      
NUPAYDAT DS    CL2                 DATE OF PAYING                               
NUPAYCON DS    CL2                 OPTIONAL CONTROL DATE                        
NUPAYCR  DS    CL1                 -=CREDIT $=CASH RECEIPT                      
NUPAYRTY DS    C                   REP TYPE S=SPECIAL (DEFAULT=PAYING)          
NUPAYREP DS    CL3                 REP (C'001'-C'999')                          
*                                  C'000' = PAID TO NETWORK                     
NUPAYGRS DS    CL4                 GROSS PAYMENT                                
NUPAYNET DS    CL4                 NET PAYMENT                                  
NUPAYSRP DS    CL3                 SPECIAL REP                                  
NUPAYSEQ DS    CL1                 SEQUENCE NUMBER                              
NUPAYELN EQU   *-NUPAYD            SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        <   > BILLING FLIGHT ELEMENT                                           
*                                                                               
NUBFLTD  DSECT                                                                  
NUBFLTEL DS    CL1                 ELEMENT CODE X'13'                           
NUBFLTLN DS    CL1                 ELEMENT LENGTH (13)                          
NUBFLTSQ DS    CL1                 SEQUENCE NUMBER                              
NUBFLT   DS    CL10                BILLED WB FLIGHT                             
*                                                                               
*                                                                               
*        <   > PRODUCT ELEMENT                                                  
*                                                                               
NUPRDD   DSECT                                                                  
NUPRDEL  DS    CL1                 ELEMENT CODE X'14'                           
NUPRDELQ EQU   X'14'                                                            
NUPRDLEN DS    CL1                 ELEMENT LENGTH (3+(6*NUM OF PRODS))          
NUPRDIND DS    CL1                 INDICATORS                                   
NUPRTRI  EQU   X'80'               X'80'=TRIGBCK (MUST HAVE 1 CREATIVE)         
NUPRSMAP EQU   X'40'               X'40'=CHECK FOR SECTIONAL MAP                
NUPRDPR  DS    CL1                 PRODUCT CODE                                 
         DS    CL1                 SPARE                                        
NUPRDPCT DS    CL2                 PRODUCT PERCENT OF DOLLARS                   
NUPRDFD  DS    CL2                 PRODUCT FEED PCT IMPRESSION BREAKOUT         
NUPRTLEN EQU   *-NUPRDPR                                                        
*                                                                               
*                                                                               
*        <   > MAX COST ELEMENT                                                 
*                                                                               
NUMCSTD  DSECT                                                                  
NUMCSEL  DS    CL1                 ELEMENT CODE X'15'                           
NUMCSLEN DS    CL1                 ELEMENT LENGTH (11)                          
NUMCSLNQ EQU   11                                                               
*                                                                               
NUMCSMCS DS    CL4                 MAX COST                                     
NUMCEIC  DS    CL4                 EIC COST                                     
NUMCSTAT DS    CL1                 X'80'= OVERRIDE EARNED COST                  
*                                                                               
*                                                                               
*        <   > CUT-IN LIST ELEMENT                                              
*                                                                               
NUCUTD   DSECT                                                                  
NUCUTEL  DS    CL1                 ELEMENT CODE X'16'                           
NUCUTLEN DS    CL1                 ELEMENT LENGTH (2 + 2*ENTRIES)               
NUCUTMG  DS    CL1                 MARKET GROUP (PWOS)                          
NUCUTPRD DS    CL1                 PRODUCT CODE (0=BLACKOUT)                    
*                                                                               
*                                                                               
*        <   > CUT IN COMMERCIAL ELEMENT                                        
*                                                                               
NUCCLD   DSECT                                                                  
NUCCLEL  DS    CL1                 ELEMENT CODE X'17'                           
NUCCLLEN DS    CL1                 ELEMENT LENGTH (2+(8*NUM OF COMM'S)          
NUCCLCOM DS    0C                  COMMERCIAL TABLE                             
*                                                                               
*                                                                               
*        <   > ADDITIONAL DATA ELEMENT                                          
*                                                                               
NUDTAD   DSECT                                                                  
NUDTAEL  DS    CL1                 ELEMENT CODE X'18'                           
NUDTAELQ EQU   X'18'                                                            
NUDTALEN DS    CL1                 ELEMENT LENGTH (50)                          
NUDTASPT DS    CL4                 SUB PROGRAM TYPE                             
NUDTANEW DS    CL1                 PROGRAM NEW OR RETURNING SHOW                
NUDTATIR DS    CL1                 PROGRAM TIER NUMBER                          
NUDTARAT DS    CL2                 PROGRAM RATING                               
NUDTAMYR DS    CL1                 SECTIONAL MAP YEAR                           
NUDTAMCD DS    CL8                 SECTIONAL MAP CODE                           
NUDTATYP DS    CL2                 PROGRAM TYPE                                 
NUDTINVN DS    CL10                INVOICE NUMBER                               
NUDTIIVN DS    CL10                INVOICE NUMBER (INTEGRATION)                 
NUDTTRAD DS    CL2                 TRADE PERCENT                                
*                                                                               
NUUNST5  DS    CL1                 UNIT STATUS 5                                
NST5NPU  EQU   X'80'               X'80' = NO PAY UNIT                          
NST5NIU  EQU   X'40'               X'40' = NO IMPRESSION UNIT                   
NST5PMBM EQU   X'20'               X'20' = POD LOOKUP MINUTE X MINUTE           
NST5HUBA EQU   X'10'               X'10' = RECORD ADDED VIA THE HUB             
NST5HUBC EQU   X'08'               X'08' = RECORD CHANGED VIA THE HUB           
NST5DLCK EQU   X'04'               X'04' = UTILS DEMOLOCK RUN                   
*                                                                               
NUDVTYPE DS    CL2                 V TYPE (FROM PACKAGE)                        
NUDTCASH DS    CL2                 CASH PERCENT                                 
NUDTGAFD DS    CL2                 GAP AFFID TIME                               
NUDTELEN EQU   *-NUDTAEL                                                        
*                                                                               
*                                                                               
*        <   > PRODUCT ELEMENT (EXPANDED PRODUCT CODE)                          
*                                                                               
NUPDED   DSECT                                                                  
NUPDEEL  DS    CL1                 ELEMENT CODE X'19'                           
NUPDEELQ EQU   X'19'                                                            
NUPDELEN DS    CL1                 ELEMENT LENGTH (3+(7*NUM OF PRODS))          
NUPDEIND DS    CL1                 INDICATORS                                   
NUPDTRI  EQU   X'80'               =TRIGBCK (MUST HAVE 1 CREATIVE)              
NUPDCSP  EQU   X'40'               =COPYSPLIT                                   
NUPDSMAP EQU   X'20'               =CHECK FOR SECTIONAL MAP                     
NUPDEPR  DS    CL3                 PRODUCT CODE                                 
NUPDEPCT DS    CL2                 PRODUCT PERCENT OF DOLLARS                   
NUPDEFD  DS    CL2                 PRODUCT FEED PCT IMPRESSION BREAKOUT         
NUPDTLEN EQU   *-NUPDEPR                                                        
*                                                                               
*                                                                               
*        <   > NETWORK UNIT COMMERCIAL ELEMENT                                  
*                                                                               
NUCMLEL  DSECT                                                                  
NUCMLEID DS    XL1'21'             ELEMENT CODE X'21'                           
NUCMLELQ EQU   X'21'                                                            
NUCMLELN DS    AL1(80)             ELEMENT LENGTH (80)                          
NUCML1   DS    CL8                 COMMERCIAL CODE                              
NUCML2   DS    CL8                 PIGGYBACK COMMERCIAL CODE                    
NUCMLBSL DS    XL1                 BILLBOARD LENGTH                             
NUCMLBSN DS    CL8                 BILLBOARD SLIDE NUMBER                       
NUCML3   DS    0CL8                COMMERCIAL3 FOR TRI-BACK PRD                 
NUCMLBCN DS    CL8                 BILLBOARD COPY NUMBER                        
*                                                                               
NUCMLFL2 DS    XL1                                                              
NUCMLFLS EQU   X'80'               NETWORK TALENT/TRANS  (DONE)                 
NUCMLFS2 EQU   X'40'               NETWORK TALENT/TRANS CML2 (DONE)             
NUCMLACK EQU   X'20'               ERROR ACKNOWLEDGED BY NINS                   
NUCMLSDS EQU   X'10'               NETWORK TALENT/TRANS -                       
*                                   UNIT SENT/THEN DELETED/THEN SENT            
NUCMLFLP EQU   X'08'               UNIT CHANGED - NEEDS REPRINT ON INST         
NUCMLNEW EQU   X'04'               COMML NEW (NONE ASSIGNED BEFORE)             
NUCMLSD2 EQU   X'02'               NETTAL SENT/DELETED/SENT CML2                
NUCMLFFD EQU   X'01'               MEDIA - NO NATIONAL UNIT, ONLY               
*                                   FEEDS                                       
         DS    XL2                 WAS INT CHGE-DOLLARS AND CENTS               
NUCMLPOS DS    CL4                 POSITION                                     
*                                                                               
NUCMLFLG DS    XL1                 FLAGS                                        
NUCMLFLC EQU   X'80'               =UNIT LEN CHANGED, ELEM INVALID              
NUCMLFPC EQU   X'40'               =UNIT PRD CHANGED, ELEM INVALID              
NUCMLFDC EQU   X'20'               =UNIT DATE CHANGED                           
*                                  10 - THIS UNIT PRINTED ON INSTR              
*                                  08 - UNIT DELETED BY TRAFFIC DEPT            
*                                  04 - BILLBOARD REQUIRED (SET IN BUY)         
*                                  02 - TRAFFIC DEL/MISSED PRINTED ON           
*                                        INSTR                                  
*                                  01 - INVERT PRINTING PRODUCTS ON             
*                                        INSTR                                  
NUCMLBPS DS    CL4                 BILLBOARD POSITION                           
NUCMLREV DS    XL1                 REV # OF ASSIGNMENT                          
NUCMLPRD DS    XL1                 COPY SPLIT PRD                               
         DS    XL2            SPARE (WAS NUCMLREF)                              
NUCMLKEY DS    XL1                 80 = PROG SPEC                               
*                                  60 - FEED & DAYPART SPEC                     
*                                  40 = FEED SPEC                               
*                                  20 = DAYPART SPEC                            
*                                  10 = ALL NETWORKS PATTERN                    
*                                  08 = MEDIA SPEC                              
*                                  00 = NET SPEC                                
NUCMLT1D DS    XL2                 TALENT TRANSFER DATE PROD1                   
NUCMLT1A DS    CL6                 TALENT TRANSFER AGENCY PROD1                 
NUCMLT2D DS    XL2                 TALENT TRANSFER DATE PROD2                   
NUCMLT2A DS    CL6                 TALENT TRANSFER AGENCY PROD2                 
NUCMLTFL DS    XL1                 TALENT TRANSFER FLAG                         
*                                  COMML 1 80 - UNIT LEN CHANGED                
*                                          40 - UNIT PRD CHANGED                
*                                          20 - UNIT DATE CHANGED               
NUCMLTF1 EQU   X'10'               =NEW COMML 1 ASSIGNED                        
*                                  COMML 2 08 - UNIT LEN CHANGED                
*                                          04 - UNIT PRD CHANGED                
*                                          02 - UNIT DATE CHANGED               
NUCMLTF2 EQU   X'01'               =NEW COMML 2 ASSIGNED                        
NUCMPPOS DS    XL1                 PRODUCT POSITION IN THE X'14' ELEM           
NUCMULT1 DS    CL1                 MULTI RUN # COMMERCIAL 1                     
NUCMULT2 DS    CL1                 MULTI RUN # COMMERCIAL 2                     
NUCMADFL DS    CL1                 FLAGS FOR AD-ID CMLS                         
NUCMADF1 EQU   X'80'               =FLAGS FOR AD-ID CML 1                       
NUCMADF2 EQU   X'40'               =FLAGS FOR AD-ID CML 2                       
NUCMADF3 EQU   X'20'               =FLAGS FOR AD-ID TRI BK/BB SLIDE             
NUCMADF4 EQU   X'10'               =FLAGS FOR AD-ID CML BB COPY                 
NUCMPROD DS    CL3                 ALPHA PRODUCT                                
NUCMLR3F DS    CL3                 ==>NEW 3-BYTE PATTERN REF FROM SEED          
         DS    CL1                 SPARE                                        
NUCMLEND EQU   *                                                                
*                                                                               
*                                                                               
*        NETWORK FEED ELEMENT                                                   
*                                                                               
NUFEDEL  DSECT                                                                  
NUFEDEID DS    XL1'22'             ELEMENT CODE X'22'                           
NUFEDELQ EQU   X'22'                                                            
NUFEDLEN DS    AL1(8)              ELEMENT LENGTH (8)                           
NUFEEDCD DS    CL4                 FEED CODE                                    
         DS    CL2                 SPARE                                        
NUFEDELN EQU   *-NUFEDEL           SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        NETWORK FEED WITH COMMERCIALS ELEMENT                                  
*                                                                               
NUFDCEL  DSECT                                                                  
NUFDCEID DS    XL1'23'             ELEMENT CODE X'23'                           
NUFDCELQ EQU   X'23'                                                            
NUFDCLEN DS    AL1(83)             ELEMENT LENGTH (80)                          
NUFDCFED DS    CL4                 FEED                                         
NUFDCML1 DS    CL8                 COMMERCIAL CODE                              
NUFDCML2 DS    CL8                 PIGGYBACK COMMERCIAL CODE                    
NUFDCBSL DS    XL1                 BILLBOARD LENGTH                             
NUFDCBSN DS    CL8                 BILLBOARD SLIDE NUMBER                       
NUFDCBCN DS    CL8                 BILLBOARD COPY NUMBER                        
NUFDPROD DS    CL3                 ALPHA PRODUCT                                
NUFDCPOS DS    CL4                 POSITION                                     
NUFDCFLG DS    XL1                 FLAGS - COPY FROM CML ELEM                   
NUFDCBPS DS    XL4                 BILLBOARD POSITION                           
NUFDCREV DS    XL1                 REV # OF ASSIGNMENT                          
NUFDCPRD DS    XL1                 COPYSPLIT PRODUCT                            
*                                  CAN ONLY BE USED IF NUSDST3 = X'40'          
*                                  MUST EQUAL NBPRD OR NBPRD2                   
NUFDCFL2 DS    XL1                 MEDIA FLAGS                                  
*                                  80 - DELETED FEED                            
*                                  40 - FEED PRINTED ON INSTRUCTIONS            
*                                       (NBUY CAN'T DELETE)                     
NUFDCSD2 EQU   X'20'               =NETWORK TALENT TRANS 2ND S/D/S              
NUFDCSDS EQU   X'10'               =NETWORK TALENT TRANS 1ST SDS                
*                                       UNIT SENT/THEN DELETED/SENT             
NUFDCFLS EQU   X'08'               =NETWORK TALENT/TRANS    (DONE)              
NUFDCFS2 EQU   X'04'               =NETWORK TALENT/TRANS CML2(DONE)             
NUFDCFLP EQU   X'02'               =UNIT CHANGED-NEEDS REPRINT ON INST          
*                                  01 - FEED ASSIGNED BY MEDIA DEPT             
*                                       TRAFFIC DEPT CAN NOT DELETE             
         DS    XL2          SPARE  (WAS NUFDCREF)                               
NUFDCKEY DS    XL1                 80 = PROG SPEC                               
*                                  40 = FEED SPEC                               
*                                  20 = DAYPART SPEC                            
NUFDCFL3 DS    XL1                 FLAG 3                                       
NUFDCNEW EQU   X'80'               COMML NEW (NONE ASSIGNED BEFORE)             
*                                                                               
NUFDPPOS DS    XL1                 PRODUCT POSITION IN THE X'14' ELEM           
NUFDMLT1 DS    CL1                 MULTIRUN # COMMERCIAL 1                      
NUFDMLT2 DS    CL1                 MULTIRUN # COMMERCIAL 2                      
         DS    CL1                 SPARE                                        
NUFDCT1D DS    XL2                 TALENT TRANSFER DATE PROD1                   
NUFDCT1A DS    CL6                 TALENT TRANSFER AGENCY PROD1                 
NUFDCT2D DS    XL2                 TALENT TRANSFER DATE PROD2                   
NUFDCT2A DS    CL6                 TALENT TRANSFER AGENCY PROD2                 
NUFDCTFL DS    XL1                 TALENT TRANSFER FLAG                         
*                                  COMML 1 80 - UNIT LEN CHANGED                
*                                          40 - UNIT PRD CHANGED                
*                                          20 - UNIT DATE CHANGED               
NUFDCTF1 EQU   X'10'               =NEW COMML 1 ASSIGNED                        
*                                  COMML 2 08 - UNIT LEN CHANGED                
*                                          04 - UNIT PRD CHANGED                
*                                          02 - UNIT DATE CHANGED               
NUFDCTF2 EQU   X'01'               =NEW COMML 2 ASSIGNED                        
         SPACE                                                                  
NUFDADFL DS    CL1                 FLAGS FOR AD-ID CMLS                         
NUFDADF1 EQU   X'80'               =FLAGS FOR AD-ID CML 1                       
NUFDADF2 EQU   X'40'               =FLAGS FOR AD-ID CML 2                       
NUFDADF3 EQU   X'20'               =FLAGS FOR AD-ID TRI BK/BB SLIDE             
NUFDADF4 EQU   X'10'               =FLAGS FOR AD-ID CML BB COPY                 
NUFDCR3F DS    XL3            ==>  3-BYTE PATTERN REF FROM SEED                 
NUFDCELN EQU   *-NUFDCEL           SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        NETWORK PAY COMMERCIAL ELEMENT                                         
*                                                                               
NUPCELD  DSECT                                                                  
NUPCEID  DS    XL1'24'             ELEMENT CODE X'24'                           
NUPCLEN  DS    AL1(11/12/15)       ELEMENT LENGTH (15)                          
NUPCPRD  DS    CL1                 PRODUCT NUMBER                               
NUPCCML  DS    CL8                 COMMERCIAL CODE                              
NUPCMLFL DS    CL1                 INVOICE COMMERCIAL FLAG                      
NUPCADF1 EQU   X'80'               =COMMERCIAL IN AD-ID FORMAT                  
NUPCHDF1 EQU   X'40'               =COMMERCIAL IS HDEF                          
NUPCCTF1 EQU   X'20'               =COMMERCIAL IS CENTERCUT                     
NUPCAPRD DS    CL3                 ALPHA PRODUCT CODE                           
                                                                                
NUPCELN  EQU   *-NUPCEID           SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        COMSCORE INFORMATION ELEMENT                                           
*                                                                               
NUCSELD  DSECT                                                                  
NUCSEL   DS    XL1                 ELEMENT CODE                                 
NUCSELQ  EQU   X'25'                                                            
NUCSLEN  DS    XL1                 ELEMENT LENGTH                               
NUCSSN   DS    CL10                COMSCORE SERIES NUMBER                       
NUCSUNIV DS    CL2                 CUNIVERSE CODE                               
NUCSVTYP DS    CL1                 COMSCORE V TYPE (FROM PACKAGE)               
         DS    CL10                SPARE                                        
NUCSLENQ EQU   *-NUCSEL                                                         
*                                                                               
*                                                                               
*        PRISMA INFORMATION ELEMENT                                             
*                                                                               
NUPSELD  DSECT                                                                  
NUPSEL   DS    XL1                 ELEMENT CODE                                 
NUPSELQ  EQU   X'26'                                                            
NUPSLEN  DS    XL1                 ELEMENT LENGTH                               
NUPSCDT  DS    XL2                 LAST CHANGE DATE                             
NUPSID   DS    CL20                PRISMA ID                                    
NUPSLENQ EQU   *-NUPSEL                                                         
*                                                                               
*                                                                               
*        <   > ESTIMATED UNIVERSE ELEMENT                                       
*                                                                               
NUEUD    DSECT                                                                  
NUEUEL   DS    CL1                 ELEMENT CODE X'31'                           
NUEULEN  DS    CL1                 ELEMENT LENGTH (75)                          
NUEUELEN DS    CL1                 ENTRY LENGTH (3)                             
NUEUNIVS DS    24CL3               UNIVERSES (0,000)                            
*                                  01=TOTAL 02=W1834 03=W1849 04=W2554          
*                                  05=W5564 06=W55+  07=WOMEN 08=M1834          
*                                  09=M1849 10=M2554 11=M5564 12=M55+           
*                                  13=MEN   14=LOH   15=WWORK 16=M1217          
*                                  17=F1217 18=TEENS 19=CH2-5 20=CH611          
*                                  21=CHILD 22=HOMES 23=W3564 24=M3564          
*                                                                               
*                                                                               
*        <   > ESTIMATED VPH ELEMENT                                            
*                                                                               
NUEVD    DSECT                                                                  
NUEVEL   DS    CL1                 ELEMENT CODE X'33'                           
NUEVLEN  DS    CL1                 ELEMENT LENGTH (119) OR (37)                 
NUEVELEN DS    CL1                 ENTRY LENGTH (1 OR 2)                        
NUEVPHS  DS    CL116               VPHS (0 DEC PLACES)                          
*                                  00=WOMEN    01=MEN      02=ADULT             
*                                  03=WM18-34  04=MN18-34  05=AD18-34           
*                                  06=WM18-49  07=MN18-49  08=AD18-49           
*                                  09-WM25-49  10=MN25-49  11=AD25-49           
*                                  12=WM25-54  13=MN25-54  14=AD25-54           
*                                  15=WM55-64  16=MN55-64  17=AD55-64           
*                                  18=55+      19=MN55+    20=AD55+             
*                                  21=WM TEEN  22=MN TEEN  23=TEENS             
*                                  24=CH2-5    25=CH6-11   26=CH2-11            
*                                  27=LOH      28=WKWOMEN  29=ALL (2+)          
*                                  30=WM35-64  31=MN35-64  32=AD35-64           
**  NEW DEMO CATEGORIES                                                         
*                                  33=WM2-11   34=MN2-11                        
*                                  35=WM6-11   36=MN6-11                        
*                                  37-WM15-24  38=MN15-24  39=AD15-24           
*                                  40=SPARE    41=SPARE    42=SPARE             
*                                  43=WM21-49  44=MN21-49  45=AD21-49           
*                                  46=WM21-54  47=MN21-54  48=AD21-54           
*                                  49=WM21+    50=MN21+    51=AD21+             
*                                  52=AD9-11   53=AD9-14                        
*                                  54=SPARE    55=WW18-49  56=WW25-54           
*                                  57=MOMS                                      
NUEVLN1Q EQU   *-NUEVEL                                                         
NUEVPHS2 DS    CL20                2ND SET OF VPHS                              
*                                  58=MN1214                                    
NUEVLN2Q EQU   *-NUEVEL                                                         
*                                                                               
*                                                                               
*        <   > ESTIMATED HOME DATA                                              
*                                                                               
NUEHD    DSECT                                                                  
NUEHEL   DS    CL1                 ELEMENT CODE X'35'                           
NUEHLEN  DS    CL1                 ELEMENT LENGTH (9)                           
NUEHELEN DS    CL1                 ENTRY LENGTH (2)                             
NUEHRTG  DS    CL2                 RATING (1 DEC)                               
NUEHHUT  DS    CL2                 HUT (2 DEC)                                  
NUEHSHR  DS    CL2                 SHARE (1 DEC)                                
*                                                                               
*                                                                               
*        <   > ACTUAL VPHS                                                      
*                                                                               
NUAVD    DSECT                                                                  
NUAVEL   DS    CL1                 ELEMENT CODE X'43'                           
NUAVLEN  DS    CL1                 ELEMENT LENGTH (41)                          
NUAVELEN DS    CL1                 ENTRY LENGTH (2)                             
NUAVPHS  DS    19CL2               ACTUAL VPHS (1 DEC)                          
*                                                                               
*                                                                               
*        <   > ACTUAL HOME DATA                                                 
*                                                                               
NUAHD    DSECT                                                                  
NUAHEL   DS    CL1                 ELEMENT CODE X'45'                           
NUAHLEN  DS    CL1                 ELEMENT LENGTH                               
NUAHOMES DS    0C                  HOME RTG/IMPSD/SHARE                         
*                                                                               
*                                                                               
*        <   > BOOK MAINT ELEMENT                                               
*                                                                               
NUBKD    DSECT                                                                  
NUBKEL   DS    CL1                 ELEMENT CODE X'5D' = EVN/EIN                 
*                                               X'5E' = NTI                     
NUBKLEN  DS    CL1                 ELEMENT LENGTH (7)                           
NUBKFMS  DS    CL3                 INTERNAL FILE/MEDIA/SOURCE                   
NUBKBOOK DS    CL2                 BOOK                                         
*                                                                               
*                                                                               
*        <   > "OTHER" FIELD HOLD ELEMENT                                       
*                                                                               
NUOTH    DSECT                                                                  
NUOTEL   DS    CL1                 ELEMENT CODE X'60'                           
NUOTLEN  DS    CL1                 ELEMENT LENGTH                               
NUOTTYP  DS    CL1                 TYPE INDICATOR                               
*                                  C'A'=AUTHORIZATION CODE                      
*                                  C'B'=COMMISSION AGENCY                       
*                                  C'C'=COMMENT                                 
*                                  C'D'=SUB-DAYPART                             
*                                  C'E'=ESTIMATED COST                          
*                                  C'F'=BUY TYPE CODE                           
*                                  C'G'=PIGGYBACK ALLOWANCE CODE                
*                                  C'H'=TRAFFIC SUPPLIER                        
*                                  C'I'=COMBO LINKS (STEWARD OPTION)            
*                                  C'J'=TVQ BOOK ESTIMATED                      
*                                  C'K'=TVQ BOOK ACTUAL                         
*                                  C'L'=MULTI RUN                               
*                                  C'M'=MIRROR CODE                             
*                                  C'N'=INTEGRATION BILL PRODUCT                
*                                  C'O'=POSITION CODE                           
*                                  C'P'=PROMOTION CODE                          
*                                  C'Q'=COMMERCIAL TAG (T1-T9)                  
*                                  C'R'=REASON CODE                             
*                                  C'S'=SOURCE OF FUNDS                         
*                                  C'T'=TRAFFIC AGENCY                          
*                                  C'U'=USER DEFINED SUB DAYPART                
*                                  C'V'=AIRING STATION                          
*                                  C'W'=WINDOWS ALTERNATE BOOK                  
*                                  C'X'=BREAKOUT                                
*                                  C'Y'=POD                                     
*                                  C'Z'=TIME ZONE                               
*                                  C'0'=HP NAME AND PCT                         
*                                  C'1'=OVERRIDE FLIGHT NUMBER                  
NUOTHER  DS    0C                  INFO FIELD                                   
*                                                                               
*                                                                               
*        <   > NAD INFORMATION ELEMENT                                          
*                                                                               
NUNAD    DSECT                                                                  
NUNADEL  DS    CL1                 ELEMENT CODE X'62'                           
NUNADLEN DS    CL1                 ELEMENT LENGTH (12)                          
NUNADCD  DS    CL6                 NAD DEFINITION CODE                          
         DS    CL4                 SPARE                                        
*                                                                               
*                                                                               
*        <   > LAST ACTIVITY LOG ELEMENT                                        
*                                                                               
NUATV    DSECT                                                                  
NUATVEL  DS    CL1                 ELEMENT CODE X'68'                           
NUATVLEN DS    CL1                 ELEMENT LENGTH (62)                          
*-- BYTE 0-1=COMPRESSED DATE                                                    
*-- BYTE 2=ACTIVITY BYTE 1                                                      
*-- BYTE 3=ACTIVITY BYTE 2                                                      
*-- BYTE 4=ACTIVITY BYTE 3 (NOT CURRENTLY USED)                                 
*-- BYTE 5=ACTIVITY BYTE 4 (NOT CURRENTLY USED)                                 
NUATVINF DS    10XL6               LOG INFO                                     
*                                                                               
*                                                                               
*        <   > NET VALUES ELEMENT                                               
*                                                                               
NUNVD    DSECT                                                                  
NUNVEL   DS    CL1                 ELEMENT CODE X'71'                           
NUNVLEN  DS    CL1                 ELEMENT LENGTH (NUNVELLN)                    
NUNVRES  DS    CL1                 NTI RESULT                                   
NUNVAFFT DS    CL2                 AFFADAVIT TIME                               
NUNVUS12 DS    CL1                 NBUSER+12                                    
NUNVNTI  DS    CL2                 NTI CODE                                     
NUNVTIME DS    CL4                 START,END TIME                               
NUNVDATE DS    CL2                 DATE                                         
NUNVBLAK DS    CL4                 BLACK WEEK LIST                              
NUNVBMSK DS    CL1                 BLACK WEEK MASK                              
NUNVUST2 DS    CL1                 UNIT STATUS 2                                
NUNVPDT  DS    CL1                 POST DATA TYPE                               
NUNVUS23 DS    CL1                 NBUSER2+3                                    
NUNVUS24 DS    CL1                 NBUSER2+4                                    
NUNVAFDT DS    CL2                 AFFIDAVIT DATE                               
NUNVNRES DS    CL1                 NAD RESULT  U=UNIT D=DEMO FILE               
NUNVMIR  DS    CL1                 MIRROR CODE                                  
NUNVNDDF DS    CL2                 NAD DEF'S LAST ACTIVE DATE                   
NUNVTCAR DS    CL1                 TCAR LEVEL                                   
NUNVELLN EQU   *-NUNVD             SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        <   > COS2 ELEMENT                                                     
*                                                                               
NUCOS2D  DSECT                                                                  
NUC2EL   DS    CL1                 ELEMENT CODE X'74'                           
NUC2LEN  DS    CL1                 ELEMENT LENGTH (11)                          
NUC2STAT DS    XL1                 STATUS                                       
NUC2ACT  EQU   X'80'               ACTUAL COST AFFECTED                         
NUC2INT  EQU   X'40'               INTEGRATION COST AFFECTED                    
NUC2FACT DS    XL4                 COS2 FACTOR                                  
NUC2AINT DS    XL4                 COS2 ADJUSTED INTEGRATION                    
*                                                                               
*                                                                               
*        <   > SEQUENCE NUMBER ELEMENT                                          
*                                                                               
NUSQD    DSECT                                                                  
NUSQEL   DS    CL1                 ELEMENT CODE X'75'                           
NUSQELQ  EQU   X'75'                                                            
NUSQLEN  DS    CL1                 ELEMENT LENGTH (20)                          
NUSQSER  DS    CL12                SERIAL #                                     
NUSQDEAL DS    CL10                DEAL #                                       
NUSQCON  DS    CL10                CONTRACT #                                   
         DS    CL6                 SPARE                                        
NUSQDQ   EQU   *-NUSQEL                                                         
*                                                                               
*                                                                               
*        <   > ASSIGNED COST CREDIT ELEMENT                                     
*                                                                               
NUASCD   DSECT                                                                  
NUASCEL  DS    CL1                 ELEMENT CODE X'76'                           
NUASCELQ EQU   X'76'                                                            
NUASCLEN DS    CL1                 ELEMENT LENGTH                               
         DS    CL1                 SPARE                                        
NUASCTYP DS    CL1                 SPECIAL RATE TYPE                            
*                                  F = ASS.COST TRADE CRED "76" ELEM            
         DS    CL1                 SPARE                                        
NUASCAMT DS    XL4                 AMOUNT                                       
         DS    XL17                SPARE                                        
NUASCBPC DS    CL3                 BILLING PRODUCT                              
         DS    CL3                 SPARE                                        
NUASCLN4 EQU   *-NUASCEL           FIXED LN FOR 3 CHAR PRDS 3/10/06             
*                                                                               
*                                                                               
*        <   > NEW KEY ELEMENT                                                  
*                                                                               
NUNKYD   DSECT                                                                  
NUNKYEL  DS    CL1                 ELEMENT CODE X'90'                           
NUNKYLEN DS    CL1                 ELEMENT LENGTH (22)                          
NUNKYKEY DS    CL20                NEW KEY (WHEN DAY CHANGE)                    
*                                                                               
*                                                                               
*        <   > ACTIVITY ELEMENT                                                 
*                                                                               
NUACTD   DSECT                                                                  
NUACTEL  DS    CL1                 ELEMENT CODE X'99'                           
NUACTLEN DS    CL1                 ELEMENT LENGTH (23)                          
NUACTACD DS    CL2                 CREATION AUTHORIZATION CODE                  
NUACTADT DS    CL3                 CREATION DATE                                
NUACTCCD DS    CL2                 LAST CHANGE AUTHORIZATION CODE               
NUACTCDT DS    CL3                 LAST CHANGE DATE                             
NUACTAID DS    CL2                 CREATION PERSONAL ID                         
NUACTCID DS    CL2                 LAST CHANGE PERSONAL ID                      
NUACTAGD DS    CL2                 SECURITY AGENCY                              
NUACTRSN DS    CL4                 REASON CODE                                  
NUACTOVL DS    CL1                 OVERLAY NUMBER                               
*                                                                               
*                                                                               
*        <   > PACKAGE/DEMO GUARANTEE FACTOR ELEMENT                            
*                                                                               
NUGUAD   DSECT                                                                  
NUGUAEL  DS    CL1                 ELEMENT CODE X'B1'=PACKAGE GUARANTEE         
*                                               X'B2'=DEMO GUARANTEE            
NUGUALEN DS    CL1                 ELEMENT LENGTH (6)                           
NUGUACAT DS    CL1                 DEMO CATEGORY (0=PACKAGE GUARANTEE)          
NUGUAFAC DS    CL2                 GUARANTEE FACTOR (2 DECIMAL PLACES)          
         DS    CL1                 SPARE                                        
NUGUAELN EQU   *-NUGUAD            SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        <   > NEW PACKAGE GUARANTEE FACTOR ELEMENT                             
*                                                                               
NUNGUD   DSECT                                                                  
NUNGUEL  DS    CL1                 ELEMENT CODE X'B3'=NEW PKG GUARANTEE         
NUNGULEN DS    CL1                 ELEMENT LENGTH (8)                           
NUNGUFAC DS    CL4                 GUARANTEE FACTOR (4 DECIMAL PLACES)          
         DS    CL2                 SPARE                                        
NUNGUELN EQU   *-NUNGUD            SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        <   > NEW DEMO GUARANTEE FACTOR ELEMENT                                
*                                                                               
NUNDGD   DSECT                                                                  
NUNDGEL  DS    CL1                 ELEMENT CODE X'B4'=NEW DEM GUARANTEE         
NUNDGLEN DS    CL1                 ELEMENT LENGTH (11)                          
NUNDGDEM DS    CL3                 DEMO                                         
NUNDGFAC DS    CL4                 GUARANTEE FACTOR (4 DECIMAL PLACES)          
         DS    CL2                 SPARE                                        
NUNDGELN EQU   *-NUNDGD            SOFT ELEMENT LENGTH                          
*                                                                               
*                                                                               
*        <   > DEMO OVERRIDE ELEMENT                                            
*                                                                               
NUOVD    DSECT                                                                  
NUOVEL   DS    CL1                 ELEMENT CODE                                 
NUOVDCQ  EQU   X'DC'                            X'DC' FOR EST. ACTUALS          
NUOVDDQ  EQU   X'DD'                            X'DD' FOR ESTIMATED             
NUOVDEQ  EQU   X'DE'                            X'DE' FOR ACTUALS               
*                                                                               
* THE FOLLOWING ELEMENT ID'S ARE LOCKED DEMO OVERRIDES WHEN                     
* UTILS REPORT RUN WITH DEMOLOCK (SPEC-24159)                                   
*                                                                               
NUOVD4Q  EQU   X'D4'               X'DD' LOCKED ESTIMATED                       
*                                                                               
NUOVLEN  DS    CL1                 ELEMENT LENGTH (12)                          
NUOVZER  DS    CL1                 X'00'                                        
NUOVCAT  DS    CL1                 CATEGORY                                     
NUOVMOD  DS    CL1                 MODIFIER                                     
*                                  C'R' FOR RATING (TYPE 'DC')                  
*                                  C'T' FOR IMPRESSIONS (TYPE X'DC')            
NUOVNUM  DS    CL1                 DEMO. NUMBER                                 
NUOVFLG  DS    CL1                 FLAGS X'80' NAD DEMO FROM FILE               
NUOVDMSD EQU   X'40'               =FROM DEMOSEED REPORT                        
*                                        X'10' USED BY EST.ACTUAL               
NUOVPRE  DS    CL1                 PRECISION FACTOR                             
NUOVVAL  DS    CL4                 VALUE                                        
NUOVLNQ  EQU   *-NUOVEL                                                         
*                                                                               
*                                                                               
*        <   > COMSCORE DEMO OVERRIDE ELEMENT                                   
*                                                                               
NUCOVD   DSECT                                                                  
NUCOVEL  DS    CL1                                                              
NUCOV1LQ EQU   X'E1'               ELEMENT CODE X'E1' FOR ESTIMATED             
NUCOVE1Q EQU   X'E1'                                                            
NUCOV2LQ EQU   X'E2'                            X'E2' FOR ACTUALS               
NUCOVE2Q EQU   X'E2'                                                            
NUCOV3LQ EQU   X'E3'                            X'E3' FOR EST. ACTUALS          
NUCOVE3Q EQU   X'E3'                                                            
*                                                                               
NUCOVLEN DS    CL1                 ELEMENT LENGTH                               
NUCOVCAT DS    CL8                 CATEGORY                                     
*                                                                               
NUCOVMOD DS    CL1                 MODIFIER                                     
NUCOVMRQ EQU   C'R'                RATING OVERRIDE                              
NUCOVMTQ EQU   C'T'                IMPRESSION OVERRIDE                          
*                                                                               
NUCOVFLG DS    CL1                 FLAGS                                        
NUCOVPRE DS    CL1                 PRECISION FACTOR                             
NUCOVVAL DS    CL4                 VALUE                                        
NUCOVLNQ EQU   *-NUCOVEL                                                        
