*          DATA SET NEGENNBUFF AT LEVEL 005 AS OF 05/06/86                      
*              DSECT TO COVER ENTRY IN NETWORK BUFFER                           
         SPACE 3                                                                
NBUFFD   DSECT                                                                  
NBUFFREC DS    0CL5                ENTRY IN BUFFER                              
NBUFFNET DS    CL4                 NETWORK                                      
NBUFFMED DS    CL1                 MEDIA                                        
         SPACE 1                                                                
*              NOTES               BUFFER IS FILLED IF NBANBUFF                 
*                                  IS PROVIDED                                  
*                                  BUFFER S/B 200 X 5 = 1000 X'00'              
