*          DATA SET NEGENSEQA  AT LEVEL 007 AS OF 09/28/93                      
*                 *** NETPAK SEQUENCE ASSIGN RECORD ***                         
         SPACE 2                                                                
NESAREC  DSECT                                                                  
NESAKEY  DS    0XL20                                                            
NESATYPE DS    XL1'31'             RECORD CODE                                  
NESAAM   DS    XL1                 AGENCY/MEDIA                                 
NESACLT  DS    XL2                 CLIENT                                       
NESADEAL DS    CL10                DEAL                                         
         DS    XL6                                                              
*                                                                               
NESALEN  DS    XL2                 RECORD LENGTH                                
NESACNTL DS    XL1                                                              
NESALINK DS    XL4                                                              
         SPACE 2                                                                
*                                                                               
NESAELEM DS    0X                                                               
*                                                                               
*     '01' ELEMENT - ASSIGNMENT ELEMENT'                                        
*                                                                               
NEASEL01 DS    XL1'01'             ELEMENT CODE                                 
NEASEL1L DS    XL1                 ELEMENT LENGTH                               
NEASNET  DS    CL4                 NETWORK                                      
NEASSEQ  DS    F                   SEQUENCE NUMBER                              
         DS    XL4                 SPARE                                        
NEASEL1Q EQU   *-NEASEL01                                                       
         SPACE 2                                                                
