*          DATA SET NEGENOTAB  AT LEVEL 004 AS OF 01/07/05                      
*                                                                               
*      TABLE OF OWNER NETWORKS FOR MASTER RECORD                                
*                                                                               
OWNERTAB DC    C'VIA ',C'Viacom             '                                   
         DC    C'ATW ',C'AOL Time Warner    '                                   
         DC    C'DIS ',C'The Walt Disney Co.'                                   
         DC    C'COMC',C'Comcast            '                                   
         DC    C'SONY',C'Sony Corp.         '                                   
         DC    C'VIV ',C'Vivendi Universal  '                                   
         DC    C'NEWS',C'News Corp.         '                                   
         DC    C'COX ',C'Cox Enterprises    '                                   
         DC    C'HUGH',C'Hughes Enterprises '                                   
         DC    C'CLCH',C'Clear Channel      '                                   
         DC    C'GE  ',C'General Electric   '                                   
         DC    C'GAN ',C'Gannett            '                                   
         DC    C'TRIB',C'Tribune Co.        '                                   
         DC    C'HRST',C'The Hearst Corp.   '                                   
         DC    C'ECHO',C'EchoStar           '                                   
         DC    C'MCGW',C'McGraw Hill        '                                   
         DC    C'USA ',C'USA Interactive    '                                   
         DC    C'CHRT',C'Charter            '                                   
         DC    C'CBLV',C'Cablevision        '                                   
         DC    C'ADPH',C'Adelphia           '                                   
         DC    C'NYT ',C'New York Times     '                                   
         DC    C'WASP',C'The Washington Post'                                   
         DC    C'LIBM',C'Liberty Media      '                                   
         DC    C'DISC',C'Discovery          '                                   
         DC    C'EWSC',C'E.W. Scripps Co.   '                                   
         DC    C'ATT ',C'ATT Broadband      '                                   
         DC    C'BLOM',C'Bloomber           '                                   
         DC    C'ABC ',C'ABC                '                                   
         DC    C'CBS ',C'CBS                '                                   
         DC    C'NBC ',C'NBC                '                                   
         DC    C'ESPN',C'ESPN               '                                   
         DC    C'MTV ',C'MTV                '                                   
         DC    C'CNN ',C'CNN                '                                   
         DC    C'DISC',C'DISC               '                                   
         DC    C'TURN',C'Turner Networks    '                                   
         DC    X'FF'                                                            
