*          DATA SET NEGENPQUA  AT LEVEL 002 AS OF 05/05/93                      
         SPACE 2                                                                
*              DSECT TO COVER PUP QUARTER DEF RECORD                            
         SPACE 3                                                                
NQURECD  DSECT                                                                  
NQUKEY   DS    0CL20               KEY                                          
NQUKTYPE DS    XL1                 TYPE X'25'                                   
NQUKAM   DS    XL1                 AGENCY/MEDIA                                 
NQUKCLT  DS    XL2                 CLIENT                                       
         DS    CL4                 SPARE                                        
NQUYEAR  DS    CL2                 YEAR                                         
         DS    CL10                SPARE                                        
         SPACE 1                                                                
NQURLEN  DS    XL2                 RECORD LENGTH                                
NQURSTAT DS    XL1                 CONTROL STATUS (X'80' = DELETED)             
NQURDA   DS    XL4                 DISK ADDRESS                                 
         SPACE 3                                                                
*              PLAN ELEMENT                                                     
         SPACE 1                                                                
NQUAEL   DS    XL1                 ELEMENT CODE X'01'                           
NQUALEN  DS    XL1                 ELEMENT LENGTH (50)                          
NQUA4ST  DS    XL2                 4TH QUARTER START DATE                       
NQUA4END DS    CL2                 4TH QUARTER END DATE                         
NQUA1END DS    XL2                 1ST QUARTER END DATE                         
NQUA2END DS    XL2                 2ND QUARTER END DATE                         
NQUA3END DS    XL2                 3RD QUARTER END DATE                         
         DS    CL38                SPARE                                        
