*          DATA SET NEGETPESTD AT LEVEL 002 AS OF 06/23/99                      
*              DSECT TO COVER GETPEST BLOCK                                     
         SPACE 3                                                                
GETPESTD DSECT                                                                  
GTPBLEN  DS    F                   LENGTH OF BLOCK                              
GTPBAENT DS    A                   A(ENTRY THAT MATCHES)                        
         SPACE 1                                                                
GTPBAMC  DS    XL3                 AGENCY/MEDIA/CLIENT IN BLOCK                 
GTPBDATA DS    0C                  START OF BLOCK INFO                          
         SPACE 1                                                                
GTPBENTD DSECT                                                                  
GTPBENT  DS    0XL11               ENTRY IN BLOCK                               
GTPBPRO  DS    XL1                 PRODUCT NUMBER                               
GTPBEST  DS    XL1                 ESTIMATE NUMBER (ZERO=DEFAULT)               
GTPBTAR1 DS    XL3                 TARGET 1                                     
GTPBTAR2 DS    XL3                 TARGET 2                                     
GTPBTAR3 DS    XL3                 TARGET 3                                     
