*          DATA SET NEGOLF2SD  AT LEVEL 001 AS OF 04/27/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T314F2D      DATE 04/27/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
LGOMEDH  DS    CL8                                                              
LGOMED   DS    CL4      5   12    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   21    6  A  P N             T        Y              
LGOCLIH  DS    CL8                                                              
LGOCLI   DS    CL4      5   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   40    7  A  P N             T        Y              
LGOPRDH  DS    CL8                                                              
LGOPRD   DS    CL7      5   49    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   58    7  A  P N             T        Y              
LGONETH  DS    CL8                                                              
LGONET   DS    CL4      5   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
LGOESTH  DS    CL8                                                              
LGOEST   DS    CL4      6   12    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   21    7  A  P N             T        Y              
LGODPTH  DS    CL8                                                              
LGODPT   DS    CL8      6   30    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   40    6  A  P N             T        Y              
LGOLENH  DS    CL8                                                              
LGOLEN   DS    CL3      6   49    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
LGOOPTH  DS    CL8                                                              
LGOOPT   DS    CL50     7   11   50  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   65    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL68     9    2   68  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    10    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    11    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    12    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    13    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    14    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    15    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    16    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    17    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    18    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    19    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    20    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    21    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    22    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    23    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    24    7   70  A  P N             T        Y              
LGOTAGH  DS    CL8                                                              
LGOTAG   DS    CL1     24   78    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
