*          DATA SET NEGOLF4D   AT LEVEL 003 AS OF 08/09/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T314F4D      DATE 08/09/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
HSLMEDH  DS    XL8                                                              
HSLMED   DS    CL4      5   12    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   21    6  A  P N             T        Y              
HSLCLIH  DS    XL8                                                              
HSLCLI   DS    CL4      5   29    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   43    7  A  P N             T        Y              
HSLPRDH  DS    XL8                                                              
HSLPRD   DS    CL7      5   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   61    7  A  P N             T        Y              
HSLNETH  DS    XL8                                                              
HSLNET   DS    CL4      5   70    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
HSLESTH  DS    XL8                                                              
HSLEST   DS    CL4      6   12    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   21    7  A  P N             T        Y              
HSLDPTH  DS    XL8                                                              
HSLDPT   DS    CL2      6   29    2  A  U N             T        Y              
HSLDPTLH DS    XL8                                                              
HSLDPTL  DS    CL9      6   32    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   43    6  A  P N             T        Y              
HSLLENH  DS    XL8                                                              
HSLLEN   DS    CL3      6   52    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL41     9    2   41  A  P N             T        Y              
HSLLNE1H DS    XL8                                                              
HSLLNE1  DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    10    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    11    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    12    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    13    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    14    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    15    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    16    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    17    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    18    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    19    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    20    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    21    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    22    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    23    7   70  A  P N             T        Y              
HSLTAGH  DS    XL8                                                              
HSLTAG   DS    CL1     23   78    1  A  P N             T        Y              
HSLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
HSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1552 BYTES                            
