*          DATA SET NEGOLF5D   AT LEVEL 004 AS OF 08/24/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T314F5D      DATE 08/24/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
BRUCLIH  DS    XL8                                                              
BRUCLI   DS    CL3      5   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     7    2   20  A  P N             T        Y              
BRUUADH  DS    XL8                                                              
BRUUAD   DS    CL1      7   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19     8    2   19  A  P N             T        Y              
BRURSDH  DS    XL8                                                              
BRURSD   DS    CL1      8   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
BRUDWPH  DS    XL8                                                              
BRUDWP   DS    CL3     10   21    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   30    9  A  P N             T        Y              
BRUNTPH  DS    XL8                                                              
BRUNTP   DS    CL3     10   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   51    9  A  P N             T        Y              
BRUPGPH  DS    XL8                                                              
BRUPGP   DS    CL3     10   63    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    11    2   32  A  P N             T        Y              
BRUTBLH  DS    XL8                                                              
BRUTBL   DS    CL3     11   40    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   44    1  A  P N             T        Y              
BRUTBUH  DS    XL8                                                              
BRUTBU   DS    CL3     11   46    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    12    2   31  A  P N             T        Y              
BRUGBLH  DS    XL8                                                              
BRUGBL   DS    CL3     12   40    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   44    1  A  P N             T        Y              
BRUGBUH  DS    XL8                                                              
BRUGBU   DS    CL3     12   46    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    13    2   33  A  P N             T        Y              
BRUWBLH  DS    XL8                                                              
BRUWBL   DS    CL3     13   40    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   44    1  A  P N             T        Y              
BRUWBUH  DS    XL8                                                              
BRUWBU   DS    CL3     13   46    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    14    2   16  A  P N             T        Y              
BRUIZUH  DS    XL8                                                              
BRUIZU   DS    CL1     14   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    15   40   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    16    2   32  A  P N             T        Y              
BRUDW1H  DS    XL8                                                              
BRUDW1   DS    CL3     16   40    3  N  U N             T        Y              
BRUDW2H  DS    XL8                                                              
BRUDW2   DS    CL3     16   52    3  N  U N             T        Y              
BRUDW3H  DS    XL8                                                              
BRUDW3   DS    CL3     16   64    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    17    2   30  A  P N             T        Y              
BRUTL1H  DS    XL8                                                              
BRUTL1   DS    CL3     17   40    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   44    1  A  P N             T        Y              
BRUTU1H  DS    XL8                                                              
BRUTU1   DS    CL3     17   46    3  N  U N             T        Y              
BRUTL2H  DS    XL8                                                              
BRUTL2   DS    CL3     17   52    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   56    1  A  P N             T        Y              
BRUTU2H  DS    XL8                                                              
BRUTU2   DS    CL3     17   58    3  N  U N             T        Y              
BRUTL3H  DS    XL8                                                              
BRUTL3   DS    CL3     17   64    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   68    1  A  P N             T        Y              
BRUTU3H  DS    XL8                                                              
BRUTU3   DS    CL3     17   70    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    18    2   30  A  P N             T        Y              
BRUBL1H  DS    XL8                                                              
BRUBL1   DS    CL3     18   40    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   44    1  A  P N             T        Y              
BRUBU1H  DS    XL8                                                              
BRUBU1   DS    CL3     18   46    3  N  U N             T        Y              
BRUBL2H  DS    XL8                                                              
BRUBL2   DS    CL3     18   52    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   56    1  A  P N             T        Y              
BRUBU2H  DS    XL8                                                              
BRUBU2   DS    CL3     18   58    3  N  U N             T        Y              
BRUBL3H  DS    XL8                                                              
BRUBL3   DS    CL3     18   64    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   68    1  A  P N             T        Y              
BRUBU3H  DS    XL8                                                              
BRUBU3   DS    CL3     18   70    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    19    2   32  A  P N             T        Y              
BRUWL1H  DS    XL8                                                              
BRUWL1   DS    CL3     19   40    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   44    1  A  P N             T        Y              
BRUWU1H  DS    XL8                                                              
BRUWU1   DS    CL3     19   46    3  N  U N             T        Y              
BRUWL2H  DS    XL8                                                              
BRUWL2   DS    CL3     19   52    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   56    1  A  P N             T        Y              
BRUWU2H  DS    XL8                                                              
BRUWU2   DS    CL3     19   58    3  N  U N             T        Y              
BRUWL3H  DS    XL8                                                              
BRUWL3   DS    CL3     19   64    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   68    1  A  P N             T        Y              
BRUWU3H  DS    XL8                                                              
BRUWU3   DS    CL3     19   70    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL34    21    2   34  A  P N             T        Y              
BRUNTIH  DS    XL8                                                              
BRUNTI   DS    CL3     21   40    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    22    2   32  A  P N             T        Y              
BRUCTIH  DS    XL8                                                              
BRUCTI   DS    CL3     22   40    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    23    2   31  A  P N             T        Y              
BRUMDSH  DS    XL8                                                              
BRUMDS   DS    CL3     23   40    3  N  U N             T        Y              
BRUENDH  DS    XL8                                                              
BRUEND   DS    CL1     23   78    1  A  U N             T        Y              
BRULAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
BRUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1120 BYTES                            
