*          DATA SET NEGOLF1TD  AT LEVEL 009 AS OF 09/22/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T314F1D      DATE 09/22/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
GOLMEDH  DS    CL8                                                              
GOLMED   DS    CL4      5   12    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   21    6  A  P N             T        Y              
GOLCLIH  DS    CL8                                                              
GOLCLI   DS    CL4      5   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   40    7  A  P N             T        Y              
GOLPRDH  DS    CL8                                                              
GOLPRD   DS    CL7      5   49    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   58    7  A  P N             T        Y              
GOLNETH  DS    CL8                                                              
GOLNET   DS    CL4      5   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
GOLESTH  DS    CL8                                                              
GOLEST   DS    CL4      6   12    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   21    7  A  P N             T        Y              
GOLDPTH  DS    CL8                                                              
GOLDPT   DS    CL8      6   30    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   40    6  A  P N             T        Y              
GOLLENH  DS    CL8                                                              
GOLLEN   DS    CL3      6   49    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   58    6  A  P N             T        Y              
GOLPERH  DS    CL8                                                              
GOLPER   DS    CL8      6   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   76    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
GOLOPTH  DS    CL8                                                              
GOLOPT   DS    CL65     7   12   65  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
GOLTARH  DS    CL8                                                              
GOLTAR   DS    CL11     8    9   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   23    5  A  P N             T        Y              
GOLDM2H  DS    CL8                                                              
GOLDM2   DS    CL11     8   30   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   56    7  A  P N             T        Y              
GOLPLNH  DS    CL8                                                              
GOLPLN   DS    CL12     8   65   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   23    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   39    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   54    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   69    5  A  P N             T        Y              
GOLDT01H DS    CL8                                                              
GOLDT01  DS    CL17    11    2   17  A  U N             T        Y              
GOLDL01H DS    CL8                                                              
GOLDL01  DS    CL11    11   23   11  A  U N             T        Y              
GOLV101H DS    CL8                                                              
GOLV101  DS    CL5     11   41    5  A  U N             T        Y              
GOLV201H DS    CL8                                                              
GOLV201  DS    CL5     11   56    5  A  U N             T        Y              
GOLDY01H DS    CL8                                                              
GOLDY01  DS    CL5     11   69    5  A  U N             T        Y              
GOLDT02H DS    CL8                                                              
GOLDT02  DS    CL17    12    2   17  A  U N             T        Y              
GOLDL02H DS    CL8                                                              
GOLDL02  DS    CL11    12   23   11  A  U N             T        Y              
GOLV102H DS    CL8                                                              
GOLV102  DS    CL5     12   41    5  A  U N             T        Y              
GOLV202H DS    CL8                                                              
GOLV202  DS    CL5     12   56    5  A  U N             T        Y              
GOLDY02H DS    CL8                                                              
GOLDY02  DS    CL5     12   69    5  A  U N             T        Y              
GOLDT03H DS    CL8                                                              
GOLDT03  DS    CL17    13    2   17  A  U N             T        Y              
GOLDL03H DS    CL8                                                              
GOLDL03  DS    CL11    13   23   11  A  U N             T        Y              
GOLV103H DS    CL8                                                              
GOLV103  DS    CL5     13   41    5  A  U N             T        Y              
GOLV203H DS    CL8                                                              
GOLV203  DS    CL5     13   56    5  A  U N             T        Y              
GOLDY03H DS    CL8                                                              
GOLDY03  DS    CL5     13   69    5  A  U N             T        Y              
GOLDT04H DS    CL8                                                              
GOLDT04  DS    CL17    14    2   17  A  U N             T        Y              
GOLDL04H DS    CL8                                                              
GOLDL04  DS    CL11    14   23   11  A  U N             T        Y              
GOLV104H DS    CL8                                                              
GOLV104  DS    CL5     14   41    5  A  U N             T        Y              
GOLV204H DS    CL8                                                              
GOLV204  DS    CL5     14   56    5  A  U N             T        Y              
GOLDY04H DS    CL8                                                              
GOLDY04  DS    CL5     14   69    5  A  U N             T        Y              
GOLDT05H DS    CL8                                                              
GOLDT05  DS    CL17    15    2   17  A  U N             T        Y              
GOLDL05H DS    CL8                                                              
GOLDL05  DS    CL11    15   23   11  A  U N             T        Y              
GOLV105H DS    CL8                                                              
GOLV105  DS    CL5     15   41    5  A  U N             T        Y              
GOLV205H DS    CL8                                                              
GOLV205  DS    CL5     15   56    5  A  U N             T        Y              
GOLDY05H DS    CL8                                                              
GOLDY05  DS    CL5     15   69    5  A  U N             T        Y              
GOLDT06H DS    CL8                                                              
GOLDT06  DS    CL17    16    2   17  A  U N             T        Y              
GOLDL06H DS    CL8                                                              
GOLDL06  DS    CL11    16   23   11  A  U N             T        Y              
GOLV106H DS    CL8                                                              
GOLV106  DS    CL5     16   41    5  A  U N             T        Y              
GOLV206H DS    CL8                                                              
GOLV206  DS    CL5     16   56    5  A  U N             T        Y              
GOLDY06H DS    CL8                                                              
GOLDY06  DS    CL5     16   69    5  A  U N             T        Y              
GOLDT07H DS    CL8                                                              
GOLDT07  DS    CL17    17    2   17  A  U N             T        Y              
GOLDL07H DS    CL8                                                              
GOLDL07  DS    CL11    17   23   11  A  U N             T        Y              
GOLV107H DS    CL8                                                              
GOLV107  DS    CL5     17   41    5  A  U N             T        Y              
GOLV207H DS    CL8                                                              
GOLV207  DS    CL5     17   56    5  A  U N             T        Y              
GOLDY07H DS    CL8                                                              
GOLDY07  DS    CL5     17   69    5  A  U N             T        Y              
GOLDT08H DS    CL8                                                              
GOLDT08  DS    CL17    18    2   17  A  U N             T        Y              
GOLDL08H DS    CL8                                                              
GOLDL08  DS    CL11    18   23   11  A  U N             T        Y              
GOLV108H DS    CL8                                                              
GOLV108  DS    CL5     18   41    5  A  U N             T        Y              
GOLV208H DS    CL8                                                              
GOLV208  DS    CL5     18   56    5  A  U N             T        Y              
GOLDY08H DS    CL8                                                              
GOLDY08  DS    CL5     18   69    5  A  U N             T        Y              
GOLDT09H DS    CL8                                                              
GOLDT09  DS    CL17    19    2   17  A  U N             T        Y              
GOLDL09H DS    CL8                                                              
GOLDL09  DS    CL11    19   23   11  A  U N             T        Y              
GOLV109H DS    CL8                                                              
GOLV109  DS    CL5     19   41    5  A  U N             T        Y              
GOLV209H DS    CL8                                                              
GOLV209  DS    CL5     19   56    5  A  U N             T        Y              
GOLDY09H DS    CL8                                                              
GOLDY09  DS    CL5     19   69    5  A  U N             T        Y              
GOLDT10H DS    CL8                                                              
GOLDT10  DS    CL17    20    2   17  A  U N             T        Y              
GOLDL10H DS    CL8                                                              
GOLDL10  DS    CL11    20   23   11  A  U N             T        Y              
GOLV110H DS    CL8                                                              
GOLV110  DS    CL5     20   41    5  A  U N             T        Y              
GOLV210H DS    CL8                                                              
GOLV210  DS    CL5     20   56    5  A  U N             T        Y              
GOLDY10H DS    CL8                                                              
GOLDY10  DS    CL5     20   69    5  A  U N             T        Y              
GOLDT11H DS    CL8                                                              
GOLDT11  DS    CL17    21    2   17  A  U N             T        Y              
GOLDL11H DS    CL8                                                              
GOLDL11  DS    CL11    21   23   11  A  U N             T        Y              
GOLV111H DS    CL8                                                              
GOLV111  DS    CL5     21   41    5  A  U N             T        Y              
GOLV211H DS    CL8                                                              
GOLV211  DS    CL5     21   56    5  A  U N             T        Y              
GOLDY11H DS    CL8                                                              
GOLDY11  DS    CL5     21   69    5  A  U N             T        Y              
GOLDT12H DS    CL8                                                              
GOLDT12  DS    CL17    22    2   17  A  U N             T        Y              
GOLDL12H DS    CL8                                                              
GOLDL12  DS    CL11    22   23   11  A  U N             T        Y              
GOLV112H DS    CL8                                                              
GOLV112  DS    CL5     22   41    5  A  U N             T        Y              
GOLV212H DS    CL8                                                              
GOLV212  DS    CL5     22   56    5  A  U N             T        Y              
GOLDY12H DS    CL8                                                              
GOLDY12  DS    CL5     22   69    5  A  U N             T        Y              
GOLDT13H DS    CL8                                                              
GOLDT13  DS    CL17    23    2   17  A  U N             T        Y              
GOLDL13H DS    CL8                                                              
GOLDL13  DS    CL11    23   23   11  A  U N             T        Y              
GOLV113H DS    CL8                                                              
GOLV113  DS    CL5     23   41    5  A  U N             T        Y              
GOLV213H DS    CL8                                                              
GOLV213  DS    CL5     23   56    5  A  U N             T        Y              
GOLDY13H DS    CL8                                                              
GOLDY13  DS    CL5     23   69    5  A  U N             T        Y              
GOLDT14H DS    CL8                                                              
GOLDT14  DS    CL17    24    2   17  A  U N             T        Y              
GOLDL14H DS    CL8                                                              
GOLDL14  DS    CL11    24   23   11  A  U N             T        Y              
GOLV114H DS    CL8                                                              
GOLV114  DS    CL5     24   41    5  A  U N             T        Y              
GOLV214H DS    CL8                                                              
GOLV214  DS    CL5     24   56    5  A  U N             T        Y              
GOLDY14H DS    CL8                                                              
GOLDY14  DS    CL5     24   69    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
GOLLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
GOLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
