*          DATA SET NEGOLF1D   AT LEVEL 005 AS OF 08/09/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T314F1D      DATE 08/09/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
GOLMEDH  DS    XL8                                                              
GOLMED   DS    CL4      5   12    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   21    6  A  P N             T        Y              
GOLCLIH  DS    XL8                                                              
GOLCLI   DS    CL4      5   29    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   43    7  A  P N             T        Y              
GOLPRDH  DS    XL8                                                              
GOLPRD   DS    CL7      5   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   61    7  A  P N             T        Y              
GOLNETH  DS    XL8                                                              
GOLNET   DS    CL4      5   70    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
GOLESTH  DS    XL8                                                              
GOLEST   DS    CL4      6   12    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   21    7  A  P N             T        Y              
GOLDPTH  DS    XL8                                                              
GOLDPT   DS    CL2      6   29    2  A  U N             T        Y              
GOLDPTLH DS    XL8                                                              
GOLDPTL  DS    CL9      6   32    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   43    6  A  P N             T        Y              
GOLLENH  DS    XL8                                                              
GOLLEN   DS    CL3      6   52    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   61    6  A  P N             T        Y              
GOLPERH  DS    XL8                                                              
GOLPER   DS    CL8      6   70    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
GOLOPTH  DS    XL8                                                              
GOLOPT   DS    CL65     7   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      8    2    2  A  P N             T        Y              
GOLTARH  DS    XL8                                                              
GOLTAR   DS    CL11     8    6   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      8   20    2  A  P N             T        Y              
GOLDM2H  DS    XL8                                                              
GOLDM2   DS    CL11     8   24   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      8   38    2  A  P N             T        Y              
GOLDM3H  DS    XL8                                                              
GOLDM3   DS    CL11     8   42   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   56    7  A  P N             T        Y              
GOLPLNH  DS    XL8                                                              
GOLPLN   DS    CL12     8   65   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   23    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   39    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   49    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   69    5  A  P N             T        Y              
GOLDT01H DS    XL8                                                              
GOLDT01  DS    CL17    11    2   17  A  U N             T        Y              
GOLDL01H DS    XL8                                                              
GOLDL01  DS    CL11    11   23   11  A  U N             T        Y              
GOLV101H DS    XL8                                                              
GOLV101  DS    CL5     11   39    5  A  U N             T        Y              
GOLV201H DS    XL8                                                              
GOLV201  DS    CL5     11   49    5  A  U N             T        Y              
GOLV301H DS    XL8                                                              
GOLV301  DS    CL5     11   59    5  A  U N             T        Y              
GOLDY01H DS    XL8                                                              
GOLDY01  DS    CL5     11   69    5  A  U N             T        Y              
GOLDT02H DS    XL8                                                              
GOLDT02  DS    CL17    12    2   17  A  U N             T        Y              
GOLDL02H DS    XL8                                                              
GOLDL02  DS    CL11    12   23   11  A  U N             T        Y              
GOLV102H DS    XL8                                                              
GOLV102  DS    CL5     12   39    5  A  U N             T        Y              
GOLV202H DS    XL8                                                              
GOLV202  DS    CL5     12   49    5  A  U N             T        Y              
GOLV302H DS    XL8                                                              
GOLV302  DS    CL5     12   59    5  A  U N             T        Y              
GOLDY02H DS    XL8                                                              
GOLDY02  DS    CL5     12   69    5  A  U N             T        Y              
GOLDT03H DS    XL8                                                              
GOLDT03  DS    CL17    13    2   17  A  U N             T        Y              
GOLDL03H DS    XL8                                                              
GOLDL03  DS    CL11    13   23   11  A  U N             T        Y              
GOLV103H DS    XL8                                                              
GOLV103  DS    CL5     13   39    5  A  U N             T        Y              
GOLV203H DS    XL8                                                              
GOLV203  DS    CL5     13   49    5  A  U N             T        Y              
GOLV303H DS    XL8                                                              
GOLV303  DS    CL5     13   59    5  A  U N             T        Y              
GOLDY03H DS    XL8                                                              
GOLDY03  DS    CL5     13   69    5  A  U N             T        Y              
GOLDT04H DS    XL8                                                              
GOLDT04  DS    CL17    14    2   17  A  U N             T        Y              
GOLDL04H DS    XL8                                                              
GOLDL04  DS    CL11    14   23   11  A  U N             T        Y              
GOLV104H DS    XL8                                                              
GOLV104  DS    CL5     14   39    5  A  U N             T        Y              
GOLV204H DS    XL8                                                              
GOLV204  DS    CL5     14   49    5  A  U N             T        Y              
GOLV304H DS    XL8                                                              
GOLV304  DS    CL5     14   59    5  A  U N             T        Y              
GOLDY04H DS    XL8                                                              
GOLDY04  DS    CL5     14   69    5  A  U N             T        Y              
GOLDT05H DS    XL8                                                              
GOLDT05  DS    CL17    15    2   17  A  U N             T        Y              
GOLDL05H DS    XL8                                                              
GOLDL05  DS    CL11    15   23   11  A  U N             T        Y              
GOLV105H DS    XL8                                                              
GOLV105  DS    CL5     15   39    5  A  U N             T        Y              
GOLV205H DS    XL8                                                              
GOLV205  DS    CL5     15   49    5  A  U N             T        Y              
GOLV305H DS    XL8                                                              
GOLV305  DS    CL5     15   59    5  A  U N             T        Y              
GOLDY05H DS    XL8                                                              
GOLDY05  DS    CL5     15   69    5  A  U N             T        Y              
GOLDT06H DS    XL8                                                              
GOLDT06  DS    CL17    16    2   17  A  U N             T        Y              
GOLDL06H DS    XL8                                                              
GOLDL06  DS    CL11    16   23   11  A  U N             T        Y              
GOLV106H DS    XL8                                                              
GOLV106  DS    CL5     16   39    5  A  U N             T        Y              
GOLV206H DS    XL8                                                              
GOLV206  DS    CL5     16   49    5  A  U N             T        Y              
GOLV306H DS    XL8                                                              
GOLV306  DS    CL5     16   59    5  A  U N             T        Y              
GOLDY06H DS    XL8                                                              
GOLDY06  DS    CL5     16   69    5  A  U N             T        Y              
GOLDT07H DS    XL8                                                              
GOLDT07  DS    CL17    17    2   17  A  U N             T        Y              
GOLDL07H DS    XL8                                                              
GOLDL07  DS    CL11    17   23   11  A  U N             T        Y              
GOLV107H DS    XL8                                                              
GOLV107  DS    CL5     17   39    5  A  U N             T        Y              
GOLV207H DS    XL8                                                              
GOLV207  DS    CL5     17   49    5  A  U N             T        Y              
GOLV307H DS    XL8                                                              
GOLV307  DS    CL5     17   59    5  A  U N             T        Y              
GOLDY07H DS    XL8                                                              
GOLDY07  DS    CL5     17   69    5  A  U N             T        Y              
GOLDT08H DS    XL8                                                              
GOLDT08  DS    CL17    18    2   17  A  U N             T        Y              
GOLDL08H DS    XL8                                                              
GOLDL08  DS    CL11    18   23   11  A  U N             T        Y              
GOLV108H DS    XL8                                                              
GOLV108  DS    CL5     18   39    5  A  U N             T        Y              
GOLV208H DS    XL8                                                              
GOLV208  DS    CL5     18   49    5  A  U N             T        Y              
GOLV308H DS    XL8                                                              
GOLV308  DS    CL5     18   59    5  A  U N             T        Y              
GOLDY08H DS    XL8                                                              
GOLDY08  DS    CL5     18   69    5  A  U N             T        Y              
GOLDT09H DS    XL8                                                              
GOLDT09  DS    CL17    19    2   17  A  U N             T        Y              
GOLDL09H DS    XL8                                                              
GOLDL09  DS    CL11    19   23   11  A  U N             T        Y              
GOLV109H DS    XL8                                                              
GOLV109  DS    CL5     19   39    5  A  U N             T        Y              
GOLV209H DS    XL8                                                              
GOLV209  DS    CL5     19   49    5  A  U N             T        Y              
GOLV309H DS    XL8                                                              
GOLV309  DS    CL5     19   59    5  A  U N             T        Y              
GOLDY09H DS    XL8                                                              
GOLDY09  DS    CL5     19   69    5  A  U N             T        Y              
GOLDT10H DS    XL8                                                              
GOLDT10  DS    CL17    20    2   17  A  U N             T        Y              
GOLDL10H DS    XL8                                                              
GOLDL10  DS    CL11    20   23   11  A  U N             T        Y              
GOLV110H DS    XL8                                                              
GOLV110  DS    CL5     20   39    5  A  U N             T        Y              
GOLV210H DS    XL8                                                              
GOLV210  DS    CL5     20   49    5  A  U N             T        Y              
GOLV310H DS    XL8                                                              
GOLV310  DS    CL5     20   59    5  A  U N             T        Y              
GOLDY10H DS    XL8                                                              
GOLDY10  DS    CL5     20   69    5  A  U N             T        Y              
GOLDT11H DS    XL8                                                              
GOLDT11  DS    CL17    21    2   17  A  U N             T        Y              
GOLDL11H DS    XL8                                                              
GOLDL11  DS    CL11    21   23   11  A  U N             T        Y              
GOLV111H DS    XL8                                                              
GOLV111  DS    CL5     21   39    5  A  U N             T        Y              
GOLV211H DS    XL8                                                              
GOLV211  DS    CL5     21   49    5  A  U N             T        Y              
GOLV311H DS    XL8                                                              
GOLV311  DS    CL5     21   59    5  A  U N             T        Y              
GOLDY11H DS    XL8                                                              
GOLDY11  DS    CL5     21   69    5  A  U N             T        Y              
GOLDT12H DS    XL8                                                              
GOLDT12  DS    CL17    22    2   17  A  U N             T        Y              
GOLDL12H DS    XL8                                                              
GOLDL12  DS    CL11    22   23   11  A  U N             T        Y              
GOLV112H DS    XL8                                                              
GOLV112  DS    CL5     22   39    5  A  U N             T        Y              
GOLV212H DS    XL8                                                              
GOLV212  DS    CL5     22   49    5  A  U N             T        Y              
GOLV312H DS    XL8                                                              
GOLV312  DS    CL5     22   59    5  A  U N             T        Y              
GOLDY12H DS    XL8                                                              
GOLDY12  DS    CL5     22   69    5  A  U N             T        Y              
GOLDT13H DS    XL8                                                              
GOLDT13  DS    CL17    23    2   17  A  U N             T        Y              
GOLDL13H DS    XL8                                                              
GOLDL13  DS    CL11    23   23   11  A  U N             T        Y              
GOLV113H DS    XL8                                                              
GOLV113  DS    CL5     23   39    5  A  U N             T        Y              
GOLV213H DS    XL8                                                              
GOLV213  DS    CL5     23   49    5  A  U N             T        Y              
GOLV313H DS    XL8                                                              
GOLV313  DS    CL5     23   59    5  A  U N             T        Y              
GOLDY13H DS    XL8                                                              
GOLDY13  DS    CL5     23   69    5  A  U N             T        Y              
GOLDT14H DS    XL8                                                              
GOLDT14  DS    CL17    24    2   17  A  U N             T        Y              
GOLDL14H DS    XL8                                                              
GOLDL14  DS    CL11    24   23   11  A  U N             T        Y              
GOLV114H DS    XL8                                                              
GOLV114  DS    CL5     24   39    5  A  U N             T        Y              
GOLV214H DS    XL8                                                              
GOLV214  DS    CL5     24   49    5  A  U N             T        Y              
GOLV314H DS    XL8                                                              
GOLV314  DS    CL5     24   59    5  A  U N             T        Y              
GOLDY14H DS    XL8                                                              
GOLDY14  DS    CL5     24   69    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
GOLLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
GOLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
