*          DATA SET NEGOALIOD  AT LEVEL 003 AS OF 05/15/84                      
***** GOALIO BLOCK                                                              
*                                                                               
GOALMODE DS    CL1                                                              
GOALFRST EQU   0                                                                
PROCGOAL EQU   1                   PROCESS GOAL                                 
GOALLAST EQU   2                                                                
GOALWEEK DS    CL1                                                              
GOALBRND DS    CL1                                                              
GOALDOL  DS    F                                                                
GOALGRP  DS    F                                                                
GOALMKT  DS    CL2                                                              
*                                                                               
NUMPRDS  DS    F                                                                
*                                                                               
*                                                                               
