*          DATA SET NEINTGBLK  AT LEVEL 006 AS OF 03/20/86                      
*              NETWORK INTEGRATION RECORD BLOCK                                 
         SPACE 3                                                                
NIBLKD   DSECT                                                                  
         DS    0F                                                               
NIBAIO   DS    A                   I/O AREA FOR INTGDATA=2000CL                 
NIBNETB  DS    A                   A(NETBLOCK)                                  
NIBAIO2  DS    A                   I/O AREA ON SECOND CALL                      
         DS    4A                  SPARE                                        
         SPACE 1                                                                
NIBCNTL  DS    CL1                 OPTION TO PASS BACK REC X'80'                
NIBAM    DS    CL1                 AGY/MED                                      
NIBNTWK  DS    CL4                 NETWORK                                      
NIBDAY   DS    CL1                 DAY    (X'40'=MON,X'20'=TUE, ETC.)           
NIBDPT   DS    CL1                 DAYPART                                      
NIBTIME  DS    CL4                 TIME                                         
NIBPROG  DS    CL6                 PROGRAM CODE                                 
NIBSTRT  DS    XL2                 START DATE                                   
NIBEND   DS    XL2                 END DATE                                     
NIBDSKSV DS    CL4                                                              
*                                                                               
NIBRATE  DS    XL4                 RETURNS RATE                                 
         SPACE 1                                                                
NIBAIOD  DS    0CL7                                                             
NIBDDTE  DS    XL3                 EFFECTIVE DATE                               
NIBDSKA  DS    XL4                 DISKADDRESS                                  
         DS    CL10                SPARE                                        
