* NETWORK MEDIA TAPE DSECT                                                      
*                                                                               
SRTREC   DS    0CL242                                                           
SRTPRD   DS    CL3                 PRODUCT                              00650**1
SRTCCODE DS    XL1                 COUNTRY CODE=X'00'                   00651**1
SRTESTNO DS    CL3                 EST NUMBER                           00653**1
SRTESTNM DS    CL20                ESTNAME                              00654**1
SRTFILL  DS    XL1                 FILLER = X'00'                       00655**1
SRTESTST DS    CL8                 MMDDYYYY                             00656**1
SRTESTND DS    CL8                 MMDDYYYY                             00657**1
SRTBUYID DS    PL9                 UNIQUE IDENTIFICATION NO             00658*15
SRTDPT   DS    CL1                 DAYPART                              00659**1
SRTMONTH DS    CL3                 JAN/FEB/ETC                          00660**1
SRTDAY   DS    CL3                 MON/TUE/ETC                          00661**1
SRTPROG  DS    CL6                 PROGRAM                              00662**1
SRTPRGNM DS    CL16                PROGRAM NAME                         00663**1
SRTNET   DS    CL4                 NETWORK                              00664**1
SRTULEN  DS    CL2                 UNIT LENGTH/30/60/ETC                00665**1
SRTACT   DS    PL6                 ACTUAL COST/DECIMALS                 00666**1
SRTINTG  DS    PL6                 INTEGRATION/DECIMALS                 00667**1
SRTEHR   DS    PL3                 EST HH RTG/PACKED ONE DEC            00668**1
SRTAHR   DS    PL3                 ACT HH RTG/PACKED ONE DEC            00669**1
SRTEHI   DS    PL6                 EST HH IMPS/PACKED                   00670**1
SRTAHI   DS    PL6                 ACT HH IMPS/PACKED                   00671**1
SRTTDEMO DS    CL10                TARGET DEMO                          00672**1
SRTETR   DS    PL3                 EST TARGET RTG/PACKED 1 DEC          00673**1
SRTATR   DS    PL3                 ACT TARGET RTG/PACKED 1 DEC          00674**1
SRTETI   DS    PL6                 EST TARGET IMPS/PACKED               00675**1
SRTATI   DS    PL6                 ACT TARGET IMPS/PACKED               00676**1
SRTACTIV DS    CL8                 LAST ACTIVITY DATE/MMDDYYYY          00677**1
SRTPFILT DS    CL6                 PACKAGE FILTER                       00678**6
SRTISCI  DS    CL80                ISCI REGION CODES 8 * 10             00679*13
SRTMEDIA DS    CL1                 MEDIA TYPE                           00680**1
SRTUTYP  DS    CL1                 P=PREEMPT/M=MISSED                   00681**1
*                                                                       00684**1
