*          DATA SET NELNKWRK   AT LEVEL 014 AS OF 11/30/17                      
***********************************************************************         
* GLOBAL EQUATES                                                      *         
***********************************************************************         
                                                                                
B#WORKD  EQU   1                   BLOCK NUMBER FOR WORKD                       
B#SAVED  EQU   2                   BLOCK NUMBER FOR SAVED                       
B#TWAD   EQU   15                  BLOCK NUMBER FOR TWAD                        
                                                                                
NETLETQ  EQU   C'N'                NETWORK SYSTEM LETTER                        
NETSYSQ  EQU   X'03'               NETWORK SYSTEM NUMBER                        
SYSPHASE EQU   X'0302'             SYSTEM PHASE                                 
                                                                                
#AGYREC  EQU   IO2                 AGENCY RECORD I/O AREA                       
AAGYREC  EQU   AIOS-4+(#AGYREC/ONEK)                                            
#NTAVREC EQU   IO2                 NTI AVERAGE RECORD I/O AREA                  
ANTAVREC EQU   AIOS-4+(#NTAVREC/ONEK)                                           
#STAREC  EQU   IO3                 STATION RECORD I/O AREA                      
ASTAREC  EQU   AIOS-4+(#STAREC/ONEK)                                            
                                                                                
MEDNET   EQU   C'N'                MEDIA - NETWORK                              
MEDSYN   EQU   C'S'                      - SYNDICATION                          
MEDCAB   EQU   C'C'                      - CABLE                                
MEDNHW   EQU   C'H'                      - HISPANIC WEEKLY                      
                                                                                
NETSTAQ  EQU   C'T'                LAST CHAR OF STATION BY MEDIA                
CBLSTAQ  EQU   C'C'                                                             
SYNSTAQ  EQU   C'S'                                                             
HISSTAQ  EQU   C'H'                                                             
                                                                                
SRCPROG  EQU   C'P'                SOURCE- PROGRAM                              
SRCTP    EQU   C'T'                      - TIME PERIOD                          
                                                                                
MAXDEMQ  EQU   50                  MAX NUMBER OF DEMOS FOR ONE MODIFIER         
MAXMODQ  EQU   7                   MAX NUMBER OF MODIFIERS                      
                                                                                
NULLCQ   EQU   C'~'                NULL INDICATOR CHAR (FOR PC)                 
                                                                                
VER10023 EQU   X'01000017'         PC VERSION  1.0.0.23 (WITH LP_VRSN)          
                                                                                
M_F      EQU   X'7C'               MONDAY TO FRIDAY                             
M_S      EQU   X'7F'               MONDAY TO SUNDAY                             
                                                                                
PMAXDEMQ EQU   54                  MAX NUMBER OF DEMOS ON THE PROG RECD         
                                                                                
ELEM01   EQU   X'01'               ELEMENT CODE 01                              
ELEM03   EQU   X'03'               ELEMENT CODE 03                              
ELEM5D   EQU   X'5D'               ELEMENT CODE 5D                              
ELEM92   EQU   X'92'               ELEMENT CODE 92                              
ELEM93   EQU   X'93'               ELEMENT CODE 93                              
ELEMC3   EQU   X'C3'               ELEMENT CODE C3                              
                                                                                
RWIMPMOD EQU   C'Y'                RAW IMPRESSIONS MODIFIER                     
IMPMOD   EQU   C'I'                IMPRESSIONS MODIFIER                         
UNVMOD   EQU   C'U'                UNIVERSE MODIFIER                            
RTGMOD   EQU   C'R'                RATINGS MODIFIER                             
VPHMOD   EQU   C'V'                VPH MODIFIER                                 
GWIMPMOD EQU   C'B'                GAA RAW IMPRESSIONS MODIFIER                 
GAIMPMOD EQU   C'N'                GAA IMPRESSIONS MODIFIER                     
GARTGMOD EQU   C'L'                GAA RATINGS MODIFIER                         
GAVPHMOD EQU   C'M'                GAA VPH MODOFIER                             
PPUTMOD  EQU   C'Z'                PROGRAM PUTS MODIFIER                        
SHRMOD   EQU   C'S'                SHARE MODIFIER                               
                                                                                
***********************************************************************         
* TRANSACTION MAP EQUATES                                             *         
***********************************************************************         
                                                                                
M#INIT   EQU   1                   INITIAL DOWNLOAD                             
M#LTBK   EQU   2                   LATEST BOOK DOWNLOAD                         
M#SMAST  EQU   3                   NET STATION MASTER RECORDS                   
M#DDEF   EQU   4                   DEMDEF RECORDS DOWNLOAD                      
M#CNRP   EQU   5                   AUD ESTIMATOR REPORT DOWNLOAD                
M#DDSTM  EQU   6                   DEMDEF STAMP DOWNLOAD                        
M#PDOWN  EQU   7                   PROGRAM RECORDS DOWNLOAD                     
M#DEINFO EQU   100                 DEMO ENGINE DOWNLOAD - DEMO INFO             
M#DEFORM EQU   101                 DEMO ENGINE DOWNLOAD - FORMULAS              
M#SDR    EQU   353                 RATING SOURCE DOWNLOAD                       
                                                                                
***********************************************************************         
* OVERLAY PHASE NUMBER EQUATES                                        *         
***********************************************************************         
                                                                                
P#ROUTS1 EQU   X'01'               GLOBAL ROUTINES 1 OVERLAY NUMBER             
P#ROUTS2 EQU   X'02'               GLOBAL ROUTINES 2 OVERLAY NUMBER             
                                                                                
***********************************************************************         
* MISCELLANEOUS EQUATES                                               *         
***********************************************************************         
                                                                                
YESQ     EQU   C'Y'                                                             
NOQ      EQU   C'N'                                                             
ONLYQ    EQU   C'O'                                                             
FF       EQU   X'FF'                                                            
FE       EQU   X'FE'                                                            
ONEK     EQU   1024                                                             
         EJECT                                                                  
WORKD    DSECT                                                                  
                                                                                
DUB      DS    D                                                                
DUB1     DS    D                                                                
DUB2     DS    D                                                                
WORK     DS    XL64                                                             
WORK2    DS    XL64                                                             
FULL1    DS    F                                                                
FULL2    DS    F                                                                
HALF1    DS    H                                                                
HALF2    DS    H                                                                
BYTE1    DS    X                                                                
BYTE2    DS    X                                                                
BYTE3    DS    X                                                                
BYTE4    DS    X                                                                
TEMP     DS    XL80                                                             
TEMP2    DS    XL80                                                             
ELEM     DS    XL256                                                            
ELEM2    DS    XL256                                                            
DMCB     DS    6F                                                               
PARM     DS    6F                                                               
                                                                                
DUMMYH   DS    XL8                                                              
DUMMYFLD DS    XL256                                                            
AGYALPH  DS    CL2                                                              
                                                                                
BASERD   DS    A                                                                
BASEADDR DS    A                                                                
BASERELO DS    A                                                                
ROU1RELO DS    A                                                                
ROU2RELO DS    A                                                                
SRVRRELO DS    A                                                                
         DS    2A                                                               
                                                                                
AFAPARM  DS    A                                                                
ATIOB    DS    A                                                                
ATWA     DS    A                                                                
ATIA     DS    A                                                                
ACOMFACS DS    A                   A(COMMON FACILITES LIST)                     
ALP      DS    A                                                                
         DS    2A                                                               
                                                                                
AIOS     DS    0A                  ** ADDRESSES OF I/O AREAS **                 
AIO1     DS    A                                                                
AIO2     DS    A                                                                
AIO3     DS    A                                                                
AIO4     DS    A                                                                
AIO5     DS    A                                                                
AIO6     DS    A                                                                
AIO7     DS    A                                                                
AIO8     DS    A                                                                
AIONM    EQU   (*-AIO1)/L'AIO1                                                  
                                                                                
GLVALUES DS    0D                  ** GLOBAL VALUES **                          
                                                                                
RELOLST  DS    0A                  ** RELOCATED ADDRESS CONSTANTS **            
VTWABLD  DS    V                   V(TWABLD)                                    
VWRKIO   DS    V                   V(WRKIO)                                     
VPNAME   DS    V                   V(PNAME)                                     
VNETUNWK DS    V                   V(NETUNWK)                                   
AFACTAB  DS    A                   A(FACILITIES TABLE)                          
ACORPHS  DS    A                   A(CORE RESIDENT PHASE LIST)                  
AFILTAB  DS    A                   A(I/O FILE TABLE)                            
ACMDTAB  DS    A                   A(I/O COMMAND TABLE)                         
ACONTTAB DS    A                   A(PROGRAM CONTENT TYPES TABLE)               
AAIRNTAB DS    A                   A(PROGRAM AIRING TYPES TABLE)                
AMEDIAT  DS    A                   A(MEDIA TABLE)                               
ABBTAB   DS    A                   A(BLD BLOCK TABLE)                           
APRGDTAB DS    A                   A(PROGRAM RECD DEMO TABLE)                   
ANTIDEMS DS    A                   A(NTI DEMOS TABLE)                           
ADISPTAB DS    A                   A(PROG RECD DEMOS DISPLACEMENTS)             
RELOLSTN EQU   (*-RELOLST)/L'RELOLST                                            
         DS    25A                 SPARES                                       
                                                                                
ARZEROS  DS    16F                 16F'0'                                       
SPACES   DS    CL132               C' '                                         
ZEROES   DS    CL132               C'0'                                         
T00A     DS    XL3                 X'D9000A'                                    
EFFS     DS    XL32                X'FFF...FFF'                                 
YES      DS    C                   C'Y'                                         
NO       DS    C                   C'N'                                         
NULLCHRS DS    CL3                 C'N/A'                                       
GLVALUEL EQU   *-GLVALUES                                                       
         DS    XL512               SPARE FOR GLVALUES GROWTH                    
                                                                                
ALET     DS    A                   TABS DATASPACE ALET                          
                                                                                
QVALS    DS    XL512               REQUEST VALUES                               
         ORG   QVALS                                                            
                                                                                
QVALSR   DS    XL(L'QVALS-(*-QVALS))                                            
                                                                                
AROUTS1  DS    A                   A(ROUTINES OVERLAY 1)                        
#WRKINI  EQU   0                                                                
AWRKINI  EQU   AROUTS1,,C'A'                                                    
#IOEXEC  EQU   1                                                                
AIOEXEC  EQU   AROUTS1,,C'A'                                                    
#NXTREC  EQU   2                                                                
ANXTREC  EQU   AROUTS1,,C'A'                                                    
#TYP3TO4 EQU   3                                                                
ATYP3TO4 EQU   AROUTS1,,C'A'                                                    
                                                                                
AROUTS2  DS    A                   A(ROUTINES OVERLAY 2)                        
#VALSRC  EQU   0                                                                
AVALSRC  EQU   AROUTS2,,C'A'       VALIDATE SOURCE                              
$VALSRC  EQU   LD_IUIR2                                                         
#VALDATS EQU   1                                                                
AVALDATS EQU   AROUTS2,,C'A'       VALIDATE START-END DATES                     
$VALDATS EQU   LD_IUIR2                                                         
#VALDYTM EQU   2                                                                
AVALDYTM EQU   AROUTS2,,C'A'       VALIDATE DAYS/TIMES                          
$VALDYTM EQU   LD_IUIR2                                                         
#VALMFID EQU   3                                                                
AVALMFID EQU   AROUTS2,,C'A'       VALIDATE MAINFRAME-ID                        
$VALMFID EQU   LD_IUIR2                                                         
#VALPNAM EQU   4                                                                
AVALPNAM EQU   AROUTS2,,C'A'       VALIDATE PROGRAM NAME                        
$VALPNAM EQU   LD_IUIR2                                                         
#VALMIND EQU   5                                                                
AVALMIND EQU   AROUTS2,,C'A'       VALIDATE MINIMUM DURATION                    
$VALMIND EQU   LD_IUIR2                                                         
#VALNAD  EQU   6                                                                
AVALNAD  EQU   AROUTS2,,C'A'       VALIDATE NAD CATEGORIES                      
$VALNAD  EQU   LD_IUIR2                                                         
#GETAGY  EQU   7                                                                
AGETAGY  EQU   AROUTS2,,C'A'       GET AGENCY RECORD                            
$GETAGY  EQU   LD_IUIR2                                                         
#VALDATE EQU   8                                                                
AVALDATE EQU   AROUTS2,,C'A'       VALIDATE SINGLE DATE                         
$VALDATE EQU   LD_IUIR2                                                         
                                                                                
COMADDR  DS    0V                  ** ADDRESSES FROM COMFACS **                 
ADDAY    DS    V                                                                
BINSRCH  DS    V                                                                
CALLOV   DS    V                                                                
DATCON   DS    V                                                                
DATVAL   DS    V                                                                
DATAMGR  DS    V                                                                
DDLINK   DS    V                                                                
GETDAY   DS    V                                                                
GETFACT  DS    V                                                                
GETPROF  DS    V                                                                
HELLO    DS    V                                                                
HEXIN    DS    V                                                                
HEXOUT   DS    V                                                                
SECRET   DS    V                                                                
SWITCH   DS    V                                                                
XSORT    DS    V                                                                
RUNIT    DS    V                                                                
SCANNER  DS    V                                                                
DEMAND   DS    V                                                                
DEMOUT   DS    V                                                                
DEMADDR  DS    V                                                                
DEMOMATH DS    V                                                                
         DS    19V                                                              
                                                                                
APHASES  DS    0V                  ** LOADED PHASES **                          
FALINK   DS    V                                                                
DEMOCON  DS    V                                                                
TSAR     DS    V                                                                
BOOKVAL  DS    V                                                                
NETWEEK  DS    V                                                                
DAYVAL   DS    V                                                                
TIMVAL   DS    V                                                                
DEFINE   DS    V                                                                
NETUNBK  DS    V                                                                
GETBROAD DS    V                                                                
UNTIME   DS    V                                                                
UNDAY    DS    V                                                                
         DS    19V                                                              
                                                                                
IOVALS   DS    0A                  *** I/O CONTROLLER VARIABLES ***             
IOADDR   DS    A                   I/O AREA ADDRESS                             
IOFILE   DS    CL7                 FILE NAME                                    
IOCMND   DS    CL7                 DATAMGR COMMAND                              
IOFLAG   DS    X                   FLAG BYTE USED BY IO ROUTINE                 
IOCMNDS  EQU   X'000F'             RESERVED FOR CONTROLLER USE                  
IOLOCK   EQU   X'0010'             READ FOR UPDATE                              
IORDEL   EQU   X'0020'             READ DELETED RECORDS                         
IOHI     EQU   X'0001'             DMRDHI                                       
IOHID    EQU   IOHI+IORDEL         DMRDHI (FOR DELETES)                         
IOHIUP   EQU   IOHI+IOLOCK         DMRDHI (FOR UPDATE)                          
IOHIUPD  EQU   IOHI+IOLOCK+IORDEL  DMRDHI (FOR UPDATE & DELETES)                
IORD     EQU   X'0002'             DMREAD                                       
IORDD    EQU   IORD+IORDEL         DMREAD (FOR DELETES)                         
IORDUP   EQU   IORD+IOLOCK         DMREAD (FOR UPDATE)                          
IORDUPD  EQU   IORD+IOLOCK+IORDEL  DMREAD (FOR UPDATE & DELETES)                
IOSQ     EQU   X'0003'             DMRSEQ                                       
IOSQD    EQU   IOSQ+IORDEL         DMRSEQ (FOR DELETES)                         
IOSQUP   EQU   IOSQ+IOLOCK         DMRSEQ (FOR UPDATE)                          
IOSQUPD  EQU   IOSQ+IOLOCK+IORDEL  DMRSEQ (FOR UPDATE & DELETES)                
IOGET    EQU   X'0004'             GETREC                                       
IOGETRUP EQU   IOGET+IOLOCK        GETREC (FOR UPDATE)                          
IOADD    EQU   X'0005'             DMADD                                        
IOADDREC EQU   X'0005'             ADDREC                                       
IOWRITE  EQU   X'0006'             DMWRT                                        
IOPUTREC EQU   X'0006'             PUTREC                                       
IOUNLOCK EQU   X'0007'             DMUNLK                                       
IO1      EQU   X'1000'             I/O AREA 1                                   
IO2      EQU   X'2000'             I/O AREA 2                                   
IO3      EQU   X'3000'             I/O AREA 3                                   
IO4      EQU   X'4000'             I/O AREA 4                                   
IO5      EQU   X'5000'             I/O AREA 5                                   
IO6      EQU   X'6000'             I/O AREA 6                                   
IO7      EQU   X'7000'             I/O AREA 7                                   
IO8      EQU   X'8000'             I/O AREA 8                                   
IOALL    EQU   X'F000'             MAX 15 I/O AREAS (CURRENTLY 8)               
IOFILES  EQU   X'0F00'             RESERVED FOR CONTROLLER USE                  
IODIR    EQU   X'0100'             I/O TO LOCAL SYSTEM DIRECTORY                
IOFIL    EQU   X'0200'             I/O TO LOCAL SYSTEM FILE                     
IOUNTDIR EQU   X'0100'             I/O TO UNIT DIRECTORY                        
IOUNTFIL EQU   X'0200'             I/O TO UNIT FILE                             
IOSPTDIR EQU   X'0300'             I/O TO SPOT DIRECTORY                        
IOSPTFIL EQU   X'0400'             I/O TO SPOT FILE                             
IOSTAFIL EQU   X'0500'             I/O TO STATION FILE                          
IOGENDIR EQU   X'0600'             I/O TO GEN DIRECTORY                         
IOGENFIL EQU   X'0700'             I/O TO GEN FILE                              
IOCTFILE EQU   X'0B00'             I/O TO CONTROL FILE                          
IOERR    DS    X                   I/O ERROR RETURN BYTE                        
IOEEOF   EQU   X'80'               END-OF-FILE                                  
IOEDSK   EQU   X'40'               NON-RECOVERABLE DISK ERROR                   
IOEDUP   EQU   X'20'               DUPLICATE KEY ON ADD                         
IOERNF   EQU   X'10'               RECORD NOT FOUND                             
IOEDEL   EQU   X'02'               RECORD IS DELETED                            
IOERRS   EQU   X'FF'               RESERVED FOR CONTROLLER USE                  
IOKEY    DS    CL64                ACTUAL KEY VALUE                             
IOKEYSAV DS    CL64                SAVED ACTUAL KEY VALUE (BEFORE I/O)          
IODA     DS    XL4                 DISK ADDRESS OF D/A RECORD                   
IOWORK   DS    XL44                D/A LINKED FILES WORK AREA                   
IODAOVER DS    XL4                 OVERRIDE DISK ADDRESS                        
IOTRACE  DS    X                   TRACE OPTION                                 
IOVALL   EQU   *-IOVALS                                                         
                                                                                
IOLENQ   EQU   4*ONEK                                                           
IODDWQ   EQU   IOLENQ-(L'IODA+L'IOWORK)                                         
IOAREA1  DS    XL(IOLENQ)                                                       
IOAREA2  DS    XL(IOLENQ)                                                       
IOAREA3  DS    XL(IOLENQ)                                                       
IOAREA4  DS    XL(IOLENQ)                                                       
IOAREA5  DS    XL(IOLENQ)                                                       
IOAREA6  DS    XL(IOLENQ)                                                       
IOAREA7  DS    XL(IOLENQ)                                                       
IOAREA8  DS    XL(IOLENQ)                                                       
                                                                                
***********************************************************************         
* DDLINK/FALINK REQUIRED STORAGE AREAS                                *         
***********************************************************************         
                                                                                
LINKW    DS    0F                                                               
DDWRKIOC DS    (WRKIOBL)X          WRKIO CONTROL BLOCK                          
DDRUNP   DS    (RUNPARML)X         RUNPARMS EMULATION                           
DDRUNF   DS    (RUNFACSL)X         RUNFACS EMULATION                            
FALINKC  DS    XL(FALINKDL)        FALINK CONTROL BLOCK                         
DDLINKC  DS    (LP_LNQ)X           DDLINK CONTROL BLOCK                         
DDLINKW  DS    XL(10*ONEK)         DDLINK WORK AREA                             
WMPAREA  DS    XL(14*ONEK)         INCREASED WORK POOL AREA                     
                                                                                
WORKL    EQU   *-WORKD                                                          
         EJECT                                                                  
***********************************************************************         
* I/O FILE TABLE                                                      *         
***********************************************************************         
                                                                                
FILTABD  DSECT                                                                  
FILNUM   DS    X                   FILE NUMBER (IOFILES EQUATE)                 
FILNAME  DS    CL7                 FILE NAME                                    
FILINDS  DS    X                   FILE INDICATORS - 1                          
FILIVL   EQU   X'80'               FILE RECORDS ARE VARIABLE LENGTH             
FILIDA   EQU   X'40'               FILE IS A DIRECT ACCESS FILE                 
FILIIS   EQU   X'20'               FILE IS AN INDEX SEQUENTIAL FILE             
FILINDS2 DS    X                   FILE INDICATORS - 2                          
FILIDI   EQU   X'80'               FILE IS D/A WITH I/S INDEX                   
FILIID   EQU   FILIDI              FILE IS I/S INDEX TO A D/A FILE              
FILNUM2  DS    X                   D/A OR I/S FILE NUMBER                       
FILKEYL  DS    X                   D/A OR I/S KEY LENGTH                        
FILCTLL  DS    X                   FIXED LENGTH I/S CONTROL LENGTH              
FILMAXL  DS    XL2                 MAXIMUM RECORD LENGTH                        
         DS    XL5                 N/D                                          
FILTABL  EQU   *-FILTABD                                                        
                                                                                
***********************************************************************         
* I/O COMMAND TABLE                                                   *         
***********************************************************************         
                                                                                
CMDTABD  DSECT                     COVERS I/O COMMAND TABLES                    
CMDFILT  DS    X                   FILE TYPE                                    
         DS    X                   N/D                                          
CMDTABL  DS    XL2                 TABLE LENGTH                                 
CMDNTRY  DS    0X                  COVERS I/O COMMAND TABLE ENTRY               
CMDNAME  DS    CL7                 COMMAND NAME                                 
CMDNUM   DS    X                   COMMAND NUMBER (SEE IOCMNDS)                 
CMDINDS  DS    X                   COMMAND INDICATORS - 1                       
CMDIDARQ EQU   X'80'               DISK ADDRESS REQUIRED FOR I/O                
CMDIDAXC EQU   X'40'               CLEAR DISK ADDRESS BEFORE I/O                
CMDIDADD EQU   X'20'               DISK ADDRESS RETURNED BY I/O                 
CMDINDS2 DS    X                   COMMAND INDICATORS - 2                       
CMDNTRYL EQU   *-CMDNTRY                                                        
                                                                                
***********************************************************************         
* INPUT TABLE ENTRIES                                                 *         
***********************************************************************         
                                                                                
DATD     DSECT                     DATES                                        
STBK     DS    XL2                 START BOOK                                   
ENDBK    DS    XL2                 END BOOK                                     
DATLN    EQU   *-DATD                                                           
                                                                                
DYTMD    DSECT                     DAYS/TIMES                                   
DTDAYS   DS    XL1                 DAY BITS                                     
DTTIMES  DS    0HL4                                                             
DTSTIME  DS    HL2                 START TIME (MILITARY)                        
DTETIME  DS    HL2                 END TIME (MILITARY)                          
DYTMLN   EQU   *-DTDAYS            LENGTH OF ONE DAY/TIME WITHIN BLOCK          
DTBLN    EQU   DYTMLN*MAXDTN+1     LENGTH OF A DAY/TIME BLOCK                   
MAXDTN   EQU   5                   MAX NO OF DAY/TIME EXPRSSNS IN BLOCK         
DTSTRLN  EQU   100                 MAX LENGTH OF INPUT EXPRESSION               
                                                                                
MFIDD    DSECT                     MAINFRAME ID                                 
MFMED    DS    C                   MEDIA                                        
MFSRC    DS    C                   SOURCE(DBFUNCT)                              
MFNET    DS    CL5                 NETWORK                                      
MFSBK    DS    XL2                 START BOOK                                   
MFEBK    DS    XL2                 END BOOK                                     
MFTABID  DS    CL(L'DEMFFTID)      FORMULA TABLE ID                             
MFNTINUM DS    XL2                 NTI NUMBER                                   
MFIND    DS    0CL3                INDICATORS                                   
MFCONT   DS    C                   CONTENT (REGULAR, SPECIAL,...)               
MFAIRNG  DS    C                   AIRING TYPE (ORIGINAL, REPEAT,...)           
MFFLAGS  DS    X                   VARIOUS FLAGS                                
MFPTYP   DS    CL2                 PROGRAM TYPE                                 
MFSTYP   DS    CL4                 SUB-PROGRAM TYPE                             
MFDAYS   DS    X                   ACTUAL DAYS OF WEEK                          
MFTIMES  DS    0HL4                ACTUAL TIMES                                 
MFSTIME  DS    HL2                 MILITARY START TIME                          
MFETIME  DS    HL2                 MILITARY END TIME                            
MFDTREQ  DS    XL(DTBLN)           DAY/TIME LIST                                
MFCTRACK DS    HL2                 TRACK NUMBER (CABLE ONLY)                    
MFCTELEC DS    HL4                 TELECAST NUMBER (CABLE ONLY)                 
MFIDLN   EQU   *-MFIDD                                                          
                                                                                
MPPD     DSECT                     MFID+PROG NAME+PCID                          
MPPMID   DS    XL(MFIDLN)          MAINFRAME ID                                 
MPPPRO   DS    CL(PNAMLN)          SELECTED PROGRAM NAME                        
MPPPCI   DS    CL(PCIDLN)          PC ID                                        
MPPHOM   DS    CL(HOMELN)          NTI HOMES                                    
MPPGHO   DS    CL(HOMELN)          GAA HOMES                                    
MPPLN    EQU   *-MPPD                                                           
                                                                                
***********************************************************************         
* OTHER VARIOUS DSECTS                                                *         
***********************************************************************         
                                                                                
CONTD    DSECT                     PROGRAM CONTENT TYPE TABLE                   
CONTCODE DS    CL1                 CONTENT CODE                                 
CONTDESC DS    CL20                CONTENT DESCRIPTION                          
CONTMEDS DS    CL10                MEDIAS WHERE CONTENT IS AVAILABLE            
CONTTABL EQU   *-CONTD                                                          
                                                                                
AIRND    DSECT                     PROGRAM AIRING TYPE TABLE                    
AIRNCODE DS    CL1                 AIRING CODE                                  
AIRNDESC DS    CL20                AIRING DESCRIPTION                           
AIRNMEDS DS    CL10                MEDIAS WHERE AIRING IS AVAILABLE             
AIRNTABL EQU   *-AIRND                                                          
                                                                                
NTIQD    DSECT                     NTI QUARTERS TABLE                           
NTIQYEAR DS    CL2                 YEAR                                         
NTIQQRT  DS    CL2                 QUARTER                                      
NTIQSDAT DS    CL6                 START DATE OF QUARTER                        
NTIQEDAT DS    CL6                 END DATE OF QUARTER                          
NTIQL    EQU   *-NTIQD                                                          
                                                                                
MEDIATD  DSECT                     MEDIA TABLE DSECT                            
MDMNAME  DS    CL30                MEDIA NAME                                   
MDREQMED DS    C                   REQUESTED MEDIA                              
MDSELSRC DS    C                   DBSELSRC                                     
MDSELMED DS    C                   DBSELMED                                     
MDFILE   DS    CL3                 DBFILE                                       
MDSELST4 DS    C                   DBSELSTA+4                                   
MDBTYPE  DS    C                   DBBTYPE                                      
MEDIATL  EQU   *-MEDIATD                                                        
                                                                                
BBTABD   DSECT                                                                  
BBOFMS   DS    CL3                 ORIGINAL FILE,MEDIA,SOURCE                   
BBBFMS   DS    CL3                 BLDG BLOCK TABLE FILE,MEDIA,SOURCE           
BBTABL   EQU   *-BBTABD                                                         
                                                                                
DEMOPARD DSECT                     3-BYTE INPUT DEMO EXPRSN FOR DEMOUT          
DEMPNAD  DS    HL1                 NAD CATEGORY                                 
DEMPMOD  DS    C                   MODIFIER                                     
DEMPDEMO DS    HL1                 DEMO NUMBER TYPE-3                           
DEMOPARL EQU   *-DEMOPARD                                                       
                                                                                
***********************************************************************         
* VARIOUS EQUATES                                                     *         
***********************************************************************         
                                                                                
NETLN    EQU   4                                                                
SUMLN    EQU   1                                                                
PNAMLN   EQU   25                                                               
NTINLN   EQU   2                                                                
PTYPLN   EQU   2                                                                
STYPLN   EQU   4                                                                
NADLN    EQU   1                                                                
CONTLN   EQU   1                                                                
AIRNLN   EQU   1                                                                
TBIDLN   EQU   7                                                                
DDCDLN   EQU   6                                                                
PCIDLN   EQU   30                                                               
HOMELN   EQU   10                                                               
PRGCDLN  EQU   6                                                                
DATELN   EQU   6                                                                
PDPLN    EQU   2                                                                
UVALN    EQU   4                                                                
                                                                                
LVWEEK   EQU   C'W'                SUMMARIZE BY WEEK                            
LVMONTH  EQU   C'M'                SUMMARIZE BY MONTH                           
LVQUART  EQU   C'Q'                SUMMARIZE BY QUARTER                         
LVPROG   EQU   C'P'                SUMMARIZE BY PROGRAM                         
LVTRAK   EQU   C'R'                SUMMARIZE BY TRACK (CABLE ONLY)              
LVEPIS   EQU   C'E'                SUMMARIZE BY TELECAST (CABLE ONLY)           
LVDAY    EQU   C'D'                SUMMARIZE BY DAY                             
LVTIME   EQU   C'T'                SUMMARIZE BY ACTUAL TIMES                    
LVHH     EQU   C'H'                SUMMARIZE BY HALF HOUR                       
LVQH     EQU   C'A'                SUMMARIZE BY QUARTER HOUR                    
LVPTYP   EQU   C'G'                SUMMARIZE BY PROGRAM TYPE                    
LVSPTYP  EQU   C'S'                SUMMARIZE BY SUB-PROGRAM TYPE                
                                                                                
DEFMINQ  EQU   6                   DEFAULT MINIMUM DURATION = 6 MINUTES         
***********************************************************************         
* SCREEN AND SAVED STORAGE WITHIN TWA                                 *         
***********************************************************************         
                                                                                
       ++INCLUDE FATWA                                                          
       ++INCLUDE NELNKFFD                                                       
         ORG   TWAD+2304                                                        
FAMSGBLK DS    CL(FAMSGDL)         BLOCK FOR FALINK ERROR MESSAGES              
FACON    DS    CL(L'FALCON)        BLOCK FOR FALINK CONTROL FIELD               
                                                                                
         DS    XL((TWANOGO-SVALUEL-8)-(*-TWAD))                                 
                                                                                
SVALUES  DS    0D                  ** SAVED STORAGE AREAS **                    
SVDDLINK DS    XL(LS_LNQ)          DDLINK SAVED STORAGE                         
SVFALINK DS    XL(2*ONEK)          FALINK SAVED STORAGE                         
SVSECRET DS    (SECLENQ)X          SECRET SAVED STORAGE                         
SVSERVER DS    XL(9*ONEK)          SERVER SAVED STORAGE                         
SVRETURN DS    XL512               SERVER RETURNED DATA                         
SVALUEL  EQU   *-SVALUES                                                        
                                                                                
         PUSH  PRINT                                                            
         PRINT OFF                                                              
       ++INCLUDE DDCOMFACS                                                      
       ++INCLUDE DDCOREQUS                                                      
       ++INCLUDE DDLINKD                                                        
       ++INCLUDE DDMASTD                                                        
       ++INCLUDE DDRUNNERD                                                      
       ++INCLUDE DEDEMTABD                                                      
       ++INCLUDE DEDEMLNETD                                                     
WRKIOD   DSECT                                                                  
       ++INCLUDE DDWRKIOD                                                       
       ++INCLUDE FALINKBLK                                                      
       ++INCLUDE FASECRETD                                                      
       ++INCLUDE FATABSRUN                                                      
                                                                                
AGYRECD  DSECT                                                                  
       ++INCLUDE SPGENAGY                                                       
                                                                                
       ++INCLUDE NEDDEQUS                                                       
                                                                                
         POP   PRINT                                                            
