*          DATA SET NEMEDE2D   AT LEVEL 010 AS OF 05/29/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EE2D      DATE 05/29/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
HUTSRCEH DS    CL8                                                              
HUTSRCE  DS    CL3      6   13    3  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL35     6   26   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A   P    N         T        Y              
HUTDAYH  DS    CL8                                                              
HUTDAY   DS    CL3      7   13    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35     7   26   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    N         T        Y              
HUTTIMEH DS    CL8                                                              
HUTTIME  DS    CL11     8   13   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25     8   26   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A   P    N         T        Y              
HUTYEARH DS    CL8                                                              
HUTYEAR  DS    CL3      9   13    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    N         T        Y              
HUTYENDH DS    CL8                                                              
HUTYEND  DS    CL3     10   13    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A   P    N         T        Y              
HUTQRTH  DS    CL8                                                              
HUTQRT   DS    CL5     11   13    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    11   26   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A   P    N         T        Y              
HUTTYPEH DS    CL8                                                              
HUTTYPE  DS    CL2     12   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    12   26   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     13    2    9  A   P    N         T        Y              
HUT52H   DS    CL8                                                              
HUT52    DS    CL2     13   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL19    13   26   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
HUTHTYPH DS    CL8                                                              
HUTHTYP  DS    CL2     14   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL38    14   26   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL38    15   26   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A   P    N         T        Y              
HUTHOLIH DS    CL8                                                              
HUTHOLI  DS    CL2     16   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    16   26   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     17    2    9  A   P    N         T        Y              
HUTSCHMH DS    CL8                                                              
HUTSCHM  DS    CL2     17   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    17   26   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   13    1  A   U    N         T        Y              
HUTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 716  BYTES                            
