*          DATA SET NEMEDCDD   AT LEVEL 001 AS OF 09/18/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN AGE UBD      DATE 09/18/89                 
         SPACE 1                                                                
AGE UBD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL1                                                              
         DS    CL2    INDICS=DS                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 72   BYTES                            
