*          DATA SET NEMEDD4D   AT LEVEL 019 AS OF 08/15/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31ED4D      DATE 08/15/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL5      6   16    5  A   U    N         T    I   Y              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   27   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL5      7   16    5  A   U    N         T        Y              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     7   27   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   16    8  A   U    N         T        Y              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     8   27   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4      9   16    4  A   U    N         T        Y              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24     9   27   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8     10   16    8  A   U    N         T        Y              
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    10   27   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11    2    4  A   P    N         T        Y              
SPLFVH   DS    CL8                                                              
SPLFV    DS    CL1     11   16    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    11   27   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL4     12   16    4  A   U    N         T        Y              
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL8     12   27    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    N         T        Y              
SPLASGH  DS    CL8                                                              
SPLASG   DS    CL2     13   16    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    13   27   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  A   P    N         T        Y              
SPLSDTH  DS    CL8                                                              
SPLSDT   DS    CL8     14   16    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A   P    N         T        Y              
SPLEDTH  DS    CL8                                                              
SPLEDT   DS    CL8     15   16    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A   P    N         T        Y              
SPLDEMOH DS    CL8                                                              
SPLDEMO  DS    CL40    17   16   40  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 587  BYTES                            
