*          DATA SET NEMEDE1D   AT LEVEL 008 AS OF 04/21/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EE1D      DATE 04/21/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
UVLCLIH  DS    CL8                                                              
UVLCLI   DS    CL4      6   13    4  A   U    N         T    I   Y              
UVLCLINH DS    CL8                                                              
UVLCLIN  DS    CL20     6   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    N         T        Y              
UVLESTH  DS    CL8                                                              
UVLEST   DS    CL4      7   13    4  A   U    N         T        Y              
UVLESTNH DS    CL8                                                              
UVLESTN  DS    CL24     7   20   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
UVLNETH  DS    CL8                                                              
UVLNET   DS    CL4      8   13    4  A   U    N         T        Y              
UVLNETNH DS    CL8                                                              
UVLNETN  DS    CL24     8   20   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
UVLPAKH  DS    CL8                                                              
UVLPAK   DS    CL4      9   13    4  A   U    N         T        Y              
UVLPAKNH DS    CL8                                                              
UVLPAKN  DS    CL36     9   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A   P    N         T        Y              
UVLSTRH  DS    CL8                                                              
UVLSTR   DS    CL8     10   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A   P    N         T        Y              
UVLENDH  DS    CL8                                                              
UVLEND   DS    CL8     11   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     12    2    9  A   P    N         T        Y              
UVLUNVH  DS    CL8                                                              
UVLUNV   DS    CL4     12   13    4  A   U    N         T        Y              
UVLUNVNH DS    CL8                                                              
UVLUNVN  DS    CL36    12   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     13    2    9  A   P    N         T        Y              
UVLINTGH DS    CL8                                                              
UVLINTG  DS    CL10    13   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
UVLOPTH  DS    CL8                                                              
UVLOPT   DS    CL40    14   13   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   13    1  A   U    N         T        Y              
UVLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
UVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 496  BYTES                            
