*          DATA SET NEMEDEDD   AT LEVEL 001 AS OF 03/11/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EEDD      DATE 03/11/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL5      6   14    5  A  U H             T    I   Y              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   24   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      7   14    8  A  U N             T        Y              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     7   24   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   14    8  A  U H             T        Y              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     8   24   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8      9   14    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24     9   24   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8     10   14    8  A  U N             T        Y              
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    10   24   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL5     11   14    5  A  U N             T        Y              
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL20    11   24   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL8     12   14    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   24    8  A  P N             T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL8     12   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13    2    9  A  P H             T        Y              
SPLTSTH  DS    CL8                                                              
SPLTST   DS    CL1     13   14    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL1     14   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    14   24   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
SPLFACH  DS    CL8                                                              
SPLFAC   DS    CL6     15   14    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
SPLRNDH  DS    CL8                                                              
SPLRND   DS    CL5     16   14    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
SPLPGKH  DS    CL8                                                              
SPLPGK   DS    CL8     17   14    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    17   24   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18    2   11  A  P N             T        Y              
SPLASSH  DS    CL8                                                              
SPLASS   DS    CL1     18   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL34    18   24   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL1     19   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    19   24   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
SPLEQVH  DS    CL8                                                              
SPLEQV   DS    CL2     20   14    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL38    20   24   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
SPLOPSH  DS    CL8                                                              
SPLOPS   DS    CL40    21   14   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22    2    4  A  P N             T        Y              
SPLDMOH  DS    CL8                                                              
SPLDMO   DS    CL7     22   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 952  BYTES                            
