*          DATA SET NEMEDF9D   AT LEVEL 008 AS OF 06/06/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EF9D      DATE 06/06/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL5      6   16    5  A   U    N         T    I   Y              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   27   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL5      7   16    5  A   U    N         T        Y              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     7   27   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   16    8  A   U    N         T        Y              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     8   27   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4      9   16    4  A   U    N         T        Y              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24     9   27   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL4     10   16    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL4     11   16    4  A   U    N         T        Y              
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL8     11   27    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A   P    N         T        Y              
SPLSDTH  DS    CL8                                                              
SPLSDT   DS    CL8     12   16    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A   P    N         T        Y              
SPLEDTH  DS    CL8                                                              
SPLEDT   DS    CL8     13   16    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    14    2   11  A   P    N         T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL1     14   16    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL43    14   27   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    15    2   11  A   P    N         T        Y              
SPLPRTH  DS    CL8                                                              
SPLPRT   DS    CL1     15   16    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   27   20  A   P    N         T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL1     17    2    1  A   P    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 517  BYTES                            
