*          DATA SET NEMED4FD   AT LEVEL 009 AS OF 09/05/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31E4FD      DATE 09/05/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
UNLCLIH  DS    CL8                                                              
UNLCLI   DS    CL4      6   13    4   A    U    N         T    I    Y           
UNLCLINH DS    CL8                                                              
UNLCLIN  DS    CL20     6   20   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    N         T         Y           
UNLPROH  DS    CL8                                                              
UNLPRO   DS    CL4      7   13    4   A    U    N         T         Y           
UNLPRONH DS    CL8                                                              
UNLPRON  DS    CL20     7   20   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    2    8   A    P    N         T         Y           
UNLESTH  DS    CL8                                                              
UNLEST   DS    CL8      8   13    8   A    U    N         T         Y           
UNLESTNH DS    CL8                                                              
UNLESTN  DS    CL24     8   23   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9    2    8   A    P    N         T         Y           
UNLEFLTH DS    CL8                                                              
UNLEFLT  DS    CL5      9   13    5   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10    2    7   A    P    N         T         Y           
UNLNETH  DS    CL8                                                              
UNLNET   DS    CL4     10   13    4   A    U    N         T         Y           
UNLNETNH DS    CL8                                                              
UNLNETN  DS    CL24    10   20   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11    2    7   A    P    N         T         Y           
UNLPAKH  DS    CL8                                                              
UNLPAK   DS    CL4     11   13    4   A    U    N         T         Y           
UNLPAKNH DS    CL8                                                              
UNLPAKN  DS    CL36    11   20   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12    2    7   A    P    N         T         Y           
UNLPRGH  DS    CL8                                                              
UNLPRG   DS    CL6     12   13    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     13    2    5   A    P    N         T         Y           
UNLSTRH  DS    CL8                                                              
UNLSTR   DS    CL8     13   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14    2    3   A    P    N         T         Y           
UNLENDH  DS    CL8                                                              
UNLEND   DS    CL8     14   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15    2    7   A    P    N         T         Y           
UNLADTH  DS    CL8                                                              
UNLADT   DS    CL8     15   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     16    2    6   A    P    N         T         Y           
UNLPGRPH DS    CL8                                                              
UNLPGRP  DS    CL4     16   13    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     17   13    1   A    U    N         T         Y           
UNLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
UNLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 486  BYTES                            
