*          DATA SET NEMEDDAD   AT LEVEL 001 AS OF 11/17/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EDAD      DATE 11/17/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SPLCLIH  DS    XL8                                                              
SPLCLI   DS    CL5      6   16    5  A  U N             T    I   Y              
SPLCLINH DS    XL8                                                              
SPLCLIN  DS    CL20     6   27   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPLPROH  DS    XL8                                                              
SPLPRO   DS    CL5      7   16    5  A  U N             T        Y              
SPLPRONH DS    XL8                                                              
SPLPRON  DS    CL20     7   27   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
SPLESTH  DS    XL8                                                              
SPLEST   DS    CL8      8   16    8  A  U N             T        Y              
SPLESTNH DS    XL8                                                              
SPLESTN  DS    CL24     8   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SPLNETH  DS    XL8                                                              
SPLNET   DS    CL4      9   16    4  A  U N             T        Y              
SPLNETNH DS    XL8                                                              
SPLNETN  DS    CL24     9   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
SPLENDDH DS    XL8                                                              
SPLENDD  DS    CL8     10   16    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
SPLKILH  DS    XL8                                                              
SPLKIL   DS    CL1     11   16    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL28    11   27   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
SPLCLSH  DS    XL8                                                              
SPLCLS   DS    CL1     12   16    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL35    12   27   35  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    13   27   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    14   27   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
SPLPUFH  DS    XL8                                                              
SPLPUF   DS    CL1     15   16    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    15   27   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL33    16   27   33  A  P N             T        Y              
SPLENDH  DS    XL8                                                              
SPLEND   DS    CL1     18    2    1  A  P N             T        Y              
SPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 616  BYTES                            
