*          DATA SET NEMEDFED   AT LEVEL 009 AS OF 07/14/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EFED      DATE 07/14/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL4      6   13    4  A   U    N         T    I   Y              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   21   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL4      7   13    4  A   U    N         T        Y              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     7   21   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL6      8   13    6  A   U    N         T        Y              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     8   21   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPLPOPTH DS    CL8                                                              
SPLPOPT  DS    CL1      9   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL27     9   21   27  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    N         T        Y              
SPLPERH  DS    CL8                                                              
SPLPER   DS    CL1     10   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    10   21   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A   P    N         T        Y              
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL9     11   13    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   P    N         T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL9     12   13    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
SPLEOPH  DS    CL8                                                              
SPLEOP   DS    CL1     13   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL21    13   21   21  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     14    2    9  A   P    N         T        Y              
SPLASSH  DS    CL8                                                              
SPLASS   DS    CL1     14   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A   P    N         T        Y              
SPLROPH  DS    CL8                                                              
SPLROP   DS    CL1     15   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL23    15   21   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8     16   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   13    1  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 522  BYTES                            
