*          DATA SET NEMEDE8D   AT LEVEL 002 AS OF 01/09/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EE8D      DATE 01/09/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SPLCLIH  DS    XL8                                                              
SPLCLI   DS    CL5      6   13    5  A  U N             T    I   Y              
SPLCLINH DS    XL8                                                              
SPLCLIN  DS    CL20     6   24   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPLPROH  DS    XL8                                                              
SPLPRO   DS    CL5      7   13    5  A  U N             T        Y              
SPLPRONH DS    XL8                                                              
SPLPRON  DS    CL20     7   24   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
SPLESTH  DS    XL8                                                              
SPLEST   DS    CL8      8   13    8  A  U N             T        Y              
SPLESTNH DS    XL8                                                              
SPLESTN  DS    CL24     8   24   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SPLNETH  DS    XL8                                                              
SPLNET   DS    CL4      9   13    4  A  U N             T        Y              
SPLNETNH DS    XL8                                                              
SPLNETN  DS    CL24     9   24   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SPLPAKH  DS    XL8                                                              
SPLPAK   DS    CL4     10   13    4  A  U N             T        Y              
SPLPAKNH DS    XL8                                                              
SPLPAKN  DS    CL36    10   24   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SPLPRGMH DS    XL8                                                              
SPLPRGM  DS    CL6     11   13    6  A  U N             T        Y              
SPLPRGNH DS    XL8                                                              
SPLPRGN  DS    CL16    11   24   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
SPLSTRTH DS    XL8                                                              
SPLSTRT  DS    CL8     12   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
SPLENDH  DS    XL8                                                              
SPLEND   DS    CL8     13   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
SPLTSTH  DS    XL8                                                              
SPLTST   DS    CL1     14   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
SPLEATH  DS    XL8                                                              
SPLEAT   DS    CL3     15   13    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    15   25   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
SPLMKDH  DS    XL8                                                              
SPLMKD   DS    CL1     16   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    16   25   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
SPLOVRH  DS    XL8                                                              
SPLOVR   DS    CL1     17   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    17   25   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
SPLPNMH  DS    XL8                                                              
SPLPNM   DS    CL1     18   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    18   25   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
SPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 720  BYTES                            
