*          DATA SET NEMEDEBD   AT LEVEL 006 AS OF 12/12/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EEBD      DATE 12/12/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SPLCLIH  DS    XL8                                                              
SPLCLI   DS    CL4      6   13    4  A  U N             T    I   Y              
SPLCLINH DS    XL8                                                              
SPLCLIN  DS    CL20     6   24   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPLPROH  DS    XL8                                                              
SPLPRO   DS    CL4      7   13    4  A  U N             T        Y              
SPLPRONH DS    XL8                                                              
SPLPRON  DS    CL20     7   24   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
SPLESTH  DS    XL8                                                              
SPLEST   DS    CL8      8   13    8  A  U N             T        Y              
SPLESTNH DS    XL8                                                              
SPLESTN  DS    CL24     8   24   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
SPLSTRTH DS    XL8                                                              
SPLSTRT  DS    CL8      9   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
SPLENDH  DS    XL8                                                              
SPLEND   DS    CL8     10   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
SPLFILEH DS    XL8                                                              
SPLFILE  DS    CL1     11   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    11   24   29  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   13    1  A  U N             T        Y              
SPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 312  BYTES                            
