*          DATA SET NEMEDF2D   AT LEVEL 021 AS OF 01/26/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EF2D      DATE 01/26/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL4      6   13    4  A   U    N         T    I   Y              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      7   13    8  A   U    N         T        Y              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     7   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   13    8  A   U    N         T        Y              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     8   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4      9   13    4  A   U    N         T        Y              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24     9   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL4     10   13    4  A   U    N         T        Y              
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL8     10   24    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8     11   13    8  A   U    N         T        Y              
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    11   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    N         T        Y              
SPLSEQH  DS    CL8                                                              
SPLSEQ   DS    CL1     12   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     13    2    6  A   P    N         T        Y              
SPLFLAVH DS    CL8                                                              
SPLFLAV  DS    CL2     13   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL41    13   24   41  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     14    2    9  A   P    N         T        Y              
SPLDOPTH DS    CL8                                                              
SPLDOPT  DS    CL2     14   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL34    14   24   34  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A   P    N         T        Y              
SPLSPOTH DS    CL8                                                              
SPLSPOT  DS    CL2     15   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL40    15   24   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A   P    N         T        Y              
SPLGRPTH DS    CL8                                                              
SPLGRPT  DS    CL2     16   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    16   24   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17    2   10  A   P    N         T        Y              
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL8     17   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A   P    N         T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL8     18   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A   P    N         T        Y              
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL8     19   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   P    N         T        Y              
SPLNOPTH DS    CL8                                                              
SPLNOPT  DS    CL8     20   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A   P    N         T        Y              
SPLUNITH DS    CL8                                                              
SPLUNIT  DS    CL8     21   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A   P    N         T        Y              
SPLGOALH DS    CL8                                                              
SPLGOAL  DS    CL1     22   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   28    1  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 843  BYTES                            
