*          DATA SET NEMEDE3D   AT LEVEL 005 AS OF 03/28/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EE3D      DATE 03/28/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
PRGNETH  DS    CL8                                                              
PRGNET   DS    CL8      6   13    8  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  A   P    N         T        Y              
PRGSTRTH DS    CL8                                                              
PRGSTRT  DS    CL8      7   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
PRGENDH  DS    CL8                                                              
PRGEND   DS    CL8      8   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   P    N         T        Y              
PRGDAYH  DS    CL8                                                              
PRGDAY   DS    CL4      9   13    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL36     9   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    N         T        Y              
PRGSEQH  DS    CL8                                                              
PRGSEQ   DS    CL2     10   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL27    10   24   27  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
PRGDPTH  DS    CL8                                                              
PRGDPT   DS    CL8     11   13    8  A   U    N         T        Y              
PRGDPTNH DS    CL8                                                              
PRGDPTN  DS    CL8     11   24    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
PRGFILTH DS    CL8                                                              
PRGFILT  DS    CL4     12   13    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   13    1  A   U    N         T        Y              
PRGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 312  BYTES                            
