*          DATA SET NEMEDE4D   AT LEVEL 003 AS OF 10/27/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EE4D      DATE 10/27/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
SPLMEDH  DS    XL8                                                              
SPLMED   DS    CL1      6   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
SPLSTRTH DS    XL8                                                              
SPLSTRT  DS    CL8      7   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
SPLTESTH DS    XL8                                                              
SPLTEST  DS    CL1      9   15    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   15    1  A  U N             T        Y              
SPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 96   BYTES                            
