*          DATA SET NEMEDFAD   AT LEVEL 002 AS OF 06/18/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EFAD      DATE 06/18/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SCLCLIH  DS    CL8                                                              
SCLCLI   DS    CL4      6   16    4  A   U    N         T    I   Y              
SCLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 32   BYTES                            
