*          DATA SET NEMEDFBD   AT LEVEL 007 AS OF 03/10/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EFBD      DATE 03/10/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL4      6   16    4  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL4      7   16    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL4      8   16    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
SPLTSTH  DS    CL8                                                              
SPLTST   DS    CL1      9   16    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4     11   16    4  A  U N             T        Y              
SPLMKTH  DS    CL8                                                              
SPLMKT   DS    CL4     11   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   16    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   21    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   16    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   16    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   21    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   16    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   16    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   21    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   16    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   16    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   21    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   16    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   16    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   21    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   13    1  A  U N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 376  BYTES                            
