*          DATA SET NEMEDDBD   AT LEVEL 004 AS OF 05/06/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EDBD      DATE 05/06/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL5      6   16    5  A   U    N         T    I   Y              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   27   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      7   16    8  A   U    N         T        Y              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     7   27   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4      8   16    4  A   U    N         T        Y              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24     8   27   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPLPKGH  DS    CL8                                                              
SPLPKG   DS    CL3      9   16    3  A   U    N         T        Y              
SPLPKGNH DS    CL8                                                              
SPLPKGN  DS    CL45     9   27   45  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10    2   11  A   P    N         T        Y              
SPLTSTH  DS    CL8                                                              
SPLTST   DS    CL1     10   16    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    10   27   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    11   27   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL30    13   16   30  A   U    N         T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL1     15    2    1  A   P    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 440  BYTES                            
