*          DATA SET NEMEDFDD   AT LEVEL 016 AS OF 06/18/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EFDD      DATE 06/18/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
AGYCLIH  DS    CL8                                                              
AGYCLI   DS    CL4      6   13    4  A   U    N         T    I   Y              
AGYCLINH DS    CL8                                                              
AGYCLIN  DS    CL20     6   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
AGYNETH  DS    CL8                                                              
AGYNET   DS    CL5      7   13    5  A   U    N         T        Y              
AGYNETNH DS    CL8                                                              
AGYNETN  DS    CL24     7   20   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A   P    N         T        Y              
AGYSTRTH DS    CL8                                                              
AGYSTRT  DS    CL9      8   13    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   P    N         T        Y              
AGYENDH  DS    CL8                                                              
AGYEND   DS    CL9      9   13    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    N         T        Y              
AGYPRIH  DS    CL8                                                              
AGYPRI   DS    CL1     10   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL27    10   20   27  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    N         T        Y              
AGYFORMH DS    CL8                                                              
AGYFORM  DS    CL2     11   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    N         T        Y              
AGYCOSTH DS    CL8                                                              
AGYCOST  DS    CL1     12   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL26    12   20   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
AGYNETAH DS    CL8                                                              
AGYNETA  DS    CL1     13   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
AGYLOKH  DS    CL8                                                              
AGYLOK   DS    CL1     14   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    14   20   33  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A   P    N         T        Y              
AGYPERH  DS    CL8                                                              
AGYPER   DS    CL1     15   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL26    15   20   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A   P    N         T        Y              
AGYDDSH  DS    CL8                                                              
AGYDDS   DS    CL2     16   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A   P    N         T        Y              
AGYDDSSH DS    CL8                                                              
AGYDDSS  DS    CL8     17   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A   P    N         T        Y              
AGYDDSEH DS    CL8                                                              
AGYDDSE  DS    CL8     18   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A   P    N         T        Y              
AGYPRODH DS    CL8                                                              
AGYPROD  DS    CL60    19   13   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   13    1  A   U    N         T        Y              
AGYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AGYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 688  BYTES                            
