*          DATA SET NEMEDDCD   AT LEVEL 003 AS OF 06/18/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EDCD      DATE 06/18/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
UVLCLIH  DS    XL8                                                              
UVLCLI   DS    CL4      6   13    4  A  U N             T    I   Y              
UVLCLINH DS    XL8                                                              
UVLCLIN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
UVLESTH  DS    XL8                                                              
UVLEST   DS    CL4      7   13    4  A  U N             T        Y              
UVLESTNH DS    XL8                                                              
UVLESTN  DS    CL24     7   20   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
UVLNETH  DS    XL8                                                              
UVLNET   DS    CL4      8   13    4  A  U N             T        Y              
UVLNETNH DS    XL8                                                              
UVLNETN  DS    CL24     8   20   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
UVLPAKH  DS    XL8                                                              
UVLPAK   DS    CL4      9   13    4  A  U N             T        Y              
UVLPAKNH DS    XL8                                                              
UVLPAKN  DS    CL36     9   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
UVLSTRH  DS    XL8                                                              
UVLSTR   DS    CL8     10   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
UVLENDH  DS    XL8                                                              
UVLEND   DS    CL8     11   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
UVLTSTH  DS    XL8                                                              
UVLTST   DS    CL1     12   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P N             T        Y              
UVLPRTH  DS    XL8                                                              
UVLPRT   DS    CL1     13   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P N             T        Y              
UVLTYPH  DS    XL8                                                              
UVLTYP   DS    CL1     14   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL35    14   22   35  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   13    1  A  U N             T        Y              
UVLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
UVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 440  BYTES                            
