*          DATA SET NEMEDD1D   AT LEVEL 022 AS OF 03/16/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31ED1D      DATE 03/16/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL4      6   16    4  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL17     6   31   17  A   P    N         T        Y              
SPLBSTRH DS    CL8                                                              
SPLBSTR  DS    CL8      6   51    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      6   61    3  A   P    N         T        Y              
SPLBENDH DS    CL8                                                              
SPLBEND  DS    CL8      6   67    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL4      7   16    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     7   31   17  A   P    N         T        Y              
SPLPSTRH DS    CL8                                                              
SPLPSTR  DS    CL8      7   51    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   61    3  A   P    N         T        Y              
SPLPENDH DS    CL8                                                              
SPLPEND  DS    CL8      7   67    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   16    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12     8   31   12  A   P    N         T        Y              
SPLAUDH  DS    CL8                                                              
SPLAUD   DS    CL1      8   51    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     8   56   14  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4      9   16    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9   31   11  A   P    N         T        Y              
SPLUNITH DS    CL8                                                              
SPLUNIT  DS    CL1      9   51    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15     9   56   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL4     10   16    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   31    8  A   P    N         T        Y              
SPLSEQH  DS    CL8                                                              
SPLSEQ   DS    CL1     10   51    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL19    10   56   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8     11   16    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   31    8  A   P    N         T        Y              
SPLSKEDH DS    CL8                                                              
SPLSKED  DS    CL1     11   51    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A   P    N         T        Y              
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL9     13   16    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL9     14   16    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A   P    N         T        Y              
SPLFILTH DS    CL8                                                              
SPLFILT  DS    CL2     15   16    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL41    15   20   41  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A   P    N         T        Y              
SPLNOPTH DS    CL8                                                              
SPLNOPT  DS    CL1     16   16    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL26    16   20   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     17    2    9  A   P    N         T        Y              
SPLSOFTH DS    CL8                                                              
SPLSOFT  DS    CL50    17   16   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A   P    N         T        Y              
SPLFORMH DS    CL8                                                              
SPLFORM  DS    CL2     18   16    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL26    18   20   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20    2    7  A   P    N         T        Y              
SPLCOMH  DS    CL8                                                              
SPLCOM   DS    CL3     20   16    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     21    2    4  A   P    N         T        Y              
SPLPCTH  DS    CL8                                                              
SPLPCT   DS    CL6     21   16    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    22    2   10  A   P    N         T        Y              
SPLSKPH  DS    CL8                                                              
SPLSKP   DS    CL1     22   16    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    22   20   11  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   13    1  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 928  BYTES                            
