*          DATA SET NEMEDEED   AT LEVEL 012 AS OF 08/16/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31EEED      DATE 08/16/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL4      6   15    4  A   U    N         T        Y              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL7      7   15    7  A   U    N         T        Y              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     7   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4      8   15    4  A   U    N         T        Y              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24     8   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL3      9   15    3  A   U    N         T        Y              
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36     9   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10    2   11  A   P    N         T        Y              
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL6     10   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10   25    9  A   P    N         T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL6     10   36    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  A   P    N         T        Y              
SPLMN1H  DS    CL8                                                              
SPLMN1   DS    CL8     11   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   23    8  A   U    N         T        Y              
SPLMN2H  DS    CL8                                                              
SPLMN2   DS    CL8     11   35    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   45    8  A   U    N         T        Y              
SPLMN3H  DS    CL8                                                              
SPLMN3   DS    CL8     11   57    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   67    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL21    12   28   21  A   P    N         T        Y              
SPLPRDH  DS    CL8                                                              
SPLPRD   DS    CL78    13    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1488 BYTES                            
