*          DATA SET NEMEDD2D   AT LEVEL 002 AS OF 05/20/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31ED2D      DATE 05/20/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    2    8   A    P    N         T         Y           
PRGNETH  DS    CL8                                                              
PRGNET   DS    CL4      6   20    4   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL4      6   28    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      6   36    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      6   44    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10     7    2   10   A    P    N         T         Y           
PRGSTRTH DS    CL8                                                              
PRGSTRT  DS    CL8      7   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    2    8   A    P    N         T         Y           
PRGENDH  DS    CL8                                                              
PRGEND   DS    CL8      8   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      9    2    3   A    P    N         T         Y           
PRGDAYH  DS    CL8                                                              
PRGDAY   DS    CL3      9   20    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     10    2    4   A    P    N         T         Y           
PRGTIMEH DS    CL8                                                              
PRGTIME  DS    CL11    10   20   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11    2    7   A    P    N         T         Y           
PRGFILTH DS    CL8                                                              
PRGFILT  DS    CL4     11   20    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12    12    2   12   A    P    N         T         Y           
PRGPTYPH DS    CL8                                                              
PRGPTYP  DS    CL4     12   20    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     13    2    4   A    P    N         T         Y           
PRGRANKH DS    CL8                                                              
PRGRANK  DS    CL4     13   20    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14    2    7   A    P    N         T         Y           
PRGDEMH  DS    CL8                                                              
PRGDEM   DS    CL60    14   20   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15    2    7   A    P    N         T         Y           
PRGOPTH  DS    CL8                                                              
PRGOPT   DS    CL60    15   20   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16   20    1   A    U    N         T         Y           
PRGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 444  BYTES                            
