*          DATA SET NEMEDD9D   AT LEVEL 001 AS OF 02/21/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31ED9D      DATE 02/21/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SPLCLIH  DS    XL8                                                              
SPLCLI   DS    CL5      6   16    5  A  U N             T    I   Y              
SPLCLINH DS    XL8                                                              
SPLCLIN  DS    CL20     6   27   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPLPROH  DS    XL8                                                              
SPLPRO   DS    CL5      7   16    5  A  U N             T        Y              
SPLPRONH DS    XL8                                                              
SPLPRON  DS    CL20     7   27   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
SPLESTH  DS    XL8                                                              
SPLEST   DS    CL8      8   16    8  A  U N             T        Y              
SPLESTNH DS    XL8                                                              
SPLESTN  DS    CL24     8   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SPLNETH  DS    XL8                                                              
SPLNET   DS    CL4      9   16    4  A  U N             T        Y              
SPLNETNH DS    XL8                                                              
SPLNETN  DS    CL24     9   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SPLDPTH  DS    XL8                                                              
SPLDPT   DS    CL3     10   16    3  A  U N             T        Y              
SPLDPTNH DS    XL8                                                              
SPLDPTN  DS    CL24    10   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SPLPKGH  DS    XL8                                                              
SPLPKG   DS    CL8     11   16    8  A  U N             T        Y              
SPLPKGNH DS    XL8                                                              
SPLPKGN  DS    CL40    11   27   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
SPLSDTH  DS    XL8                                                              
SPLSDT   DS    CL8     12   16    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
SPLEDTH  DS    XL8                                                              
SPLEDT   DS    CL8     13   16    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
SPLDEMH  DS    XL8                                                              
SPLDEM   DS    CL3     14   16    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
SPLDOLH  DS    XL8                                                              
SPLDOL   DS    CL3     15   16    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   27   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
SPLINTH  DS    XL8                                                              
SPLINT   DS    CL1     16   16    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    2   11  A  P N             T        Y              
SPLTAPEH DS    XL8                                                              
SPLTAPE  DS    CL1     17   16    1  A  U N             T        Y              
SPLENDH  DS    XL8                                                              
SPLEND   DS    CL1     19    2    1  A  P N             T        Y              
SPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 592  BYTES                            
