*          DATA SET NEMEDD6D   AT LEVEL 009 AS OF 08/07/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31ED6D      DATE 08/07/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    N         T        Y              
SPLTYPH  DS    CL8                                                              
SPLTYP   DS    CL1      6   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    N         T        Y              
SPLCOMH  DS    CL8                                                              
SPLCOM   DS    CL1      7   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16     7   20   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8   13    1  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 82   BYTES                            
