*          DATA SET NENADTABLE AT LEVEL 001 AS OF 09/23/91                      
HDEMPRE  DS    0CL9                                                             
         DC    AL1(01),C'  (USA) '                                              
         DC    AL1(11),C' N/EAST '                                              
         DC    AL1(12),C' E/CENT '                                              
         DC    AL1(13),C' W/CENT '                                              
         DC    AL1(14),C'  SOUTH '                                              
         DC    AL1(15),C' PACIFIC'                                              
         DC    AL1(21),C'  CS/A  '                                              
         DC    AL1(22),C'  CS/B  '                                              
         DC    AL1(23),C' CS/C+D '                                              
         DC    AL1(31),C' ANY/CBL'                                              
         DC    AL1(32),C' PAY/CBL'                                              
         DC    AL1(33),C' BAS/CBL'                                              
         DC    AL1(34),C' NO/CBL '                                              
         DC    AL1(41),C'  HHS/1 '                                              
         DC    AL1(42),C'  HHS/2 '                                              
         DC    AL1(43),C' HHS/3+ '                                              
         DC    AL1(44),C' HHS/4+ '                                              
         DC    AL1(51),C' ANY18- '                                              
         DC    AL1(52),C' ANY12- '                                              
         DC    AL1(53),C'  ANY6- '                                              
         DC    AL1(54),C'  ANY3- '                                              
         DC    AL1(55),C' ANY6-11'                                              
         DC    AL1(56),C' ANY1217'                                              
         DC    AL1(61),C'  $15M+ '                                              
         DC    AL1(62),C'  $20M+ '                                              
         DC    AL1(63),C'  $30M+ '                                              
         DC    AL1(64),C'  $40M+ '                                              
         DC    AL1(65),C'  $50M+ '                                              
         DC    AL1(66),C'  $60M+ '                                              
         DC    AL1(67),C'  $30M- '                                              
         DC    AL1(71),C' $30+/NA'                                              
         DC    AL1(72),C' $30+POM'                                              
         DC    AL1(73),C' $30+COL'                                              
         DC    AL1(74),C' $40+/NA'                                              
         DC    AL1(75),C' $40+POM'                                              
         DC    AL1(76),C' $40+COL'                                              
         DC    AL1(77),C' $40DUAL'                                              
         DC    AL1(91),C'  TZ/E  '                                              
         DC    AL1(92),C'  TZ/C  '                                              
         DC    AL1(93),C' TZ/M+P '                                              
         DC    AL1(101),C'  W/VCR '                                             
         DC    AL1(102),C' W/REMOT'                                             
         DC    AL1(103),C'   1TV  '                                             
         DC    AL1(104),C'   2TV  '                                             
         DC    AL1(105),C'   3TV  '                                             
         DC    AL1(106),C'  4+TV  '                                             
         DC    AL1(111),C' HOH25- '                                             
         DC    AL1(112),C' HOH2534'                                             
         DC    AL1(113),C' HOH3554'                                             
         DC    AL1(114),C' HOH5564'                                             
         DC    AL1(115),C' HOH64+ '                                             
         DC    AL1(121),C'  ED8-  '                                             
         DC    AL1(122),C'  ED12- '                                             
         DC    AL1(123),C'  ED12  '                                             
         DC    AL1(124),C'  ED16- '                                             
         DC    AL1(125),C'  ED16+ '                                             
         DC    AL1(131),C' OCC/WC '                                             
         DC    AL1(132),C' OCC/BC '                                             
         DC    AL1(133),C' OCC/NO '                                             
         DC    AL1(141),C' RACE/B '                                             
         DC    AL1(142),C' RACE/W '                                             
         DC    AL1(151),C'   CAR  '                                             
         DC    AL1(152),C'  CAR1  '                                             
         DC    AL1(153),C'  CAR2+ '                                             
         DC    AL1(154),C' CAR/NEW'                                             
         DC    AL1(156),C'   TRK  '                                             
         DC    AL1(157),C'  TRK1  '                                             
         DC    AL1(158),C'  TRK2+ '                                             
         DC    AL1(159),C' TRK/NEW'                                             
         DC    AL1(161),C'   DOG  '                                             
         DC    AL1(162),C'   CAT  '                                             
         DC    XL1'FF'                                                          
         SPACE 2                                                                
