*          DATA SET NENAVWRK   AT LEVEL 250 AS OF 04/23/19                      
*          DATA SET SPMAKWRK   AT LEVEL 183 AS OF 01/27/00                      
WORKD    DSECT                                                                  
*                                                                               
MISERR   EQU   1                   MISSING INPUT FIELD                          
INVERR   EQU   2                   INVALID INPUT FIELD                          
NUMERR   EQU   3                   NON-NUMERIC INPUT FIELD                      
NOBBTRIG EQU   4                   CAN'T ADD BBOARD B/C UNIT'S TRIGGY           
SUBERR   EQU   5                   SUB-LINE MAXIMUM EXCEEDED                    
HELPMSG  EQU   6                   HELP MESSAGE                                 
SUPVMISS EQU   7                   MISSING SUPERVISOR RECORD                    
DATCHERR EQU   11                  DATE CANNOT BE CHANGED                       
DAYCGERR EQU   12                  DAY CANNOT BE CHANGED                        
DATERR   EQU   13                  INVALID DATE                                 
COVERR   EQU   14                  PROGRAM DAY(S) DO NOT COVER UNIT DAY         
DAYERR   EQU   15                  INVALID DAY                                  
TIMERR   EQU   16                  INVALID TIME                                 
NOTFOUND EQU   53                  RECORD NOT FOUND                             
RECDEL   EQU   56                  RECORD IS DELETED                            
CLLOKERR EQU   59                  CLIENT IS LOCKED (UPDATIVE SOON)             
STERR    EQU   61                  DATE IS BEFORE ESTIMATE START                
ENDERR   EQU   62                  DATE IS AFTER ESTIMATE END                   
SEQERR   EQU   63                  DATE SEQUENCE ERROR                          
CBLPLERR EQU   64                  CABLE PLANS CAN'T BE TRANSFERRED             
REPDERR  EQU   101                 CANNOT DELETE SP. REP ON PAID UNIT           
REPCHERR EQU   102                 CANNOT CHANGE SP. REP ON PAID UNIT           
PRESTERR EQU   106                 BRAND ESTIMATE NOT ON FILE                   
ALLCHERR EQU   107                 ALLOCATION CANNOT BE CHANGED IF PAID         
UNALLERR EQU   108                 CANNOT UNALLOCATE BILLED/PAID UNIT           
PRDERR   EQU   109                 INVALID PRODUCT CODE                         
BADBOOK  EQU   110                 INVALID BOOK                                 
DELERR   EQU   129                 CANNOT DELETE MISSING/MAKE-GOOD UNIT         
MGNFERR  EQU   131                 MAKE-GOOD REFERENCE NOT FOUND                
MGINVERR EQU   132                 INVALID MAKE-GOOD REFERENCE                  
PREERR   EQU   133                 CANNOT PRE-EMPT MADE-GOOD UNIT               
STCHAERR EQU   134                 STEWARD,FIELD CHANGED SINCE DOWNLOAD         
ENEWERR  EQU   158                 ONLY 'NEW' ESTIMATES ALLOWED                 
ELOCKERR EQU   159                 ESTIMATE HEADER IS LOCKED                    
CLIFRERR EQU   160                 CANNOT ADD CLIENT FROZEN                     
PROGERR  EQU   172                 PROGRAM RECORD NOT FOUND                     
PGNEWERR EQU   173                 NEW PROGRAM RECORDS ONLY                     
TOOLARGE EQU   175                 RECORD SIZE HAS OVERFLOWED MAXIMUM           
SCTYERR  EQU   178                 ACCESS TO CLIENT NOT AUTHORIZED              
UCBLKERR EQU   179                 CANNOT ADD UNITS PACKAGE CABLE\LOCK          
CLOCKERR EQU   180                 PACKAGE HAS UNIT(S) - CANT CBL LOCK          
PKDELERR EQU   181                 PACKAGE HAS UNIT(S) - CANNOT DELETE          
DPCHGERR EQU   182                 CANNOT CHANGE PACKAGE DAYPART                
LOCKERR  EQU   183                 CANNOT LOCK PACK. W BILLD/PD. UNITS          
PAKFERR  EQU   185                 PACKAGE IS FROZEN                            
PAKLERR  EQU   186                 PACKAGE IS LOCKED                            
DUPPACK  EQU   187                 BP DUPLICATE PACKAGE #                       
DAYDTEMT EQU   188                 DAY & DATE MUST MATCH                        
PAYCHGNA EQU   189                 CHANGING RATE AFTE PAY NOT ALLOWED           
INTGNF   EQU   190                 INTEGRATION NOT FOUND                        
NOESTPRD EQU   192                 NO PRD THIS EST (COPYU)                      
PGNOSHR  EQU   193                 IF PACK GUAR. NO SHARE/HUT/RTG CHG           
INVPMETR EQU   194                 INVALID POSTING DATA                         
PUPPACC  EQU   195                 PACKAGE RECORD GHANGED                       
CPLXERR  EQU   196                 COMPLEX MUST BE Y/N                          
DUPFEDC  EQU   200                 DUPLICATE FEED CODE                          
FEDCNDEL EQU   201                 FEED CODE CAN'T BE DELETED                   
FEEDCERR EQU   221                 FEED CODE NOT FOUND                          
BADBYR   EQU   222                 INVALID BUYER CODE                           
BADOFC   EQU   223                 INVALID OFFICE CODE                          
NOINVS   EQU   224                 NO INVENTORY HEADERS FOR THIS REQ.           
PREUPWAR EQU   230                 SOME QTRS PREVIOUSLY UPLOADED                
REPERR   EQU   232                 REP NOT FOUND                                
ADUERR   EQU   233                 NO ACT OR INT COST ALLOWED                   
BADUSRID EQU   234                 BAD USER ID                                  
CLIERR   EQU   236                 CLIENT NOT FOUND                             
ESTERR   EQU   237                 ESTIMATE NOT FOUND                           
NETERR   EQU   238                 NETWORK NOT FOUND                            
PAKERR   EQU   239                 PACKAGE NOT FOUND                            
UNIVERR  EQU   240                 UNIVERSE NOT FOUND                           
PUPPACA  EQU   241                 PUP PACKAGE ADD                              
ALLUTRNS EQU   242                 ALL UNITS TRANSFERED                         
PRGUTRNS EQU   243                 1 PROGRAM UNITS TRANSFER (NEXT PRG)          
PKGDIS   EQU   244                 PACKAGE DISPLAYED                            
UNTNOTAD EQU   245                 UNITS ON PUP NOT ALL ADDED                   
AFFIDLCK EQU   246                 AFFID SEEDED CANOT CHANGE FIELD              
AUDITERR EQU   247                 REASON CODE INPUT ERROR                      
INVREASN EQU   248                 INVALID REASON CODE                          
MAXIOERR EQU   249                 MAXIMUM IO'S EXCEEDED                        
AUDACTER EQU   250                 NO DELETE ACTION WHEN AUDIT SET              
USERERR  EQU   255                 USER SUPPLIED ERROR MESSAGE                  
*                                                                               
* I/O EQUATES                                                                   
*                                                                               
READ     EQU   1                   READ ON DIRECTORY                            
SEQ      EQU   2                   SEQUENTIAL READ ON DIRECTORY                 
HIGH     EQU   3                   READ HIGH ON DIRECTORY OR IS FILE            
WRITE    EQU   4                   WRITE TO DIRECTORY                           
ADD      EQU   5                   ADD TO DIRECTORY                             
GET      EQU   6                   GETREC ON DIRECT ACCESS FILE                 
PUT      EQU   7                   PUTREC ON DIRECT ACCESS FILE                 
ADDREC   EQU   8                   ADDREC ON DIRECT ACCESS FILE                 
SPT      EQU   16                  SPOT FILE/DIRECTORY                          
UNT      EQU   32                  UNIT FILE/DIRECTORY                          
STA      EQU   48                  STATION FILE/DIRECTORY                       
TRF      EQU   64                  TRAFFIC FILE/DIRECTORY                       
NTI      EQU   80                  NTI(PAV) FILE/DIRECTORY                      
CTL      EQU   96                  CONTROL FILE/DIRECTORY                       
XSP      EQU   112                 XSPOT FILE                                   
DIR      EQU   X'80'               READ DIRECTORY                               
FIL      EQU   X'00'               READ FILE                                    
PASSDEL  EQU   X'0100'             RETURN DELETED RECORDS                       
UPDATE   EQU   X'0200'             READ FOR UPDATE - LOCKS RECORD               
*                                                                               
BASE1    DS    F                                                                
BASE2    DS    F                                                                
BASERD   DS    F                                                                
BASERELO DS    F                                                                
OVRELO   DS    F                                                                
ATWA     DS    A                                                                
ATIA     DS    A                                                                
ATIOB    DS    A                                                                
ASYSPARM DS    A                                                                
ACOMFACS DS    A                                                                
ASYSFACS DS    A                                                                
ASECBLK  DS    A                   SPARE                                        
         DS    A                   SPARE                                        
*                                                                               
VTWABLD  DS    A                   LINKED WITH BASE                             
VBILLRDR DS    A                                                                
VCALCSHP DS    A                                                                
         DS    A                   SPARE                                        
*                                                                               
VDATAMGR DS    A                                                                
VCALLOV  DS    A                                                                
VGETMSG  DS    A                                                                
VGETTXT  DS    A                                                                
VHELLO   DS    A                                                                
VSCANNER DS    A                                                                
VHEXIN   DS    A                                                                
VHEXOUT  DS    A                                                                
VCASHVAL DS    A                                                                
VDATVAL  DS    A                                                                
VDATCON  DS    A                                                                
VADDAY   DS    A                                                                
VPERVERT DS    A                                                                
VGETDAY  DS    A                                                                
VPERVAL  DS    A                                                                
VGLOBBER DS    A                                                                
VRECUP   DS    A                                                                
VGETFACT DS    A                                                                
VDEMAND  DS    A                                                                
VGETPROF DS    A                                                                
VWSSVRS  DS    A                                                                
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
*                                                                               
VCOMBASE DS    0A                  VCOMMON ROUTINES IN BASE                     
VALIBYR  DS    A                                                                
VALIMED  DS    A                                                                
VALICLT  DS    A                                                                
VALIPRD  DS    A                                                                
VALIEST  DS    A                                                                
VALISTA  DS    A                                                                
VALIPR2  DS    A                                                                
GETHDR   DS    A                                                                
GETDATA  DS    A                                                                
SENDMSG  DS    A                   ERROR MESSAGES GO HERE                       
FVAL     DS    A                   FIELD SCANNER AND VALIDATER                  
VALIREP  DS    A                   CHECK LOCK STATUS                            
         DS    25A                 SPARE                                        
VCOMBASX EQU   *                                                                
VCOMBASN EQU   (VCOMBASX-VCOMBASE)/4                                            
*                                                                               
BASEFACS DS    0F                   BASE PROGRAM MODULE ADDRESSES               
AIOCALL  DS    A                                                                
         DS    3A                                                               
*                                                                               
ANETIOBK DS    A                                                                
ANETBLK  DS    A                                                                
*                                                                               
AIO      DS    A                   SHOULD BE ONE OF THE FOLLOWING !             
AIO1     DS    A                                                                
AIO2     DS    A                                                                
AIO3     DS    A                                                                
AIO4     DS    A                                                                
*                                                                               
APHASES  DS    0A                                                               
*                                                                               
VFALINK  DS    V                                                                
VOFFICER DS    V                                                                
VSTAPACK DS    V                                                                
VDEMOCON DS    V                                                                
VDEMOUT  DS    V                                                                
VDAYUNPK DS    V                                                                
VUNTIME  DS    V                                                                
VGETBROD DS    V                                                                
VCLPACK  DS    A                                                                
VSTAVAL  DS    A                                                                
VTSAR    DS    A                                                                
VDAYVAL  DS    A                                                                
VTIMVAL  DS    A                                                                
VGETRATE DS    A                                                                
VCLUNPK  DS    A                                                                
VDEMOVAL DS    A                                                                
VNETWEEK DS    A                                                                
VDEFINE  DS    A                                                                
VGETNUN  DS    A                                                                
VGETHUT  DS    A                                                                
VNETVAL  DS    A                                                                
VMSPACK  DS    A                                                                
         DS    A                                                                
         DS    A                                                                
         DS    A                                                                
         DS    A                                                                
*                                                                               
COMMAND  DS    CL8                 DATAMGR COMMAND                              
DIRECTRY DS    CL8                                                              
FILE     DS    CL8                 DATAMGR FILE                                 
NDXDA    DS    CL4                 HELD DISK ADDRESS FOR IO ROUTINE             
*                                                                               
RDUPDATE DS    C                                                                
DMOUTBTS DS    X                                                                
DMINBTS  DS    X                                                                
DMBYTE   DS    X                                                                
XSPT     DS    C                   =C'Y' FOR XSPDIR/XSPFILE                     
*                                                                               
DDS      DS    C                   Y=DDS TERMINAL                               
*                                                                               
DMINBITS DS    X                   DATAMGR BITS (UPDATE,READ,DELETES)           
IOFLAG   DS    X                   COMMAND/FILE PASSED TO ROUTINETES)           
*                                                                               
HDRADDR  DS    A                                                                
DATADDR  DS    A                                                                
SEMICOL   EQU  X'5E'                                                            
SEMICOLON EQU  SEMICOL                                                          
         DS    32D                 SPARE                                        
*                                                                               
AGETDATA DS    A                   FALINK ROUTINE ADDRESSES                     
ASETELEM DS    A                                                                
AADDDATA DS    A                                                                
AFABLK   DS    A                                                                
AMAPTAB  DS    A                                                                
DPOINTER DS    A                   FOR INPUT DATA IN BDATA                      
HDRCODE  DS    CL2                                                              
ANYDATA  DS    CL1                                                              
MYFLAG   DS    CL1                                                              
CMTCOUNT DS    X                                                                
*                                                                               
DMCB     DS    6F                                                               
DMWORK   DS    12D                                                              
SPACES   DS    CL80                                                             
*                                                                               
DUB      DS    D                                                                
FULL     DS    F                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
*                                                                               
ERROR    DS    H                                                                
*                                                                               
BYTE     DS    X                                                                
BYTE2    DS    X                                                                
*                                                                               
ELCODE   DS    X                                                                
ELCDLO   DS    X                                                                
ELCDHI   DS    X                                                                
BUYELS   DS    XL2                 SAVE ELCDLO/ELCDHI                           
         DS    XL2                                                              
         DS    XL1                                                              
*                                                                               
SPOTS    DS    F                                                                
GROSS    DS    F                                                                
NET      DS    F                                                                
TAX      DS    F                                                                
*                                  FIELD VALIDATION STORAGE                     
FERN     DS    X                   FIELD ERROR NUMBER (USER SET)                
FNDX     DS    X                   FIELD INDEX (USER SET)                       
FADDR    DS    A                   A(FIELD HEADER)                              
FMAX     DS    X                   OPTIONAL MAXIMUN SCAN LENGTH                 
FLAST    DS    AL3                 A(LAST STRING) OR ZERO                       
FLEN     DS    X                   LENGTH OF LAST STRING OR ZERO                
FTERM    DS    XL6                 LIST OF SCAN TERMINATORS                     
         DS    X                                                                
FLDH     DS    XL8                 FIELD HEADER CONSTRUCTED BY FVAL             
FLD      DS    CL79                EXTRACTED DATA (SPACE FILLED)                
FSTOP    DS    X                   STOP CHARACTER OR X'FF'                      
         DS    CL10                SPARE                                        
         SPACE 1                                                                
****************                                                                
*                                                                               
         DS    0D                                                               
KEY      DS    XL48                                                             
KEYSAVE  DS    XL48                                                             
*                                                                               
WORK     DS    CL100                                                            
WORK2    DS    CL260                                                            
*                                                                               
         DS    0D                                                               
BLOCK    DS    CL300                                                            
*                                                                               
         DS    0D                                                               
*                                                                               
         DS    0D                                                               
OVWORK   DS    XL512                                                            
*                                                                               
NETREQ   DS    XL2048                                                           
NETIOBLK DS    XL1024                                                           
NETBLK   DS    XL1024                                                           
*                                                                               
         ORG   NETREQ                                                           
SVAGYNAM DS    CL33                                                             
SVAGYADR DS    CL33                                                             
SVAPROF  DS    CL16                AGENCY PROFILE                               
SV00PRF  DS    CL16                00 PROFILE                                   
SVA0PRF  DS    CL16                A0 PROFILE                                   
SVA0APRF DS    CL16                A0A PROFILD                                  
SVMKPRF  DS    CL16                MK PROFILE                                   
SVRCVEL  DS    CL2                                                              
SVLENGTH DS    CL1                 PROGRAM KEY COMPARE LENGTH                   
SVMEDNM  DS    CL12                                                             
SVOFFC   DS    CL1                                                              
SVTIME   DS    F                    START END TIMES                             
SVCLI    DS    CL11                 5 CLIENT CODES                              
SVEST    DS    CL21                 20 ESTIMATES                                
SVPKG    DS    CL9                  8 PACKAGES                                  
SVPRD    DS    CL26                 25 PRODUCTS                                 
SVNET    DS    CL61                 15 NETWORK CODES                            
SVMKT    DS    CL31                 15 MARKET NUMBERS                           
SVFILT1  DS    CL1             X'80'=NO BILLED                                  
*                              X'40'=NO DEMOS                                   
*                              X'20'=NO LOCKED                                  
*                              X'10'=NO MADEGOOD                                
*                              X'08'=MISSED                                     
*                              X'04'=NO PAID                                    
*                              X'02'=NO PREEMPTED                               
*                              X'02'=NO PREEMPTED                               
SVFILT2  DS    CL1                                                              
SVDAYFLT DS    CL1                  Y = DAY FILTER INPUTTED                     
SVDAY    DS    CL1                  DAY  MON=1 SUN=7                            
SVDAYDEM DS    CL1                  DAY DEMO FORMAT MON=40 SUN=01               
SVSDATE  DS    CL2                  START DATE                                  
SVEDATE  DS    CL2                  END DATE                                    
SVBDATE  DS    CL2                  BUY DATE                                    
SVEESDAT DS    CL6                  START DATE (EBCDIC)                         
SVEEEDAT DS    CL6                  END DATE (EBCDIC)                           
SVEEBDAT DS    CL6                  BUY DATE (EBCDIC)                           
SVNTI    DS    CL2                  NTI CODE                                    
SVDAYPT  DS    CL1                                                              
SVPRNAD  DS    CL6                  PROGRAM RECORD NAD CODE                     
SVPRFILT DS    CL3                  PROGRAM RECORD FILTER                       
SVSOURC  DS    CL1                  SOURCE                                      
SVPRGCD  DS    CL6                  PROGRAM CODE                                
SVPRNAM  DS    CL16                 PROGRAM NAME                                
SVLINE   DS    CL1                  BUY LINE NUMBER                             
SVBUYTYP DS    CL1                  BUY TYPE                                    
SVACTCST DS    CL4                  ACTUAL COST                                 
*                                                                               
* MISSED UNIT INFORMATIO                                                        
*                                                                               
SVMSPROG DS    CL6                  MISSED PROGRAM CODE                         
SVMSBDAT DS    CL2                  MISSED BUY DATE                             
SVMSLINE DS    CL1                  MISSED LINE NUMBER                          
SVMSPAKG DS    CL1                  MISSED PACKAGE NUMBER                       
*                                                                               
* DEMO INFO                                                                     
*                                                                               
SVHOMIMP DS    F                    HOME IMP'S                                  
SVHOMGRP DS    H                    HOME GRP'S                                  
SVGRPS   DS    CL51                 DEMO VALUES RATINGS (MAX 25)                
SVVPHS   DS    CL51                 DEMO VALUES VPHS    (MAX 25)                
SVIMPS   DS    CL101                DEMO VALUES IMPS    (MAX 25)                
*                                                                               
* ADDITIONAL SAVE AREAS                                                         
*                                                                               
SVTIME2  DS    CL4                  SECOND TIME FILTER                          
SVDY2FLT DS    CL1                  SECOND DAY FILTER INDICATOR                 
SVDAY2   DS    CL1                  SECOND DAY FILTER                           
SVDY2DEM DS    CL1                  DAY DEMO FORMAT MON=40 SUN=01               
SVPRTYPE DS    CL6                  PROGRAM TYPE                                
SVPRTIER DS    CL1                  PROGRAM TIER                                
SV2DAYPT DS    CL1                  2 CHARACTER DAYPART                         
SVPRNEW  DS    CL1                  PROGRAM NEW/RETURNING INDICATOR             
SVPRCONT DS    CL2                  PROGRAM CONTENT                             
SVFRSW   DS    CL1                  FRONTRUNNER SWITCH                          
SVUNIV   DS    CL2                  SAVED UNIVERSE NUMBER                       
SVUNIVDT DS    CL2                  SAVED UNIVERSE DATE                         
SVTVQBK  DS    CL2                  SAVED PLAN TVQ BOOK                         
SVINDS1  DS    CL1                                                              
SVI1UNIQ EQU   X'80'                X'80'=PASS UNIVERSE ONLY (FRONTRNR)         
SVI1VPHQ EQU   X'40'                X'40'=PASS VPH'S ONLY (FRONTRNR)            
SVI1HUTQ EQU   X'20'                X'20'=PASS HUTS ONLY (FRONTRNR)             
SVI186Q  EQU   X'10'                X'10'=DONT PASS 86 ELEM WITH UNIV           
SVI1NTIQ EQU   X'08'                X'08'=GET NTI DEMOS                         
SVI1CSUQ EQU   X'04'                X'04'=GET CUNIVERSE                         
*                                                                               
*                                                                               
*  PLAN INFO TO RETRIEVE HUT DATA                                               
*                                                                               
PLANHTYR DS    CL1                  HUT TEAR                                    
PLANHTNO DS    CL1                  NUMBER OF YEARS BACK                        
PLANHTSC DS    CL1                  HUT SCHEME OR X'00'                         
PLANHTAV DS    CL1                  HUT AVERAGING (Q/M)                         
PLANPERT DS    CL1                  PERIOD QUARTER,MONTH,WEEK                   
PLANHTPO DS    CL2                  HUT PERCENT OVERRIDE (2 DEC.)               
PLANHTFL DS    CL1                  HUT FLAVOR N(TI) B(ROADCAST) C(AL)          
*                                                                               
* ADDITIONAL SAVE AREAS                                                         
*                                                                               
SVAGYFL2 DS    CL1                  AGENCY FLAG 2                               
SVBRNDOW DS    CL1                  BRAND OWNERSHIP REPORT SWITCH               
SVECST   DS    CL1                  SAVE ECOST LEVEL CLIENT                     
SVEDEMSW DS    CL1                  DEMO LOOKUP CONTROL                         
*                                   BYTE X'20' = EST DEMOS NO GUARANTEE         
*                                   BYTE X'10' = ACTUAL DEMOS                   
*                                   BYTE X'08' = RTG 30 SECOND EQUIV            
*                                   BYTE X'04' = RTG NO EQUIVALENCE             
*                                   BYTE X'02' = IMP 30 SECOND EQUIV            
*                                   BYTE X'01' = IMP NO EQUIVALENCE             
SVINV    DS    CL10                 INVOICE                                     
SVIGNORE DS    CL1                  IGNORE FLAGS                                
SVIFILMQ EQU   X'01'                IGNORE FILM                                 
SVICOSTQ EQU   X'02'                IGNORE COST                                 
SVITIMEQ EQU   X'04'                IGNORE TIME                                 
SVILENQ  EQU   X'08'                IGNORE LENGTH                               
SVIICSTQ EQU   X'10'                IGNORE INTEGRATION COST                     
SVISEPQ  EQU   X'20'                IGNORE SEPERATION                           
BMKTSTA  DS    0CL5                 MKT/STA                                     
BMKTP    DS    CL2                  PACKED MARKET                               
BSTAP    DS    CL3                  PACKED STATION                              
SVCOMFLG DS    CL1                  COMMENT FLAGS                               
SVCMDELQ EQU   X'01'                DELETE COMMENTS                             
SVNTISTA DS    CL4                  NTI STATION                                 
SVHDCC   DS    C                   HD/CENTERCUT                                 
SVHDQ    EQU   C'H'                HI-DEF                                       
SVCCQ    EQU   C'C'                CENTERCUT                                    
SVSTATSW DS    CL1                  DEMO LOOKUP CONTROL                         
*                                   BYTE X'01' = ACTUALS COLUMN 2               
*                                   BYTE X'02' = EST COLUMN 2                   
*                                   BYTE X'04' = EST GUARANTEE COLUMN 2         
SVSESSNS DS    CL2                  NNAV/NBUY SESSION NUMBERS                   
SVSTEWST DS    CL1                                                              
*                                   X'80' = THIS IS FROM THE HUB                
SVMEDTYP DS    CL1                 NETWORK MEDIA TYPE                           
         DS    CL9                  SPARE                                       
** SAVE AREAS FOR WIZARD DOWNLOAD ***                                           
         DS    CL56                SPARE                                        
*                                                                               
SVWIZPRD DS    CL30                CL3 X 10 PRODUCTS                            
SVWZPRD# EQU   (*-SVWIZPRD)/3                                                   
SVWIZEST DS    CL20                XL1 X 20 ESTIMATES                           
SVWIZSED DS    XL4                 BINARY START-END DATES                       
CURRCLT  DS    CL2                 CURRENT WIZ CLIENT                           
CURREST  DS    CL1                 CURRENT WIZ EST                              
WIZEST   DS    CL1                 WIZEST FLAG                                  
CURRPRDS DS    CL31                PRODS FROM SVWIZPRD VALID FOR                
*                                  CURRENT CLIENT FROM SVWIZCLT                 
*                                  WITH X'FF' AT END OF LIST                    
** END WIZ SAVE AREAS**                                                         
MSGTYPE  DS    CL1                 E=ERROR                                      
READREC  DS    CL1                 N='DON'T READ RECORD' JUST KEY               
*                                  ON VALIPRD ETC CALLS                         
ERRORMSG DS    CL60                FOR EXTRA ERROR MESSAGES                     
*                                  ALONG WITH ERROR FIELD                       
UPLSEQNM DS    CL1                 SEQUENCE NUMBERS FOR TSAR RECS               
*                                                                               
BUYERRSW DS    CL1                 Y=ERROR RETURNED FROM BUY                    
*                                                                               
TSARRCLN DS    CL2                 TSAR RECORD LENGTH                           
*                                                                               
* WIZSTAT IS USED BY WIZARD DOWNLOAD TO CONTROL REPORTING                       
* OF ERRORS AT REQUEST TIME                                                     
* WIZSTAT=X'01' - DON'T STOP ON ERROR, JUST PASS VALID REQ DATA                 
*                                                                               
WIZSTAT  DS    CL1                 X'01'   SKIP-ERROR MODE ON                   
WIZSTERR EQU   X'02'               X'02'   ERROR FOUND                          
WIZSTCLI EQU   X'04'               X'04'   BYPASS CLUNPK IN VALCLI              
WIZSTBAR EQU   X'08'               X'08'   PASS BARULES RECORD INFO             
*                                                                               
SVWIZCLT DS    CL540                CL3,XL2,CL20,XL1,XL1                        
LNWIZCLT EQU   27                  (CODE,BINRY,NAME,OFFCE,ECOST) X XL20         
*                                                                               
* SEARCH PACKAGE FIELDS                                                         
*                                                                               
SPKDPT   DS    XL1                 DAYPART                                      
SPKSTAT  DS    CL1                 STATUS                                       
SPKSTLOC EQU   C'1'                  - LOCKED                                   
SPKSTULO EQU   C'2'                  - UNLOCKED                                 
SPKSTFRZ EQU   C'3'                  - FROZEN                                   
SPKSTUFR EQU   C'4'                  - UNFROZEN                                 
SPKSTUPL EQU   C'5'                  - UPLSET                                   
SPKSTUUP EQU   C'6'                  - UPLRESET                                 
SPKESTD  DS    XL2                 ESTIMATE START DATE                          
SPKEEND  DS    XL2                 ESTIMATE END DATE                            
*                                                                               
TSARLOC  DS    CL60                LOCAL TSAR BLOCK (USED BY OVERLAYS)          
         DS    CL109               SPARE                                        
         ORG                                                                    
*                                                                               
*ENIO    EQU   4096                                                             
LENIO    EQU   6000                EXPAND UNIT FILE TO HANDLE COMSCORE          
IOAREA1  DS    (LENIO)X                                                         
IOAREA2  DS    (LENIO)X                                                         
IOAREA3  DS    (LENIO)X                                                         
IOAREA4  DS    (LENIO)X                                                         
*                                                                               
LENWORK  EQU   *-WORKD                                                          
*                                                                               
WORKX    EQU   *                                                                
         EJECT                                                                  
*===================================================================*           
* SCREEN DSECT                                                                  
*===================================================================*           
         SPACE 1                                                                
       ++INCLUDE FATWA                                                          
*                                                                               
         ORG   TWAD+64                                                          
       ++INCLUDE NENAVFFD                                                       
*                                                                               
         ORG   TWAD+2304                                                        
FABLK    DS    CL(FALINKDL)        BLOCK FOR FALINK                             
FPARMS   DS    6F                  RETURN PARMETER BLK FROM GETDATA             
FAMSGBLK DS    CL(FAMSGDL)         BLOCK FOR FALINK ERROR MESSAGES              
FACON    DS    CL(L'FALCON)        BLOCK FOR FALINK CONTROL FIELD               
*                                                                               
         DS    0D                                                               
SVTSRKEY DS    XL1                 TSAR KEY (SEQUENCE NUMBER)                   
TEMPSET  DS    XL1                 Y=TEMP PAGES ALLOCATED                       
SVINITSW DS    CL1                  Y= TSAR INIT DONE                           
SVSAVESW DS    CL1                  Y= TSAR SAVE DONE                           
SVRSTSAV DS    CL1                  Y= TSAR SAVE DONE                           
*                                                                               
BRKFLAG  DS    XL1                                                              
BRKFULL  EQU   X'80'                                                            
BRKRESM  EQU   X'40'                                                            
*                                                                               
SVTSARIN DS    CL1                  TSAR SAVE DONE                              
         DS    XL7                  SPARE                                       
SVBUYCNT DS    H                                                                
*                                                                               
QAGY     EQU   TWAAGY                                                           
QMED     DS    CL1                                                              
*                                                                               
QCLT     DS    CL3                                                              
SVCNAME  DS    CL20                                                             
SVCPROF  DS    CL16                                                             
SVCXTRA  DS    CL16                                                             
QPRD     DS    CL3                                                              
QPRD2    DS    CL3                                                              
SVPNAME  DS    CL20                                                             
SVPNAME2 DS    CL20                                                             
QEST     DS    CL3                                                              
QEST2    DS    CL3                                                              
SVENAME  DS    CL20                                                             
QDEMOS   DS    XL75                                                             
QSTA     DS    CL8                                                              
SVSTAPRT DS    CL8                                                              
QMKT     DS    CL4                                                              
SVMKTNM  DS    CL24                                                             
QMGR     DS    0CL5                                                             
QMGRPID  DS    CL1                                                              
QMGRP    DS    CL4                                                              
QPER     DS    CL12                REQUESTED PERIOD                             
*                                                                               
BAGYMD   DS    XL1                                                              
BCLT     DS    XL2                                                              
BPRD     DS    XL1                                                              
BPRD2    DS    XL1                                                              
BPOLPRD  DS    XL1                                                              
BEST     DS    XL1                 BEST/BEST2 USED FOR HEADER EST               
BEST2    DS    XL1                                                              
BMKT     DS    H                                                                
BNET     DS    XL4                                                              
BPKG     DS    XL1                                                              
BMOS     DS    XL2                 Y/M                                          
BPER     DS    XL4                 2 BYTE MOS START/END                         
****************                                                                
*                                                                               
BYCBLNET DS    XL3                                                              
BBCBLNET DS    X                   CABLE NETWORK CODE                           
BNOGOAL  DS    C                   CABLE NETWORK CODE                           
BSKED    DS    C                   O=OTO, S=SKED                                
*                                                                               
FLAGS    DS    X                   VARIOUS FLAGS                                
FLSNDCMT EQU   X'80'               SEND COMMENTS WITH BUYS                      
FLNOMAT  EQU   X'40'               UPDATE BUY W/OUT MATCH                       
*        EQU   X'20'                                                            
*        EQU   X'10'                                                            
*        EQU   X'08'                                                            
*        EQU   X'04'                                                            
*        EQU   X'02'                                                            
*        EQU   X'01'                                                            
*                                                                               
         DS    CL1                 SPARE                                        
*                                                                               
* CABLE MATCHMAKER STORAGE ARE                                                  
*                                                                               
QGRP     DS    CL4                  GROUP CODE                                  
QBYR     DS    CL4                  BUYER CODE                                  
SVOFCNAM DS    CL24                 OFFICE NAME                                 
SVBYRNAM DS    CL24                 BUYER NAME                                  
SVHDFLAG DS    XL1                  INV HEADER FLAGS                            
FLSNDMAT EQU   X'80'                SEND MATCHED INVOICE HEADERS                
*                                                                               
TSARREC  DS    XL64                 TSAR RECORD BUFFER                          
I2INTREQ DS    CL1                  MATCH ON INTEGRATION                        
I2CALREQ DS    CL1                  CALANDER OR BRODCAST MONTH                  
I2EST    DS    CL3                  I2 ESTIMATE                                 
I2ESTFLT DS    CL3                  I2 EST FILTER (ONLY IF EST IS C'NO)         
I2PRDGRP DS    CL4                  I2 PRODUCT GROUP FIELD                      
QMMREP   DS    CL3                  MATCHMAKER REP                              
SVROT    DS    CL1                  ROTATION (PROGRAM SEARCH)                   
QSPV     DS    CL4                  SUPERVISOR CODE                             
I2DRFTSW DS    CL1                  I2 DRAFT MODE SWITCH                        
I2ESTB   DS    XL1                  I2 BINARY ESTIMATE                          
SVPRSMID DS    CL20                 PRISMA ID                                   
         DS    CL10                 SPARE                                       
* RESTORE LOGIC INFORMATION                                                     
LASTHDR  DS    XL1                  LAST HEADER                                 
LASTMC   DS    XL1                  LAST MAP CODE                               
LASTKEY  DS    XL32                 LAST KEY                                    
*                                                                               
*  FRONTRUNNER KEY SAVE AREA                                                    
*                                                                               
SVFRCLI  DS    CL3                  CLIENT SAVE (FRONTRUNNER)                   
SVFREST  DS    CL3                  ESTIMATE SAVE (FRONTRUNNER)                 
SVFRNET  DS    CL4                  NETWORK SAVE (FRONTRUNNER)                  
SVFRPACK DS    CL3                  PACKAGE SAVE (FRONTRUNNER)                  
SVFRPROG DS    CL6                  PROGRAM CODE SAVE (FRONTRUNNER)             
SVFRDATE DS    CL8                  DATE SAVE (FRONTRUNNER)                     
SVFRSLIN DS    CL3                  SUB LINE SAVE (FRONTRUNNER)                 
SVFRREAS DS    CL3                  REASON CODE SAVE (FRONTRUNNER)              
*                                                                               
SVFRTYP  DS    CL1                  P=PACKAGE,B=BUY UPLOAD                      
*                                                                               
SVPERTYP DS    CL1                  PERIOD TYPE W/M/Q                           
SVPAKGUA DS    XL4                  PACKAGE GUARANTEE                           
SVDEMCAT DS    XL3                  DEMO GUARANTEE CATEGORY                     
SVDEMGUA DS    XL4                  DEMO GUARANTEE                              
SVSTPLAN DS    CL6                  START DATE OF UPLOAD                        
SVENPLAN DS    CL6                  END DATE OF UPLOAD                          
SVFRSTSW DS    CL1                  FIRST UNIT SWITCH Y,N                       
SVCSLIC  DS    CL32                 COMSCORE LICENSE                            
         DS    CL86                 SPARE                                       
OVERSAVE DS    XL128                OVERLAY STORAGE                             
*                                                                               
* END OF CABLE MATCHMAKER STORAGE                                               
*                                                                               
BDATAX   EQU   *                                                                
*                                                                               
         DS    0D                                                               
BBUYLIN  DS    X                   CURRENT BUYLINE NUMBER                       
*                                                                               
SVXFROV  DS    X                   OVERLAY FOR XFRCTL RETURN                    
SVRESUME DS    X                   GLOBBER RETURN IF NON-ZERO                   
SVREASON DS    X                   REASON FOR GLOBBER EXIT                      
*                                                                               
SVRMOTO  EQU   C'M'                MINUS OTO                                    
SVRTMOTO EQU   C'T'                TEST MINUS OTO OK                            
SVRPOTO  EQU   C'P'                PLUS OTO                                     
SVRPASS1 EQU   C'1'                VALIDATE BUY                                 
SVRPASS2 EQU   C'2'                MAKE NEW BUY                                 
SVRBUYX  EQU   C'X'                LAST NEW BUY PASS                            
SVRMG    EQU   C'G'                MAKEGOOD                                     
SVRSKED  EQU   C'S'                SKED                                         
SVRCHG   EQU   C'C'                CHANGE BUY (TIME/COST)                       
*                                                                               
SVDPNTRD DS    H                   SAVE DPOINTER DISPLACEMENT                   
*                                                                               
APRD     DS    CL3                 AFFID ELEM PRODUCT                           
SVOLDRCV DS    X                                                                
SVSNVKEY DS    XL32                                                             
SVBUYDT1 DS    XL78                                                             
SVBUYDT2 DS    XL78                                                             
SVBUYDT3 DS    XL78                                                             
*                                                                               
BMGCODE  DS    CL2                 BUY MAKEGOOD CODE                            
BSTDATE  DS    XL2                 BUY START DATE                               
BEDDATE  DS    XL2                 BUY END DATE                                 
BCOST    DS    XL3                 BUY COST                                     
BNPW     DS    X                   NUMBER PER WEEK                              
BRTTYP   DS    X                   RATE TYPE                                    
*                                                                               
QCOST    DS    CL10                                                             
*                                                                               
SVBYRFLT DS    CL1                                                              
QMGCD    DS    CL2                 MAKEGOOD CODE                                
QUESTOR  DS    CL12                                                             
QWHEN    DS    CL1                                                              
QDEST    DS    CL8                                                              
QBOOK    DS    CL4                                                              
QHUT     DS    CL2                                                              
*                                                                               
SVSKDATE DS    XL2                                                              
SVSKNUM  DS    XL1                                                              
*                                                                               
QBUYID   DS    CL12                                                             
*                                                                               
SVI2XPRF DS    CL16                I2X PROFILE                                  
SVI2YPRF DS    CL16                I2Y PROFILE                                  
*                                                                               
VERSION  DS    XL4                 MM VERSION NUMBER                            
*                                                                               
OTODATA  DS    CL3                 +OTO DATE/SPOTNUM                            
*                                                                               
QSTARTB  DS    XL3                 MOS START IN 3 BYTE BINARY                   
QENDB    DS    XL3                 MOS END IN 3 BYTE BINARY                     
*                                                                               
MOLINE   DS    X                   LAST MINUS OTO LINE NUMBER                   
SVBYROP1 DS    X                                                                
QREP     DS    CL3                 REP                                          
APRD2    DS    CL3                 PIGGY AFFID PRD                              
*                                                                               
*                                                                               
SVOLAY   DS    X                   SAVED SPECIAL OVERLAY NUMBER                 
*                                                                               
SVGLOBSW DS    CL1                 SAVE GLOBBER SWITCH E=EDIT,B=DONE            
*                                                                               
* TSAR BLOCK DEFINE AREA                                                        
*                                                                               
TSARBLK  DS    CL48                                                             
*                                                                               
         DS    CL82                SPARE                                        
*                                                                               
         DS    CL1000              SECRET BLOCK                                 
*                                                                               
         ORG                                                                    
         DS    0D                                                               
         DS    CL1280              SPARE                                        
*                                                                               
SVOVDATA DS    CL1024              DDLINK WORK AREA (NENAVWORKD)                
*                                                                               
QNTDMS   DS    XL((CDEMLNQ*CDEMMAX)+1)   COMSCORE DEMO NAMES                    
CDEMLNQ  EQU   8                   L'COMSCORE DEMO NAME                         
CDEMMAX  EQU   20                  MAXIMUM # OF COMSCORE DEMOS                  
*                                                                               
SVTWALEN EQU  *-FABLK                                                           
*                                                                               
         ORG   TWAD+((TWANOGO)-(5*1024))                                        
SVSECRET DS    XL1024              OFFICER SECRET SAVED STORAGE                 
SVFALINK DS    XL(4*1024)          FALINK'S SAVED STORAGE                       
         EJECT                                                                  
H01A001  EQU   1                                                                
H01AG06  EQU   2                                                                
H01MK01  EQU   3                                                                
H01CL10  EQU   4                   ADJACENCY CODE                               
H01I2X7  EQU   5                   MG INV TO MG SPOT ONLY                       
H01I2X13 EQU   6                   SHOW SPOT SEQ NUMBERS                        
H01I2Y5  EQU   7                   SHOW SPECIAL REP NAME                        
*                                                                               
H02OFC   EQU   1                                                                
H02BYR   EQU   2                                                                
*                                                                               
H03MKT   EQU   2                                                                
H03STA   EQU   3                                                                
H03CLT   EQU   4                                                                
H03PRD   EQU   5                                                                
H03PR2   EQU   6                                                                
H03MOS   EQU   7                                                                
H03ESRNG EQU   8                                                                
H03CNAME EQU   10                                                               
H03PNAME EQU   11                                                               
H03ENAME EQU   12                                                               
H03INV   EQU   13                                                               
H03FLMSQ EQU   14                                                               
H03FLM   EQU   15                                                               
H03FLAGS EQU   16                                                               
H03BUBL  EQU   20                                                               
*                                                                               
H03FLAGD DSECT                                                                  
H03F_POL  DS  CL1                  C'N' IF NOT POL                              
H03F_STAT DS  CL1                  C'W' WIP, C'M' MATCHED                       
*                                                                               
H04MKT   EQU   01                                                               
H04MKTNM EQU   02                                                               
*                                                                               
H05EST   EQU   01                                                               
H05ESTNM EQU   02                                                               
H05ESDAT EQU   03                                                               
H05EEDAT EQU   04                                                               
H05EDEM  EQU   05                                                               
         EJECT                                                                  
H06BDATA EQU   1                   (SEE H6D BELOW)                              
H06BDEM  EQU   2                                                                
*                                                                               
H6D      DSECT          *** BUYREC DATA (SEMICOLON DELIMITED)                   
H6SEQ    DS    CL3                 SEQUENCE NUMBER                              
H6PRD    DS    CL3                 PRD                                          
H6EST    DS    CL3                 EST                                          
H6PRD2   DS    CL3                 PRD2                                         
H6EST2   DS    CL3                 EST2                                         
H6LINE   DS    CL3                 LINE                                         
H6DAYS   DS    CL3                 DAYS (SUM OF BIT VALUES)                     
H6DAYCNT DS    CL1                 END DAY - START DAY (=0 DEFAULT)             
H6STIM   DS    CL4                 START TIME (0-2400)                          
H6ETIM   DS    CL4                 END TIME (0-2400)                            
H6SDAT   DS    CL6                 START DATE MMDDYY                            
H6EDAT   DS    CL6                 END DATE   MDDDYY                            
H6SLN    DS    CL3                 SLN                                          
H6GRS    DS    CL8                 GROSS COST                                   
H6NET    DS    CL8                 NET COST                                     
H6RTYP   DS    CL1                 RATE TYPE                                    
H6PROG   DS    CL17                PROGRAM NAME                                 
H6COM    DS    CL1                 COMMENTS ? (=N/Y)                            
H6REP    DS    CL3                 SPECIAL REP                                  
H6ADJ    DS    CL2                 ADJACENCY CODE                               
H6WKIND  DS    CL1                 WEEK INDICATOR                               
H6DPT    DS    CL1                 DAYPART CODE                                 
H6CBLNET DS    CL3                 CABLE NETWORK                                
H6MGCD   DS    CL2                 BUYLINE MAKEGOOD CODE                        
H6DAILY  DS    CL1                 BUYLINE HAS DAILY SKED                       
H6DX     EQU   *                                                                
*                                                                               
H07DAYS  EQU   01                                                               
H07TIMS  EQU   02                                                               
H07PROG  EQU   03                                                               
*                                                                               
H08SPDET EQU   01                                                               
*                                                                               
S8D      DSECT                     FIELD DELIMITER IS SEMICOLON                 
S8SEQ    DS    CL3                 BUYLINE SEQNUM                               
S8MTCH   DS    CL1                 MATCHED (=N/Y)                               
S8MGCD   DS    CL2                 MAKEGOOD CODE                                
S8SDAT   DS    CL6                 START DATE MMDDYY                            
S8SPOT   DS    CL2                 SPOT NUMBER                                  
S8PRD    DS    CL3                 PRODUCT                                      
S8PRD2   DS    CL3                 PRODUCT 2                                    
*                                  0=$0, NULL=NO OVRD                           
S8GRS    DS    CL8                 GROSS COST OVERRIDE                          
S8NET    DS    CL8                 NET COST OVERRIDE                            
S8OTO    DS    CL1                 THIS IS AN OTO (=N/Y/-)                      
S8PAID   DS    CL1                 THIS SPOT IS PAID                            
S8DX     EQU   *                                                                
*                                                                               
H09AFFID EQU   01                                                               
*                                                                               
S9D      DSECT                     DELIMITER IS SEMICOLON                       
S9MTCHD  DS    CL1                 MATCHED (=Y/N)                               
S9RUNON  DS    CL6                 RUN DATE MMDDYY                              
S9STIME  DS    CL4                 START TIME (INTEGER)                         
S9SLN    DS    CL3                 SLN                                          
S9PRD    DS    CL3                 PRODUCT                                      
S9PR2    DS    CL3                 PRODUCT 2                                    
S9GROSS  DS    CL8                 GROSS COST                                   
S9NET    DS    CL8                 NET COST                                     
S9MGCOD  DS    CL2                 ORDERED SPOT MAKEGOOD CODE                   
S9DEMO   DS    CL5                 DEMO VALUE                                   
S9FILM   DS    CL8                 FILM CODE                                    
S9FILM2  DS    CL8                 FILM CODE                                    
S9CBLNET DS    CL3                 CABLE NETWORK                                
S9MGAFF  DS    CL1                 AFFID IS A MAKEGOOD                          
S9DX     EQU   *                                                                
*                                                                               
H10COM   EQU   01                                                               
*                                                                               
WIZCLTD  DSECT                                                                  
WIZCLT   DS    CL3                 CLIENT CODE                                  
WIZBCLT  DS    XL2                 CLIENT BINARY CODE                           
WIZCLTNM DS    CL20                CLIENT NAME                                  
WIZCLTO  DS    XL1                 CLIENT OFFICE NUMBER                         
WIZECST  DS    XL1                 CLIENT ECOST LEVEL                           
         EJECT                                                                  
*********************************************************************           
* DSECT TO COVER DEMO BLOCK                                                     
*********************************************************************           
DBLOCKD  DSECT                                                                  
       ++INCLUDE DEDBLOCK                                                       
       ++INCLUDE DEDBEXTRAD                                                     
         EJECT                                                                  
       ++INCLUDE DDCOMFACS                                                      
       ++INCLUDE FALINKBLK                                                      
