*          DATA SET NENETDEMT  AT LEVEL 002 AS OF 01/26/00                      
* EXPANDED TO HANDLE (N) DEMOS                                                  
*              AREA FOR DEMO EXTENSION                                          
* RAWDATA = NOT EQUIVALENCED + ADJUSTED FOR DEM/PKG GUAR                        
         SPACE 3                                                                
RAWDATA  DS    0D                                                               
RWESTHOM DS    CL8                 ESTIMATED HOMES                              
RWACTHOM DS    CL8                 ACTUAL HOMES                                 
RWESTDEM DS    CL(L'NDESTDEM)      ESTIMATED DEMOS                              
RWACTDEM DS    CL(L'NDACTDEM)      ACTUAL DEMOS                                 
*  RQDATA = EQUIVALENCED + ADJUSTED FOR DEM/PKG GUAR                            
RQDATA   DS    0D                                                               
RQESTHOM DS    CL8                 ESTIMATED HOMES                              
RQACTHOM DS    CL8                 ACTUAL HOMES                                 
RQESTDEM DS    CL(L'NDESTDEM)      ESTIMATED DEMOS                              
RQACTDEM DS    CL(L'NDACTDEM)      ACTUAL DEMOS                                 
* NNDATA  =  NOT EQUIVALENCED + NOT ADJUSTED FOR DEM/PKG GUAR                   
         SPACE 3                                                                
NNDATA   DS    0D                                                               
NNESTHOM DS    CL8                 ESTIMATED HOMES                              
NNACTHOM DS    CL8                 ACTUAL HOMES                                 
NNESTDEM DS    CL(L'NDESTDEM)      ESTIMATED DEMOS                              
NNACTDEM DS    CL(L'NDACTDEM)      ACTUAL DEMOS                                 
*  NQDATA = EQUIVALENCED + NOT ADJUSTED FOR DEM/PKG GUAR                        
NQDATA   DS    0D                                                               
NQESTHOM DS    CL8                 ESTIMATED HOMES                              
NQACTHOM DS    CL8                 ACTUAL HOMES                                 
NQESTDEM DS    CL(L'NDESTDEM)      ESTIMATED DEMOS                              
NQACTDEM DS    CL(L'NDACTDEM)      ACTUAL DEMOS                                 
