*          DATA SET NENETRATED AT LEVEL 003 AS OF 11/25/86                      
*              DSECT TO COVER NETRATE BLOCK                                     
         SPACE 3                                                                
NETRATED DSECT                                                                  
NRBLOCK  DS    0CL256                                                           
NRAUNIT  DS    A                   A(UNIT TO BE ANALYZED)                       
NRPRODNM DS    XL1                 OPTIONAL PRODUCT NUMBER                      
*                                  IF SUPPLIED RATES WILL BE SPLIT              
*                                  FOR P/BACKS AND BILLING POSTED               
NRUSEACT DS    CL1                 Y=USE ACTUAL FOR ORDERED GROSS               
*                                  (ORDERED NET IS ALWAYS ON ACTUAL)            
         DS    CL10                SPARE                                        
         SPACE 1                                                                
NRTOTORG DS    F                   TOTAL         ORDERED GROSS                  
NRTOTORN DS    F                                 ORDERED NET                    
NRTOTBLG DS    F                                 BILLED  GROSS                  
NRTOTBLN DS    F                                 BILLED  NET                    
NRTOTCLG DS    F                                 CLEARED GROSS                  
NRTOTCLN DS    F                                 CLEARED NET                    
         SPACE 1                                                                
NRTIMORG DS    F                   TIME          ORDERED GROSS                  
NRTIMORN DS    F                                 ORDERED NET                    
NRTIMBLG DS    F                                 BILLED  GROSS                  
NRTIMBLN DS    F                                 BILLED  NET                    
NRTIMCLG DS    F                                 CLEARED GROSS                  
NRTIMCLN DS    F                                 CLEARED NET                    
         SPACE 1                                                                
NRINTORG DS    F                   INTEGRATION   ORDERED GROSS                  
NRINTORN DS    F                                 ORDERED NET                    
NRINTBLG DS    F                                 BILLED  GROSS                  
NRINTBLN DS    F                                 BILLED  NET                    
NRINTCLG DS    F                                 CLEARED GROSS                  
NRINTCLN DS    F                                 CLEARED NET                    
         SPACE 1                                                                
NRSPEORG DS    F                   TOTAL         ORDERED GROSS                  
NRSPEORN DS    F                   SPECIAL       ORDERED NET                    
NRSPEBLG DS    F                   CHARGES       BILLED  GROSS                  
NRSPEBLN DS    F                                 BILLED  NET                    
NRSPECLG DS    F                                 CLEARED GROSS                  
NRSPECLN DS    F                                 CLEARED NET                    
         SPACE 1                                                                
NRCUTORG DS    F                   CUTIN         ORDERED GROSS                  
NRCUTORN DS    F                                 ORDERED NET                    
NRCUTBLG DS    F                                 BILLED  GROSS                  
NRCUTBLN DS    F                                 BILLED  NET                    
NRCUTCLG DS    F                                 CLEARED GROSS                  
NRCUTCLN DS    F                                 CLEARED NET                    
         SPACE 1                                                                
NRBLKORG DS    F                   BLACKOUT      ORDERED GROSS                  
NRBLKORN DS    F                                 ORDERED NET                    
NRBLKBLG DS    F                                 BILLED  GROSS                  
NRBLKBLN DS    F                                 BILLED  NET                    
NRBLKCLG DS    F                                 CLEARED GROSS                  
NRBLKCLN DS    F                                 CLEARED NET                    
         SPACE 1                                                                
NRSATORG DS    F                   SATELLITE     ORDERED GROSS                  
NRSATORN DS    F                                 ORDERED NET                    
NRSATBLG DS    F                                 BILLED  GROSS                  
NRSATBLN DS    F                                 BILLED  NET                    
NRSATCLG DS    F                                 CLEARED GROSS                  
NRSATCLN DS    F                                 CLEARED NET                    
         SPACE 1                                                                
         DS    XL24                SPARE                                        
         DS    XL24                SPARE                                        
         SPACE 1                                                                
NROTHORG DS    F                   OTHER         ORDERED GROSS                  
NROTHORN DS    F                   SPECIAL       ORDERED NET                    
NROTHBLG DS    F                   CHARGES       BILLED  GROSS                  
NROTHBLN DS    F                                 BILLED  NET                    
NROTHCLG DS    F                                 CLEARED GROSS                  
NROTHCLN DS    F                                 CLEARED NET                    
