*          DATA SET NEPAYFDD   AT LEVEL 014 AS OF 12/01/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T313FDD      DATE 12/01/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BROHED1H DS    CL8                                                              
BROHED1  DS    CL63     9    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   68    7  A  P N             T        Y              
BROHED2H DS    CL8                                                              
BROHED2  DS    CL63    10    3   63  A  P N             T        Y              
BRODFFH  DS    CL8                                                              
BRODFF   DS    CL1     10   68    1  A  U N             T        Y              
BROLIN1H DS    CL8                                                              
BROLIN1  DS    CL63    11    3   63  A  P N             T        Y              
BRODAT1H DS    CL8                                                              
BRODAT1  DS    CL1     11   68    1  A  U N             T        Y              
BROLIN2H DS    CL8                                                              
BROLIN2  DS    CL63    12    3   63  A  P N             T        Y              
BRODAT2H DS    CL8                                                              
BRODAT2  DS    CL1     12   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    13    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    14    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    15    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    16    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    17    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    18    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    19    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    20    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    21    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    22    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    23    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL63    24    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   68    1  A  U N             T        Y              
BROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1296 BYTES                            
