*          DATA SET NEPAYFBD   AT LEVEL 003 AS OF 09/07/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T313FBD      DATE 09/07/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BRCHED1H DS    CL8                                                              
BRCHED1  DS    CL63     9    3   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   69   11  A  P N             T        Y              
BRCHED2H DS    CL8                                                              
BRCHED2  DS    CL63    10    3   63  A  P N             T        Y              
BRCDFFH  DS    CL8                                                              
BRCDFF   DS    CL1     10   69    1  A  U N             T        Y              
BRCDFCH  DS    CL8                                                              
BRCDFC   DS    CL8     10   72    8  A  U N             T        Y              
BRCLIN1H DS    CL8                                                              
BRCLIN1  DS    CL65    11    3   65  A  P N             T        Y              
BRCFIL1H DS    CL8                                                              
BRCFIL1  DS    CL1     11   69    1  A  U N             T        Y              
BRCCML1H DS    CL8                                                              
BRCCML1  DS    CL8     11   72    8  A  U N             T        Y              
BRCLIN2H DS    CL8                                                              
BRCLIN2  DS    CL65    12    3   65  A  P N             T        Y              
BRCFIL2H DS    CL8                                                              
BRCFIL2  DS    CL1     12   69    1  A  U N             T        Y              
BRCCML2H DS    CL8                                                              
BRCCML2  DS    CL8     12   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    13    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    14    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    15    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    16    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    17    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    18    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    19    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    20    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    21    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    22    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    23    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    24    3   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   69    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     24   72    8  A  U N             T        Y              
BRCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BRCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1568 BYTES                            
