*          DATA SET NEPAYWRK   AT LEVEL 077 AS OF 01/09/18                      
* ERROR MESSAGE EQUATES                                                         
*                                                                               
MISERR   EQU   1                   MISSING INPUT FIELD                          
INVERR   EQU   2                   INVALID INPUT FIELD                          
NUMERR   EQU   3                   NON-NUMERIC INPUT FIELD                      
DATERR   EQU   13                  INVALID DATE                                 
NOTFOUND EQU   53                  RECORD NOT FOUND                             
RECDEL   EQU   56                  RECORD IS DELETED                            
CLLOKERR EQU   59                  CLIENT IS LOCKED (UPDATIVE SOON)             
STERR    EQU   61                  DATE IS BEFORE ESTIMATE START                
ENDERR   EQU   62                  DATE IS AFTER ESTIMATE END                   
SEQERR   EQU   63                  DATE SEQUENCE ERROR                          
ESTTYPER EQU   68                  ESTIMATE TYPE CANNOT BE PAID                 
ESTREQER EQU   69                  ESTIMATE NUMBER REQUIRED FOR CLR             
ACTERR   EQU   80                  ACTUAL COST MISSING FROM UNIT                
TFRSTERR EQU   81                  TIME NOT PAID ON UNIT                        
NOPAYERR EQU   82                  NO UNITS TO PAY                              
CMLRGORN EQU   83                  COMMERICAL OPTION WITHOUT GROSS/NET          
PBTWOCML EQU   84                  PIGGYBACK NEEDS 2 COMMERCIALS                
PCMLMTHM EQU   85                  COMMERCIAL MATCH MANDATORY                   
PRDERR   EQU   109                 INVALID PRODUCT CODE                         
SPOFFERR EQU   137                 PERIOD OVERLAPS SPECIAL OFFICE START         
SPODTERR EQU   138                 NO DATES FOR SPECIAL OFFICE                  
ENEWERR  EQU   158                 ONLY 'NEW' ESTIMATES ALLOWED                 
ELOCKERR EQU   159                 ESTIMATE HEADER IS LOCKED                    
PROGERR  EQU   172                 PROGRAM RECORD NOT FOUND                     
PGNEWERR EQU   173                 NEW PROGRAM RECORDS ONLY                     
TOOLARGE EQU   175                 RECORD SIZE HAS OVERFLOWED MAXIMUM           
SCTYERR  EQU   178                 ACCESS TO CLIENT NOT AUTHORIZED              
PAKLERR  EQU   186                 PACKAGE IS LOCKED                            
ADDRERR  EQU   231                 STATION ADDRESS NOT FOUND                    
REPERR   EQU   232                 REP NOT FOUND                                
CLIERR   EQU   236                 CLIENT NOT FOUND                             
ESTERR   EQU   237                 ESTIMATE NOT FOUND                           
NETERR   EQU   238                 NETWORK NOT FOUND                            
PAKERR   EQU   239                 PACKAGE NOT FOUND                            
USERERR  EQU   255                 USER SUPPLIED ERROR MESSAGE                  
         EJECT                                                                  
* I/O EQUATES                                                                   
*                                                                               
READ     EQU   1                   READ ON DIRECTORY                            
SEQ      EQU   2                   SEQUENTIAL READ ON DIRECTORY                 
HIGH     EQU   3                   READ HIGH ON DIRECTORY OR IS FILE            
WRITE    EQU   4                   WRITE TO DIRECTORY                           
ADD      EQU   5                   ADD TO DIRECTORY                             
GET      EQU   6                   GETREC ON DIRECT ACCESS FILE                 
PUT      EQU   7                   PUTREC ON DIRECT ACCESS FILE                 
ADDREC   EQU   8                   ADDREC ON DIRECT ACCESS FILE                 
SPT      EQU   16                  SPOT FILE/DIRECTORY                          
UNT      EQU   32                  UNIT FILE/DIRECTORY                          
STA      EQU   48                  STATION FILE/DIRECTORY                       
DIR      EQU   X'80'               READ DIRECTORY                               
FILE     EQU   X'00'               READ FILE                                    
PASSDEL  EQU   X'0100'             RETURN DELETED RECORDS                       
UPDATE   EQU   X'0200'             READ FOR UPDATE - LOCKS RECORD               
*                                                                               
NEBLOCKL EQU   NBBLKEND-NETBLOCK+1 NETBLOCK LENGTH                              
SPOOLLEN EQU   SPOOLEND+L'SPOOLEND+1-SPOOLD SPOOL AREA LENGTH                   
LENTWA   EQU   2304                                                             
COMMTWA  EQU   6304                                                             
LENSAVE  EQU   6144                LENGTH OF SAVE PAGE AREA                     
*                                                                               
YES      EQU   C'Y'                                                             
NO       EQU   C'N'                                                             
COMMA    EQU   C','                                                             
STAR     EQU   C'*'                                                             
DASH     EQU   C'-'                                                             
SLASH    EQU   C'/'                                                             
EQUALS   EQU   C'='                                                             
EOT      EQU   X'FF'                                                            
         SPACE                                                                  
*                                  INPUT SYNTAX EQUATES                         
ISINGLE  EQU   X'08'               SINGLE NUMBER OR ALPHA VALID                 
IRANGE   EQU   X'10'               RANGE OF NUMBERS VALID                       
IALL     EQU   X'20'               'ALL' VALID                                  
IFILTER  EQU   X'40'               FILTER VALID                                 
*                                                                               
DDSONLY  EQU   X'01'               ACTION VALID FOR DDS ONLY                    
FSTCURS  EQU   X'02'               BASE SETS CURSOR/EXITS FIRST TIME            
KEYONLY  EQU   X'02'               KEYWORD ONLY OPTION                          
ALLSREP  EQU   X'04'               ALL SPECIAL REPS VALID FOR ACTION            
KEYBOTH  EQU   X'08'               KEYWORD ONLY & KEYWORD + OPTION              
         SPACE                                                                  
* ACTION EQUATES                                                                
*                                                                               
CLEAR    EQU   1                                                                
TEST     EQU   2                                                                
PRINT    EQU   3                                                                
DIS      EQU   4                                                                
CHA      EQU   5                                                                
LIST     EQU   6                                                                
AUD      EQU   7                                                                
         SPACE                                                                  
* MODE EQUATES                                                                  
*                                                                               
DISPLAY  EQU   X'01'                                                            
CHANGE   EQU   X'02'                                                            
EDIT     EQU   X'03'                                                            
FIRST    EQU   X'80'               FIRST TIME FOR ACTION                        
         SPACE 2                                                                
* UNIT BILLED STATUS EQUATES                                                    
*                                                                               
BILLED   EQU   X'0001'                                                          
UNBILLED EQU   X'0002'                                                          
TBILL    EQU   X'0004'             TIME BILLED                                  
INTBILL  EQU   X'0008'             INTEGRATION BILLED                           
CUTIBILL EQU   X'0010'             CUT-IN BILLED                                
BLAKBILL EQU   X'0020'             BLACKOUT BILLED                              
COPYBILL EQU   X'0040'             COPY-SPLIT BILLED                            
OTHBILL  EQU   X'0080'             OTHER PAID                                   
*--FOR TEST UNDER MASK                                                          
TMBIL    EQU   X'01'                                                            
TMUNBIL  EQU   X'02'                                                            
TMTBIL   EQU   X'04'             TIME BILLED                                    
TMINTBIL EQU   X'08'             INTEGRATION BILLED                             
TMCUTBIL EQU   X'10'             CUT-IN BILLED                                  
TMBLKBIL EQU   X'20'             BLACKOUT BILLED                                
TMCOPBIL EQU   X'40'             COPY-SPLIT BILLED                              
TMOTHBIL EQU   X'80'             OTHER PAID                                     
         SPACE                                                                  
* UNIT PAID STATUS EQUATES                                                      
*                                                                               
PAID     EQU   X'0001'                                                          
UNPAID   EQU   X'0002'                                                          
PARTPAID EQU   X'0004'                                                          
TPAID    EQU   X'0008'                                                          
INTPAID  EQU   X'0010'                                                          
CUTIPAID EQU   X'0020'             CUT-IN PAID                                  
BLAKPAID EQU   X'0040'             BLACKOUT PAID                                
COPYPAID EQU   X'0080'             COPY-SPLIT PAID                              
OTHPAID  EQU   X'0100'             OTHER PAID                                   
*--FOR TEST UNDER MASK                                                          
TMPAI    EQU   X'01'                                                            
TMUNPAI  EQU   X'02'                                                            
TMPARPAI EQU   X'04'                                                            
TMTPAI   EQU   X'08'                                                            
TMINTPAI EQU   X'10'                                                            
TMCUTPAI EQU   X'20'               CUT-IN PAID                                  
TMBLKPAI EQU   X'40'               BLACKOUT PAID                                
TMCOPPAI EQU   X'80'               COPY-SPLIT PAID                              
TMOTHPAI EQU   X'01'               OTHER PAID                                   
         EJECT                                                                  
* DSECT TO COVER NETWORK PAY BLOCK (USED WITH NEGETPAY)                         
*                                                                               
* BLOCK MAY EXPAND TO SUPPORT FUTURE NEEDS                                      
*                                                                               
PAYBLKD  DSECT                                                                  
PAYFUNCT DS    X                   MODULE FUNCTION (PAYTOTS,PAYELS)             
PAYSW    DS    C                                                                
         DS    CL2                 SPARE                                        
PAYAELS  DS    A                   A(OUTPUT AREA FOR ELEMENTS)                  
         DS    CL4                 SPARE                                        
*                                                                               
PAYSTAT  DS    X                   UNIT PAYABLE STATUS (SET BY GETPAY)          
PAYRSN   DS    X                   REASON WHY UNIT IS NOT PAYABLE               
*                                  (USED BY BROWSE AND PRINT OVERLAYS)          
PAYERROR DS    X                   ERROR CODE (ZERO=OK)                         
PAYNELS  DS    X                   NUMBER OF ELEMENTS                           
PAYGROSS DS    F                   PAYABLE GROSS                                
PAYNT    DS    F                   PAYABLE NET                                  
*                                                                               
CPGRS    DS    F                   CASH % GROSS DOLLARS                         
CPNET    DS    F                   CASH % NET DOLLARS                           
NBPAYCGR DS    F                   PAYING CASH% GROSS                           
NBPAYCNT DS    F                   PAYING CASH% NET                             
         DS    CL32                SPARE                                        
         SPACE 2                                                                
PAYTOTS  EQU   1                   RETURN PAYABLE TOTALS                        
PAYELS   EQU   2                   GENERATE PAY ELEMENTS AND TOTALS             
UNALLOC  EQU   1                   UNIT IS UNALLOCATED                          
NOACTUAL EQU   2                   UNIT MISSING ACTUAL COST                     
TIMEUNPD EQU   3                   TIME NOT YET PAID                            
PAYABLE  EQU   X'01'               UNIT IS PAYABLE                              
TPAY     EQU   X'02'               UNIT IS TIME PAYABLE                         
IPAY     EQU   X'04'               UNIT IS INTEGRATION PAYABLE                  
SPAY     EQU   X'08'               UNIT IS SPECIAL-RATE PAYABLE                 
         EJECT                                                                  
* NEGENPACK                                                                     
         PRINT OFF                                                              
       ++INCLUDE NEGENPACK                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* NEGENUNIT                                                                     
         PRINT OFF                                                              
       ++INCLUDE NEGENUNIT                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* SPGENCLRST                                                                    
         PRINT OFF                                                              
       ++INCLUDE SPGENCLRST                                                     
         PRINT ON                                                               
         SPACE 2                                                                
* DDSPOOLD                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDSPOOLD                                                       
         PRINT ON                                                               
         SPACE 2                                                                
* SPGENCLT (CLTHDRD)                                                            
         PRINT OFF                                                              
CLTHDRD  DSECT                                                                  
       ++INCLUDE SPGENCLT                                                       
         PRINT ON                                                               
         SPACE 2                                                                
         PRINT OFF                                                              
ESTHDRD  DSECT                                                                  
       ++INCLUDE SPGENEST                                                       
         PRINT ON                                                               
         SPACE 2                                                                
         EJECT                                                                  
* DSECT TO COVER PAY PROGRAM GLOBAL WORKING STORAGE                             
*                                                                               
PAYWRKD  DSECT                                                                  
DUB      DS    D                   GENERAL WORK AREAS FOR ALL MODULES           
DUB2     DS    D                                                                
FULL     DS    F                                                                
FULL2    DS    F                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
BYTE     DS    C                                                                
THREE    DS    CL3                                                              
DMCB     DS    6F                                                               
DMCB2    DS    6F                                                               
WORK     DS    CL60                                                             
BYTE2    DS    C                                                                
ELCODE   DS    X                                                                
*                                  PARAMETER LIST OF SYSTEM FACILITIES          
APARM    DS    A                   A(PARAM LIST)                                
ATIA     DS    A                   A(TERMINAL INPUT AREA)                       
ATWA     DS    A                   A(TERMINAL WORK AREA)                        
ACOMFACS DS    A                   A(COMMON FACILITIES LIST)                    
         DS    2A                                                               
*                                  BASE SAVE ADDRESSES                          
BRELO    DS    A                   BASE PROGRAM RELOCATION FACTOR               
AWORK    DS    A                   BASE PROGRAM SAVED RD VALUE                  
SAVEBRE  DS    A                   SAVE REGISTER FOR BASE PROGRAM               
BASE1    DS    A                   FIRST BASE REGISTER                          
BASE2    DS    A                   SECOND BASE REGISTER                         
         DS    2A                                                               
SBRELO   DS    A                   SUBSIDIARY ROOT RELO                         
SBBASE1  DS    A                   SUBSIDIARY ROOT FIRST BASE                   
SBBASE2  DS    A                   SUBSIDIARY ROOT SECOND BASE                  
         DS    A                                                                
*                                  TWA VALUES                                   
DDS      DS    C                   Y=DDS TERMINAL                               
AUTH     DS    XL2                 AUTHORIZATION BITS                           
TERM     DS    XL2                 TERMINAL NUMBER                              
USERID   DS    XL2                 USER-ID NUMBER                               
AGYALPH  DS    CL2                 AGENCY ALPHA ID                              
         DS    CL3                 SPARE                                        
         SPACE 1                                                                
*                                                                               
COMFACS  DS    0F                  MODULE ADDRESSES FROM COMFACS                
VDATMGR  DS    V                                                                
VCALOV   DS    V                                                                
VGETMSG  DS    V                                                                
VHELLO   DS    V                                                                
VSCANNER DS    V                                                                
VUNSCAN  DS    V                                                                
VHEXOUT  DS    V                                                                
VCASHVAL DS    V                                                                
VDATVAL  DS    V                                                                
VDATCON  DS    V                                                                
VADDAY   DS    V                                                                
VGETDAY  DS    V                                                                
VGETPROF DS    V                                                                
VPERVERT DS    V                                                                
VGETFACT DS    V                                                                
         DS    5V                                                               
         SPACE 1                                                                
*                                                                               
COREFACS DS    0F                  CORE-RESIDENT MODULE ADDRESSES               
VCENTER  DS    V                                                                
VCHOPPER DS    V                                                                
VSPOOL   DS    V                                                                
VSQUASH  DS    V                   V(SQUASHER)                                  
VUNDAY   DS    V                                                                
VUNDERLN DS    V                   V(UNDERLIN)                                  
VUNTIME  DS    V                                                                
VCLPACK  DS    V                                                                
VCLUNPK  DS    V                                                                
VNETIO   DS    V                                                                
VNETVAL  DS    V                   V(NETVALUE)                                  
         DS    8V                                                               
*                                                                               
BASEFACS DS    0F                  BASE PROGRAM MODULE ADDRESSES                
VGTBROAD DS    V                   GETBROAD                                     
VGETPAY  DS    V                   NEGETPAY                                     
AIO      DS    A                                                                
AFVAL    DS    A                                                                
VNETNET  DS    V                   NENETNET                                     
VMSPACK  DS    V                                                                
VBILRDR  DS    V                                                                
         DS    2A                                                               
         SPACE 1                                                                
BASECOM  DS    0F                  COMMONLY ENTERED BASE SUB-ROUTINES           
VGETFLD  DS    A                                                                
VERROR   DS    A                                                                
VEXIT    DS    A                                                                
VCLEARF  DS    A                   CLEAR AND FOUT FIELDS                        
VFILREC  DS    A                   EXTRA FILTERING ON RECORD                    
VDISFIL  DS    A                   DISPLAY FILTER EXPRESSION                    
VGETRSN  DS    A                   DISPLAY REASON WHY UNIT UNPAYABLE            
         DS    6A                  SPARE                                        
         DS    3A                  ADDITIONAL SPARE                             
*                                  ADCON LIST                                   
AACTNTRY DS    A                   A(ACTION TABLE ENTRY)                        
AOPTNTRY DS    A                   A(OPTION ENTRY)                              
ASECRET  DS    A                   A(SECRET BLOCK)                              
         DS    6A                  SPARE                                        
*                                                                               
AESTTAB  DS    A                   TABLE OF ESTIMATES AND FLAGS                 
AIOAREA1 DS    A                   ADCONS FOR EXTENDED WORKING                  
AIOAREA2 DS    A                   STORAGE ADDRESSABILITY                       
AIOAREA3 DS    A                                                                
AIOAREA4 DS    A                                                                
ASPOOLA  DS    A                   A(SPOOL PRINT AREA)                          
ACLIREC  DS    A                   A(CLIENT RECORD)                             
AOVWORK  DS    A                                                                
         DS    6A                  SPARE                                        
*                                                                               
TODAY    DS    CL6                 TODAY'S DATE - YYMMDD                        
TODAYC   DS    XL2                 TODAY'S DATE - COMPRESSED                    
UNTFILE  DS    CL8                 HELLO FILE NAME                              
XTRA     DS    CL24                OPTIONAL EXTRA MESSAGE                       
BILLTYPE DS    CL1                 UNIT BILLING TYPE                            
*                                  C'Y' - NEW CSR SCREEN IN BUY                 
*                                  C'N' - OLD CSR SCREEN IN BUY                 
*                                  C'R' - OLD CSR SCREEN IN BUY                 
PAYFLAGS DS    XL1                 FLAGS                                        
FACINPUT EQU   X'01'               FORCE ACTUAL COST INPUT                      
REVRSCR  EQU   X'02'               REVERSE = OPTION CR->CK                      
REVRSCK  EQU   X'04'               REVERSE = OPTION CK->CR                      
*                                                                               
INVNUM   DS    CL10                INVOICE NUMBER                               
PGRP     DS    XL3                 PRODUCT GROUP                                
CRCKDAT  DS    XL2                 BILLING DATE                                 
*                                                                               
         DS    CL31                SPARE                                        
*                                                                               
ACTION   DS    X                   ACTION                                       
OVERLAY  DS    X                   OVERLAY NUMBER                               
SCREEN   DS    X                   SCREEN NUMBER                                
ACTI     DS    X                   ACTION INDICATORS                            
PRTCLEAR DS    C                   PRINT CLEARANCE DETAILS PAGE (Y/N)           
*                                                                               
THISVALS DS    0C                  THIS TIME CONTROL VALUES                     
CLI      DS    CL3                 CLIENT (2-3 CHARACTER CODE)                  
NETWORK  DS    CL4                 NETWORK CALL LETTERS                         
REPTYPE  DS    C                   PAYEE TYPE (P=PAYING, S=SPECIAL)             
REP      DS    CL3                 REP CODE                                     
START    DS    CL6                 PAY PERIOD START DATE (YYMMDD)               
END      DS    CL6                 PAY PERIOD END DATE                          
SUB      DS    X                   PAY PERIOD SUB-LINE                          
DATETYP  DS    CL1                 DATE TYPE B=BROADCAST                        
         DS    CL7                 SPARE                                        
OPTVALS  DS    0CL64               OPTIONS VALUES-CONTROL                       
PROD     DS    CL3                 PRODUCT CODE                                 
PRDN     DS    X                   BRAND NUMBER                                 
PROD2    DS    CL3                 PRODUCT CODE (SECOND)                        
PRDN2    DS    X                   BRAND NUMBER (SECOND)                        
P1PCT    DS    XL2                 PRODUCT 1 PERCENT                            
ESTTYP   DS    X                   ESTIMATE INPUT TYPE                          
EST      DS    CL3                 ESTIMATE FILTER                              
PACK     DS    X                   PACKAGE NUMBER                               
PROGRAM  DS    CL6                 PROGRAM CODE                                 
DAYPART  DS    C                   DAYPART CODE                                 
FILTER   DS    CL6                 FILTER VALUES                                
BILLST   DS    XL2                 BILLING STATUS FILTER                        
CLEARST  DS    XL2                 CLEARED STATUS FILTER                        
ACTOPT   DS    XL4                 ACTUAL COST FILTER                           
PAYTYPE  DS    C                   PAY TYPE                                     
*                                  T=TIME ONLY                                  
*                                  I=INTEGRATION ONLY                           
*                                  U=CUT-IN ONLY                                
*                                  B=BLACKOUT ONLY                              
*                                  S=COPY-SPLIT ONLY                            
*                                  O=OTHER ONLY                                 
*                                  R=ALL SPECIAL RATES                          
PAYDLRS  DS    C                   0 = BOTH NET/GROSS,G = GROSS,N = NET         
SVCOML   DS    CL8                 PAY COMMERICAL                               
SVNAFF   DS    CL1                 NO COMMERCIAL MATCH CHECK                    
NOMTCH   DS    CL1                 NO AFFIDAVIT CHECK                           
CLEARLEN EQU   *-THISVALS          CONTROL LENGTH FOR ACTION CLEAR              
SEQUENCE DS    C                   FILE SEQUENCE                                
THISLEN  EQU   *-THISVALS          LENGTH OF CONTROL VALUES                     
AMTOPT   DS    C                   AMOUNT OPTION (G,N - TEST ONLY)              
         ORG   OPTVALS+L'OPTVALS                                                
*                                                                               
APYFLAG  DS    XL1                 AUTOPAY FLAG                                 
APYYES   EQU   X'01'               AUTOPAY?                                     
APYTEST  EQU   X'02'               SOON NPAY TESTING?                           
*                                                                               
APYKEY   DS    XL32                AUTOPAY RECORD KEY                           
*                                                                               
SMEDTYPE DS    CL1                 STATION SUB MEDIA TYPE                       
         DS    CL30                SPARE                                        
*                                                                               
EXTVALS  DS    0C                  THIS TIME EXTRA VALUES                       
AGYMED   DS    X                   AGENCY/MEDIA CODE                            
AGYPRO   DS    CL15                AGENCY PROFILE                               
PAYPROF  DS    CL16                PAY PROGRAM PROFILE                          
CLIPK    DS    CL2                 PACKED CLIENT CODE                           
PREOPT   DS    C                   USER PRE-EMPT PROFILE (NBUSER+13)            
*                                  Y=SUPPRESS PRE-EMPTS                         
*                                  N=RETURN PRE-EMPTS                           
ENAME    DS    CL20                ESTIMATE NAME                                
PRDNAME  DS    CL20                PRODUCT NAME                                 
MARKET   DS    CL4                 MARKET CODE                                  
REPNAME  DS    CL22                                                             
SPECREP  DS    XL2                 SPECIAL REP (BINARY)                         
SRATREP  DS    CL3                 SPECAIL RATE REP CODE                        
*                                  X'80'=ALL SPECIAL REPS FILTER                
UFILTER  DS    CL6                 UNIT PAY FILTER VALUE-SPACE FILLED           
TOTOPT   DS    C                   SHOW TOTALS ONLY ON LIST/DIS (Y)             
SPOFFSW  DS    C                   CLIENT OFFICE OVERRIDE (Y)                   
PAYPROF2 DS    CL16                PAY PROGRAM PROFILE (2)                      
DATADISP DS    H                                                                
MATCHSW  DS    C                   UNMATCHED DATA SWITCH                        
PRDLKSW  DS    X                   PRODUCT CHECK SWITCH                         
PAYPROFA DS    CL16                PAY PROGRAM PROFILE (A)                      
AGYFLG1  DS    XL1                 AGENCY FLAG 1                                
AGYFLG2  DS    XL1                 AGENCY FLAG 2                                
AGYFLG3  DS    XL1                 AGENCY FLAG 3                                
         DS    CL11                SPARE                                        
*                                                                               
TOTAMT   DS    F                   CLEARANCE TOTAL (FROM EDITCL)                
TOTAMTLO DS    F                                                                
TOTAMTHI DS    F                                                                
TOTG     DS    F                   GROSS CLEARANCE - UNIT RECORDS               
TOTN     DS    F                   NET CLEARANCE - UNIT RECORDS                 
         DS    CL8                 SPARE                                        
AMTS     DS    CL((CLRLINES+1)*8)  AMOUNT TABLE (GENERATED BY EDITCL)           
*                                                                               
*                                  FIELD VALIDATION STORAGE                     
FERN     DS    X                   FIELD ERROR NUMBER (USER SET)                
FNDX     DS    X                   FIELD INDEX (USER SET)                       
FADDR    DS    A                   A(FIELD HEADER)                              
FMAX     DS    X                   OPTIONAL MAXIMUN SCAN LENGTH                 
FLAST    DS    AL3                 A(LAST STRING) OR ZERO                       
FLEN     DS    X                   LENGTH OF LAST STRING OR ZERO                
FTERM    DS    XL6                 LIST OF SCAN TERMINATORS                     
         DS    X                                                                
FLDH     DS    XL8                 FIELD HEADER CONSTRUCTED BY FVAL             
FLD      DS    CL79                EXTRACTED DATA (SPACE FILLED)                
FSTOP    DS    X                   STOP CHARACTER OR X'FF'                      
         DS    CL10                SPARE                                        
         SPACE 1                                                                
*                                  I/O ROUTINE WORKING STORAGE                  
IOFLAG   DS    0X                  COMMAND/FILE PASSED TO ROUTINE               
AIOAREA  DS    A                   A(I/O BUFFER FOR RECORD)                     
KEY      DS    CL32                                                             
KEYSAVE  DS    CL32                KEY PASSED TO DATAMGR                        
DMINBITS DS    X                   DATAMGR BITS (UPDATE READ, DELETES)          
NDXDA    DS    XL4                 RECORD DISK ADDRESS                          
         DS    CL16                SPARE                                        
         DS    0D                                                               
DMWORK   DS    12D                 DATAMGR WORK AREA                            
*                                                                               
PAYPROFB DS    CL16                                                             
*                                                                               
         DS    CL112               SPARE                                        
*                                                                               
         SPACE 2                                                                
       ++INCLUDE NETBLOCKN                                                      
         SPACE 2                                                                
*                                                                               
* ALL AREAS BELOW THIS POINT ARE ADDRESSED THROUGH ADCONS DYNAMICALLY           
* SET BY THE BASE. (DO NOT REFER TO LABELS)                                     
*                                                                               
         DS    0D                                                               
ESTTAB   DS    CL520               TABLE OF ESTIMATES AND FLAGS                 
*                                                                               
         DS    0D                                                               
*IOAREA1  DS    CL4096                                                          
*IOAREA2  DS    CL4096                                                          
*IOAREA3  DS    CL4096                                                          
*IOAREA4  DS    CL4096                                                          
IOAREA1  DS    CL6000                                                           
IOAREA2  DS    CL6000                                                           
IOAREA3  DS    CL6000                                                           
IOAREA4  DS    CL6000                                                           
*                                                                               
SPOOLA   DS    CL(SPOOLLEN)        ON-LINE PRINT AREA                           
*                                                                               
         DS    0D                                                               
CLIREC   DS    CL1500              CLIENT RECORD                                
*                                                                               
OVWORK   DS    CL2300              LOCAL STORAGE FOR OVERLAYS                   
PAYWRKX  EQU   *                                                                
         EJECT                                                                  
* DSECT TO COVER PAY PROGRAM SCREENS                                            
*                                                                               
       ++INCLUDE FATWA                                                          
         SPACE 1                                                                
         ORG   TWAUSER                                                          
         SPACE 1                                                                
* GLOBAL SAVE FIELDS                                                            
*                                                                               
MODE     DS    X                   PROCESSING MODE - DISPLAY,CHANGE             
AGENCY   DS    CL2                 AGENCY                                       
LACT     DS    X                   LAST TIME ACTION                             
LSCREEN  DS    X                   LAST TIME SCREEN NUMBER                      
LPAGES   DS    X                   LAST TIME SAVED PAGES                        
         DS    CL12                SPARE                                        
LOVSAVE  DS    CL30                LAST TIME OVERLAY SAVE                       
         EJECT                                                                  
       ++INCLUDE NEPAYFFD                                                       
         EJECT                                                                  
* CLEARANCE SCREEN                                                              
*                                                                               
         ORG   PAYLAST                                                          
       ++INCLUDE NEPAYFED                                                       
         SPACE 2                                                                
CLRLEN   EQU   CLRINV2H-CLRINV1H   LENGTH OF LINE ON CLEARANCE SCREEN           
CLRLINES EQU   (CLRLAST-CLRINV1H)/CLRLEN                                        
CLRAMTH  EQU   CLRAMT1H-CLRINV1H   DISPLACEMENT TO AMOUNT FIELD HEADER          
CLRCOMH  EQU   CLRCOM1H-CLRINV1H   DISPLACEMENT TO COMMENT FIELD HEADER         
         EJECT                                                                  
* LAST TIME SAVE AREA                                                           
*                                                                               
         ORG   TWAD+LENTWA                                                      
LASTVALS DS    0C                  LAST TIME CONTROL VALUES                     
LCLI     DS    CL3                 CLIENT (2-3 CHARACTER CODE)                  
LNETWORK DS    CL4                 NETWORK CALL LETTERS                         
LREPTYPE DS    C                   PAYEE TYPE (P=PAYING, S=SPECIAL)             
LREP     DS    CL3                 REP CODE                                     
LSTART   DS    CL6                 PAY PERIOD START DATE (YYMMDD)               
LEND     DS    CL6                 PAY PERIOD END DATE                          
LSUB     DS    X                   PAY PERIOD SUB-LINE                          
         DS    CL8                 SPARE                                        
LOPTVALS DS    0CL64               OPTIONS VALUES-CONTROL                       
LPROD    DS    CL3                 PRODUCT CODE                                 
LPRDN    DS    X                   BRAND NUMBER                                 
LPROD2   DS    CL3                 PRODUCT CODE (SECOND)                        
LPRDN2   DS    X                   BRAND NUMBER (SECOND)                        
LP1PCT   DS    XL2                 PRODUCT 1 PERCENT                            
LESTTYP  DS    X                   ESTIMATE INPUT TYPE                          
LEST     DS    CL3                 ESTIMATE FILTER                              
LPACK    DS    X                   PACKAGE NUMBER                               
LPROG    DS    CL6                 PROGRAM CODE                                 
LDAYPART DS    C                   DAYPART CODE                                 
LFILTER  DS    CL6                 FILTER VALUES                                
LBILLST  DS    XL2                 BILLING STATUS FILTER                        
LCLEARST DS    XL2                 CLEARED STATUS FILTER                        
LACTOPT  DS    XL4                 ACTUAL COST FILTER                           
LPAYTYPE DS    C                   PAY TYPE (T=TIME ONLY,I=INTG ONLY)           
LPAYDLRS DS    C                   0 = BOTH NET/GROSS,G = GROSS,N = NET         
LSVCOML  DS    CL8                 PAY COMMERICAL                               
LSVNAFF  DS    C                   NO COMMERCIAL MATCH                          
LSMTCHAF DS    C                   NO AFFIDAVIT MATCH CHECK                     
LSEQ     DS    C                   FILE SEQUENCE                                
LASTLEN  EQU   *-LASTVALS          LENGTH OF CONTROL VALUES                     
         ORG   LOPTVALS+L'LOPTVALS                                              
SVDATA   DS    0C                                                               
*                                                                               
SVVALS   DS    0C                                                               
SVDATE   DS    XL2                 SAVED AIR DATE                               
SVSUB    DS    X                   SAVED SUB-LINE                               
SVVALSLN EQU   *-SVVALS                                                         
*                                                                               
SVTABNTR DS    X                   NUMBER OF TABLE ENTRIES                      
SVLNTRY  DS    X                   NUMBER OF LAST ENTRY DISPLAYED               
SVDATAL  EQU   *-SVDATA                                                         
*                                                                               
PRAGENCY DS    CL2                 AGENCY                                       
PRCLIENT DS    CL3                 CLIENT                                       
PRSTTYPE DS    CL1                 STATION TYPE                                 
*                                                                               
PRUSER   DS    CL16                NBUSER1 PROFILE                              
PRUSER1  DS    CL16                NBUSER2 PROFILE                              
PRUSER2  DS    CL16                NBUSER3 PROFILE                              
PRPAY1   DS    CL16                PAY PROFILE 1                                
PRPAY2   DS    CL16                PAY PROFILE 2                                
PRPAYA   DS    CL16                PAY PROFILE A                                
*                                                                               
TSARTRC  DS    XL1                 MUST BE 1 BYTE BEFORE TSARBLK                
TSARBLK  DS    XL64                TSAR BLOCK                                   
*                                                                               
         DS    CL84                SPARE                                        
LASTX    EQU   *                   END OF BASE SAVE AREA                        
*                                                                               
         ORG   TWAD+COMMTWA        MORE COMMON TWA SPACE                        
SVAREA2  DS    0H                                                               
SVSECRET DS    CL1024              SECRET BLOCK                                 
