*          DATA SET NEPKGTBL   AT LEVEL 002 AS OF 09/04/01                      
*              NETPAK PACKAGE TABLE DSECT                                       
*                                                                               
NPKTBLD  DSECT                                                                  
NPKTKEY  DS    0CL32                                                            
NPKTAM   DS    XL1                                                              
NPKTCLI  DS    XL2                                                              
NPKTNET  DS    CL4                                                              
NPKTEST  DS    XL1                                                              
NPKTPAK  DS    XL1                                                              
NPKTNAME DS    CL16                PACKAGE NAME                                 
NPKTDEMO DS    XL3                 PACKAGE DEMO(SEEDED BY CPM REPORT)           
NPKTCPM  DS    XL4                 PACKAGE CPM                                  
*                                                                               
