*          DATA SET NEPLISTD   AT LEVEL 001 AS OF 02/28/85                      
*              DSECT TO COVER ENTRY IN NETGOAL PRODUCT LIST                     
         SPACE 3                                                                
LISTD    DSECT                     PRODUCT LIST ENTRY                           
LISTNO   DS    XL1                 PRODUCT NUMBER                               
LISTDIV  DS    XL2                 DIVISION NUMBER                              
LISTPRD  DS    CL3                 PRODUCT ALPHA                                
LISTTARG DS    XL1                 TARGET DEMO NUMBER                           
LISTUSER DS    XL1                 USER NUMBER                                  
