*          DATA SET NEPODWORK  AT LEVEL 127 AS OF 02/20/19                      
*        WORKING STORAGE FOR POD/RESEARCH WRITER                                
*                                                                               
*        EQUATES FOR WORKING STORAGE                                            
LENSPOOL EQU   SPOOLEND-SPOOLD                                                  
LENGEND  EQU   IO-GEND                                                          
LENSYSD  EQU   SYSEND-SYSD                                                      
LENIOAS  EQU   NIOS*(LIOS+8)                                                    
LENWORK  EQU   LENSPOOL+LENGEND+LENSYSD+LENIOAS                                 
*                                                                               
NIOS     EQU   3                   3 IO AREAS                                   
LIOS     EQU   2000                2000 BYTE IO AREA                            
*                                                                               
MAXSYSC  EQU   20                  MAX NUMBER OF FILTER SYSCODES                
         EJECT                                                                  
*        POD WRITER PROGRAM WORKING STORAGE                                     
SYSD     DSECT                                                                  
DUMPSYSD DS    D                   **SYSD** IN DUMP                             
ATIOB    DS    A                   A(TRANSLATOR BLOCK)                          
*                                                                               
*                                                                               
*        ADRESSES OF LINKED ROUTINES                                            
SYSV     DS    0A                  EXTERNAL ADDRESSES                           
BINSRCH  DS    V                                                                
COVAIL   DS    V                                                                
DUMMY    DS    V                                                                
NVTYPES  EQU   (*-SYSV)/4                                                       
         DS    5V                  SPARE                                        
*                                                                               
*                                                                               
*        CORE RESIDENT PHASES                                                   
COREFACS DS    0A                                                               
DAYUNPK  DS    A                                                                
GENCON   DS    A                                                                
DRONE    DS    A                                                                
DEFINE   DS    A                                                                
GETNUN   DS    A                                                                
GETHUT   DS    A                                                                
CLPACK   DS    A                                                                
NETWEEK  DS    A                                                                
DEMOCON  DS    A                                                                
PODGEN   DS    A                                                                
DEMAND   DS    A                                                                
GETBROAD DS    A                                                                
NETUNBK  DS    A                                                                
MSPACK   DS    A                                                                
MSUNPK   DS    A                                                                
RANSID   DS    A                                                                
SPDEMUP  DS    A                   T00A22                                       
UPVAL    DS    A                   T00A13                                       
SPGETIUN DS    A                   T00A24                                       
REGETIUN DS    A                   T00A29                                       
GENPROG  DS    A                                                                
STAPACK  DS    A                                                                
NCORE    EQU   (*-COREFACS)/4                                                   
*                                                                               
*                                                                               
*        COMFACS ADDRESS                                                        
DEMOUT   DS    V                                                                
DEMOVAL  DS    V                                                                
HISPNAME DS    V                   NAME FILTER MODULE (HISPANIC)                
VGETPROF DS    A                   GETPROF FROM CGETPROF                        
NSIWEEK  DS    V                                                                
PODSCAN  DS    V                                                                
DEMOMATH DS    V                                                                
*                                                                               
*                                                                               
*        COMMON FACILITIES IN NEPODGEN                                          
DUMPFCIL DS    D                   *FACILS* IN DUMP                             
SYSCOMM  DS    0A                  COMMON FACILITIES FOR SYSTEM                 
VALUSER  DS    V                   FILLS IN USERNAME USERADD                    
VALMED   DS    V                   VALIDATE MEDIA                               
VALCLT   DS    V                   VALIDATE CLIENT                              
VALBOOK  DS    V                   VALIDATE BOOK                                
PDSERR   DS    V                   ERROR ROUTINE                                
VALDEMO  DS    V                   VALIDATE DEMO                                
VALNET   DS    V                   VALIDATE STATION                             
VALDYTM  DS    V                   VALIDATE DAY TIME                            
VPRGHUT  DS    V                   RETREIVE PROGRAM HUTS                        
VALPROG  DS    V                   VALIDATE PROGRAM DATES                       
VALOPTS  DS    V                   VALIDATE OPTIONS                             
VALTITS  DS    V                   VALIDATE TITLES                              
VALFILT  DS    V                   VALIDATE FILTERS                             
VCHKFILT DS    V                   CHECK FILTERS                                
*                                                                               
*                                  DRONE RELATED VALIDATION ROUTINES            
VALLEFT  DS    V                   VALIDATE LEFT HEADLINE                       
VALRGHT  DS    V                   VALIDATE RIGHT HEADLINE                      
VALMID   DS    V                   VALIDATE MID LINE                            
VALROWS  DS    V                   VALIDATE (UP TO MAX) ROWS                    
VALCOLS  DS    V                   VALIDATE (UP TO MAX) COLUMNS                 
VALPEX   DS    V                   VALIDATE A PERIOD EXPRESSION                 
*                                                                               
*                                  DRONE FACILITIES                             
INITDRON DS    V                   INITIALIZE FOR DRONE                         
VROWDRON DS    V                   VALIDATE A ROW                               
GROWDRON DS    V                   GENERATE ELEMENTS FOR ROW                    
VCOLDRON DS    V                   VALIDATE A COLUMN                            
GCOLDRON DS    V                   GENERATE ELEMENTS FOR COLUMN                 
VCMPDRON DS    V                   VALIDATE A COMPUTATION                       
GCMPDRON DS    V                   GENERATE ELEMENTS FOR COMP                   
GUSRDRON DS    V                   GENERATE USER ELEMENTS                       
WRAPDRON DS    V                   WRAP UP DRONE                                
*                                                                               
*                                  DRIVER FACILITIES                            
INITDRIV DS    V                   INITIALIZE FOR DRIVER                        
*                                                                               
*                                  RUN TIME ROUTINES                            
GENHEAD  DS    V                   GENERAL HEADLINE HOOK                        
*                                                                               
GENEDICT DS    V                   GENERATE EDICT CONTROL CARDS                 
*                                                                               
*                                  ODDMENTS                                     
NUMERIC  DS    V                   NUMERIC TEST                                 
PACK     DS    V                   PACK AND CVB INTO R1                         
CURSERR  DS    V                   POSITION CURSOR AND EXIT                     
ERRXIT   DS    V                   GENERAL ERROR EXIT                           
EXIT     DS    V                   COMMON EXIT                                  
VSCBLLST DS    V                   SPOT LIST OF CABLE STATIONS                  
*                                                                               
NSYSCOMM EQU   (*-SYSCOMM)/4                                                    
*                                                                               
*                                                                               
*        ASSORTED AREAS                                                         
DUMPASRT DS    D                   *ASSORT* IN DUMP                             
VMSPACK  DS    V                   ENTRY POINT INTO STAPACK FOR MSPACK          
VMSUNPK  DS    V                   ENTRY POINT INTO STAPACK FOR MSUNPNK         
         EJECT                                                                  
***********************************************************************         
*              OPTIONS                                                *         
***********************************************************************         
*                                                                               
BOXOPT   DS    CL1                 N=NO BOXES                                   
LEFTOPT  DS    CL1                 Y=LEFT ALIGN                                 
SPACOPT  DS    XL1                 SPACING (1-3)                                
*                                                                               
DOWNOPT  DS    XL1                 OPTION TO DOWN LOAD                          
DOWNON   EQU   X'80'               DOWN LOADING TURNED ON                       
DOWNNOH  EQU   X'40'               NO HEADINGS FOR DOWNLOAD                     
*                                                                               
DOWNOPT2 DS    XL1                 OPTION 2 TO DOWN LOAD                        
DOWNCHAR DS    XL1                 CHARACTER FOR TOTALS                         
PAYOPT   DS    CL1                 PAY CABLE OPTION                             
WIDEOPT  DS    CL1                 Y=WIDE OPTION                                
TRACEOPT DS    CL1                 OPTION TO TRACE DRIVER                       
NARROPT  DS    CL1                 NARROW REPORT                                
PEROPT   DS    XL1                 PERIOD OPTION M=MONTH,W=WEEK,Q=QTR           
TYPEOPT  DS    XL1                 HUT TYPE A,I,C,D                             
SCHEMOPT DS    XL1                 HUT SCHEME                                   
HUT52OPT DS    XL1                 52 WEEK OPTION                               
DPTOPT   DS    XL1                 DAYPART FILTER                               
WKINDS2  DS    XL1                 GLINDS2 HOLD AREA                            
EXACTOPT DS    CL1                 EXACT DATES OPTION                           
DAYPOPT  DS    CL1                 DAY TIME MERGING OPTION                      
MAXOPT   DS    D                   DEMO RESTRICT EDIT                           
MINOPT   DS    D                   DEMO RESTRICT OPTION                         
UNIVOPT  DS    F                   UNIVERSE OPTION                              
HOMEOPT  DS    F                   HOME OPTION                                  
*                                                                               
DEMOPT   DS    CL1                 DEMO OPTION                                  
DEMOTGT  EQU   C'T'                TARGET DEMOS ONLY                            
DEMOSEC  EQU   C'S'                SECONDARY DEMOS ONLY                         
*                                                                               
DEMGRP   DS    CL1                 C'P'=DEMO GROUPING BY PRODUCT GROUP          
FTNYOPT  DS    XL1                 INCLUDE FIFTEEN MINUTE PROGRAMS              
NSEPOPT  DS    XL1                 NO SEPTEMBER DATA                            
BRKOOPT  DS    XL1                 BREAKOUT DATA REQUESTED                      
PRECOPT  DS    XL1                 SHOW DATA IN CABLE PRECISION                 
VAROPT   DS    XL1                 VARIOUS DAYS OPTION                          
DAYSOPT  DS    XL1                 BREAKOUT M-F,AND M-S DAYS                    
HHHUT    DS    XL1                 Y= BREAKOUT HUTS BY HALF HOUR                
HUTOVER  DS    H                   HUT OVERRIDE INDICATOR                       
DMAOPT   DS    C                   DMA R/P/S CALC                               
OPTSCNLN DS    CL1                 VARIABLE SCAN LENGTH ARGUMENT                
MPAINDEX DS    CL2                 MPA INDEX PROGRAM NUMBER                     
SOLOOPT  DS    XL1                 NO SINGLE RUN PROGRAMS                       
MINDUR   DS    XL1                 MINIMUM DURATION                             
MINCOMM  DS    XL1                 MINIMUM COMMERCIAL DURATION                  
SOFTRNGE DS    XL1                 SOFT RANGE FLAG                              
OPTIND   DS    XL1                 VARIOUS OPTIONS INDICATOR                    
OPTCNADP EQU   X'80'               DDS OPTION TO REPORT ON PROG AVG             
OPTCONT  EQU   X'40'               CONTINUED REPORT(MORE DEMOS,COLUMNS)         
PIVAEOPT DS    CL1                 AUDIENCE ESTIMATOR OPTION                    
PIVAEY   EQU   C'Y'                INCLUDE ONLY AE RECORDS                      
PIVAEN   EQU   C'N'                INCLUDE ONLY NON-AE RECORDS                  
PDAEMETH DS    X                   AUDIENCE ESTIMATOR METHODOLOGY (PIV)         
PVSNEG   DS    X                   NEGATE PVS FILTERS?                          
PVSNEGQ  EQU   1                   YES                                          
MINCOMS  DS    HL1                 FILTER FOR MINIMUM COMMERCIAL SECS           
OPTFLAG1 DS    X                   VARIOUS OPTION FLAGS                         
ACMMWTQ  EQU   X'80'               MINUTE WEIGHTING FOR ACM                     
EXCLNTI  EQU   X'40'               EXCLUDE NTI PROGAM NUMBER                    
INCLOSQ  EQU   X'20'               INCLUDE ORDERED SUSTAINERS                   
COMSRCQ  EQU   X'10'               SOURCE COM REQUESTED                         
COMSRCOQ EQU   X'08'               ONLY SOURCE COM REQUESTED                    
COMDEMOQ EQU   X'04'               COMSCORE DEMO REQUESTED                      
COMEPQ   EQU   X'02'               EPISODE INFO REQUESTED                       
OPTMINTY DS    X                   MINUTE TYPE                                  
OPTMCOMQ EQU   X'01'               -COMMERCIAL                                  
OPTMPROQ EQU   X'02'               -PROMO                                       
OPTMPSAQ EQU   X'04'               -PSA                                         
OPTSCWGT DS    X                   OPTION TO WEIGHT MXM BY SECONDS              
OPTSWS   EQU   1                   -WEIGHT BY COMMERCIAL SECONDS                
OPTSWTS  EQU   2                   -WEIGHT BY TOTAL COMM SECONDS                
OPTSWPD  EQU   3                   -WEIGHT BY POD SECONDS                       
OPTMINCM DS    X                   MINIMUM NUMBER OF COMMERCIAL SECONDS         
PODPASS  DS    CL1                 PASS NUMBER (1/2 FOR COMSCORE)               
*                                                                               
PODFLAG  DS    XL1                 FLAGS                                        
PODCNADQ EQU   X'80'               CNAD REQUEST                                 
PODCNAWQ EQU   X'40'               CNAW REQUEST                                 
*                                                                               
         DS    CL8                 SPARE                                        
***********************************************************************         
*              END OF OPTIONS                                         *         
***********************************************************************         
         EJECT                                                                  
***********************************************************************         
*              PRINT DATA                                             *         
***********************************************************************         
*                                                                               
TITLE    DS    CL64                MAIN REPORT TITLE (HEAD1)                    
*                                                                               
OUTAREA  DS    0CL75               OUTPUT AREAS                                 
LABLAREA DS    CL15                LABEL AREA                                   
         DS    CL1                                                              
CODENNAM DS    0CL59                                                            
CODEAREA DS    CL12                CODE                                         
         DS    CL1                                                              
NAMEAREA DS    CL46                NAME                                         
*                                                                               
TOTWIDTH DS    H                   USED FOR WIDTH CHECKING                      
PWIDTH   DS    F                   WIDTH OF PRINT LINES                         
AH1      DS    A                   A(HEAD1)                                     
AH2      DS    A                   A(HEAD2)                                     
AH3      DS    A                   A(HEAD3)                                     
AH4      DS    A                   A(HEAD4)                                     
AH5      DS    A                   A(HEAD5)                                     
AP1      DS    A                   A(P)                                         
*                                                                               
MYPOSO   DS    0CL3                SAVED PRINT POSITION                         
MYLTYP   DS    CL1                       LINE TYPE (H/M/P)                      
MYLINE   DS    XL1                       LINE NUMBER                            
MYCOL    DS    XL1                       COLUMN NUMBER                          
*                                                                               
MYOLEN   DS    XL1                 SAVED OUTPUT LENGTH                          
MYFIRSTH DS    XL1                 FIRST HEADING LINE                           
MYLABEL  DS    CL1                 (COLUMN) LABEL                               
*                                                                               
LASTHEAD DS    XL1                 ROW NUMBER OF LAST HEADLINE                  
PRTSW    DS    XL1                 N=DON'T PRINT THIS DETAIL LINE               
         EJECT                                                                  
***********************************************************************         
*              COLUMN/ROW DATA                                        *         
***********************************************************************         
*                                                                               
ANYROWSW DS    CL1                 USED FOR CHECKING ROWS                       
ROW1WIDE DS    XL1                 ROW 1 WIDTH                                  
ROWWIDTH DS    XL1                 TOTAL ROW WIDTH                              
COLXTEND DS    XL1                 COLUMN EXTENSION INDICATOR                   
*                                                                               
COLIND   DS    XL1                 COLUMN INDICATOR                             
COLIDEM  EQU   X'80'               DEMO/CPP COLUMN(S)                           
COLIRND  EQU   X'40'               DOLLAR ROUNDING INDICATOR                    
COLIGDEM EQU   X'20'               GOAL DEMOS LINKED TO DEMO MENU               
COLINDR  EQU   X'10'               NO DEMO ROUNDING INDICATOR                   
COLISPT  EQU   X'08'               SPOTS COLUMN(S)                              
*                                                                               
*                                                                               
***********************************************************************         
*              DRIVER/DRONE RELATED ADDRESSES                         *         
***********************************************************************         
*                                                                               
AGLOBAL  DS    A                   A(DRIVER GLOBALS)                            
DRIVER   DS    A                   A(DRIVER)                                    
*                                                                               
*                                                                               
***********************************************************************         
*              POINTERS FOR UNADDRESSABLE LIST AREAS                  *         
***********************************************************************         
*                                                                               
APODBKL  DS    A                   A(PODBKL)  BOOK LIST                         
APODMKTL DS    A                   A(PODMKTL) MARKET LIST                       
APODPRGL DS    A                   A(PODPRGL) PROGRAM GROUP LIST                
APODINPL DS    A                   A(PODINPL) INPUT FIELD LIST                  
APODOBSQ DS    A                   A(PODOBSQ) INPUT BOOK EQUATE LIST            
         DS    A                   SPARE                                        
PGNR     DS    A                   RELO FOR NEPODGEN                            
PGNR2    DS    A                   RELO2 FOR NEPODGEN                           
APODNET  DS    A                   A(PODNET)  STATION LIST                      
APDSYSC  DS    A                   A(PDSYSCD) SYSCODE LIST                      
APDNTDMS DS    A                   A(COMSCORE DEMO NAMES)                       
VCOMINTR DS    A                   A(COMINTER)                                  
ADBCSREX DS    A                   A(CSRN EXTEND DBLOCK)                        
         DS    10A                 SPARE                                        
*                                                                               
*                                                                               
***********************************************************************         
*              POINTER ADDRESSES                                      *         
***********************************************************************         
*                                                                               
REQDPTR  DS    CL4                 POINTER INTO PDREQDT                         
PRGTPTR  DS    CL4                 POINTER INTO PDPRGTT                         
PODMPTR  DS    CL4                 POINTER INTO PODMKTL                         
NSIDPTR  DS    CL4                 POINTER INTO PDSIDMKT                        
STDMPTR  DS    A                   POINTER INTO PDSTDEM                         
PRGLPTR  DS    CL4                 POINTER INTO PODPRGL                         
*                                                                               
*                                                                               
***********************************************************************         
*              SAVE AREAS                                             *         
***********************************************************************         
*                                                                               
SAVER0   DS    CL4                 SAVE REGISTER 0                              
SAVER2   DS    CL4                 SAVE REGISTER 2                              
SAVER4   DS    CL4                 SAVE REGISTER 4                              
SAVERE   DS    CL4                 SAVE REGISTER E                              
SAVERF   DS    CL4                 SAVE REGISTER F                              
ALASTCOL DS    A                   A(LAST COLUMN VALIDATED)                     
ACONTOPT DS    A                                                                
*                                                                               
*                                                                               
***********************************************************************         
*              INDICATORS                                             *         
***********************************************************************         
*                                                                               
DATAIND4 DS    XL1                 DATA INDICATOR 4                             
DISPREP  EQU   X'20'               SPECIAL REP                                  
*                                                                               
DATAIND3 DS    XL1                 DATA INDICATOR 3                             
DATAIND2 DS    XL1                 DATA INDICATOR 2                             
*                                                                               
DATAIND  DS    XL1                 DATA INDICATOR                               
DIDEMP   EQU   X'20'               BUY PURCHASED DEMO                           
DIDEMR   EQU   X'10'               BUY RERATE DEMO                              
DIDEMA   EQU   X'08'               BUY AFFID DEMO                               
DIBYDEM  EQU   DIDEMP+DIDEMR+DIDEMA                                             
DIDEMNDX EQU   X'02'               DEMO INDEX                                   
*                                                                               
OUTIND   DS    XL1                 OUTPUT INDICATOR                             
ININD    DS    XL1                 INPUT INDICATOR                              
SVBBMWK  DS    CL1                 BBM WEEKLY REQUEST INDCATOR                  
*                                                                               
REQIND   DS    XL1                 REQUEST INDICATOR                            
REQITRN  EQU   X'80'               TRANSMIT THE REPORT                          
*                                                                               
CABWFLAG DS    X                   CABLE FLAG FOR LIMITING REQUESTS             
NTITP    EQU   X'80'                                                            
ZZZC     EQU   X'40'                                                            
RANKING  EQU   X'20'                                                            
RUNDATE  EQU   X'10'                                                            
NTI      EQU   X'08'                                                            
NET      EQU   X'04'                                                            
PROG     EQU   X'02'                                                            
TIME     EQU   X'01'                                                            
*                                                                               
*                                                                               
***********************************************************************         
*              MISCELLANEOUS                                          *         
***********************************************************************         
*                                                                               
NFLDS    DS    CL1                 NUMBER OF FIELDS                             
AGYSIGN  DS    CL12                SIGN ON ID                                   
AGYALPHA DS    CL2                 AGENCY ALPHA                                 
AGYNUM   DS    CL3                 LAST 3 NUMERIC OF SIGN OR X'FF'              
DDS      DS    C                   Y=DDS                                        
AUTH     DS    XL2                 AUTHORIZATION BITS                           
TERM     DS    XL2                 TERMINAL NUMBER                              
USERID   DS    XL2                 USER ID NUMBER                               
FIELDERR DS    XL1                 USED FOR CURSOR POSITIONING                  
SVFLDER  DS    XL1                                                              
LNDEMCOD DS    H                                                                
GOAGAIN  DS    C                   CONTROL INTERNAL CALLS TO GENCON             
NDEMOS   DS    XL1                 NUMBER OF BUY DEMOS                          
NDEMS1   DS    XL1                 NUMBER OF COLUMNS ON FIRST SCREEN            
RPT2ID   DS    CL8                 SECOND REPORT NAME                           
SCR2IND  DS    XL1                 SECOND SCREEN INDICATOR                      
SCR2YES  EQU   X'80'               NOW PROCESSING SECOND SCREEN                 
*                                                                               
NTISRCQ  EQU   X'80'               SOURCE NTI/NTI-T REQUESTED                   
CNADSRQ  EQU   X'40'               SOURCE CNAD/CNADT REQUESTED                  
*                                                                               
PDSYSBK  DS    XL2                 BOOK OF EXISTENT SYSCODE TABLE               
PDSYSMK  DS    HL2                 MARKET OF EXISTENT SYSCODE TABLE             
*                                                                               
TEMPFLD  DS    CL100                                                            
*                                                                               
* THESE FIELDS WERE MOVED HERE FROM NEPODDRIVE TO MAKE IT RE-ENTRANT            
*                                                                               
OUTLEVEL DS    XL1                                                              
INLEVEL  DS    XL1                                                              
LEVELSWS DS    CL16                                                             
SVPDBOOK DS    XL(L'PDSBOOK)                                                    
SVTOTWT  DS    PL8                                                              
EDTBLK   DS    CL24                                                             
*                                                                               
* THESE FIELDS WERE MOVED HERE FROM NEPODGEN TO MAKE IT RE-ENTRANT              
*                                                                               
NADUSE   DS    C                   NAD USE FLAG 'Y','N'                         
DYTMOVR  DS    C                   DAY/TIME OVERLAP FLAG: 0,'Y'                 
NEGSW    DS    C                   NEGATION SWITCH. 1=REVERSE                   
COLRANK  DS    X                   COLUMN RANK                                  
PIVZZZ   DS    X                   ZZZZ REQUEST FOR PIV FLAG                    
REPMENU  DS    C                                                                
ACMFLAG  DS    X                                                                
MTHTABL  DS    A                                                                
AMTHTAB  DS    A                                                                
NFLD#    DS    X                                                                
NHFLAG   DS    X                   NHT REQUEST FLAG                             
SAVSTA   DS    CL5                                                              
EDITLIST DS    XL64                USED OFFLINE ONLY                            
AVALBLCK DS    A                   A(VALBLCK)                                   
*                                                                               
***********************************************************************         
*              WORK AREAS                                             *         
***********************************************************************         
*                                                                               
FACTWRK  DS    10D                 GETFACT AREA                                 
PROF1W   DS    CL16                1W PROFILE FOR SPOT                          
*                                                                               
*                                                                               
***********************************************************************         
*              ERROR MESSAGE DATA                                     *         
***********************************************************************         
*                                                                               
PERROR   DS    XL2                 ERROR NUMBER FOR GETTXT                      
PMSGTYPE DS    X                   MESSAGE TYPE (X'00' = ERROR)                 
*                                                                               
*                                                                               
***********************************************************************         
*              BUFFER ADDRESSES                                       *         
***********************************************************************         
*                                                                               
ADBUFF   DS    A                   A(WORKING STORAGE BUFFER) - ONLINE           
ADATES   DS    A                   A(DATE BUFFER)                               
ANAMPOOL DS    A                   A(NAME POOL)                                 
LNAMPOOL DS    F                   ADDRESS OF POOL AREA                         
ADPGPROG DS    A                   A(DRONE GENERATED DPG PROGRAM)               
AWEEKS   DS    A                   A(WEEKS TABLE)                               
AMONTHS  DS    A                   A(MONTHS TABLE)                              
AQTRS    DS    A                   A(QUARTERS TABLE)                            
*                                                                               
*                                                                               
***********************************************************************         
*              DEMO DATA AREAS                                        *         
***********************************************************************         
*                                                                               
PODBOOK  DS    CL24                HOLDS BOOK AND SOURCE INFO 1ST ENT           
PODBKPT  DS    CL4                 POINTER INTO PODBOOK                         
PODBKOPT DS    CL1                 ASSORTED BOOK OPTIONS                        
PODBKNUM DS    CL1                 COUNTER OF ENTRIES INTO PODBOOK              
PODNADBK DS    CL1                 NAD BOOK CHECK                               
*PODNETL  EQU   8                   LENGTH OF ONE NETW ENTRY                    
*LPODNET  EQU   2401                TOTAL LENGTH OF TABLE                       
*                                  (300 STA * 8) + 1                            
*                                                                               
* SIZE INCREASED FOR COMSCORE NPOD MAR/17 - SCHT                                
*                                                                               
PODNETL  EQU   13                  LENGTH OF ONE NETW ENTRY                     
LPODNET  EQU   3901                TOTAL LENGTH OF TABLE                        
*                                  (300 STA * 13) + 1                           
*                                                                               
PODNETAD DS    CL4                 ADDRESS OF CURRENT NET ENTRY                 
PODNETMB DS    CL2                 MEDIA AND BOOKTYPE FOR ALL STA               
PODNTFLT DS    CL49                NTI FILTERS HOLDS 8                          
PODNDFLT DS    CL49                NAD FILTERS HOLDS 8                          
PODPVFLT DS    CL49                PIV FILTERS HOLDS 8                          
PODNHFLT DS    CL49                NHT FILTERS HOLDS 8                          
PODNTNUM DS    CL1                 COUNTER OF ENTRIES INTO PODNET               
PODDAYTM DS    CL51                DAY TIME TABLE 10 ENTRIES                    
PODPSTRT DS    CL2                 PROGRAM START RANGE                          
PODPEND  DS    CL2                 PROGRAM END RANGE                            
PROGSTRT DS    CL6                 EBCDIC PROGRAM START DATE                    
PODMPAMK DS    CL2                 MPA MARKET NUMBER                            
         EJECT                                                                  
***********************************************************************         
*              DBLOCK DATA                                            *         
***********************************************************************         
*                                                                               
DUMPDBA  DS    D                   **DBA*** IN DUMP                             
DBLOCKA  DS    CL256                                                            
         DS    CL8                 BECAUSE DBLOCK CAN EXCEED 256                
         EJECT                                                                  
       ++INCLUDE DRONEBLKD                                                      
         EJECT                                                                  
       ++INCLUDE NEPODBLCK                                                      
         EJECT                                                                  
SYSD     DSECT                                                                  
         ORG   PDLOCKX                                                          
         EJECT                                                                  
STARTSV  DS    0F                  START OF SYSTEM SAVE AREA                    
         DS    D                   **WEEKS* IN DUMP                             
BUFF     DS    0C                                                               
         DS    CL(NWEEKS*4)                                                     
         DS    D                   *MONTHS* IN DUMP                             
         DS    CL(NMONTHS*4)                                                    
         DS    D                   **QTRS** IN DUMP                             
         DS    CL(NQTRS*4)                                                      
         ORG   BUFF+LDATES                                                      
         DS    D                   **BKLST* IN DUMP                             
         DS    360C                                                             
         DS    D                   **DPG*** IN DUMP                             
         DS    3000C                                                            
         DS    D                   **DPGIO* IN DUMP                             
         DS    1000C                                                            
         DS    1000C               ** SPARE FOR ONLINE TESTING **               
*                                                                               
NWEEKS   EQU   60                                                               
NMONTHS  EQU   18                                                               
NQTRS    EQU   5                                                                
LDATES   EQU   400                 ENOUGH ROOM FOR ALL DATES BUFFERS            
*                                                                               
SYSEND   DS    0C                  END OF SAVED STORAGE                         
         EJECT                                                                  
***********************************************************************         
*              ERROR MESSAGES (SYSTEM 24)                             *         
***********************************************************************         
*                                                                               
INVMED   EQU   61                  INVALID MEDIA CODE                           
NTICON   EQU   0300                FILTERS PRGS AND PDF CONFLICT                
PDFCON   EQU   0301                CAN'T USE EXACT W/PDF FILTER                 
INVPRGS  EQU   0302                INVALID PRGS INPUT, ONLY 5 ALLOWED           
INVSID   EQU   0303                INVALID OR MISSING SID                       
INVPER   EQU   0304                INVALID OR MISSING PERIOD                    
INVEST   EQU   0305                MISSING ESTIMATE BOOK                        
NOSIDS   EQU   0306                SIDS NOT AVAILABLE                           
NEEDUP   EQU   0307                ESTIMATE BOOKS NEED UPGRADE FORMULAS         
MISSTA   EQU   0308                MISSING STATION OR MARKET                    
MENUOPT  EQU   0309                MENU OPTION MUST BE SET                      
INVOPT   EQU   0310                INVALID OPTION                               
INVROW   EQU   0311                INVALID ROW EXPRESSION                       
NOSTAK   EQU   0312                RANK CANNOT BE USED WITH STACKED             
NOLAST   EQU   0313                RANK CANNOT BE LAST ROW                      
INVRNK   EQU   0314                RANK INVALID FOR DETAIL AVERAGE              
NOCLEN   EQU   0315                LENGTH CANNOT BE USED WITH CABLE             
INVBOOK  EQU   0316                INVALID BOOK EXPRESSION                      
MPABOOK  EQU   0317                EMI/NMI NEEDS A MPA BOOK                     
INVFEX   EQU   0318                INVALID FILTER EXPRESSION                    
INVFPR   EQU   0319                INVALID FILTER PREFIX                        
INVDEM   EQU   0320                INVALID DEMO EXPRESSION                      
IMPRTG   EQU   0321                EMI/NMI ONLY ALLOW IMP AND RTG               
INVSRC   EQU   0322                INVALID SOURCE EXPRESSION                    
NOPIVD   EQU   0323                PIV SOURCE REQUESTED W/NO DATES              
INVCOL   EQU   0324                INVALID COLUMN EXPRESSION                    
NOUSER   EQU   0325                CANNOT FIND USER RECORD                      
INVFORM  EQU   0326                INVALID DATE FORMAT                          
INVNET   EQU   0327                INVALID NETWORK                              
TOOMKT   EQU   0328                TOO MANY MARKETS                             
MRGCON   EQU   0329                CAN'T USE MRKT AND MRKGRP                    
MAX8FIL  EQU   0330                MAXIMUM OF 8 FILTERS EXCEEDED                
PREMIN   EQU   0331                PRE OPTION MUST PRECEED MIN OPTION           
WIDOVR   EQU   0332                HEADING OVERRIDE IS WIDER THAN COL           
DUPOPT   EQU   0333                DUPLICATE OPTION ENTERED                     
NEED1    EQU   0334                MUST HAVE AT LEAST 1 ROW & 1 COLUMN          
INVSTA   EQU   0335                INVALID STATION                              
TOOMANY  EQU   0336                TOO MANY ENTRIES                             
MISSPER  EQU   0337                PERIOD MISSING FOR SID                       
MRKCON   EQU   0338                CAN'T USE MRKT/MRKGRP W/PDF FILTER           
AFFCON   EQU   0339                CAN'T USE AFFIL WITH UAFFIL                  
STKCON   EQU   0340                CAN'T USE STACK WITH GSTACK                  
PRGCON   EQU   0341                CAN'T USE PRGS WITH PRGGRP                   
PAVUPG   EQU   0342                UPGRADE INVALID FOR PAV                      
TALLERR  EQU   0343                TALL INVALID WITH DAYPART                    
BADCONT  EQU   0344         REPORT 2 IS NOT A VALID CONTINUATION REPORT         
MANYCOL  EQU   0345             TOO MANY COLUMN DEMOS(INCLUDING RANGES)         
NOPRGERR EQU   0346                CCV MUST REQUEST PROGRAM NAME                
MISSTAT  EQU   0347                COUNTY GIVEN WITHOUT A STATE                 
NADCABS  EQU   0348             FOR CABLE NAD USE SOURCE CNAD OR CNAW           
CNDNTI   EQU   0349       NTI AND CNAD/CNAW CAN'T BE REQUESTED TOGETHER         
NODTERR  EQU   0350       FOR OPTION DAYPART MUST REQUEST DAY AND TIME          
ITNERR   EQU   0351       NO TIME FILTERING FOR ITN-S                           
NONETERR EQU   0352       ZZZ REQUESTS FOR PIV MUST DISPLAY NETWORK DET         
TOMCHERR EQU   0353       DATE NOT ALLOWED WITH ALL CABLE NTI-T RANK            
CCVMERR  EQU   0354       SOURCE CCV NOT ALLOWED WITH ANY OTHER SOURCES         
TOMCHER2 EQU   0355       DATE/TIME NOT ALLOWED WITH 15WEEK ALL-CBL RNK         
SYNNOTNH EQU   0356       SYNDICATION DATA NOT AVAILABLE FOR NHT                
ALSTASYS EQU   0357       ALL-STATION/SYSCODE REQ MUST FILTER ON SYSCOD         
PRGERR   EQU   0358       PROGRAM NAME NOT ALLOWED WITH ALL-SYSCODE REQ         
LIVEONLY EQU   0359       ONLY LIVE DATA BEFORE JAN/06                          
NOACMH   EQU   0360       NO HISPANIC DATA AVAILABLE FOR ACM                    
BADHSOLD EQU   0361       MUST USE SOURCE HPM, HPW, OR HPC AFTER SEP/07         
BADHSNEW EQU   0362       MUST USE SOURCE NHT, NHW, OR NHC BEFOR SEP/07         
MISSMTYP EQU   0363       SECOND WEIGHTING ONLY WITH OPTION MINTYP              
RENMERR  EQU   0364       SOURCE REN NOT ALLOWED WITH ANY OTHER SOURCES         
SINERR   EQU   0367       NO TIME FILTERING FOR SIN-S                           
*                                                                               
       ++INCLUDE DEDEMEQUS2                                                     
         EJECT                                                                  
