*          DATA SET NEPODE0D   AT LEVEL 027 AS OF 10/31/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T325E0D      DATE 10/31/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      4    2    4  A   P    N         T        Y              
SPLCODH  DS    CL8                                                              
SPLCOD   DS    CL8      4   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      4   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      4   20    4  A   P    N         T        Y              
SPLNAMH  DS    CL8                                                              
SPLNAM   DS    CL26     4   28   26  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      4   56    7  A   P    N         T        Y              
SPLRFTH  DS    CL8                                                              
SPLRFT   DS    CL8      4   64    8  A   U    N         T        Y    2         
SPLRFTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     6    2   12  A   P    N         T        Y              
SPLSBKH  DS    CL8                                                              
SPLSBK   DS    CL60     6   20   60  A   U    N         T        Y   10         
SPLSBKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL23     7    2   23  A   P    N         T        Y              
SPLPSTH  DS    CL8                                                              
SPLPST   DS    CL8      7   28    8  A   U    N         T        Y   40         
SPLPSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   38    3  A   P    N         T        Y              
SPLPENH  DS    CL8                                                              
SPLPEN   DS    CL8      7   46    8  A   U    N         T        Y   41         
SPLPENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     8    2   10  A   P    N         T        Y              
SPLDTMH  DS    CL8                                                              
SPLDTM   DS    CL60     8   20   60  A   U    N         T        Y   18         
SPLDTMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL60     9   20   60  A   U    N         T        Y   25         
SPLNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10    2    5  A   P    N         T        Y              
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL69    10   10   69  A   U    N         T        Y   60         
SPLDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
SPLLEFTH DS    CL8                                                              
SPLLEFT  DS    CL16    12   10   16  A   U    N         T        Y  111         
SPLLEFTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   28   16  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12   46   12  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12   59    3  A   P    N         T        Y              
SPLMIDH  DS    CL8                                                              
SPLMID   DS    CL16    12   64   16  A   U    N         T        Y  103         
SPLMIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
SPLDETSH DS    CL8                                                              
SPLDETS  DS    CL16    13   10   16  A   U    N         T        Y  104         
SPLDETSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   28   16  A   U    N         T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   46   16  A   U    N         T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   64   16  A   U    N         T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   10   16  A   U    N         T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   28   16  A   U    N         T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   46   16  A   U    N         T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   64   16  A   U    N         T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15    2    7  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     15   10    1  A   P    N         T        Y              
SPLCOLSH DS    CL8                                                              
SPLCOLS  DS    CL32    15   12   32  A   U    N         T        Y  106         
SPLCOLSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    15   47   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    16   12   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    16   47   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    17   12   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    17   47   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    18   12   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    18   47   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    19   12   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    19   47   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    20   12   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    20   47   32  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  A   P    N         T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL69    21   10   69  A   U    N         T        Y  108         
SPLOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A   P    N         T        Y              
SPLOPT2H DS    CL8                                                              
SPLOPT2  DS    CL69    22   10   69  A   U    N         T        Y  108         
SPLOPT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23    2    7  A   P    N         T        Y              
SPLFILTH DS    CL8                                                              
SPLFILT  DS    CL69    23   10   69  A   U    N         T        Y  109         
SPLFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     24    2    5  A   P    N         T        Y              
SPLTITH  DS    CL8                                                              
SPLTIT   DS    CL55    24   10   55  A   U    N         T        Y   66         
SPLTITX  DS    CL8                                                              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2104 BYTES                            
