*          DATA SET NEPROGTABS AT LEVEL 013 AS OF 09/30/19                      
*---------------------------------------------------------------------*         
*           VARIOUS TABLES FOR THE NETWORK PROGRAM RECORD             *         
*---------------------------------------------------------------------*         
                                                                                
CONTAB   DC    CL2'G ',CL40'General Audience'                                   
         DC    CL2'M ',CL40'Mature Audiences Only'                              
         DC    CL2'PG',CL40'Parental Guidance Suggested'                        
         DC    CL2'Y ',CL40'All Children'                                       
         DC    CL2'Y7',CL40'Directed to Children 7 and Above'                   
         DC    CL2'14',CL40'Parents Strongly Cautioned'                         
         DC    XL1'FF'                                                          
                                                                                
MIRTAB   DC    CL1'A',CL30'4 Hours Later'                                       
         DC    CL1'B',CL30'5 Hours Earlier'                                     
         DC    CL1'C',CL30'11 Hours Earlier'                                    
         DC    CL1'D',CL30'6 Hours Earlier'                                     
         DC    CL1'E',CL30'9 Hours Earlier'                                     
         DC    CL1'F',CL30'3 Hours Later'                                       
         DC    CL1'G',CL30'7 Hours Later'                                       
         DC    CL1'H',CL30'4 Hours Earlier'                                     
         DC    CL1'I',CL30'6.5 Hours Later'                                     
         DC    CL1'J',CL30'7.5 Hours Later'                                     
         DC    CL1'K',CL30'5 Hours Later'                                       
         DC    CL1'L',CL30'4.5 Hours Later'                                     
         DC    CL1'M',CL30'3 Hours and 5 Hours Later'                           
         DC    CL1'N',CL30'2 Hours and 4 Hours Later'                           
         DC    CL1'O',CL30'8 Hours Later'                                       
         DC    CL1'P',CL30'3 Hours and 6 Hours Later'                           
         DC    CL1'Q',CL30'2 Hours Later'                                       
         DC    CL1'R',CL30'6 Hours Later'                                       
         DC    XL1'FF'                                                          
                                                                                
TCARTAB  DC    CL1'1'              LEVEL 1 WB=1                                 
         DC    CL1'2'              LEVEL 2                                      
         DC    CL1'3'              LEVEL 3                                      
         DC    CL1'4'              LEVEL 4                                      
         DC    CL1'5'              LEVEL 5                                      
         DC    XL1'FF'                                                          
                                                                                
TCARTAB2 DC    CL1'5'              LEVEL 5 TCAR=5                               
         DC    CL1'6'              LEVEL 6                                      
         DC    CL1'7'              LEVEL 7                                      
         DC    CL1'8'              LEVEL 8                                      
         DC    CL1'9'              LEVEL 9                                      
         DC    XL1'FF'                                                          
