*          DATA SET NEPROGTABD AT LEVEL 024 AS OF 01/03/06                      
*---------------------------------------------------------------------*         
*                 DSECTS FOR TABLES IN NEPROGTABS                     *         
*---------------------------------------------------------------------*         
                                                                                
CONTABD  DSECT                     TABLE OF CONTENT CODES                       
CONTCD   DS    CL2                 CONTENT CODE                                 
CONTNM   DS    CL40                CONTENT NAME                                 
CONTABL  EQU   *-CONTABD                                                        
                                                                                
MIRTABD  DSECT                     TABLE OF MIRROR CODES                        
MIRCODE  DS    CL1                 MIRROR CODE                                  
MIRNAME  DS    CL30                MIRROR NAME                                  
MIRTABL  EQU   *-MIRTABD                                                        
