*          DATA SET NEPUPE4D   AT LEVEL 005 AS OF 05/05/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T322E4D      DATE 05/05/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
PUPCLIH  DS    CL8                                                              
PUPCLI   DS    CL8      6   10    8  A  U N             T    I   Y   10         
PUPCLIX  DS    CL8                                                              
PUPCLINH DS    CL8                                                              
PUPCLIN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   50    4  N  P H             T        Y              
PUPYEARH DS    CL8                                                              
PUPYEAR  DS    CL2      6   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     8    2   20  A  P H             T        Y              
PUPQ4SDH DS    CL8                                                              
PUPQ4SD  DS    CL10     8   24   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  A  P H             T        Y              
PUPQ4DTH DS    CL8                                                              
PUPQ4DT  DS    CL10     9   24   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  A  P H             T        Y              
PUPQ1DTH DS    CL8                                                              
PUPQ1DT  DS    CL10    10   24   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  A  P H             T        Y              
PUPQ2DTH DS    CL8                                                              
PUPQ2DT  DS    CL10    11   24   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    12    2   18  A  P H             T        Y              
PUPQ3DTH DS    CL8                                                              
PUPQ3DT  DS    CL10    12   24   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 336  BYTES                            
