*          DATA SET NEPUPE1D   AT LEVEL 002 AS OF 05/03/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T322E1D      DATE 05/03/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
PUPCLIH  DS    CL8                                                              
PUPCLI   DS    CL8      6   10    8  A  U N             T    I   Y   10         
PUPCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P H             T        Y              
PUPNETH  DS    CL8                                                              
PUPNET   DS    CL8      6   28    8  A  U N             T        Y   20         
PUPNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
PUPDPTH  DS    CL8                                                              
PUPDPT   DS    CL8      6   46    8  A  U N             T        Y   30         
PUPDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   56    4  A  P H             T        Y              
PUPPLANH DS    CL8                                                              
PUPPLAN  DS    CL4      6   64    4  A  U N             T        Y   40         
PUPPLANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   70    5  A  P N             T        Y              
PUPQURTH DS    CL8                                                              
PUPQURT  DS    CL2      6   77    2  A  U N             T        Y   41         
PUPQURTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
PUPPROGH DS    CL8                                                              
PUPPROG  DS    CL8      7   10    8  A  U N             T        Y   60         
PUPPROGX DS    CL8                                                              
PUPPNAMH DS    CL8                                                              
PUPPNAM  DS    CL16     7   20   16  A  P N             T        Y              
PUPPDTH  DS    CL8                                                              
PUPPDT   DS    CL16     7   38   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   56    4  A  P N             T        Y              
PUPHUTSH DS    CL8                                                              
PUPHUTS  DS    CL13     7   64   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
PUPTAR2H DS    CL8                                                              
PUPTAR2  DS    CL3      8   74    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
PUPLENSH DS    CL8                                                              
PUPLENS  DS    CL18     9    8   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     9   42   32  A  P N             T        Y              
PUPTARGH DS    CL8                                                              
PUPTARG  DS    CL7      9   74    7  A  P N             T        Y              
PUPPERH  DS    CL8                                                              
PUPPER   DS    CL5     10    2    5  A  P N             T        Y              
PUPUNITH DS    CL8                                                              
PUPUNIT  DS    CL3     10    8    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   23    3  A  P N             T        Y              
PUPOVERH DS    CL8                                                              
PUPOVER  DS    CL12    10   28   12  A  P N             T        Y   62         
PUPOVERX DS    CL8                                                              
PUPDEMOH DS    CL8                                                              
PUPDEMO  DS    CL40    10   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    11   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    12   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    13   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     14    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    14   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    15   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    16   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    17   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    18   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    19   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    20   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    21   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    22   41   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   13    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   23    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   28   12  A  P N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    23   41   40  A  P N             T        Y              
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2296 BYTES                            
