*          DATA SET NEPUPD8D   AT LEVEL 001 AS OF 04/27/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T322D8D      DATE 04/27/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
PUPCLIH  DS    CL8                                                              
PUPCLI   DS    CL8      7   10    8  A   U    N         T        Y   10         
PUPCLIX  DS    CL8                                                              
PUPCLINH DS    CL8                                                              
PUPCLIN  DS    CL20     7   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    H         T        Y              
PUPNETH  DS    CL8                                                              
PUPNET   DS    CL8      8   10    8  A   U    N         T        Y   20         
PUPNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A   P    H         T        Y              
PUPDPTH  DS    CL8                                                              
PUPDPT   DS    CL8      8   28    8  A   U    N         T        Y   30         
PUPDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8   38    4  A   P    H         T        Y              
PUPPLANH DS    CL8                                                              
PUPPLAN  DS    CL5      8   46    5  A   U    N         T        Y   40         
PUPPLANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    10    2   17  A   P    N         T        Y              
PUPDEMOH DS    CL8                                                              
PUPDEMO  DS    CL40    10   20   40  A   U    N         T        Y  100         
PUPDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    11    2   17  A   P    N         T        Y              
PUPOPTH  DS    CL8                                                              
PUPOPT   DS    CL40    11   20   40  A   U    N         T        Y  120         
PUPOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
PUPQSTLH DS    CL8                                                              
PUPQSTL  DS    CL40    12   10   40  A   U    N         T        Y  110         
PUPQSTLX DS    CL8                                                              
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 519  BYTES                            
