*          DATA SET NEPUPF3D   AT LEVEL 001 AS OF 03/06/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T322F3D      DATE 03/06/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
PUPCLIH  DS    CL8                                                              
PUPCLI   DS    CL8      6   10    8  A   U    N         T    I   Y   10         
PUPCLIX  DS    CL8                                                              
PUPCLINH DS    CL8                                                              
PUPCLIN  DS    CL20     6   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PUPNETH  DS    CL8                                                              
PUPNET   DS    CL8      7   10    8  A   U    N         T        Y   20         
PUPNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
PUPDPTH  DS    CL8                                                              
PUPDPT   DS    CL8      8   10    8  A   U    N         T        Y   30         
PUPDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9    2    4  A   P    N         T        Y              
PUPPLANH DS    CL8                                                              
PUPPLAN  DS    CL4      9   10    4  A   U    N         T        Y   40         
PUPPLANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   U    N         T        Y              
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 197  BYTES                            
