*          DATA SET NEPUPFAD   AT LEVEL 008 AS OF 10/07/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T322FAD      DATE 10/07/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
PUPCLIH  DS    CL8                                                              
PUPCLI   DS    CL8      6   10    8  A  U N             T    I   Y   10         
PUPCLIX  DS    CL8                                                              
PUPCLINH DS    CL8                                                              
PUPCLIN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
PUPNETH  DS    CL8                                                              
PUPNET   DS    CL8      7   10    8  A  U N             T        Y   20         
PUPNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   20    7  A  P H             T        Y              
PUPDPTH  DS    CL8                                                              
PUPDPT   DS    CL8      7   28    8  A  U N             T        Y   30         
PUPDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   38    4  A  P H             T        Y              
PUPPLANH DS    CL8                                                              
PUPPLAN  DS    CL4      7   46    4  A  U N             T        Y   40         
PUPPLANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
PUPYEARH DS    CL8                                                              
PUPYEAR  DS    CL4      9   10    4  A  U N             T        Y   41         
PUPYEARX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9   20    4  A  P N             T        Y              
PUPNAMEH DS    CL8                                                              
PUPNAME  DS    CL16     9   28   16  A  U N             T        Y   42         
PUPNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
PUPUNIVH DS    CL8                                                              
PUPUNIV  DS    CL8     10   10    8  A  U N             T        Y   43         
PUPUNIVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   20    7  A  P H             T        Y              
PUPLENSH DS    CL8                                                              
PUPLENS  DS    CL12    10   28   12  A  U N             T        Y   44         
PUPLENSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10   56    6  A  P H             T        Y              
         DS    CL8                                               S= 200         
PUPCPLNH DS    CL8                                                              
PUPCPLN  DS    CL1     10   64    1  A  U N             T        Y              
PUPCPLNX DS    CL8                                               S= 201         
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
PUPPTYPH DS    CL8                                                              
PUPPTYP  DS    CL8     11   10    8  A  U N             T        Y   51         
PUPPTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   20    7  A  P H             T        Y              
PUPHTYRH DS    CL8                                                              
PUPHTYR  DS    CL8     11   28    8  A  U N             T        Y   45         
PUPHTYRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   38    7  A  P N             T        Y              
PUPHTSCH DS    CL8                                                              
PUPHTSC  DS    CL8     11   46    8  A  U N             T        Y   46         
PUPHTSCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
PUPHTAVH DS    CL8                                                              
PUPHTAV  DS    CL8     12   10    8  A  U N             T        Y   47         
PUPHTAVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   20    7  A  P N             T        Y              
PUPHTYPH DS    CL8                                                              
PUPHTYP  DS    CL8     12   28    8  A  U N             T        Y   48         
PUPHTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   38    7  A  P N             T        Y              
PUPHTOVH DS    CL8                                                              
PUPHTOV  DS    CL8     12   46    8  A  U N             T        Y   59         
PUPHTOVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   56    7  A  P N             T        Y              
PUPGDEMH DS    CL8                                                              
PUPGDEM  DS    CL12    12   64   12  A  P N             T        Y   62         
PUPGDEMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
PUPGCPMH DS    CL8                                                              
PUPGCPM  DS    CL8     13   10    8  A  U N             T        Y   60         
PUPGCPMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   20    7  A  P N             T        Y              
PUPADJAH DS    CL8                                                              
PUPADJA  DS    CL8     13   28    8  A  U N             T        Y   61         
PUPADJAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   38    7  A  P N             T        Y              
PUPDCPMH DS    CL8                                                              
PUPDCPM  DS    CL8     13   46    8  A  U N             T        Y   62         
PUPDCPMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   56    7  A  P N             T        Y              
PUPADJDH DS    CL8                                                              
PUPADJD  DS    CL8     13   64    8  A  U N             T        Y   62         
PUPADJDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P H             T        Y              
PUPDEMOH DS    CL8                                                              
PUPDEMO  DS    CL48    14   10   48  A  U N             T        Y   49         
PUPDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
PUPFILTH DS    CL8                                                              
PUPFILT  DS    CL3     15   10    3  A  U N             T        Y   52         
PUPFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     16    2    4  A  P N             T        Y              
PUPZONEH DS    CL8                                                              
PUPZONE  DS    CL1     16   10    1  A  U N             T        Y   63         
PUPZONEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
PUPBUD4H DS    CL8                                                              
PUPBUD4  DS    CL30    18   20   30  A  U N             T        Y   50         
PUPBUD4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
PUPBUD1H DS    CL8                                                              
PUPBUD1  DS    CL30    19   20   30  A  U N             T        Y   50         
PUPBUD1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
PUPBUD2H DS    CL8                                                              
PUPBUD2  DS    CL30    20   20   30  A  U N             T        Y   50         
PUPBUD2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    21    2   12  A  P N             T        Y              
PUPBUD3H DS    CL8                                                              
PUPBUD3  DS    CL30    21   20   30  A  U N             T        Y   50         
PUPBUD3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
PUPCOMMH DS    CL8                                                              
PUPCOMM  DS    CL68    23   10   68  A  U N             T        Y   50         
PUPCOMMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     24    2    1  A  P N             T        Y              
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1320 BYTES                            
