*          DATA SET NEPUPD1D   AT LEVEL 005 AS OF 03/25/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T322D1D      DATE 03/25/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
PUPCLIH  DS    CL8                                                              
PUPCLI   DS    CL8      7   10    8  A   U    N         T        Y   10         
PUPCLIX  DS    CL8                                                              
PUPCLINH DS    CL8                                                              
PUPCLIN  DS    CL20     7   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    H         T        Y              
PUPNETH  DS    CL8                                                              
PUPNET   DS    CL8      8   10    8  A   U    N         T        Y   20         
PUPNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A   P    H         T        Y              
PUPDPTH  DS    CL8                                                              
PUPDPT   DS    CL8      8   28    8  A   U    N         T        Y   30         
PUPDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8   38    4  A   P    H         T        Y              
PUPPLANH DS    CL8                                                              
PUPPLAN  DS    CL4      8   46    4  A   U    N         T        Y   40         
PUPPLANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    10    2   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   20    7  A   P    N         T        Y              
PUPPSYNH DS    CL8                                                              
PUPPSYN  DS    CL8     10   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   20    7  A   P    N         T        Y              
PUPPSTLH DS    CL8                                                              
PUPPSTL  DS    CL40    11   28   40  A   U    N         T        Y  110         
PUPPSTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    13    2   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   20    7  A   P    N         T        Y              
PUPDRYNH DS    CL8                                                              
PUPDRYN  DS    CL8     13   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   38    7  A   P    N         T        Y              
PUPDRQUH DS    CL8                                                              
PUPDRQU  DS    CL8     13   46    8  A   U    N         T        Y   72         
PUPDRQUX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14   20    7  A   P    N         T        Y              
PUPVPHH  DS    CL8                                                              
PUPVPH   DS    CL8     14   28    8  A   U    N         T        Y  112         
PUPVPHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14   38    7  A   P    N         T        Y              
PUPIMPH  DS    CL8                                                              
PUPIMP   DS    CL8     14   46    8  A   U    N         T        Y  113         
PUPIMPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14   56    7  A   P    N         T        Y              
PUPGRPH  DS    CL8                                                              
PUPGRP   DS    CL8     14   64    8  A   U    N         T        Y  114         
PUPGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15   20    7  A   P    N         T        Y              
PUPDRTLH DS    CL8                                                              
PUPDRTL  DS    CL40    15   28   40  A   U    N         T        Y  110         
PUPDRTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    17    2   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   20    7  A   P    N         T        Y              
PUPQSYNH DS    CL8                                                              
PUPQSYN  DS    CL8     17   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   38    7  A   P    N         T        Y              
PUPQGRPH DS    CL8                                                              
PUPQGRP  DS    CL8     17   46    8  A   U    N         T        Y  115         
PUPQGRPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18   20    7  A   P    N         T        Y              
PUPQSTLH DS    CL8                                                              
PUPQSTL  DS    CL40    18   28   40  A   U    N         T        Y  110         
PUPQSTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    20    2   17  A   P    N         T        Y              
PUPDEMOH DS    CL8                                                              
PUPDEMO  DS    CL40    20   20   40  A   U    N         T        Y  100         
PUPDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    21    2   17  A   P    N         T        Y              
PUPOPTH  DS    CL8                                                              
PUPOPT   DS    CL40    21   20   40  A   U    N         T        Y  120         
PUPOPTX  DS    CL8                                                              
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1023 BYTES                            
