*          DATA SET NEPUPF8D   AT LEVEL 018 AS OF 02/27/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T322F8D      DATE 02/27/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
PUPCLIH  DS    CL8                                                              
PUPCLI   DS    CL8      6   10    8  A  U N             T    I   Y   10         
PUPCLIX  DS    CL8                                                              
PUPCLINH DS    CL8                                                              
PUPCLIN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
PUPNETH  DS    CL8                                                              
PUPNET   DS    CL8      7   10    8  A  U N             T        Y   20         
PUPNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   20    7  A  P H             T        Y              
PUPDPTH  DS    CL8                                                              
PUPDPT   DS    CL8      7   28    8  A  U N             T        Y   30         
PUPDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   38    4  A  P H             T        Y              
PUPPLANH DS    CL8                                                              
PUPPLAN  DS    CL4      7   46    4  A  U N             T        Y   40         
PUPPLANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9    2    5  A  P H             T        Y              
PUPPCNTH DS    CL8                                                              
PUPPCNT  DS    CL2      9    9    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      9   39    6  A  P N             T        Y              
PUPHNADH DS    CL8                                                              
PUPHNAD  DS    CL3      9   48    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   56    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   64    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   72    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL43    10    2   43  A  P N             T        Y              
PUPHDEMH DS    CL8                                                              
PUPHDEM  DS    CL6     10   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   55    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   63    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   71    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL43    11    2   43  A  P N             T        Y              
PUPHLNEH DS    CL8                                                              
PUPHLNE  DS    CL6     11   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   55    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   63    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   71    6  A  P N             T        Y              
PUPNAMH  DS    CL8                                                              
PUPNAM   DS    CL9     12    2    9  A  U N             T        Y              
PUPCODH  DS    CL8                                                              
PUPCOD   DS    CL4     12   13    4  A  U N             T        Y              
PUPDAYH  DS    CL8                                                              
PUPDAY   DS    CL5     12   19    5  A  U N             T        Y              
PUPTIMH  DS    CL8                                                              
PUPTIM   DS    CL11    12   26   11  A  U N             T        Y              
PUPHOMH  DS    CL8                                                              
PUPHOM   DS    CL6     12   39    6  A  U N             T        Y              
PUPDM1H  DS    CL8                                                              
PUPDM1   DS    CL6     12   47    6  A  U N             T        Y              
PUPDM2H  DS    CL8                                                              
PUPDM2   DS    CL6     12   55    6  A  U N             T        Y              
PUPDM3H  DS    CL8                                                              
PUPDM3   DS    CL6     12   63    6  A  U N             T        Y              
PUPDM4H  DS    CL8                                                              
PUPDM4   DS    CL6     12   71    6  A  U N             T        Y              
PUPNAM2H DS    CL8                                                              
PUPNAM2  DS    CL9     13    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     23    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   47    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   55    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   63    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   71    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL53    24    5   53  A  P N             T        Y              
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2128 BYTES                            
