*          DATA SET NEPUPF4D   AT LEVEL 007 AS OF 03/16/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T322F4D      DATE 03/16/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
PUPCLIH  DS    CL8                                                              
PUPCLI   DS    CL8      6   10    8  A  U H             T    I   Y   10         
PUPCLIX  DS    CL8                                                              
PUPCLINH DS    CL8                                                              
PUPCLIN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
PUPNETH  DS    CL8                                                              
PUPNET   DS    CL8      7   10    8  A  U H             T        Y   20         
PUPNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   20    7  A  P H             T        Y              
PUPDPTH  DS    CL8                                                              
PUPDPT   DS    CL8      7   28    8  A  U H             T        Y   30         
PUPDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   38    4  A  P H             T        Y              
PUPPLANH DS    CL8                                                              
PUPPLAN  DS    CL4      7   46    4  A  U H             T        Y   40         
PUPPLANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
PUPDEMOH DS    CL8                                                              
PUPDEMO  DS    CL26     8   10   26  A  U N             T        Y   49         
PUPDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P N             T        Y              
PUPLENH  DS    CL8                                                              
PUPLEN   DS    CL8      8   46    8  A  U N             T        Y   30         
PUPLENX  DS    CL8                                                              
PUPGUARH DS    CL8                                                              
PUPGUAR  DS    CL19     8   61   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL42    10    2   42  A  P N             T        Y              
PUPTITRH DS    CL8                                                              
PUPTITR  DS    CL35    10   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL42    11    2   42  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL35    11   46   35  A  P N             T        Y              
PUPPERH  DS    CL8                                                              
PUPPER   DS    CL6     13    2    6  A  P N             T        Y              
PUPDATAH DS    CL8                                                              
PUPDATA  DS    CL71    13    9   71  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL71    14    9   71  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL71    15    9   71  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL71    16    9   71  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL71    18    9   71  A  P H             T        Y              
PUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 960  BYTES                            
