*          DATA SET NERESF1D   AT LEVEL 009 AS OF 12/16/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T321F1D      DATE 12/16/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
PURSRCEH DS    CL8                                                              
PURSRCE  DS    CL24     7   15   24  A   U    N         T        Y   10         
PURSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   60    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    N         T        Y              
PURBOOKH DS    CL8                                                              
PURBOOK  DS    CL24     8   15   24  A   U    N         T        Y   20         
PURBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      9    2    5  A   P    N         T        Y              
PURDEMOH DS    CL8                                                              
PURDEMO  DS    CL50     9   15   50  A   U    N         T        Y   30         
PURDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     11    2    8  A   P    N         T        Y              
PURNETH  DS    CL8                                                              
PURNET   DS    CL7     11   15    7  A   U    N         T        Y   40         
PURNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   35    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   45    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   15    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   35    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   45    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
PUROPTH  DS    CL8                                                              
PUROPT   DS    CL40    14   15   40  A   U    N         T        Y  100         
PUROPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     15    2    9  A   P    N         T        Y              
PURTITLH DS    CL8                                                              
PURTITL  DS    CL40    15   15   40  A   U    N         T        Y   70         
PURTITLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
PURFILTH DS    CL8                                                              
PURFILT  DS    CL40    16   15   40  A   U    N         T        Y   75         
PURFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17    2   10  A   P    N         T        Y              
PURSTIMH DS    CL8                                                              
PURSTIM  DS    CL7     17   15    7  A   U    N         T        Y  110         
PURSTIMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18    2    8  A   P    N         T        Y              
PURETIMH DS    CL8                                                              
PURETIM  DS    CL7     18   15    7  A   U    N         T        Y  120         
PURETIMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   15    1  A   U    N         T        Y              
PURLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PURWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 751  BYTES                            
