*          DATA SET NERESALL2  AT LEVEL 001 AS OF 07/29/86                      
       ++INCLUDE DDSPOOLD                                                       
       ++INCLUDE DDSPLWORKD                                                     
       ++INCLUDE NERESWORKD                                                     
         ORG   DBLOCKA                                                          
       ++INCLUDE DEDBLOCK                                                       
       ++INCLUDE DDBIGBOX                                                       
       ++INCLUDE NERESFFD                                                       
       ++INCLUDE DDGENTWA                                                       
T321FFD  DSECT                                                                  
         ORG   CONHEAD+2304                                                     
SVUSRNAM DS    CL33                SAVE REP NAME                                
SVUSRADD DS    CL33                SAVE REP ADDRESS                             
         DS    200C                SPARE                                        
