*          DATA SET NERESF3D   AT LEVEL 004 AS OF 11/25/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T321F3D      DATE 11/25/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A   P    N         T        Y              
LAYSRCEH DS    CL8                                                              
LAYSRCE  DS    CL24     7   22   24  A   U    N         T        Y   10         
LAYSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  A   P    N         T        Y              
LAYPSTRH DS    CL8                                                              
LAYPSTR  DS    CL8      8   22    8  A   U    N         T        Y   12         
LAYPSTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     9    2   17  A   P    N         T        Y              
LAYPENDH DS    CL8                                                              
LAYPEND  DS    CL8      9   22    8  A   U    N         T        Y   14         
LAYPENDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    10    2   18  L   P    N         T        Y              
LAYBOOKH DS    CL8                                                              
LAYBOOK  DS    CL24    10   22   24  A   U    N         T        Y   20         
LAYBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    11    2   17  L   P    N         T        Y              
LAYDEMOH DS    CL8                                                              
LAYDEMO  DS    CL44    11   22   44  A   U    N         T        Y   30         
LAYDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L   P    N         T        Y              
LAYNETH  DS    CL8                                                              
LAYNET   DS    CL7     13   22    7  A   U    N         T        Y   40         
LAYNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   32    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   42    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   52    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   62    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   72    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15    2   10  L   P    N         T        Y              
LAYDAYH  DS    CL8                                                              
LAYDAY   DS    CL8     15   22    8  A   U    N         T        Y   50         
LAYDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16    2   10  L   P    N         T        Y              
LAYSTRTH DS    CL8                                                              
LAYSTRT  DS    CL8     16   22    8  A   U    N         T        Y  110         
LAYSTRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17    2   10  L   P    N         T        Y              
LAYENDH  DS    CL8                                                              
LAYEND   DS    CL8     17   22    8  A   U    N         T        Y  120         
LAYENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19    2    7  A   P    N         T        Y              
LAYOPTH  DS    CL8                                                              
LAYOPT   DS    CL40    19   22   40  A   U    N         T        Y  100         
LAYOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     20    2    9  A   P    N         T        Y              
LAYTITLH DS    CL8                                                              
LAYTITL  DS    CL40    20   22   40  A   U    N         T        Y   70         
LAYTITLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     21    2    9  A   P    N         T        Y              
LAYFILTH DS    CL8                                                              
LAYFILT  DS    CL40    21   22   40  A   U    N         T        Y   75         
LAYFILTX DS    CL8                                                              
LAYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 928  BYTES                            
