*          DATA SET NERWBLOCKD AT LEVEL 002 AS OF 02/15/85                      
         DS    0D                                                               
NERWBLOK DS    0C                                                               
         SPACE 1                                                                
         DS    D                   START OF BLOCK                               
RWAIO    DS    A                   A(REPORT WRITER RECORD)                      
RWANETB  DS    A                   A(NETSYSD + NETBLOCK)                        
RWSTRTWS DS    A                   A(BEGIN OF WORKING STORAGE)                  
RWENDWS  DS    A                   A(END OF WORKING STORAGE)                    
*                                                                               
RWCURAIR DS    A                   A(CURRENT INTERNAL RECORD)                   
RWCURITB DS    A                   CURRENT TABLE ENTRY                          
RWBLKEND DS    CL1                                                              
