*          DATA SET NESFMF5D   AT LEVEL 005 AS OF 02/04/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF5D      DATE 02/04/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
REPMEDH  DS    CL8                                                              
REPMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   20    3  A  P H             T        Y              
REPREPH  DS    CL8                                                              
REPREP   DS    CL3      5   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
REPNAMEH DS    CL8                                                              
REPNAME  DS    CL22     7   18   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
REPSTADH DS    CL8                                                              
REPSTAD  DS    CL24     8   18   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A  P N             T        Y              
REPCITYH DS    CL8                                                              
REPCITY  DS    CL24     9   18   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
REPSTATH DS    CL8                                                              
REPSTAT  DS    CL3     10   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
REPBZIPH DS    CL8                                                              
REPBZIP  DS    CL10    11   18   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
REPCOUNH DS    CL8                                                              
REPCOUN  DS    CL1     12   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
REPNTWKH DS    CL8                                                              
REPNTWK  DS    CL1     13   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   18    1  A  U N             T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 328  BYTES                            
