*          DATA SET NESFMD0D   AT LEVEL 012 AS OF 01/11/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CD0D      DATE 01/11/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
AGRMEDH  DS    CL8                                                              
AGRMED   DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
AGRCLIH  DS    CL8                                                              
AGRCLI   DS    CL8      5   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
AGRPROH  DS    CL8                                                              
AGRPRO   DS    CL8      6   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   20    3  A  P N             T        Y              
AGRESTH  DS    CL8                                                              
AGREST   DS    CL8      6   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
AGRDPTH  DS    CL8                                                              
AGRDPT   DS    CL8      6   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   56   12  A  P N             T        Y              
AGRSTPH  DS    CL8                                                              
AGRSTP   DS    CL4      6   70    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8    9   11  A  P N             T        Y              
AGRLIN1H DS    CL8                                                              
AGRLIN1  DS    CL30     8   22   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   13    7  A  P N             T        Y              
AGRLIN2H DS    CL8                                                              
AGRLIN2  DS    CL30     9   22   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   13    7  A  P N             T        Y              
AGRLIN3H DS    CL8                                                              
AGRLIN3  DS    CL30    10   22   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   13    7  A  P N             T        Y              
AGRLIN4H DS    CL8                                                              
AGRLIN4  DS    CL30    11   22   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    8   12  A  P N             T        Y              
AGRPCTH  DS    CL8                                                              
AGRPCT   DS    CL10    13   22   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   16    4  A  P N             T        Y              
AGRBASH  DS    CL8                                                              
AGRBAS   DS    CL2     14   22    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL27    14   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    15    6   14  A  P N             T        Y              
AGREFDH  DS    CL8                                                              
AGREFD   DS    CL6     15   22    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   11    9  A  P N             T        Y              
AGRKDTH  DS    CL8                                                              
AGRKDT   DS    CL6     16   22    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   12    8  A  P N             T        Y              
AGRGSTH  DS    CL8                                                              
AGRGST   DS    CL2     17   22    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    19    2   18  A  P N             T        Y              
AGRRCAH  DS    CL8                                                              
AGRRCA   DS    CL14    19   22   14  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    20    6   14  A  P N             T        Y              
AGRCMAH  DS    CL8                                                              
AGRCMA   DS    CL14    20   22   14  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   22    2  A  U N             T        Y              
AGRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
AGRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 704  BYTES                            
