*          DATA SET NESFMF7D   AT LEVEL 005 AS OF 11/08/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF7D      DATE 11/08/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
PGMNETH  DS    XL8                                                              
PGMNET   DS    CL4      5   11    4  A  U N             T        Y    0         
PGMNETX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
PGMPGRH  DS    XL8                                                              
PGMPGR   DS    CL6      5   29    6  A  U N             T        Y    0         
PGMPGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P N             T        Y              
PGMEDTH  DS    XL8                                                              
PGMEDT   DS    CL8      5   48    8  A  U N             T        Y    0         
PGMEDTX  DS    XL8                                                              
PGMNOH   DS    XL8                                                              
PGMNO    DS    CL2      5   62    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   72    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
PGMDAYH  DS    XL8                                                              
PGMDAY   DS    CL4      7   15    4  A  U N             T        Y    0         
PGMDAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7   35    5  A  P N             T        Y              
PGMTIMEH DS    XL8                                                              
PGMTIME  DS    CL11     7   46   11  A  U N             T        Y    0         
PGMTIMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   60   10  A  P N             T        Y              
PGMSDATH DS    XL8                                                              
PGMSDAT  DS    CL8      7   71    8  A  U N             T        Y    0         
PGMSDATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
PGMNAMEH DS    XL8                                                              
PGMNAME  DS    CL16     8   15   16  A  U N             T        Y    0         
PGMNAMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      8   35    9  A  P N             T        Y              
PGMSHRH  DS    XL8                                                              
PGMSHR   DS    CL7      8   46    7  A  U N             T        Y    0         
PGMSHRX  DS    XL8                                                              
PGMGAAH  DS    XL8                                                              
PGMGAA   DS    CL3      8   55    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   60    7  A  P N             T        Y              
PGMFLTRH DS    XL8                                                              
PGMFLTR  DS    CL4      8   71    4  A  U N             T        Y    0         
PGMFLTRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
PGMROTH  DS    XL8                                                              
PGMROT   DS    CL16     9   15   16  A  U N             T        Y    0         
PGMROTX  DS    XL8                                                              
PGMNCSH  DS    XL8                                                              
PGMNCS   DS    CL7      9   35    7  A  P N             T        Y              
PGMNTIH  DS    XL8                                                              
PGMNTI   DS    CL5      9   43    5  N  U N             T        Y    0         
PGMNTIX  DS    XL8                                                              
PGMCSNH  DS    XL8                                                              
PGMCSN   DS    CL10     9   49   10  N  U N             T        Y    0         
PGMCSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9   60    7  A  P N             T        Y              
PGMDYPTH DS    XL8                                                              
PGMDYPT  DS    CL2      9   71    2  A  U N             T        Y    0         
PGMDYPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PGMCNTH  DS    XL8                                                              
PGMCNT   DS    CL3     10   15    3  A  U N             T        Y    0         
PGMCNTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     10   25    3  A  P N             T        Y              
PGMNEWH  DS    XL8                                                              
PGMNEW   DS    CL1     10   30    1  A  U N             T        Y    0         
PGMNEWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10   35    9  A  P N             T        Y              
PGMTYPH  DS    XL8                                                              
PGMTYP   DS    CL2     10   46    2  A  U N             T        Y    0         
PGMTYPX  DS    XL8                                                              
PGMSTYPH DS    XL8                                                              
PGMSTYP  DS    CL4     10   49    4  A  U N             T        Y    0         
PGMSTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10   60    9  A  P N             T        Y              
PGMVWSCH DS    XL8                                                              
PGMVWSC  DS    CL2     10   71    2  A  P N             T        Y    0         
PGMVWSCX DS    XL8                                                              
PGMCVTYH DS    XL8                                                              
PGMCVTY  DS    CL2     10   74    2  A  P N             T        Y    0         
PGMCVTYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
PGMOTHH  DS    XL8                                                              
PGMOTH   DS    CL44    11   15   44  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   60    8  A  P N             T        Y              
PGMNCDEH DS    XL8                                                              
PGMNCDE  DS    CL6     11   71    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   10    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   66    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   73    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
PGMW1H   DS    XL8                                                              
PGMW1    DS    CL4     13   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   17    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   31    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   45    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   52    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   59    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   66    4  A  U N             T        Y              
PGMW10H  DS    XL8                                                              
PGMW10   DS    CL4     13   73    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
PGMM1H   DS    XL8                                                              
PGMM1    DS    CL4     14   10    4  A  U N             T        Y              
PGMM2H   DS    XL8                                                              
PGMM2    DS    CL4     14   17    4  A  U N             T        Y              
PGMM3H   DS    XL8                                                              
PGMM3    DS    CL4     14   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   31    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   45    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   52    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   59    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   66    4  A  U N             T        Y              
PGMM10H  DS    XL8                                                              
PGMM10   DS    CL4     14   73    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   10    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   17    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   24    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   31    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   38    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   45    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   52    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   59    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   66    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   73    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16   10    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   45    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   59    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   66    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
PGMW11H  DS    XL8                                                              
PGMW11   DS    CL4     17   17    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   45    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   59    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   17    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   38    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   45    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   59    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   17    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   24    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19   38    5  A  P N             T        Y              
PGMC1H   DS    XL8                                                              
PGMC1    DS    CL4     19   45    4  A  U N             T        Y    1         
PGMC1X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   52    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   59    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   66    4  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   13    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   17    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   25    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   31    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   39    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   45    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   54    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   59    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   67    5  A  P N             T        Y              
PGMVPH2H DS    XL8                                                              
PGMVPH2  DS    CL4     20   73    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   13    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   17    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   25    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   31    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   39    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   45    4  A  U N             T        Y              
PGMCDENH DS    XL8                                                              
PGMCDEN  DS    CL6     21   64    6  A  P N             T        Y              
PGMCDEFH DS    XL8                                                              
PGMCDEF  DS    CL6     21   71    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    2   10  A  P N             T        Y              
PGMUVPHH DS    XL8                                                              
PGMUVPH  DS    CL66    22   13   66  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
PGMSPECH DS    XL8                                                              
PGMSPEC  DS    CL16    23   13   16  A  U N             T        Y              
PGMACTVH DS    XL8                                                              
PGMACTV  DS    CL30    23   43   30  A  P N             T        Y              
PGMAEH   DS    XL8                                                              
PGMAE    DS    CL5     23   75    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24   16   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24   30   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24   44   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    24   63   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
PGMLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
PGMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2344 BYTES                            
