*          DATA SET NESFME6AD  AT LEVEL 009 AS OF 05/13/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CE6D      DATE 05/13/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
NPRNETH  DS    CL8                                                              
NPRNET   DS    CL4      5   11    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
NPRPGRH  DS    CL8                                                              
NPRPGR   DS    CL6      5   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  A  P N             T        Y              
NPREDTH  DS    CL8                                                              
NPREDT   DS    CL8      5   48    8  A  U N             T        Y              
NPRNOH   DS    CL8                                                              
NPRNO    DS    CL2      5   62    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   72    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
NPRNCDH  DS    CL8                                                              
NPRNCD   DS    CL6      7   13    6  A  U N             T        Y              
NPRFSTH  DS    CL8                                                              
NPRFST   DS    CL1      9    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     9    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   17    1  A  P N             T        Y              
NPRD1H   DS    CL8                                                              
NPRD1    DS    CL7      9   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   43    1  A  P N             T        Y              
NPRD2H   DS    CL8                                                              
NPRD2    DS    CL7      9   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   69    1  A  P N             T        Y              
NPRD3H   DS    CL8                                                              
NPRD3    DS    CL7      9   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    10    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     10   17    1  A  P N             T        Y              
NPRD4H   DS    CL8                                                              
NPRD4    DS    CL7     10   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     10   43    1  A  P N             T        Y              
NPRD5H   DS    CL8                                                              
NPRD5    DS    CL7     10   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     10   69    1  A  P N             T        Y              
NPRD6H   DS    CL8                                                              
NPRD6    DS    CL7     10   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    11    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11   17    1  A  P N             T        Y              
NPRD7H   DS    CL8                                                              
NPRD7    DS    CL7     11   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11   43    1  A  P N             T        Y              
NPRD8H   DS    CL8                                                              
NPRD8    DS    CL7     11   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11   69    1  A  P N             T        Y              
NPRD9H   DS    CL8                                                              
NPRD9    DS    CL7     11   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    12    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     12   17    1  A  P N             T        Y              
NPRD10H  DS    CL8                                                              
NPRD10   DS    CL7     12   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     12   43    1  A  P N             T        Y              
NPRD11H  DS    CL8                                                              
NPRD11   DS    CL7     12   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     12   69    1  A  P N             T        Y              
NPRD12H  DS    CL8                                                              
NPRD12   DS    CL7     12   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     13   17    1  A  P N             T        Y              
NPRD13H  DS    CL8                                                              
NPRD13   DS    CL7     13   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     13   43    1  A  P N             T        Y              
NPRD14H  DS    CL8                                                              
NPRD14   DS    CL7     13   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     13   69    1  A  P N             T        Y              
NPRD15H  DS    CL8                                                              
NPRD15   DS    CL7     13   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    14    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     14   17    1  A  P N             T        Y              
NPRD16H  DS    CL8                                                              
NPRD16   DS    CL7     14   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     14   43    1  A  P N             T        Y              
NPRD17H  DS    CL8                                                              
NPRD17   DS    CL7     14   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     14   69    1  A  P N             T        Y              
NPRD18H  DS    CL8                                                              
NPRD18   DS    CL7     14   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15   17    1  A  P N             T        Y              
NPRD19H  DS    CL8                                                              
NPRD19   DS    CL7     15   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15   43    1  A  P N             T        Y              
NPRD20H  DS    CL8                                                              
NPRD20   DS    CL7     15   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15   69    1  A  P N             T        Y              
NPRD21H  DS    CL8                                                              
NPRD21   DS    CL7     15   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    16    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   17    1  A  P N             T        Y              
NPRD22H  DS    CL8                                                              
NPRD22   DS    CL7     16   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   43    1  A  P N             T        Y              
NPRD23H  DS    CL8                                                              
NPRD23   DS    CL7     16   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   69    1  A  P N             T        Y              
NPRD24H  DS    CL8                                                              
NPRD24   DS    CL7     16   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17   17    1  A  P N             T        Y              
NPRD25H  DS    CL8                                                              
NPRD25   DS    CL7     17   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17   43    1  A  P N             T        Y              
NPRD26H  DS    CL8                                                              
NPRD26   DS    CL7     17   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17   69    1  A  P N             T        Y              
NPRD27H  DS    CL8                                                              
NPRD27   DS    CL7     17   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18   17    1  A  P N             T        Y              
NPRD28H  DS    CL8                                                              
NPRD28   DS    CL7     18   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18   43    1  A  P N             T        Y              
NPRD29H  DS    CL8                                                              
NPRD29   DS    CL7     18   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18   69    1  A  P N             T        Y              
NPRD30H  DS    CL8                                                              
NPRD30   DS    CL7     18   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19   17    1  A  P N             T        Y              
NPRD31H  DS    CL8                                                              
NPRD31   DS    CL7     19   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19   43    1  A  P N             T        Y              
NPRD32H  DS    CL8                                                              
NPRD32   DS    CL7     19   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19   69    1  A  P N             T        Y              
NPRD33H  DS    CL8                                                              
NPRD33   DS    CL7     19   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    20    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   17    1  A  P N             T        Y              
NPRD34H  DS    CL8                                                              
NPRD34   DS    CL7     20   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   43    1  A  P N             T        Y              
NPRD35H  DS    CL8                                                              
NPRD35   DS    CL7     20   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   69    1  A  P N             T        Y              
NPRD36H  DS    CL8                                                              
NPRD36   DS    CL7     20   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21   17    1  A  P N             T        Y              
NPRD37H  DS    CL8                                                              
NPRD37   DS    CL7     21   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21   43    1  A  P N             T        Y              
NPRD38H  DS    CL8                                                              
NPRD38   DS    CL7     21   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21   69    1  A  P N             T        Y              
NPRD39H  DS    CL8                                                              
NPRD39   DS    CL7     21   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    22    4   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     22   17    1  A  P N             T        Y              
NPRD40H  DS    CL8                                                              
NPRD40   DS    CL7     22   19    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   30   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     22   43    1  A  P N             T        Y              
NPRD41H  DS    CL8                                                              
NPRD41   DS    CL7     22   45    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   56   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     22   69    1  A  P N             T        Y              
NPRD42H  DS    CL8                                                              
NPRD42   DS    CL7     22   71    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL26    23    2   26  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    23   33   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26    24    2   26  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    24   33   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
NPRLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
NPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2496 BYTES                            
