*          DATA SET NESFMAFD   AT LEVEL 001 AS OF 09/05/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CAFD      DATE 09/05/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
CMSMEDH  DS    XL8                                                              
CMSMED   DS    CL1      6   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
CMSCLTH  DS    XL8                                                              
CMSCLT   DS    CL3      7   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
CMSPRDH  DS    XL8                                                              
CMSPRD   DS    CL3      8   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
CMSNETH  DS    XL8                                                              
CMSNET   DS    CL4      9   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  A  P H             T        Y              
CMSPERH  DS    XL8                                                              
CMSPER   DS    CL17    10   10   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
CMSTIMEH DS    XL8                                                              
CMSTIME  DS    CL3     11   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    11   24   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   21    1  A  U N             T        Y              
CMSLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CMSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 248  BYTES                            
