*          DATA SET NESFMB7D   AT LEVEL 008 AS OF 04/19/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CB7D      DATE 04/19/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFSMEDH  DS    CL8                                                              
SFSMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL2      5   20    2  A  P H             T        Y              
SFSIDH   DS    CL8                                                              
SFSID    DS    CL1      5   28    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      5   38    4  A  P H             T        Y              
SFSCODEH DS    CL8                                                              
SFSCODE  DS    CL4      5   46    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16     5   56   16  A  P N             T        Y              
SFSSTRTH DS    CL8                                                              
SFSSTRT  DS    CL6      5   73    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SFSBK1H  DS    CL8                                                              
SFSBK1   DS    CL12     7   11   12  A  P N             T        Y              
SFSBK1LH DS    CL8                                                              
SFSBK1L  DS    CL3      7   24    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   32    4  A  P N             T        Y              
SFSNM1H  DS    CL8                                                              
SFSNM1   DS    CL24     7   38   24  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SFSBK2H  DS    CL8                                                              
SFSBK2   DS    CL12     8   11   12  A  P N             T        Y              
SFSBK2LH DS    CL8                                                              
SFSBK2L  DS    CL3      8   24    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   32    4  A  P N             T        Y              
SFSNM2H  DS    CL8                                                              
SFSNM2   DS    CL24     8   38   24  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
SFSNEWH  DS    CL8                                                              
SFSNEW   DS    CL8     10   16    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     10   25    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     10   34    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     10   43    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     10   52    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     10   61    8  A  U H             T        Y              
SFSENDLH DS    CL8                                                              
SFSENDL  DS    CL8     10   70    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     10   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    12    2   16  A  P N             T        Y              
SFSLISTH DS    CL8                                                              
SFSLIST  DS    CL6     14    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   74    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   18    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   50    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   66    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   74    6  A  P N             T        Y              
SFSPFKH  DS    CL8                                                              
SFSPFK   DS    CL77    24    2   77  L  P H             T        Y              
SFSLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SFSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1952 BYTES                            
