*          DATA SET NESFM96D   AT LEVEL 003 AS OF 03/04/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C96D      DATE 03/04/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MNTMEDH  DS    XL8                                                              
MNTMED   DS    CL1      5   11    1  A  U N             T    I   Y              
MNTMDNH  DS    XL8                                                              
MNTMDN   DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
MNTCLTH  DS    XL8                                                              
MNTCLT   DS    CL3      5   46    3  A  U N             T        Y              
MNTCLNH  DS    XL8                                                              
MNTCLN   DS    CL16     5   56   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
MNTPRDH  DS    XL8                                                              
MNTPRD   DS    CL3      6   11    3  A  U N             T        Y              
MNTPDNH  DS    XL8                                                              
MNTPDN   DS    CL16     6   20   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
MNTPTRH  DS    XL8                                                              
MNTPTR   DS    CL3      6   46    3  A  U N             T        Y              
MNTPRNH  DS    XL8                                                              
MNTPRN   DS    CL19     6   56   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
MNTESTH  DS    XL8                                                              
MNTEST   DS    CL3      7   11    3  A  U N             T        Y              
MNTESDH  DS    XL8                                                              
MNTESD   DS    CL17     7   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
MNTSTAH  DS    XL8                                                              
MNTSTA   DS    CL5      7   46    5  A  U N             T        Y              
MNTMKNH  DS    XL8                                                              
MNTMKN   DS    CL19     7   56   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
MNTDATH  DS    XL8                                                              
MNTDAT   DS    CL8      8   11    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   38    6  A  P H             T        Y              
MNTMONH  DS    XL8                                                              
MNTMON   DS    CL6      8   46    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
MNTDMEH  DS    XL8                                                              
MNTDME   DS    CL1     10   11    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   40    6  A  P N             T        Y              
MNTDCLH  DS    XL8                                                              
MNTDCL   DS    CL3     10   49    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
MNTDPRH  DS    XL8                                                              
MNTDPR   DS    CL3     11   11    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   40    7  A  P N             T        Y              
MNTDP2H  DS    XL8                                                              
MNTDP2   DS    CL3     11   49    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
MNTDESH  DS    XL8                                                              
MNTDES   DS    CL3     12   11    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   40    7  A  P N             T        Y              
MNTDSTH  DS    XL8                                                              
MNTDST   DS    CL5     12   49    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
MNTDPKH  DS    XL8                                                              
MNTDPK   DS    CL3     13   11    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   40    6  A  P N             T        Y              
MNTDPGH  DS    XL8                                                              
MNTDPG   DS    CL4     13   49    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P N             T        Y              
MNTDMTYH DS    XL8                                                              
MNTDMTY  DS    CL1     14   11    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   40    8  A  P N             T        Y              
MNTDPTH  DS    XL8                                                              
MNTDPT   DS    CL1     14   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
MNTMKTH  DS    XL8                                                              
MNTMKT   DS    CL4     15   11    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   40    4  A  P N             T        Y              
MNTSREPH DS    XL8                                                              
MNTSREP  DS    CL4     15   49    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
MNTPAYH  DS    XL8                                                              
MNTPAY   DS    CL12    16   11   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   40    4  A  P N             T        Y              
MNTPDTH  DS    XL8                                                              
MNTPDT   DS    CL8     16   49    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
MNTINVH  DS    XL8                                                              
MNTINV   DS    CL10    17   11   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   40    6  A  P N             T        Y              
MNTSUBMH DS    XL8                                                              
MNTSUBM  DS    CL1     17   49    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
MNTINVGH DS    XL8                                                              
MNTINVG  DS    CL12    18   11   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
MNTINVNH DS    XL8                                                              
MNTINVN  DS    CL12    19   11   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
MNTERRH  DS    XL8                                                              
MNTERR   DS    CL2     20   11    2  A  U N             T        Y              
MNTERR2H DS    XL8                                                              
MNTERR2  DS    CL2     20   26    2  A  U N             T        Y              
MNTERR3H DS    XL8                                                              
MNTERR3  DS    CL2     20   41    2  A  U N             T        Y              
MNTDAH   DS    XL8                                                              
MNTDA    DS    CL12    24    2   12  A  P N             T        Y              
MNTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 928  BYTES                            
