*          DATA SET NESFMBAD   AT LEVEL 008 AS OF 04/07/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CBAD      DATE 04/07/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
LDTCLTH  DS    CL8                                                              
LDTCLT   DS    CL3      5   10    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
LDTCDEH  DS    CL8                                                              
LDTCDE   DS    CL4      5   26    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   65    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19     7    2   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7   29   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7   52   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19     8    2   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     8   24   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     8   47   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65     9   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    10   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    11   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    12   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    13   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    14   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    15   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    16   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    17   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    18   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    19   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    20   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    21   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    22   11   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL65    23   11   65  A  P N             T        Y              
LDTTAGH  DS    CL8                                                              
LDTTAG   DS    CL1     24    2    1  A  P N             T        Y              
LDTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
LDTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1480 BYTES                            
