*          DATA SET NESFMB4D   AT LEVEL 001 AS OF 02/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CB4D      DATE 02/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
ADLMEDH  DS    CL8                                                              
ADLMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  L  P N             T        Y              
ADLSTAH  DS    CL8                                                              
ADLSTA   DS    CL8      5   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   38    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7    7    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   17    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   39    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL2      7   65    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      7   70    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8    7    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      8   17    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      8   39    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL2      8   65    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   70    8  L  P H             T        Y              
ADLSELH  DS    CL8                                                              
ADLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
ADLTAGH  DS    CL8                                                              
ADLTAG   DS    CL1     24    2    1  A  P N             T        Y              
ADLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
ADLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1624 BYTES                            
