*          DATA SET NESFMDFD   AT LEVEL 003 AS OF 07/23/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CDFD      DATE 07/23/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
SFRMDH   DS    CL8                                                              
SFRMD    DS    CL2      5   10    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
SFRCLIH  DS    CL8                                                              
SFRCLI   DS    CL3      5   28    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   34    2  A   P    N         T        Y              
SFRIDDH  DS    CL8                                                              
SFRIDD   DS    CL4      5   37    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   65    1  A   P    N         T        Y              
SFRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 88   BYTES                            
