*          DATA SET NESFM9AD   AT LEVEL 001 AS OF 04/03/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C9AD      DATE 04/03/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PXCMEDH  DS    XL8                                                              
PXCMED   DS    CL1      5   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PXCCLIH  DS    XL8                                                              
PXCCLI   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
PXCPRDH  DS    XL8                                                              
PXCPRD   DS    CL3      5   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P H             T        Y              
PXCESTH  DS    XL8                                                              
PXCEST   DS    CL3      6   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P H             T        Y              
PXCNETH  DS    XL8                                                              
PXCNET   DS    CL4      6   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   21   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   44    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   63   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   21   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   44    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   63   15  A  P N             T        Y              
PXCPRG1H DS    XL8                                                              
PXCPRG1  DS    CL17    10    2   17  A  U N             T        Y              
PXCDAT1H DS    XL8                                                              
PXCDAT1  DS    CL17    10   21   17  A  U N             T        Y              
PXCPRG2H DS    XL8                                                              
PXCPRG2  DS    CL17    10   44   17  A  U N             T        Y              
PXCDAT2H DS    XL8                                                              
PXCDAT2  DS    CL17    10   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   63   17  A  U N             T        Y              
PXCENDH  DS    XL8                                                              
PXCEND   DS    CL1     24   78    1  A  P N             T        Y              
PXCLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PXCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1704 BYTES                            
