*          DATA SET NESFME0D   AT LEVEL 001 AS OF 10/14/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CE0D      DATE 10/14/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFCMEDH  DS    XL8                                                              
SFCMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFCMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SFCCLIH  DS    XL8                                                              
SFCCLI   DS    CL3      5   28    3  A  U H             T        Y    0         
SFCCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P N             T        Y              
SFCSIDH  DS    XL8                                                              
SFCSID   DS    CL2      5   47    2  A  U H             T        Y    0         
SFCSIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   50    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      7    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    5    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   11    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   25    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   47    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   61    6  A  P N             T        Y              
SFCLINH  DS    XL8                                                              
SFCLIN   DS    CL79     8    2   79  A  P N             T        Y    0         
SFCLINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
SFCLSTH  DS    XL8                                                              
SFCLST   DS    CL79    23    2   79  A  P N             T        Y    0         
SFCLSTX  DS    XL8                                                              
SFCFILLH DS    XL8                                                              
SFCFILL  DS    CL79    24    2   79  A  P N             T        Y    0         
SFCFILLX DS    XL8                                                              
SFCLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SFCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1808 BYTES                            
