*          DATA SET NESFMC3D   AT LEVEL 003 AS OF 05/30/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CC3D      DATE 05/30/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PRDMEDH  DS    XL8                                                              
PRDMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PRDCLTH  DS    XL8                                                              
PRDCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
PRDPRDH  DS    XL8                                                              
PRDPRD   DS    CL3      5   47    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
PRDNAMEH DS    XL8                                                              
PRDNAME  DS    CL20     7   18   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
PRDACCTH DS    XL8                                                              
PRDACCT  DS    CL5      9   18    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
PRDCLASH DS    XL8                                                              
PRDCLAS  DS    CL2     10   18    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   39   12  A  P N             T        Y              
PRDLOCKH DS    XL8                                                              
PRDLOCK  DS    CL1     10   52    1  A  U N             T        Y              
PRDLDATH DS    XL8                                                              
PRDLDAT  DS    CL8     10   56    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
PRDBNAMH DS    XL8                                                              
PRDBNAM  DS    CL30    12   18   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   10    7  A  P N             T        Y              
PRDADD2H DS    XL8                                                              
PRDADD2  DS    CL30    13   18   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   10    7  A  P N             T        Y              
PRDADD3H DS    XL8                                                              
PRDADD3  DS    CL30    14   18   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   10    7  A  P N             T        Y              
PRDADD4H DS    XL8                                                              
PRDADD4  DS    CL30    15   18   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    17    2   16  A  P N             T        Y              
PRDOAFH  DS    XL8                                                              
PRDOAF   DS    CL5     17   19    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    18    2   29  A  P N             T        Y              
PRDBBASH DS    XL8                                                              
PRDBBAS  DS    CL5     18   32    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   39    8  A  P N             T        Y              
PRDCPCTH DS    XL8                                                              
PRDCPCT  DS    CL9     18   48    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   59   10  A  P N             T        Y              
PRDCBASH DS    XL8                                                              
PRDCBAS  DS    CL5     18   70    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   20   15  A  P N             T        Y              
PRDEDATH DS    XL8                                                              
PRDEDAT  DS    CL8     19   37    8  A  U N             T        Y              
PRDDSC1H DS    XL8                                                              
PRDDSC1  DS    CL20    21    2   20  A  P N             T        Y              
PRDUSR1H DS    XL8                                                              
PRDUSR1  DS    CL32    21   26   32  A  P N             T        Y              
PRDDSC2H DS    XL8                                                              
PRDDSC2  DS    CL20    22    2   20  A  P N             T        Y              
PRDUSR2H DS    XL8                                                              
PRDUSR2  DS    CL16    22   26   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   78    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     24    2    7  A  P N             T        Y              
PRDOPTSH DS    XL8                                                              
PRDOPTS  DS    CL67    24   10   67  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   79    1  A  P N             T        Y              
PRDLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
