*          DATA SET NESFMF1D   AT LEVEL 018 AS OF 02/09/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF1D      DATE 02/09/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
COMMEDH  DS    CL8                                                              
COMMED   DS    CL2      5   10    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
COMCLTH  DS    CL8                                                              
COMCLT   DS    CL3      5   28    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A   P    N         T        Y              
COMPRDH  DS    CL8                                                              
COMPRD   DS    CL3      5   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   55    8  A   P    N         T        Y              
COMESTH  DS    CL8                                                              
COMEST   DS    CL3      5   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    N         T        Y              
COMNTWKH DS    CL8                                                              
COMNTWK  DS    CL4      6   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      6   20    3  A   P    N         T        Y              
COMDPTH  DS    CL8                                                              
COMDPT   DS    CL3      6   28    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      6   38    3  A   P    N         T        Y              
COMPKGH  DS    CL8                                                              
COMPKG   DS    CL3      6   43    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
COMIDH   DS    CL8                                                              
COMID    DS    CL6      7   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   65    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
COMCOMH  DS    CL8                                                              
COMCOM   DS    CL50    12    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    13    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    14    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    15    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    16    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    17    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    18    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    19    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    20    2   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    21    2   50  A   U    N         T        Y              
COMTABFH DS    CL8                                                              
COMTABF  DS    CL1     22    2    1  A   P    N         T        Y              
COMLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 829  BYTES                            
