*          DATA SET NESFMB1D   AT LEVEL 002 AS OF 05/18/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CB1D      DATE 05/18/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
RESCDEH  DS    CL8                                                              
RESCDE   DS    CL3      5   11    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
RESOPTH  DS    CL8                                                              
RESOPT   DS    CL50     6   11   50  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   72    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
RESREAH  DS    CL8                                                              
RESREA   DS    CL50     8   15   50  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
RESLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
RESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 200  BYTES                            
