*          DATA SET NESFMCFCD  AT LEVEL 002 AS OF 11/01/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CCFD      DATE 11/01/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
DATPNMH  DS    CL8                                                              
DATPNM   DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   10    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   18    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   37    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   45    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   53    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   10    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     7   18   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   37    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   45    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     7   53   16  A  P N             T        Y              
DATPGM1H DS    CL8                                                              
DATPGM1  DS    CL1      8    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   18   16  A  U N             T        Y              
DATPGM2H DS    CL8                                                              
DATPGM2  DS    CL5      8   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     10    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    10   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    10   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    11   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    11   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    12   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    12   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    13   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    13   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     14    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    21   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    21   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    22   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   45    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    22   53   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    1    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    3    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    23   18   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   45    5  A  U N             T        Y              
DATENDFH DS    CL8                                                              
DATENDF  DS    CL16    23   53   16  A  U N             T        Y              
DATPFKH  DS    CL8                                                              
DATPFK   DS    CL70    24    2   70  A  P N             T        Y              
DATLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
DATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2040 BYTES                            
