*          DATA SET NESFME8D   AT LEVEL 020 AS OF 05/13/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CE8D      DATE 05/13/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P N             T        Y              
NDUCODH  DS    CL8                                                              
NDUCOD   DS    CL12     5   13   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   72    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
NDUNCDH  DS    CL8                                                              
NDUNCD   DS    CL6      7   13    6  A  U N             T        Y              
NDUFSTH  DS    CL8                                                              
NDUFST   DS    CL12     9    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   15    1  A  P N             T        Y              
NDUD1H   DS    CL8                                                              
NDUD1    DS    CL6      9   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   41    1  A  P N             T        Y              
NDUD2H   DS    CL8                                                              
NDUD2    DS    CL6      9   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   67    1  A  P N             T        Y              
NDUD3H   DS    CL8                                                              
NDUD3    DS    CL6      9   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     10   15    1  A  P N             T        Y              
NDUD4H   DS    CL8                                                              
NDUD4    DS    CL6     10   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     10   41    1  A  P N             T        Y              
NDUD5H   DS    CL8                                                              
NDUD5    DS    CL6     10   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     10   67    1  A  P N             T        Y              
NDUD6H   DS    CL8                                                              
NDUD6    DS    CL6     10   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11   15    1  A  P N             T        Y              
NDUD7H   DS    CL8                                                              
NDUD7    DS    CL6     11   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11   41    1  A  P N             T        Y              
NDUD8H   DS    CL8                                                              
NDUD8    DS    CL6     11   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11   67    1  A  P N             T        Y              
NDUD9H   DS    CL8                                                              
NDUD9    DS    CL6     11   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     12   15    1  A  P N             T        Y              
NDUD10H  DS    CL8                                                              
NDUD10   DS    CL6     12   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     12   41    1  A  P N             T        Y              
NDUD11H  DS    CL8                                                              
NDUD11   DS    CL6     12   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     12   67    1  A  P N             T        Y              
NDUD12H  DS    CL8                                                              
NDUD12   DS    CL6     12   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     13   15    1  A  P N             T        Y              
NDUD13H  DS    CL8                                                              
NDUD13   DS    CL6     13   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     13   41    1  A  P N             T        Y              
NDUD14H  DS    CL8                                                              
NDUD14   DS    CL6     13   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     13   67    1  A  P N             T        Y              
NDUD15H  DS    CL8                                                              
NDUD15   DS    CL6     13   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     14   15    1  A  P N             T        Y              
NDUD16H  DS    CL8                                                              
NDUD16   DS    CL6     14   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     14   41    1  A  P N             T        Y              
NDUD17H  DS    CL8                                                              
NDUD17   DS    CL6     14   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     14   67    1  A  P N             T        Y              
NDUD18H  DS    CL8                                                              
NDUD18   DS    CL6     14   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15   15    1  A  P N             T        Y              
NDUD19H  DS    CL8                                                              
NDUD19   DS    CL6     15   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15   41    1  A  P N             T        Y              
NDUD20H  DS    CL8                                                              
NDUD20   DS    CL6     15   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15   67    1  A  P N             T        Y              
NDUD21H  DS    CL8                                                              
NDUD21   DS    CL6     15   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   15    1  A  P N             T        Y              
NDUD22H  DS    CL8                                                              
NDUD22   DS    CL6     16   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   41    1  A  P N             T        Y              
NDUD23H  DS    CL8                                                              
NDUD23   DS    CL6     16   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   67    1  A  P N             T        Y              
NDUD24H  DS    CL8                                                              
NDUD24   DS    CL6     16   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17   15    1  A  P N             T        Y              
NDUD25H  DS    CL8                                                              
NDUD25   DS    CL6     17   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17   41    1  A  P N             T        Y              
NDUD26H  DS    CL8                                                              
NDUD26   DS    CL6     17   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17   67    1  A  P N             T        Y              
NDUD27H  DS    CL8                                                              
NDUD27   DS    CL6     17   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18   15    1  A  P N             T        Y              
NDUD28H  DS    CL8                                                              
NDUD28   DS    CL6     18   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18   41    1  A  P N             T        Y              
NDUD29H  DS    CL8                                                              
NDUD29   DS    CL6     18   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18   67    1  A  P N             T        Y              
NDUD30H  DS    CL8                                                              
NDUD30   DS    CL6     18   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19   15    1  A  P N             T        Y              
NDUD31H  DS    CL8                                                              
NDUD31   DS    CL6     19   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19   41    1  A  P N             T        Y              
NDUD32H  DS    CL8                                                              
NDUD32   DS    CL6     19   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19   67    1  A  P N             T        Y              
NDUD33H  DS    CL8                                                              
NDUD33   DS    CL6     19   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   15    1  A  P N             T        Y              
NDUD34H  DS    CL8                                                              
NDUD34   DS    CL6     20   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   41    1  A  P N             T        Y              
NDUD35H  DS    CL8                                                              
NDUD35   DS    CL6     20   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20   67    1  A  P N             T        Y              
NDUD36H  DS    CL8                                                              
NDUD36   DS    CL6     20   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21   15    1  A  P N             T        Y              
NDUD37H  DS    CL8                                                              
NDUD37   DS    CL6     21   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21   41    1  A  P N             T        Y              
NDUD38H  DS    CL8                                                              
NDUD38   DS    CL6     21   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21   67    1  A  P N             T        Y              
NDUD39H  DS    CL8                                                              
NDUD39   DS    CL6     21   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     22   15    1  A  P N             T        Y              
NDUD40H  DS    CL8                                                              
NDUD40   DS    CL6     22   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   28   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     22   41    1  A  P N             T        Y              
NDUD41H  DS    CL8                                                              
NDUD41   DS    CL6     22   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   54   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     22   67    1  A  P N             T        Y              
NDUD42H  DS    CL8                                                              
NDUD42   DS    CL6     22   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL27    23    2   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26    23   33   26  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26    24    2   26  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    24   33   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
NDULAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
NDUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2016 BYTES                            
