*          DATA SET NESFMD7D   AT LEVEL 007 AS OF 07/11/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CD7D      DATE 07/11/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
GFLMEDH  DS    CL8                                                              
GFLMED   DS    CL1      5    9    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   17    6  A   P    N         T        Y              
GFLCLIH  DS    CL8                                                              
GFLCLI   DS    CL3      5   25    3  A   U    N         T        Y              
GFLCLNMH DS    CL8                                                              
GFLCLNM  DS    CL20     5   31   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
GFLPROH  DS    CL8                                                              
GFLPRO   DS    CL3      6   11    3  A   U    N         T        Y              
GFLPRNMH DS    CL8                                                              
GFLPRNM  DS    CL20     6   17   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6   41    8  A   P    N         T        Y              
GFLESTH  DS    CL8                                                              
GFLEST   DS    CL3      6   51    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   75    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60     8    2   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60     9    2   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    10   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    11   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    12   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    13   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    14   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    15   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    16   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    17   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    18   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    19   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    20   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    21   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    22   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   22    1  A   P    N         T        Y              
GFLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
GFLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1408 BYTES                            
