*          DATA SET NESFMFBD   AT LEVEL 001 AS OF 02/04/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF1D      DATE 02/04/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11  A   P    N         T        Y              
CLTNAMEH DS    CL8                                                              
CLTNAME  DS    CL20     5   17   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     6    2   13  A   P    N         T        Y              
CLTONUMH DS    CL8                                                              
CLTONUM  DS    CL1      6   17    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A   P    N         T        Y              
CLTIFCDH DS    CL8                                                              
CLTIFCD  DS    CL8      7   17    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     9    2   14  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  A   P    N         T        Y              
CLTOP1H  DS    CL8                                                              
CLTOP1   DS    CL1     11   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11   28   15  A   P    N         T        Y              
CLTOP2H  DS    CL8                                                              
CLTOP2   DS    CL1     11   49    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11   53   14  A   P    N         T        Y              
CLTOP3H  DS    CL8                                                              
CLTOP3   DS    CL1     11   74    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    12    2   14  A   P    N         T        Y              
CLTOP4H  DS    CL8                                                              
CLTOP4   DS    CL1     12   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL18    12   28   18  A   P    N         T        Y              
CLTOP5H  DS    CL8                                                              
CLTOP5   DS    CL1     12   49    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL19    12   53   19  A   P    N         T        Y              
CLTOP6H  DS    CL8                                                              
CLTOP6   DS    CL1     12   74    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL21    13    2   21  A   P    N         T        Y              
CLTOP7H  DS    CL8                                                              
CLTOP7   DS    CL1     13   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13   28   20  A   P    N         T        Y              
CLTOP8H  DS    CL8                                                              
CLTOP8   DS    CL1     13   49    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13   53   20  A   P    N         T        Y              
CLTOP9H  DS    CL8                                                              
CLTOP9   DS    CL1     13   74    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14    2   20  A   P    N         T        Y              
CLTOP10H DS    CL8                                                              
CLTOP10  DS    CL1     14   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14   28   20  A   P    N         T        Y              
CLTOP11H DS    CL8                                                              
CLTOP11  DS    CL1     14   49    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14   53   20  A   P    N         T        Y              
CLTOP12H DS    CL8                                                              
CLTOP12  DS    CL1     14   74    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  A   P    N         T        Y              
CLTOP13H DS    CL8                                                              
CLTOP13  DS    CL1     15   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   28   20  A   P    N         T        Y              
CLTOP14H DS    CL8                                                              
CLTOP14  DS    CL1     15   49    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   53   20  A   P    N         T        Y              
CLTOP15H DS    CL8                                                              
CLTOP15  DS    CL1     15   74    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  A   P    N         T        Y              
CLTEX1H  DS    CL8                                                              
CLTEX1   DS    CL1     16   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16   28   20  A   P    N         T        Y              
CLTEX2H  DS    CL8                                                              
CLTEX2   DS    CL1     16   49    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16   53   20  A   P    N         T        Y              
CLTEX3H  DS    CL8                                                              
CLTEX3   DS    CL1     16   74    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17    2   20  A   P    N         T        Y              
CLTEX4H  DS    CL8                                                              
CLTEX4   DS    CL1     17   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17   28   20  A   P    N         T        Y              
CLTEX5H  DS    CL8                                                              
CLTEX5   DS    CL1     17   49    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17   53   20  A   P    N         T        Y              
CLTEX6H  DS    CL8                                                              
CLTEX6   DS    CL1     17   74    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18    2   20  A   P    N         T        Y              
CLTEX7H  DS    CL8                                                              
CLTEX7   DS    CL1     18   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18   28   20  A   P    N         T        Y              
CLTEX8H  DS    CL8                                                              
CLTEX8   DS    CL1     18   49    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18   53   20  A   P    N         T        Y              
CLTEX9H  DS    CL8                                                              
CLTEX9   DS    CL1     18   74    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    19    2   20  A   P    N         T        Y              
CLTEX10H DS    CL8                                                              
CLTEX10  DS    CL1     19   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A   P    N         T        Y              
CLTTTLEH DS    CL8                                                              
CLTTTLE  DS    CL10    21   11   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   11    1  A   P    N         T        Y              
CLTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
CLTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1084 BYTES                            
