*          DATA SET NESFMF6D   AT LEVEL 011 AS OF 02/04/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF6D      DATE 02/04/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
RPLMEDH  DS    CL8                                                              
RPLMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
RPLREPH  DS    CL8                                                              
RPLREP   DS    CL3      5   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      8    8    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   18    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   40    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      9    8    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     9   13   20  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL41     9   35   41  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   78    1  A  P N             T        Y              
RPLSELH  DS    CL8                                                              
RPLSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    24    7   74  A  P N             T        Y              
RPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
RPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1608 BYTES                            
