*          DATA SET NESFMBED   AT LEVEL 007 AS OF 09/02/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CBED      DATE 09/02/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
ESTMEDKH DS    XL8                                                              
ESTMEDK  DS    CL1      5   12    1  A  U N             T    I   Y              
ESTMEDNH DS    XL8                                                              
ESTMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
ESTCLIKH DS    XL8                                                              
ESTCLIK  DS    CL3      5   47    3  A  U N             T        Y              
ESTCLINH DS    XL8                                                              
ESTCLIN  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
ESTPRDKH DS    XL8                                                              
ESTPRDK  DS    CL3      6   12    3  A  U N             T        Y              
ESTPRDNH DS    XL8                                                              
ESTPRDN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   38    8  A  P H             T        Y              
ESTESTKH DS    XL8                                                              
ESTESTK  DS    CL3      6   47    3  A  U N             T        Y              
ESTESTDH DS    XL8                                                              
ESTESTD  DS    CL20     6   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
ESTDESCH DS    XL8                                                              
ESTDESC  DS    CL20     8   16   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   38    6  A  P N             T        Y              
ESTSTATH DS    XL8                                                              
ESTSTAT  DS    CL8      8   47    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
ESTSTRDH DS    XL8                                                              
ESTSTRD  DS    CL9      9   16    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   38    8  A  P N             T        Y              
ESTENDDH DS    XL8                                                              
ESTENDD  DS    CL9      9   50    9  A  U N             T        Y              
ESTBFDH  DS    XL8                                                              
ESTBFD   DS    CL18    10    2   18  A  P N             T        Y              
ESTBBH   DS    XL8                                                              
ESTBB    DS    CL10    11    2   10  A  P N             T        Y              
ESTBBASH DS    XL8                                                              
ESTBBAS  DS    CL5     11   16    5  A  U N             T        Y              
ESTCPH   DS    XL8                                                              
ESTCP    DS    CL8     11   27    8  A  P N             T        Y              
ESTCPCTH DS    XL8                                                              
ESTCPCT  DS    CL8     11   38    8  A  U N             T        Y              
ESTCBH   DS    XL8                                                              
ESTCB    DS    CL10    11   56   10  A  P N             T        Y              
ESTCBASH DS    XL8                                                              
ESTCBAS  DS    CL5     11   68    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
ESTREPH  DS    XL8                                                              
ESTREP   DS    CL3     12   16    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   38    4  A  P N             T        Y              
ESTTYPEH DS    XL8                                                              
ESTTYPE  DS    CL3     12   47    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
ESTRANH  DS    XL8                                                              
ESTRAN   DS    CL7     13   16    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   38    8  A  P N             T        Y              
ESTRTYPH DS    XL8                                                              
ESTRTYP  DS    CL2     13   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
ESTECONH DS    XL8                                                              
ESTECON  DS    CL15    14   16   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   38   13  A  P N             T        Y              
ESTERTLH DS    XL8                                                              
ESTERTL  DS    CL2     14   56    2  A  U N             T        Y              
ESTPONDH DS    XL8                                                              
ESTPOND  DS    CL3     15    2    3  A  P N             T        Y              
ESTPONH  DS    XL8                                                              
ESTPON   DS    CL15    15   15   15  A  U N             T        Y              
ESTRBKDH DS    XL8                                                              
ESTRBKD  DS    CL11    16    2   11  A  P N             T        Y              
ESTRBKH  DS    XL8                                                              
ESTRBK   DS    CL6     16   15    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   24    7  A  P N             T        Y              
ESTHUTH  DS    XL8                                                              
ESTHUT   DS    CL7     16   33    7  A  U N             T        Y              
ESTDSC1H DS    XL8                                                              
ESTDSC1  DS    CL20    17    2   20  A  P N             T        Y              
ESTUSR1H DS    XL8                                                              
ESTUSR1  DS    CL32    17   23   32  A  P N             T        Y              
ESTDSC2H DS    XL8                                                              
ESTDSC2  DS    CL20    18    2   20  A  P N             T        Y              
ESTUSR2H DS    XL8                                                              
ESTUSR2  DS    CL32    18   23   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
ESTFLTRH DS    XL8                                                              
ESTFLTR  DS    CL3     19   12    3  A  U N             T        N              
         DS    XL8                                                              
         DS    CL7     20    2    7  A  P N             T        Y              
ESTOPTH  DS    XL8                                                              
ESTOPT   DS    CL65    20   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL41    24    2   41  A  P N             T        Y              
ESTLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1064 BYTES                            
