*          DATA SET NESFMF3D   AT LEVEL 017 AS OF 01/29/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF3D      DATE 01/29/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SFMMEDH  DS    CL8                                                              
SFMMED   DS    CL2      5    9    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   13    7  A  P N             T        Y              
SFMNTWKH DS    CL8                                                              
SFMNTWK  DS    CL4      5   22    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     5   28   10  A  P N             T        Y              
SFMEFFH  DS    CL8                                                              
SFMEFF   DS    CL8      5   40    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   58    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74     7    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL73     8    5   73  A  P N             T        Y              
SFMDAYH  DS    CL8                                                              
SFMDAY   DS    CL8      9    5    8  A  U N             T        Y              
SFMDPTH  DS    CL8                                                              
SFMDPT   DS    CL2      9   16    2  A  U N             T        Y              
SFMTIMH  DS    CL8                                                              
SFMTIM   DS    CL11     9   20   11  A  U N             T        Y              
SFMEXH   DS    CL8                                                              
SFMEX    DS    CL35     9   33   35  A  U N             T        Y              
SFMRTEH  DS    CL8                                                              
SFMRTE   DS    CL8      9   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    10   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    11   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    12   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    13   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    14   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    15   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    16   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    17   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    18   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    19   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    20   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    21   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    22   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    5    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    23   33   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   70    8  A  U N             T        Y              
SFMTAGH  DS    CL8                                                              
SFMTAG   DS    CL1     24    2    1  A  P N             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
