*          DATA SET NESFM4FD   AT LEVEL 009 AS OF 02/07/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C4FD      DATE 02/07/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BFMMEDH  DS    XL8                                                              
BFMMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
BFMCLTH  DS    XL8                                                              
BFMCLT   DS    CL3      5   29    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
BFMPRDH  DS    XL8                                                              
BFMPRD   DS    CL3      7   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   20    8  A  P N             T        Y              
BFMESTH  DS    XL8                                                              
BFMEST   DS    CL3      7   29    3  A  U N             T        Y              
BFMESTDH DS    XL8                                                              
BFMESTD  DS    CL17     7   35   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    6    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   10    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   14    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     9   18   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30     9   29   30  A  P H             T        Y              
BFMSELH  DS    XL8                                                              
BFMSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    10    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    11    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    12    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    13    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    14    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    15    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    16    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    17    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    18    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    19    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    20    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    21    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    22    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    23    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    24    6   73  A  P N             T        Y              
BFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1624 BYTES                            
