*          DATA SET NESFMAED   AT LEVEL 003 AS OF 01/24/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CAED      DATE 01/24/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
CLCMEDH  DS    XL8                                                              
CLCMED   DS    CL2      6   15    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
CLCCLTH  DS    XL8                                                              
CLCCLT   DS    CL3      7   15    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P H             T        Y              
CLCTCLTH DS    XL8                                                              
CLCTCLT  DS    CL3      8   15    3  A  U N             T        Y              
CLCERH   DS    XL8                                                              
CLCER    DS    CL70    10    2   70  A  P H             T        Y              
CLCER1H  DS    XL8                                                              
CLCER1   DS    CL70    11    2   70  A  P N             T        Y              
CLCER2H  DS    XL8                                                              
CLCER2   DS    CL70    12    2   70  A  P N             T        Y              
CLCER3H  DS    XL8                                                              
CLCER3   DS    CL70    13    2   70  A  P N             T        Y              
CLCER4H  DS    XL8                                                              
CLCER4   DS    CL70    14    2   70  A  P N             T        Y              
CLCER5H  DS    XL8                                                              
CLCER5   DS    CL70    15    2   70  A  P N             T        Y              
CLCER6H  DS    XL8                                                              
CLCER6   DS    CL70    16    2   70  A  P N             T        Y              
CLCER7H  DS    XL8                                                              
CLCER7   DS    CL70    17    2   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   21    1  A  U N             T        Y              
CLCLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CLCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 728  BYTES                            
