*          DATA SET NESFMFCD   AT LEVEL 005 AS OF 10/19/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CFCD      DATE 10/19/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
SFMMEDH  DS    CL8                                                              
SFMMED   DS    CL2      5    9    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   13    6  A   P    N         T        Y              
SFMCLTH  DS    CL8                                                              
SFMCLT   DS    CL3      5   21    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   26    7  A   P    N         T        Y              
SFMPRDH  DS    CL8                                                              
SFMPRD   DS    CL3      5   35    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   40    8  A   P    N         T        Y              
SFMESTH  DS    CL8                                                              
SFMEST   DS    CL3      5   50    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    N         T        Y              
SFMTYPH  DS    CL8                                                              
SFMTYP   DS    CL2      6    8    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL74     8    5   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL74     9    5   74  A   P    N         T        Y              
SFMPRD1H DS    CL8                                                              
SFMPRD1  DS    CL3     10    5    3  A   U    N         T        Y              
SFMRATEH DS    CL8                                                              
SFMRATE  DS    CL7     10    9    7  A   U    N         T        Y              
SFMPRD2H DS    CL8                                                              
SFMPRD2  DS    CL3     10   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   65    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    5    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22    9    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   33    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   37    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   51    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   61    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   65    7  A   U    N         T        Y              
SFMTOTH  DS    CL8                                                              
SFMTOT   DS    CL7     23    5    7  A   P    N         T        Y              
SFMTAGH  DS    CL8                                                              
SFMTAG   DS    CL1     23   65    1  A   P    N         T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2016 BYTES                            
