*          DATA SET NESFMC7D   AT LEVEL 006 AS OF 01/29/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CC7D      DATE 01/29/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MRTMEDH  DS    CL8                                                              
MRTMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
MRTMKTH  DS    CL8                                                              
MRTMKT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
MRTMKTNH DS    CL8                                                              
MRTMKTN  DS    CL24     7   19   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
MRTTZONH DS    CL8                                                              
MRTTZON  DS    CL1      8   19    1  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
MRTRANKH DS    CL8                                                              
MRTRANK  DS    CL3      9   19    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
MRTHOMSH DS    CL8                                                              
MRTHOMS  DS    CL8     10   19    8  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
MRTNTAH  DS    CL8                                                              
MRTNTA   DS    CL2     11   19    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    12    2   16  A  P N             T        Y              
MRTWTH   DS    CL8                                                              
MRTWT    DS    CL5     12   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
MRTSHRH  DS    CL8                                                              
MRTSHR   DS    CL5     13   19    5  A  U N             T        Y              
MRTRST1H DS    CL8                                                              
MRTRST1  DS    CL16    14    2   16  A  P N             T        Y              
MRTRSM1H DS    CL8                                                              
MRTRSM1  DS    CL4     14   19    4  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   26   12  A  P N             T        Y              
MRTSCL1H DS    CL8                                                              
MRTSCL1  DS    CL1     14   39    1  N  U N             T        Y              
MRTRST2H DS    CL8                                                              
MRTRST2  DS    CL16    15    2   16  A  P N             T        Y              
MRTRSM2H DS    CL8                                                              
MRTRSM2  DS    CL4     15   19    4  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   26   12  A  P N             T        Y              
MRTSCL2H DS    CL8                                                              
MRTSCL2  DS    CL1     15   39    1  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
MRTLOCKH DS    CL8                                                              
MRTLOCK  DS    CL3     16   19    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    17    2   16  A  P N             T        Y              
MRTDSTH  DS    CL8                                                              
MRTDST   DS    CL1     17   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    18    2   16  A  P N             T        Y              
MRTMKTSH DS    CL8                                                              
MRTMKTS  DS    CL35    18   19   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   19    1  A  U N             T        Y              
MRTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
MRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 584  BYTES                            
