*          DATA SET NESFMF9D   AT LEVEL 005 AS OF 10/07/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF9D      DATE 10/07/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P N             T        Y              
UNICODH  DS    XL8                                                              
UNICOD   DS    CL12     5   13   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   72    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     7    2   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7   25    5  A  P H             T        Y              
UNIHM1H  DS    XL8                                                              
UNIHM1   DS    CL6      7   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    9    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   17    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   25    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      8   33    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   41    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   49    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   57    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   65    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      8   73    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P H             T        Y              
UNIW1H   DS    XL8                                                              
UNIW1    DS    CL6      9    9    6  A  U N             T        Y              
UNIW2H   DS    XL8                                                              
UNIW2    DS    CL6      9   17    6  A  U N             T        Y              
UNIW3H   DS    XL8                                                              
UNIW3    DS    CL6      9   25    6  A  U N             T        Y              
UNIW4H   DS    XL8                                                              
UNIW4    DS    CL6      9   33    6  A  U N             T        Y              
UNIW5H   DS    XL8                                                              
UNIW5    DS    CL6      9   41    6  A  U N             T        Y              
UNIW6H   DS    XL8                                                              
UNIW6    DS    CL6      9   49    6  A  U N             T        Y              
UNIW7H   DS    XL8                                                              
UNIW7    DS    CL6      9   57    6  A  U N             T        Y              
UNIW8H   DS    XL8                                                              
UNIW8    DS    CL6      9   65    6  A  U N             T        Y              
UNIW9H   DS    XL8                                                              
UNIW9    DS    CL6      9   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P H             T        Y              
UNIM1H   DS    XL8                                                              
UNIM1    DS    CL6     10    9    6  A  U N             T        Y              
UNIM2H   DS    XL8                                                              
UNIM2    DS    CL6     10   17    6  A  U N             T        Y              
UNIM3H   DS    XL8                                                              
UNIM3    DS    CL6     10   25    6  A  U N             T        Y              
UNIM4H   DS    XL8                                                              
UNIM4    DS    CL6     10   33    6  A  U N             T        Y              
UNIM5H   DS    XL8                                                              
UNIM5    DS    CL6     10   41    6  A  U N             T        Y              
UNIM6H   DS    XL8                                                              
UNIM6    DS    CL6     10   49    6  A  U N             T        Y              
UNIM7H   DS    XL8                                                              
UNIM7    DS    CL6     10   57    6  A  U N             T        Y              
UNIM8H   DS    XL8                                                              
UNIM8    DS    CL6     10   65    6  A  U N             T        Y              
UNIM9H   DS    XL8                                                              
UNIM9    DS    CL6     10   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P H             T        Y              
UNIA1H   DS    XL8                                                              
UNIA1    DS    CL6     11    9    6  A  P N             T        Y              
UNIA2H   DS    XL8                                                              
UNIA2    DS    CL6     11   17    6  A  P N             T        Y              
UNIA3H   DS    XL8                                                              
UNIA3    DS    CL6     11   25    6  A  P N             T        Y              
UNIA4H   DS    XL8                                                              
UNIA4    DS    CL6     11   33    6  A  P N             T        Y              
UNIA5H   DS    XL8                                                              
UNIA5    DS    CL6     11   41    6  A  P N             T        Y              
UNIA6H   DS    XL8                                                              
UNIA6    DS    CL6     11   49    6  A  P N             T        Y              
UNIA7H   DS    XL8                                                              
UNIA7    DS    CL6     11   57    6  A  P N             T        Y              
UNIA8H   DS    XL8                                                              
UNIA8    DS    CL6     11   65    6  A  P N             T        Y              
UNIA9H   DS    XL8                                                              
UNIA9    DS    CL6     11   73    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    9    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13   17    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13   25    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     13   33    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     13   49    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     13   57    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     13   65    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     13   73    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
UNIW11H  DS    XL8                                                              
UNIW11   DS    CL6     14   17    6  A  U N             T        Y              
UNIW12H  DS    XL8                                                              
UNIW12   DS    CL6     14   25    6  A  U N             T        Y              
UNIW13H  DS    XL8                                                              
UNIW13   DS    CL6     14   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   42    5  A  P H             T        Y              
UNIG1H   DS    XL8                                                              
UNIG1    DS    CL6     14   49    6  A  U N             T        Y              
UNIG2H   DS    XL8                                                              
UNIG2    DS    CL6     14   65    6  A  U N             T        Y              
UNIG3H   DS    XL8                                                              
UNIG3    DS    CL6     14   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P H             T        Y              
UNIM11H  DS    XL8                                                              
UNIM11   DS    CL6     15   17    6  A  U N             T        Y              
UNIM12H  DS    XL8                                                              
UNIM12   DS    CL6     15   25    6  A  U N             T        Y              
UNIM13H  DS    XL8                                                              
UNIM13   DS    CL6     15   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   42    4  A  P H             T        Y              
UNIB1H   DS    XL8                                                              
UNIB1    DS    CL6     15   49    6  A  U N             T        Y              
UNIB2H   DS    XL8                                                              
UNIB2    DS    CL6     15   65    6  A  U N             T        Y              
UNIB3H   DS    XL8                                                              
UNIB3    DS    CL6     15   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  P H             T        Y              
UNIA10H  DS    XL8                                                              
UNIA10   DS    CL6     16    9    6  A  U N             T        Y              
UNIA11H  DS    XL8                                                              
UNIA11   DS    CL6     16   17    6  A  P N             T        Y              
UNIA12H  DS    XL8                                                              
UNIA12   DS    CL6     16   25    6  A  P N             T        Y              
UNIA13H  DS    XL8                                                              
UNIA13   DS    CL6     16   33    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   42    5  A  P H             T        Y              
UNIC1H   DS    XL8                                                              
UNIC1    DS    CL6     16   49    6  A  P N             T        Y              
UNIC2H   DS    XL8                                                              
UNIC2    DS    CL6     16   57    6  A  U N             T        Y              
UNIC3H   DS    XL8                                                              
UNIC3    DS    CL6     16   65    6  A  P N             T        Y              
UNIC4H   DS    XL8                                                              
UNIC4    DS    CL6     16   73    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     18   13    3  A  P H             T        Y              
UNIWW1H  DS    XL8                                                              
UNIWW1   DS    CL6     18   17    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   27    5  A  P H             T        Y              
UNIWW2H  DS    XL8                                                              
UNIWW2   DS    CL6     18   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   43    5  A  P H             T        Y              
UNIWW3H  DS    XL8                                                              
UNIWW3   DS    CL6     18   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   60    4  A  P H             T        Y              
UNIWW4H  DS    XL8                                                              
UNIWW4   DS    CL6     18   65    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     19   13    3  A  P H             T        Y              
UNIHH1H  DS    XL8                                                              
UNIHH1   DS    CL6     19   17    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   27    3  A  P H             T        Y              
UNIHH2H  DS    XL8                                                              
UNIHH2   DS    CL6     19   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   43    2  A  P H             T        Y              
UNIHH3H  DS    XL8                                                              
UNIHH3   DS    CL6     19   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
UNIUUNIH DS    XL8                                                              
UNIUUNI  DS    CL66    20   13   66  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
UNINCDEH DS    XL8                                                              
UNINCDE  DS    CL6     21   13    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
UNIDESCH DS    XL8                                                              
UNIDESC  DS    CL60    22   10   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
UNISPECH DS    XL8                                                              
UNISPEC  DS    CL16    23   13   16  A  U N             T        Y              
UNIACTVH DS    XL8                                                              
UNIACTV  DS    CL30    23   43   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28    24    2   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL27    24   33   27  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    24   63   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
UNILAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
UNIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
