*          DATA SET NESFM81D   AT LEVEL 008 AS OF 09/17/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C81D      DATE 09/17/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
LIMMEDH  DS    XL8                                                              
LIMMED   DS    CL1      5   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
LIMCLIH  DS    XL8                                                              
LIMCLI   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
LIMPRDH  DS    XL8                                                              
LIMPRD   DS    CL3      5   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P H             T        Y              
LIMESTH  DS    XL8                                                              
LIMEST   DS    CL3      6   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P H             T        Y              
LIMNETH  DS    XL8                                                              
LIMNET   DS    CL4      6   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   42    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   62   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   62   15  A  P N             T        Y              
LIMLIM1H DS    XL8                                                              
LIMLIM1  DS    CL19    10    2   19  A  U N             T        Y              
LIMDAT1H DS    XL8                                                              
LIMDAT1  DS    CL17    10   22   17  A  U N             T        Y              
LIMLIM2H DS    XL8                                                              
LIMLIM2  DS    CL19    10   42   19  A  U N             T        Y              
LIMDAT2H DS    XL8                                                              
LIMDAT2  DS    CL17    10   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    11    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    11   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    12    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    12   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    13    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    13   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    14    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    14   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    15    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    15   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    16    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    16   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    17    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    17   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    18    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    18   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    19    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    19   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    20    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    20   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    21    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    21   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    22    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    22   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   62   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    23    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    23   42   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   62   17  A  U N             T        Y              
LIMENDH  DS    XL8                                                              
LIMEND   DS    CL1     24   78    1  A  P N             T        Y              
LIMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
LIMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1752 BYTES                            
