*          DATA SET NESFMB0D   AT LEVEL 006 AS OF 11/14/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CB0D      DATE 11/14/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
ESTMEDKH DS    XL8                                                              
ESTMEDK  DS    CL1      5   12    1  A  U N             T    I   Y              
ESTMEDNH DS    XL8                                                              
ESTMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
ESTCLIKH DS    XL8                                                              
ESTCLIK  DS    CL3      5   50    3  A  U N             T        Y              
ESTCLINH DS    XL8                                                              
ESTCLIN  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
ESTPRDKH DS    XL8                                                              
ESTPRDK  DS    CL3      6   12    3  A  U N             T        Y              
ESTPRDNH DS    XL8                                                              
ESTPRDN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
ESTESTKH DS    XL8                                                              
ESTESTK  DS    CL3      7   12    3  A  U N             T        Y              
ESTESTNH DS    XL8                                                              
ESTESTN  DS    CL20     7   20   20  A  P N             T        Y              
ESTEDATH DS    XL8                                                              
ESTEDAT  DS    CL17     7   56   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
ESTPRD1H DS    XL8                                                              
ESTPRD1  DS    CL3      8   17    3  A  U N             T        Y              
ESTPRD2H DS    XL8                                                              
ESTPRD2  DS    CL3      8   23    3  A  U N             T        Y              
ESTPRD3H DS    XL8                                                              
ESTPRD3  DS    CL3      8   29    3  A  U N             T        Y              
ESTPRD4H DS    XL8                                                              
ESTPRD4  DS    CL3      8   35    3  A  U N             T        Y              
ESTPRD5H DS    XL8                                                              
ESTPRD5  DS    CL3      8   41    3  A  U N             T        Y              
ESTPRD6H DS    XL8                                                              
ESTPRD6  DS    CL3      8   47    3  A  U N             T        Y              
ESTPRD7H DS    XL8                                                              
ESTPRD7  DS    CL3      8   53    3  A  U N             T        Y              
ESTPRD8H DS    XL8                                                              
ESTPRD8  DS    CL3      8   59    3  A  U N             T        Y              
ESTPRD9H DS    XL8                                                              
ESTPRD9  DS    CL3      8   65    3  A  U N             T        Y              
ESTPRD0H DS    XL8                                                              
ESTPRD0  DS    CL3      8   71    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
ESTDSPH  DS    XL8                                                              
ESTDSP   DS    CL80     9    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    10    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    11    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    12    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    13    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    14    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    15    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    16    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    17    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    18    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    19    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    20    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    21    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    22    1   80  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL80    23    1   80  A  P N             T        Y              
ESTLSTH  DS    XL8                                                              
ESTLST   DS    CL80    24    1   80  A  P N             T        Y              
ESTLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
