*          DATA SET NESFMEFD   AT LEVEL 029 AS OF 06/12/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219C7D      DATE 06/12/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL29     8    7   29  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL29     8   44   29  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL29     9    7   29  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL29     9   44   29  A   P    N         T        Y              
SHRF1H   DS    CL8                                                              
SHRF1    DS    CL25    11    2   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    11   40   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    12    2   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    12   40   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    13    2   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    13   40   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    14    2   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    14   40   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    15    2   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    15   40   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    16    2   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    16   40   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17    2   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17   40   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   67    7  A   U    N         T        Y              
SHRTABH  DS    CL8                                                              
SHRTAB   DS    CL1     18    2    1  A   P    N         T        Y              
SHRTOTH  DS    CL8                                                              
SHRTOT   DS    CL13    19    2   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     19   16    9  A   P    N         T        Y              
SHRLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SHRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 870  BYTES                            
