*          DATA SET NESFMA9D   AT LEVEL 003 AS OF 03/14/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CA9D      DATE 03/14/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
DPLCLTH  DS    XL8                                                              
DPLCLT   DS    CL3      5   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     5   20   12  A  P N             T        Y              
DPLDPTH  DS    XL8                                                              
DPLDPT   DS    CL2      5   34    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     7    2   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     8    2   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
DPLFRSTH DS    XL8                                                              
DPLFRST  DS    CL65     9   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    10   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    11   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    12   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    13   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    14   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    15   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    16   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    17   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    18   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    19   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    20   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    21   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    22   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    23   11   65  A  P N             T        Y              
DPLENDH  DS    XL8                                                              
DPLEND   DS    CL1     24    2    1  A  P N             T        Y              
DPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
DPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1416 BYTES                            
