*          DATA SET NESFME4D   AT LEVEL 001 AS OF 10/14/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CE4D      DATE 10/14/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFPMEDH  DS    XL8                                                              
SFPMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFPMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SFPCLIH  DS    XL8                                                              
SFPCLI   DS    CL3      5   28    3  A  U H             T        Y    0         
SFPCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SFPPROH  DS    XL8                                                              
SFPPRO   DS    CL3      5   47    3  A  U H             T        Y    0         
SFPPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   56    8  A  P N             T        Y              
SFPSIDH  DS    XL8                                                              
SFPSID   DS    CL2      5   66    2  A  U H             T        Y    0         
SFPSIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      7    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    5    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   11    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   25    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   47    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   61    6  A  P N             T        Y              
SFPLINH  DS    XL8                                                              
SFPLIN   DS    CL79     8    2   79  A  P N             T        Y    0         
SFPLINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
SFPLSTH  DS    XL8                                                              
SFPLST   DS    CL79    23    2   79  A  P N             T        Y    0         
SFPLSTX  DS    XL8                                                              
SFPFILLH DS    XL8                                                              
SFPFILL  DS    CL79    24    2   79  A  P N             T        Y    0         
SFPFILLX DS    XL8                                                              
SFPLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SFPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
