*          DATA SET NESFMCDD   AT LEVEL 001 AS OF 06/05/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CCDD      DATE 06/05/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PNGMEDH  DS    XL8                                                              
PNGMED   DS    CL1      5    9    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   17    6  A  P H             T        Y              
PNGCLIH  DS    XL8                                                              
PNGCLI   DS    CL3      5   25    3  A  U H             T        Y              
PNGCLNMH DS    XL8                                                              
PNGCLNM  DS    CL20     5   31   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
PNGPROH  DS    XL8                                                              
PNGPRO   DS    CL3      6   11    3  A  U H             T        Y              
PNGPRNMH DS    XL8                                                              
PNGPRNM  DS    CL20     6   17   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   41    8  A  P H             T        Y              
PNGESTH  DS    XL8                                                              
PNGEST   DS    CL3      6   51    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   75    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21     8    2   21  A  P N             T        Y              
PNGCHPH  DS    XL8                                                              
PNGCHP   DS    CL3      8   25    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21     9    2   21  A  P N             T        Y              
PNGACCH  DS    XL8                                                              
PNGACC   DS    CL6      9   25    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    10    2   21  A  P N             T        Y              
PNGPGBH  DS    XL8                                                              
PNGPGB   DS    CL4     10   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    11    2   21  A  P N             T        Y              
PNGPGEH  DS    XL8                                                              
PNGPGE   DS    CL4     11   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    12    2   21  A  P N             T        Y              
PNGEVCH  DS    XL8                                                              
PNGEVC   DS    CL6     12   25    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    13    2   21  A  P N             T        Y              
PNGMLTH  DS    XL8                                                              
PNGMLT   DS    CL1     13   25    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    14    2   21  A  P N             T        Y              
PNGNOBH  DS    XL8                                                              
PNGNOB   DS    CL1     14   25    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    15    2   21  A  P N             T        Y              
PNGBSFXH DS    XL8                                                              
PNGBSFX  DS    CL2     15   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   22    1  A  U N             T        Y              
PNGLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PNGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 504  BYTES                            
