*          DATA SET NESFM90D   AT LEVEL 004 AS OF 09/04/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C90D      DATE 09/04/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
NVLMEDH  DS    XL8                                                              
NVLMED   DS    CL3      5   10    3  A  U N             T        Y              
NVLMDNH  DS    XL8                                                              
NVLMDN   DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
NVLCLTH  DS    XL8                                                              
NVLCLT   DS    CL3      5   46    3  A  U N             T        Y              
NVLCLNH  DS    XL8                                                              
NVLCLN   DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
NVLADRH  DS    XL8                                                              
NVLADR   DS    CL65     7   14   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
NVLSIGH  DS    XL8                                                              
NVLSIG   DS    CL65     9   14   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
NVLDEPH  DS    XL8                                                              
NVLDEP   DS    CL65    11   14   65  A  U N             T        Y              
NVLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
NVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 376  BYTES                            
