*          DATA SET NESFM69D   AT LEVEL 001 AS OF 09/29/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C69D      DATE 09/29/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SELMEDH  DS    CL8                                                              
SELMED   DS    CL1      5   10    1  A  U N             T        Y              
SELMEDNH DS    CL8                                                              
SELMEDN  DS    CL10     5   16   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SELCLIH  DS    CL8                                                              
SELCLI   DS    CL3      5   47    3  A  U N             T        Y              
SELCLINH DS    CL8                                                              
SELCLIN  DS    CL20     5   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SELPROH  DS    CL8                                                              
SELPRO   DS    CL3      6   10    3  A  U N             T        Y              
SELPRONH DS    CL8                                                              
SELPRON  DS    CL20     6   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  A  P N             T        Y              
SELESTH  DS    CL8                                                              
SELEST   DS    CL3      6   47    3  A  U N             T        Y              
SELESTNH DS    CL8                                                              
SELESTN  DS    CL20     6   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18     8    2   18  A  P N             T        Y              
SELSELH  DS    CL8                                                              
SELSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
SELLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1640 BYTES                            
