*          DATA SET NESFMADD   AT LEVEL 008 AS OF 03/29/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CADD      DATE 03/29/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SMLYEARH DS    XL8                                                              
SMLYEAR  DS    CL2      5   10    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
SMLCODEH DS    XL8                                                              
SMLCODE  DS    CL8      5   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   65    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22     7    2   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22     8    2   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64     9    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    10    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    11    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    12    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    13    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    14    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    15    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    16    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    17    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    18    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    19    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    20    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    21    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    22    8   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL64    23    8   64  A  P N             T        Y              
SMLTAGH  DS    XL8                                                              
SMLTAG   DS    CL1     23   78    1  A  P N             T        Y              
SMLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SMLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1376 BYTES                            
