*          DATA SET NESFM9BD   AT LEVEL 008 AS OF 10/11/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C9BD      DATE 10/11/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
WBMCLTH  DS    XL8                                                              
WBMCLT   DS    CL3      5   10    3  A  U N             T        Y              
WBMCLNH  DS    XL8                                                              
WBMCLN   DS    CL20     5   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
WBMPRDH  DS    XL8                                                              
WBMPRD   DS    CL3      6   10    3  A  U N             T        Y              
WBMPRNH  DS    XL8                                                              
WBMPRN   DS    CL18     6   20   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     7    2   20  A  P H             T        Y              
WBMFICH  DS    XL8                                                              
WBMFIC   DS    CL6      7   25    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
WBMFIDH  DS    XL8                                                              
WBMFID   DS    CL10     9   16   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
WBMTYPH  DS    XL8                                                              
WBMTYP   DS    CL1     10   16    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   27    7  A  P N             T        Y              
WBMDPTH  DS    XL8                                                              
WBMDPT   DS    CL2     10   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
WBMSTDH  DS    XL8                                                              
WBMSTD   DS    CL8     11   16    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   27    8  A  P N             T        Y              
WBMENDH  DS    XL8                                                              
WBMEND   DS    CL8     11   40    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
WBMSTAH  DS    XL8                                                              
WBMSTA   DS    CL8     13   16    8  A  U N             T        Y              
WBMUPDH  DS    XL8                                                              
WBMUPD   DS    CL70    24    2   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  P N             T        Y              
WBMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
WBMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 440  BYTES                            
