*          DATA SET NESFM99D   AT LEVEL 011 AS OF 08/22/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C99D      DATE 08/22/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
BHSCLTH  DS    XL8                                                              
BHSCLT   DS    CL3      5   12    3  A  U N             T        Y              
BHSCNMH  DS    XL8                                                              
BHSCNM   DS    CL20     5   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
BHSPRDH  DS    XL8                                                              
BHSPRD   DS    CL3      6   12    3  A  U N             T        Y              
BHSPNMH  DS    XL8                                                              
BHSPNM   DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
BHSESTH  DS    XL8                                                              
BHSEST   DS    CL3      7   12    3  A  U N             T        Y              
BHSENMH  DS    XL8                                                              
BHSENM   DS    CL20     7   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
BHSNETH  DS    XL8                                                              
BHSNET   DS    CL4      8   12    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
BHSMOSH  DS    XL8                                                              
BHSMOS   DS    CL6      9   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
BHSPKGH  DS    XL8                                                              
BHSPKG   DS    CL3     10   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   10    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   14    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   18    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   23    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   30    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   34    8  A  P N             T        Y              
BHSSELH  DS    XL8                                                              
BHSSEL   DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    13    6   73  A  P N             T        Y              
BHSL2H   DS    XL8                                                              
BHSL2    DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    14    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    15    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    16    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    17    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    18    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    19    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    20    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    21    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    22    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    23    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    24    6   73  A  P N             T        Y              
BHSTAGH  DS    XL8                                                              
BHSTAG   DS    CL1     24   80    1  A  P N             T        Y              
BHSLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BHSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1464 BYTES                            
