*          DATA SET NESFM93D   AT LEVEL 013 AS OF 08/06/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C93D      DATE 08/06/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SFMMEDH  DS    XL8                                                              
SFMMED   DS    CL2      5    9    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   13    6  A  P N             T        Y              
SFMCLTH  DS    XL8                                                              
SFMCLT   DS    CL3      5   21    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   26    7  A  P N             T        Y              
SFMPRDH  DS    XL8                                                              
SFMPRD   DS    CL3      5   35    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   40    8  A  P N             T        Y              
SFMESTH  DS    XL8                                                              
SFMEST   DS    CL3      5   50    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
SFMTYPH  DS    XL8                                                              
SFMTYP   DS    CL2      6    8    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22     8    5   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22     8   30   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22     8   55   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22     9    5   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22     9   30   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22     9   55   22  A  P N             T        Y              
SFMPRD1H DS    XL8                                                              
SFMPRD1  DS    CL3     10    5    3  A  U N             T        Y              
SFMRATEH DS    XL8                                                              
SFMRATE  DS    CL7     10   10    7  A  U N             T        Y              
SFMPGB1H DS    XL8                                                              
SFMPGB1  DS    CL4     10   19    4  A  U N             T        Y              
SFMSUF1H DS    XL8                                                              
SFMSUF1  DS    CL2     10   25    2  A  U N             T        Y              
SFMPRD2H DS    XL8                                                              
SFMPRD2  DS    CL3     10   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   75    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    5    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   19    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   55    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   60    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   75    2  A  U N             T        Y              
SFMTOTH  DS    XL8                                                              
SFMTOT   DS    CL7     24    5    7  A  P N             T        Y              
SFMTAGH  DS    XL8                                                              
SFMTAG   DS    CL1     24   65    1  A  P N             T        Y              
SFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2360 BYTES                            
