*          DATA SET NESFMD6D   AT LEVEL 002 AS OF 07/11/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CD6D      DATE 07/11/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
GFFMEDH  DS    CL8                                                              
GFFMED   DS    CL1      5    9    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   17    6  A   P    H         T        Y              
GFFCLIH  DS    CL8                                                              
GFFCLI   DS    CL3      5   25    3  A   U    H         T        Y              
GFFCLNMH DS    CL8                                                              
GFFCLNM  DS    CL20     5   31   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
GFFPROH  DS    CL8                                                              
GFFPRO   DS    CL3      6   11    3  A   U    H         T        Y              
GFFPRNMH DS    CL8                                                              
GFFPRNM  DS    CL20     6   17   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6   41    8  A   P    H         T        Y              
GFFESTH  DS    CL8                                                              
GFFEST   DS    CL3      6   51    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      6   75    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  A   P    N         T        Y              
GFFDIVH  DS    CL8                                                              
GFFDIV   DS    CL2      8   19    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
GFFPRDH  DS    CL8                                                              
GFFPRD   DS    CL4      9   19    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
GFFNATH  DS    CL8                                                              
GFFNAT   DS    CL3     10   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A   P    N         T        Y              
GFFSUBH  DS    CL8                                                              
GFFSUB   DS    CL3     11   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A   P    N         T        Y              
GFFASSH  DS    CL8                                                              
GFFASS   DS    CL1     12   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     12   30    9  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   22    1  A   U    N         T        Y              
GFFLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
GFFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 336  BYTES                            
