*          DATA SET NESFMB9D   AT LEVEL 003 AS OF 04/07/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CB9D      DATE 04/07/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
DSTCLTH  DS    CL8                                                              
DSTCLT   DS    CL3      5   10    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
DSTCDEH  DS    CL8                                                              
DSTCDE   DS    CL4      5   26    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
DSTHD1H  DS    CL8                                                              
DSTHD1   DS    CL20     7   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     8    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     9   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     9   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     9   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
DSTHD2H  DS    CL8                                                              
DSTHD2   DS    CL20    12   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17    2   10  A  P N             T        Y              
DSTHD3H  DS    CL8                                                              
DSTHD3   DS    CL20    17   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    20    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   22   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   42   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   62   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   18    1  A  P N             T        Y              
DSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
DSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1040 BYTES                            
