*          DATA SET NESFM98D   AT LEVEL 008 AS OF 08/22/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C98D      DATE 08/22/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
BHNCLTH  DS    XL8                                                              
BHNCLT   DS    CL3      5   12    3  A  U N             T        Y              
BHNCNMH  DS    XL8                                                              
BHNCNM   DS    CL20     5   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
BHNPRDH  DS    XL8                                                              
BHNPRD   DS    CL3      6   12    3  A  U N             T        Y              
BHNPNMH  DS    XL8                                                              
BHNPNM   DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
BHNESTH  DS    XL8                                                              
BHNEST   DS    CL3      7   12    3  A  U N             T        Y              
BHNENMH  DS    XL8                                                              
BHNENM   DS    CL20     7   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
BHNNETH  DS    XL8                                                              
BHNNET   DS    CL4      8   12    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
BHNMOSH  DS    XL8                                                              
BHNMOS   DS    CL6      9   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P H             T        Y              
BHNPKGH  DS    XL8                                                              
BHNPKG   DS    CL3     10   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    12    2   23  A  P N             T        Y              
BHNEDTH  DS    XL8                                                              
BHNEDT   DS    CL8     12   27    8  A  U N             T        Y              
BHNLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BHNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 304  BYTES                            
