*          DATA SET NESFMC1SD  AT LEVEL 042 AS OF 06/12/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CC1D      DATE 06/12/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CLTMEDH  DS    CL8                                                              
CLTMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
CLTCLTH  DS    CL8                                                              
CLTCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
CLTNAMEH DS    CL8                                                              
CLTNAME  DS    CL20     7   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
CLTONUMH DS    CL8                                                              
CLTONUM  DS    CL1      8   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17     9    2   17  A  P N             T        Y              
CLTAONMH DS    CL8                                                              
CLTAONM  DS    CL6      9   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
CLTIFCDH DS    CL8                                                              
CLTIFCD  DS    CL8     10   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
CLTOPTSH DS    CL8                                                              
CLTOPTS  DS    CL57    11   20   57  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   12   20  A  P N             T        Y              
CLTOP1H  DS    CL8                                                              
CLTOP1   DS    CL1     14   34    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    14   43   18  A  P N             T        Y              
CLTOP2H  DS    CL8                                                              
CLTOP2   DS    CL1     14   64    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   12   20  A  P N             T        Y              
CLTOP3H  DS    CL8                                                              
CLTOP3   DS    CL1     15   34    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   43   20  A  P N             T        Y              
CLTOP4H  DS    CL8                                                              
CLTOP4   DS    CL1     15   64    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    16   12   19  A  P N             T        Y              
CLTOP5H  DS    CL8                                                              
CLTOP5   DS    CL1     16   34    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   43   11  A  P N             T        Y              
CLTLOCKH DS    CL8                                                              
CLTLOCK  DS    CL1     16   64    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   12    8  A  P N             T        Y              
CLTTTLEH DS    CL8                                                              
CLTTTLE  DS    CL10    17   21   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   21    1  A  U N             T        Y              
CLTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
CLTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 560  BYTES                            
