*          DATA SET NESFMD4D   AT LEVEL 017 AS OF 07/18/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CD4D      DATE 07/18/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
SMFMDH   DS    CL8                                                              
SMFMD    DS    CL2      5   10    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
SMFCLIH  DS    CL8                                                              
SMFCLI   DS    CL3      5   28    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   34    2  A   P    N         T        Y              
SMFIDDH  DS    CL8                                                              
SMFIDD   DS    CL1      5   37    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   65    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60     7    2   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60     8    2   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65     9   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    10   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    11   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    12   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    13   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    14   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    15   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    16   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    17   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    18   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    19   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    20   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    21   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    22   11   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    23   11   65  A   P    N         T        Y              
SMFTAGH  DS    CL8                                                              
SMFTAG   DS    CL1     24    2    1  A   P    N         T        Y              
SMFLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SMFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1488 BYTES                            
