*          DATA SET NESFM68D   AT LEVEL 001 AS OF 09/29/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C68D      DATE 09/29/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
COMMEDH  DS    CL8                                                              
COMMED   DS    CL1      5   10    1  A  U N             T    I   Y              
COMMEDNH DS    CL8                                                              
COMMEDN  DS    CL10     5   16   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
COMCLIH  DS    CL8                                                              
COMCLI   DS    CL3      5   47    3  A  U N             T        Y              
COMCLINH DS    CL8                                                              
COMCLIN  DS    CL20     5   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
COMPROH  DS    CL8                                                              
COMPRO   DS    CL3      6   10    3  A  U N             T        Y              
COMPRONH DS    CL8                                                              
COMPRON  DS    CL20     6   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  A  P H             T        Y              
COMESTH  DS    CL8                                                              
COMEST   DS    CL3      6   47    3  A  U N             T        Y              
COMESTNH DS    CL8                                                              
COMESTN  DS    CL20     6   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7   12    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7   17    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7   22   10  A  P N             T        Y              
COMD1H   DS    CL8                                                              
COMD1    DS    CL10     7   44   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   12    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   17    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   22   10  A  P N             T        Y              
COMD2H   DS    CL8                                                              
COMD2    DS    CL10     8   44   10  A  P N             T        Y              
COMLN1TH DS    CL8                                                              
COMLN1T  DS    CL1      9    3    1  A  U N             T        Y   20         
COMLN1TX DS    CL8                                                              
COMLN1EH DS    CL8                                                              
COMLN1E  DS    CL1      9    8    1  A  U N             T        Y   20         
COMLN1EX DS    CL8                                                              
COMLN1LH DS    CL8                                                              
COMLN1L  DS    CL3      9   12    3  A  U N             T        Y   20         
COMLN1LX DS    CL8                                                              
COMLN1MH DS    CL8                                                              
COMLN1M  DS    CL1      9   18    1  A  U N             T        Y   20         
COMLN1MX DS    CL8                                                              
COMLN1FH DS    CL8                                                              
COMLN1F  DS    CL20     9   22   20  A  U N             T        Y   20         
COMLN1FX DS    CL8                                                              
COMLN1DH DS    CL8                                                              
COMLN1D  DS    CL32     9   44   32  A  P N             T        Y   30         
COMLN1DX DS    CL8                                                              
COMLN2TH DS    CL8                                                              
COMLN2T  DS    CL1     10    3    1  A  U N             T        Y   20         
COMLN2TX DS    CL8                                                              
COMLN2EH DS    CL8                                                              
COMLN2E  DS    CL1     10    8    1  A  U N             T        Y   20         
COMLN2EX DS    CL8                                                              
COMLN2LH DS    CL8                                                              
COMLN2L  DS    CL3     10   12    3  A  U N             T        Y   20         
COMLN2LX DS    CL8                                                              
COMLN2MH DS    CL8                                                              
COMLN2M  DS    CL1     10   18    1  A  U N             T        Y   20         
COMLN2MX DS    CL8                                                              
COMLN2FH DS    CL8                                                              
COMLN2F  DS    CL20    10   22   20  A  U N             T        Y   20         
COMLN2FX DS    CL8                                                              
COMLN2DH DS    CL8                                                              
COMLN2D  DS    CL32    10   44   32  A  P N             T        Y   30         
COMLN2DX DS    CL8                                                              
COMLN3TH DS    CL8                                                              
COMLN3T  DS    CL1     11    3    1  A  U N             T        Y   20         
COMLN3TX DS    CL8                                                              
COMLN3EH DS    CL8                                                              
COMLN3E  DS    CL1     11    8    1  A  U N             T        Y   20         
COMLN3EX DS    CL8                                                              
COMLN3LH DS    CL8                                                              
COMLN3L  DS    CL3     11   12    3  A  U N             T        Y   20         
COMLN3LX DS    CL8                                                              
COMLN3MH DS    CL8                                                              
COMLN3M  DS    CL1     11   18    1  A  U N             T        Y   20         
COMLN3MX DS    CL8                                                              
COMLN3FH DS    CL8                                                              
COMLN3F  DS    CL20    11   22   20  A  U N             T        Y   20         
COMLN3FX DS    CL8                                                              
COMLN3DH DS    CL8                                                              
COMLN3D  DS    CL32    11   44   32  A  P N             T        Y   30         
COMLN3DX DS    CL8                                                              
COMLN4TH DS    CL8                                                              
COMLN4T  DS    CL1     12    3    1  A  U N             T        Y   20         
COMLN4TX DS    CL8                                                              
COMLN4EH DS    CL8                                                              
COMLN4E  DS    CL1     12    8    1  A  U N             T        Y   20         
COMLN4EX DS    CL8                                                              
COMLN4LH DS    CL8                                                              
COMLN4L  DS    CL3     12   12    3  A  U N             T        Y   20         
COMLN4LX DS    CL8                                                              
COMLN4MH DS    CL8                                                              
COMLN4M  DS    CL1     12   18    1  A  U N             T        Y   20         
COMLN4MX DS    CL8                                                              
COMLN4FH DS    CL8                                                              
COMLN4F  DS    CL20    12   22   20  A  U N             T        Y   20         
COMLN4FX DS    CL8                                                              
COMLN4DH DS    CL8                                                              
COMLN4D  DS    CL32    12   44   32  A  P N             T        Y   30         
COMLN4DX DS    CL8                                                              
COMLN5TH DS    CL8                                                              
COMLN5T  DS    CL1     13    3    1  A  U N             T        Y   20         
COMLN5TX DS    CL8                                                              
COMLN5EH DS    CL8                                                              
COMLN5E  DS    CL1     13    8    1  A  U N             T        Y   20         
COMLN5EX DS    CL8                                                              
COMLN5LH DS    CL8                                                              
COMLN5L  DS    CL3     13   12    3  A  U N             T        Y   20         
COMLN5LX DS    CL8                                                              
COMLN5MH DS    CL8                                                              
COMLN5M  DS    CL1     13   18    1  A  U N             T        Y   20         
COMLN5MX DS    CL8                                                              
COMLN5FH DS    CL8                                                              
COMLN5F  DS    CL20    13   22   20  A  U N             T        Y   20         
COMLN5FX DS    CL8                                                              
COMLN5DH DS    CL8                                                              
COMLN5D  DS    CL32    13   44   32  A  P N             T        Y   30         
COMLN5DX DS    CL8                                                              
COMLN6TH DS    CL8                                                              
COMLN6T  DS    CL1     14    3    1  A  U N             T        Y   20         
COMLN6TX DS    CL8                                                              
COMLN6EH DS    CL8                                                              
COMLN6E  DS    CL1     14    8    1  A  U N             T        Y   20         
COMLN6EX DS    CL8                                                              
COMLN6LH DS    CL8                                                              
COMLN6L  DS    CL3     14   12    3  A  U N             T        Y   20         
COMLN6LX DS    CL8                                                              
COMLN6MH DS    CL8                                                              
COMLN6M  DS    CL1     14   18    1  A  U N             T        Y   20         
COMLN6MX DS    CL8                                                              
COMLN6FH DS    CL8                                                              
COMLN6F  DS    CL20    14   22   20  A  U N             T        Y   20         
COMLN6FX DS    CL8                                                              
COMLN6DH DS    CL8                                                              
COMLN6D  DS    CL32    14   44   32  A  P N             T        Y   30         
COMLN6DX DS    CL8                                                              
COMLN7TH DS    CL8                                                              
COMLN7T  DS    CL1     15    3    1  A  U N             T        Y   20         
COMLN7TX DS    CL8                                                              
COMLN7EH DS    CL8                                                              
COMLN7E  DS    CL1     15    8    1  A  U N             T        Y   20         
COMLN7EX DS    CL8                                                              
COMLN7LH DS    CL8                                                              
COMLN7L  DS    CL3     15   12    3  A  U N             T        Y   20         
COMLN7LX DS    CL8                                                              
COMLN7MH DS    CL8                                                              
COMLN7M  DS    CL1     15   18    1  A  U N             T        Y   20         
COMLN7MX DS    CL8                                                              
COMLN7FH DS    CL8                                                              
COMLN7F  DS    CL20    15   22   20  A  U N             T        Y   20         
COMLN7FX DS    CL8                                                              
COMLN7DH DS    CL8                                                              
COMLN7D  DS    CL32    15   44   32  A  P N             T        Y   30         
COMLN7DX DS    CL8                                                              
COMLN8TH DS    CL8                                                              
COMLN8T  DS    CL1     16    3    1  A  U N             T        Y   20         
COMLN8TX DS    CL8                                                              
COMLN8EH DS    CL8                                                              
COMLN8E  DS    CL1     16    8    1  A  U N             T        Y   20         
COMLN8EX DS    CL8                                                              
COMLN8LH DS    CL8                                                              
COMLN8L  DS    CL3     16   12    3  A  U N             T        Y   20         
COMLN8LX DS    CL8                                                              
COMLN8MH DS    CL8                                                              
COMLN8M  DS    CL1     16   18    1  A  U N             T        Y   20         
COMLN8MX DS    CL8                                                              
COMLN8FH DS    CL8                                                              
COMLN8F  DS    CL20    16   22   20  A  U N             T        Y   20         
COMLN8FX DS    CL8                                                              
COMLN8DH DS    CL8                                                              
COMLN8D  DS    CL32    16   44   32  A  P N             T        Y   30         
COMLN8DX DS    CL8                                                              
COMLN9TH DS    CL8                                                              
COMLN9T  DS    CL1     17    3    1  A  U N             T        Y   20         
COMLN9TX DS    CL8                                                              
COMLN9EH DS    CL8                                                              
COMLN9E  DS    CL1     17    8    1  A  U N             T        Y   20         
COMLN9EX DS    CL8                                                              
COMLN9LH DS    CL8                                                              
COMLN9L  DS    CL3     17   12    3  A  U N             T        Y   20         
COMLN9LX DS    CL8                                                              
COMLN9MH DS    CL8                                                              
COMLN9M  DS    CL1     17   18    1  A  U N             T        Y   20         
COMLN9MX DS    CL8                                                              
COMLN9FH DS    CL8                                                              
COMLN9F  DS    CL20    17   22   20  A  U N             T        Y   20         
COMLN9FX DS    CL8                                                              
COMLN9DH DS    CL8                                                              
COMLN9D  DS    CL32    17   44   32  A  P N             T        Y   30         
COMLN9DX DS    CL8                                                              
COMLNATH DS    CL8                                                              
COMLNAT  DS    CL1     18    3    1  A  U N             T        Y   20         
COMLNATX DS    CL8                                                              
COMLNAEH DS    CL8                                                              
COMLNAE  DS    CL1     18    8    1  A  U N             T        Y   20         
COMLNAEX DS    CL8                                                              
COMLNALH DS    CL8                                                              
COMLNAL  DS    CL3     18   12    3  A  U N             T        Y   20         
COMLNALX DS    CL8                                                              
COMLNAMH DS    CL8                                                              
COMLNAM  DS    CL1     18   18    1  A  U N             T        Y   20         
COMLNAMX DS    CL8                                                              
COMLNAFH DS    CL8                                                              
COMLNAF  DS    CL20    18   22   20  A  U N             T        Y   20         
COMLNAFX DS    CL8                                                              
COMLNADH DS    CL8                                                              
COMLNAD  DS    CL32    18   44   32  A  P N             T        Y   30         
COMLNADX DS    CL8                                                              
COMANNOH DS    CL8                                                              
COMANNO  DS    CL48    20    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   52   11  A  P N             T        Y              
COMLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1992 BYTES                            
