*          DATA SET NESFMCBD   AT LEVEL 012 AS OF 02/18/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CCBD      DATE 02/18/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
SFMCLTH  DS    CL8                                                              
SFMCLT   DS    CL3      5   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   18    7  A  P N             T        Y              
SFMNETH  DS    CL8                                                              
SFMNET   DS    CL4      5   27    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   36    7  A  P N             T        Y              
SFMPROH  DS    CL8                                                              
SFMPRO   DS    CL6      5   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   56    4  A  P N             T        Y              
SFMDATH  DS    CL8                                                              
SFMDAT   DS    CL10     5   62   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     6    2   13  A  P N             T        Y              
SFMTYPEH DS    CL8                                                              
SFMTYPE  DS    CL5      6   17    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      6   24    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75     7    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75     8    2   75  A  P N             T        Y              
SFMPRD1H DS    CL8                                                              
SFMPRD1  DS    CL9      9    2    9  A  U N             T        Y              
SFMPRD2H DS    CL8                                                              
SFMPRD2  DS    CL9      9   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   68    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22    2    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   13    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   24    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   35    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   57    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   68    9  A  U N             T        Y              
SFMTAGH  DS    CL8                                                              
SFMTAG   DS    CL1     22   79    1  A  P N             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2016 BYTES                            
