*          DATA SET NESFMCAD   AT LEVEL 021 AS OF 01/27/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CCAD      DATE 01/27/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MSLMEDH  DS    CL8                                                              
MSLMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
MSLSTATH DS    CL8                                                              
MSLSTAT  DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
MSLOPTNH DS    CL8                                                              
MSLOPTN  DS    CL12     5   46   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   58    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      6   65    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      6   72    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7    8    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7   19    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL11     7   28   11  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7   56    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   65    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   72    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8    8    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8   19    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL24     8   28   24  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8   56    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      8   65    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      8   72    4  L  P H             T        Y              
MSLSELH  DS    CL8                                                              
MSLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
MSLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
MSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
