*          DATA SET NESFM61D   AT LEVEL 001 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31C61D      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
SI2MEDH  DS    XL8                                                              
SI2MED   DS    CL1      6   10    1  A  U N             T        Y    1         
SI2MEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
SI2CLTH  DS    XL8                                                              
SI2CLT   DS    CL3      6   28    3  A  U N             T        Y    2         
SI2CLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
SI2PRDH  DS    XL8                                                              
SI2PRD   DS    CL8      6   46    8  A  U N             T        Y    3         
SI2PRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   56    8  A  P N             T        Y              
SI2ESTH  DS    XL8                                                              
SI2EST   DS    CL3      6   65    3  A  U N             T        Y    4         
SI2ESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SI2STATH DS    XL8                                                              
SI2STAT  DS    CL8      7   10    8  A  U N             T        Y    7         
SI2STATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
SI2MYRH  DS    XL8                                                              
SI2MYR   DS    CL8      7   28    8  A  U N             T        Y    8         
SI2MYRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   38    4  A  P N             T        Y              
SI2PR2H  DS    XL8                                                              
SI2PR2   DS    CL8      7   46    8  A  U N             T        Y    9         
SI2PR2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   56    4  A  P N             T        Y              
SI2ES2H  DS    XL8                                                              
SI2ES2   DS    CL3      7   65    3  A  U N             T        Y   10         
SI2ES2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   70    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SI2LN1H  DS    XL8                                                              
SI2LN1   DS    CL70     8   10   70  A  U N             T        Y    5         
SI2LN1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70     9   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    10   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    11   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    12   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    13   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    14   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    15   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    16   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    17   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    18   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     19    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    19   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     20    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    20   10   70  A  U N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P H             T        Y              
SI2LN14H DS    XL8                                                              
SI2LN14  DS    CL70    21   10   70  A  U N             T        Y    5         
SI2LN14X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
SI2PROFH DS    XL8                                                              
SI2PROF  DS    CL30    22   10   30  A  U N             T        Y    6         
SI2PROFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     22   42    7  A  P N             T        Y              
SI2CDTEH DS    XL8                                                              
SI2CDTE  DS    CL8     22   50    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22   60   11  A  P N             T        Y              
SI2ADTEH DS    XL8                                                              
SI2ADTE  DS    CL8     22   72    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    24    2   29  A  P H             T        Y              
SI2LAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SI2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1880 BYTES                            
