*          DATA SET NESFMF2D   AT LEVEL 017 AS OF 08/12/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF2D      DATE 08/12/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5   A    P    N         T         Y           
ESFMEDH  DS    CL8                                                              
ESFMED   DS    CL2      5   10    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      5   20    6   A    P    N         T         Y           
ESFCLTH  DS    CL8                                                              
ESFCLT   DS    CL3      5   28    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   38    7   A    P    N         T         Y           
ESFPRDH  DS    CL8                                                              
ESFPRD   DS    CL3      5   47    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      5   55    8   A    P    N         T         Y           
ESFESTH  DS    CL8                                                              
ESFEST   DS    CL3      5   65    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      6    2    4   A    P    N         T         Y           
ESFNTWKH DS    CL8                                                              
ESFNTWK  DS    CL4      6   10    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      6   20    3   A    P    N         T         Y           
ESFDPTH  DS    CL8                                                              
ESFDPT   DS    CL3      6   28    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      6   38    3   A    P    N         T         Y           
ESFPKGH  DS    CL8                                                              
ESFPKG   DS    CL3      6   43    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    N         T         Y           
ESFIDH   DS    CL8                                                              
ESFID    DS    CL6      7   10    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      7   65    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL37     9    2   37   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9   40    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL37    10    2   37   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL20    10   40   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     11    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    11   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     12    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    12   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     13    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    13   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    14   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     15    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    15   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     16    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    16   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    17   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     18    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    18   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     19    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    19   11   65   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     20    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    20   11   65   A    P    N         T         Y           
ESFTAGH  DS    CL8                                                              
ESFTAG   DS    CL1     21    2    1   A    P    N         T         Y           
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1192 BYTES                            
