*          DATA SET NESFMD3D   AT LEVEL 012 AS OF 07/22/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CD3D      DATE 07/22/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFMMEDH  DS    CL8                                                              
SFMMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SFMCLTH  DS    CL8                                                              
SFMCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL2      5   34    2  A  P H             T        Y              
SFMIDH   DS    CL8                                                              
SFMID    DS    CL4      5   37    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SFMBK1H  DS    CL8                                                              
SFMBK1   DS    CL12     7   11   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   33    4  A  P N             T        Y              
SFMNM1H  DS    CL8                                                              
SFMNM1   DS    CL24     7   39   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SFMBK2H  DS    CL8                                                              
SFMBK2   DS    CL12     8   11   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   33    4  A  P N             T        Y              
SFMNM2H  DS    CL8                                                              
SFMNM2   DS    CL24     8   39   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    10    2   25  A  P N             T        Y              
SFMUSERH DS    CL8                                                              
SFMUSER  DS    CL3     10   30    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
SFMPRD1H DS    CL8                                                              
SFMPRD1  DS    CL3     11   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   24    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   30    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   36    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   42    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   54    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   60    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   66    3  A  U N             T        Y              
SFMPRDXH DS    CL8                                                              
SFMPRDX  DS    CL3     11   72    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
SFMLST1H DS    CL8                                                              
SFMLST1  DS    CL72    15    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    16    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    17    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    18    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    19    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    20    2   72  A  P N             T        Y              
SFMLSTXH DS    CL8                                                              
SFMLSTX  DS    CL72    21    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
SFMADD1H DS    CL8                                                              
SFMADD1  DS    CL30    23   10   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   42    6  A  P N             T        Y              
SFMADD2H DS    CL8                                                              
SFMADD2  DS    CL30    23   50   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
SFMADD3H DS    CL8                                                              
SFMADD3  DS    CL30    24   10   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   42    6  A  P N             T        Y              
SFMADD4H DS    CL8                                                              
SFMADD4  DS    CL30    24   50   30  A  U N             T        Y              
SFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
