*          DATA SET NESFMF4D   AT LEVEL 008 AS OF 07/31/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CF4D      DATE 07/31/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
LSTMEDH  DS    CL8                                                              
LSTMED   DS    CL2      5    9    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   13    7  A   P    N         T        Y              
LSTNTWKH DS    CL8                                                              
LSTNTWK  DS    CL4      5   22    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     5   28   10  A   P    N         T        Y              
LSTEFFH  DS    CL8                                                              
LSTEFF   DS    CL8      5   40    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   58    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24     7    2   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24     8    2   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24     9    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    10    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    11    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    12    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    13    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    14    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    15    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    16    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    17    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    18    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    19    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    20    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    21    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    22    8   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    23    8   24  A   P    N         T        Y              
LSTTAGH  DS    CL8                                                              
LSTTAG   DS    CL1     24    2    1  A   P    N         T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 816  BYTES                            
