*          DATA SET NESFMDBD   AT LEVEL 001 AS OF 10/13/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CDBD      DATE 10/13/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SMFMDH   DS    XL8                                                              
SMFMD    DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL2      5   20    2  A  P N             T        Y              
SMFIDDH  DS    XL8                                                              
SMFIDD   DS    CL2      5   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   65    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60     7    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60     8    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65     9   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    10   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    11   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    12   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    13   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    14   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    15   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    16   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    17   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    18   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    19   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    20   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    21   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    22   11   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    23   11   65  A  P N             T        Y              
SMFTAGH  DS    XL8                                                              
SMFTAG   DS    CL1     24    2    1  A  P N             T        Y              
SMFLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SMFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1464 BYTES                            
