*          DATA SET NESFME2D   AT LEVEL 005 AS OF 06/10/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219E2D      DATE 06/10/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     7    2   12  A   P    N         T        Y              
PRDNAMEH DS    CL8                                                              
PRDNAME  DS    CL20     7   18   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A   P    N         T        Y              
PRDACCTH DS    CL8                                                              
PRDACCT  DS    CL5      9   18    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    10    2   13  A   P    N         T        Y              
PRDCLASH DS    CL8                                                              
PRDCLAS  DS    CL2     10   18    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A   P    N         T        Y              
PRDBNAMH DS    CL8                                                              
PRDBNAM  DS    CL30    12   18   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   10    7  A   P    N         T        Y              
PRDADD2H DS    CL8                                                              
PRDADD2  DS    CL30    13   18   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   10    7  A   P    N         T        Y              
PRDADD3H DS    CL8                                                              
PRDADD3  DS    CL30    14   18   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   10    7  A   P    N         T        Y              
PRDADD4H DS    CL8                                                              
PRDADD4  DS    CL30    15   18   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    17    2   16  A   P    N         T        Y              
PRDOAFH  DS    CL8                                                              
PRDOAF   DS    CL5     17   19    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL29    18    2   29  A   P    N         T        Y              
PRDBBASH DS    CL8                                                              
PRDBBAS  DS    CL5     18   32    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18   39    8  A   P    N         T        Y              
PRDCPCTH DS    CL8                                                              
PRDCPCT  DS    CL8     18   48    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   58   10  A   P    N         T        Y              
PRDCBASH DS    CL8                                                              
PRDCBAS  DS    CL5     18   69    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    19   20   15  A   P    N         T        Y              
PRDEDATH DS    CL8                                                              
PRDEDAT  DS    CL8     19   37    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   18    1  A   U    N         T        Y              
PRDLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
PRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 530  BYTES                            
