*          DATA SET NESFMB5D   AT LEVEL 006 AS OF 09/12/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CB5D      DATE 09/12/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFMMEDH  DS    XL8                                                              
SFMMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFMMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   20    2  A  P H             T        Y              
SFMIDH   DS    XL8                                                              
SFMID    DS    CL1      5   28    1  A  U H             T        Y    0         
SFMIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     7    2   13  A  P H             T        Y              
SFMBK1H  DS    XL8                                                              
SFMBK1   DS    CL12     7   17   12  A  U H             T        Y    0         
SFMBK1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   35    6  A  P H             T        Y              
SFMLN1H  DS    XL8                                                              
SFMLN1   DS    CL1      7   43    1  A  U H             T        Y    0         
SFMLN1X  DS    XL8                                                              
SFMZLN1H DS    XL8                                                              
SFMZLN1  DS    CL1      7   45    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
SFMBK2H  DS    XL8                                                              
SFMBK2   DS    CL12     8   17   12  A  U H             T        Y    0         
SFMBK2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8   35    6  A  P N             T        Y              
SFMLN2H  DS    XL8                                                              
SFMLN2   DS    CL1      8   43    1  A  U H             T        Y    0         
SFMLN2X  DS    XL8                                                              
SFMZLN2H DS    XL8                                                              
SFMZLN2  DS    CL1      8   45    1  A  P Z             T        Y              
SFMSMIDH DS    XL8                                                              
SFMSMID  DS    CL20    10    2   20  A  P N             T        Y              
SFMSMI1H DS    XL8                                                              
SFMSMI1  DS    CL1     10   23    1  A  P N             T        Y              
SFMSCM1H DS    XL8                                                              
SFMSCM1  DS    CL8     10   25    8  A  U N             T        Y  111         
SFMSCM1X DS    XL8                                                              
SFMSMI2H DS    XL8                                                              
SFMSMI2  DS    CL1     10   40    1  A  P N             T        Y              
SFMSCM2H DS    XL8                                                              
SFMSCM2  DS    CL8     10   42    8  A  U N             T        Y  111         
SFMSCM2X DS    XL8                                                              
SFMSMI3H DS    XL8                                                              
SFMSMI3  DS    CL1     11   23    1  A  P N             T        Y              
SFMSCM3H DS    XL8                                                              
SFMSCM3  DS    CL8     11   25    8  A  U N             T        Y  111         
SFMSCM3X DS    XL8                                                              
SFMSMI4H DS    XL8                                                              
SFMSMI4  DS    CL1     11   40    1  A  P N             T        Y              
SFMSCM4H DS    XL8                                                              
SFMSCM4  DS    CL8     11   42    8  A  U N             T        Y  111         
SFMSCM4X DS    XL8                                                              
SFMSMI5H DS    XL8                                                              
SFMSMI5  DS    CL1     12   23    1  A  P N             T        Y              
SFMSCM5H DS    XL8                                                              
SFMSCM5  DS    CL8     12   25    8  A  U N             T        Y  111         
SFMSCM5X DS    XL8                                                              
SFMSMI6H DS    XL8                                                              
SFMSMI6  DS    CL1     12   40    1  A  P N             T        Y              
SFMSCM6H DS    XL8                                                              
SFMSCM6  DS    CL8     12   42    8  A  U N             T        Y  111         
SFMSCM6X DS    XL8                                                              
SFMTAGH  DS    XL8                                                              
SFMTAG   DS    CL1     13    2    1  A  P N             T        Y              
SFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 488  BYTES                            
