*          DATA SET NESFMA0D   AT LEVEL 002 AS OF 01/31/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31CA0D      DATE 01/31/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
OFDOFDH  DS    XL8                                                              
OFDOFD   DS    CL2      5   10    2  A  U H             T    I   Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
OFDMNDH  DS    XL8                                                              
OFDMND   DS    CL24     6   10   24  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL13     7    2   13  A  P N             T        Y              
OFDLISH  DS    XL8                                                              
OFDLIS   DS    CL1      7   16    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10     7   38   10  A  P N             T        Y              
OFDMEDH  DS    XL8                                                              
OFDMED   DS    CL1      7   49    1  A  U H             T        Y              
OFDSTRTH DS    XL8                                                              
OFDSTRT  DS    CL79     9    2   79  A  P H             T        Y              
OFDSELH  DS    XL8                                                              
OFDSEL   DS    CL1     10    2    1  A  U N             T        Y              
OFDCODEH DS    XL8                                                              
OFDCODE  DS    CL33    10    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    10   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    11    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    11   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    12    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    12   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    13    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    13   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    14    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    14   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    15    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    15   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    16    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    16   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    17    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    17   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    18    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    18   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    19    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    19   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    20    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    20   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    21    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    21   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    22    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    22   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    23    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   43    1  A  U N             T        Y              
OFDENDH  DS    XL8                                                              
OFDEND   DS    CL33    23   48   33  A  P N             T        Y              
OFDPFKYH DS    XL8                                                              
OFDPFKY  DS    CL64    24    2   64  A  P H             T        Y              
OFDREH   DS    XL8                                                              
OFDRE    DS    CL11    24   68   11  A  P Z             T        Y              
OFDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
OFDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
