*          DATA SET NESPLF6D   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T31DF6D      DATE 12/01/83                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
RNKSRCEH DS    CL8                                                              
RNKSRCE  DS    CL22     6   13   22   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL4      7    2    4   A    P    N         T         Y           
RNKBOOKH DS    CL8                                                              
RNKBOOK  DS    CL22     7   13   22   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5      8    2    5   A    P    N         T         Y           
RNKDEMOH DS    CL8                                                              
RNKDEMO  DS    CL36     8   13   36   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     10   13    9   A    P    N         T         Y           
RNKDAYH  DS    CL8                                                              
RNKDAY   DS    CL3     12   13    3   A    U    N         T         Y           
RNKTIMEH DS    CL8                                                              
RNKTIME  DS    CL11    12   18   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     13   13    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    13   18   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14   13    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    14   18   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     15   13    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    15   18   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     16   13    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    16   18   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17   13    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    17   18   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     18   13    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    18   18   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     20    2    8   A    P    N         T         Y           
RNKSTATH DS    CL8                                                              
RNKSTAT  DS    CL7     20   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20   22    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20   40    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20   49    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20   58    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     21   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     21   22    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     21   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     21   40    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     21   49    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     21   58    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     23    2    9   A    P    N         T         Y           
RNKMANYH DS    CL8                                                              
RNKMANY  DS    CL4     23   13    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     24    2    7   A    P    N         T         Y           
RNKFILTH DS    CL8                                                              
RNKFILT  DS    CL7     24   13    7   A    U    N         T         Y           
RNKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RNKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 628  BYTES                            
