*          DATA SET NESPLD1D   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T31DD1D      DATE 12/01/83                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL4      6   13    4   A    U    N         T    I    Y           
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   24   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    N         T         Y           
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL4      7   13    4   A    U    N         T         Y           
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     7   24   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    2    8   A    P    N         T         Y           
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   13    8   A    U    N         T         Y           
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     8   24   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9    2    7   A    P    N         T         Y           
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4      9   13    4   A    U    N         T         Y           
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24     9   24   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4     10    2    4   A    P    N         T         Y           
SPLBOOKH DS    CL8                                                              
SPLBOOK  DS    CL5     10   13    5   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11    2    7   A    P    N         T         Y           
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL4     11   13    4   A    U    N         T         Y           
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    11   24   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13    2    8   A    P    N         T         Y           
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL8     13   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14    2    8   A    P    N         T         Y           
SPLDTAH  DS    CL8                                                              
SPLDTA   DS    CL4     14   13    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30    14   24   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     15    2    9   A    P    N         T         Y           
SPLMGRH  DS    CL8                                                              
SPLMGR   DS    CL2     15   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16    2    8   A    P    N         T         Y           
SPLSEQH  DS    CL8                                                              
SPLSEQ   DS    CL2     16   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     17    2    6   A    P    N         T         Y           
SPLFLAVH DS    CL8                                                              
SPLFLAV  DS    CL2     17   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    17   24   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     18    2    6   A    P    N         T         Y           
SPLDETH  DS    CL8                                                              
SPLDET   DS    CL2     18   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL42    18   24   42   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    19    2   10   A    P    N         T         Y           
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL8     19   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     20    2    8   A    P    N         T         Y           
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL8     20   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    21    2   10   A    P    N         T         Y           
SPLTAPEH DS    CL8                                                              
SPLTAPE  DS    CL8     21   13    8   A    U    N         T         Y           
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 706  BYTES                            
