*          DATA SET NESPLD3D   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T31DD3D      DATE 12/01/83                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL5      6   13    5   A    U    N         T    I    Y           
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   24   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    N         T         Y           
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL5      7   13    5   A    U    N         T         Y           
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     7   24   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    2    8   A    P    N         T         Y           
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   13    8   A    U    N         T         Y           
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     8   24   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10    2    7   A    P    N         T         Y           
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4     10   13    4   A    U    N         T         Y           
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24    10   24   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11    2    7   A    P    N         T         Y           
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL4     11   13    4   A    U    N         T         Y           
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL8     11   24    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12    2    7   A    P    N         T         Y           
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL4     12   13    4   A    U    N         T         Y           
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    12   24   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14    2    6   A    P    N         T         Y           
SPLFLAVH DS    CL8                                                              
SPLFLAV  DS    CL2     14   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15    2    8   A    P    N         T         Y           
SPLFORMH DS    CL8                                                              
SPLFORM  DS    CL30    15   13   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    16    2   10   A    P    N         T         Y           
SPLDETH  DS    CL8                                                              
SPLDET   DS    CL11    16   13   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     17    2    7   A    P    N         T         Y           
SPLSUBH  DS    CL8                                                              
SPLSUB   DS    CL2     17   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     18    2    9   A    P    N         T         Y           
SPLRECH  DS    CL8                                                              
SPLREC   DS    CL8     18   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     19    2    9   A    P    N         T         Y           
SPLRSUBH DS    CL8                                                              
SPLRSUB  DS    CL2     19   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    20    2   10   A    P    N         T         Y           
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL8     20   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     21    2    8   A    P    N         T         Y           
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL8     21   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     22    2    5   A    P    N         T         Y           
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL24    22   13   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     23    2    6   A    P    N         T         Y           
SPLOTHH  DS    CL8                                                              
SPLOTH   DS    CL24    23   13   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     24    2    6   A    P    N         T         Y           
SPLFILTH DS    CL8                                                              
SPLFILT  DS    CL2     24   13    2   A    U    N         T         Y           
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 732  BYTES                            
