*          DATA SET NESPLE3D   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T31DE3D      DATE 12/01/83                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7   A    P    N         T         Y           
PRGNETH  DS    CL8                                                              
PRGNET   DS    CL8      6   13    8   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL10     7    2   10   A    P    N         T         Y           
PRGSTRTH DS    CL8                                                              
PRGSTRT  DS    CL8      7   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    2    8   A    P    N         T         Y           
PRGENDH  DS    CL8                                                              
PRGEND   DS    CL8      8   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      9    2    3   A    P    N         T         Y           
PRGDAYH  DS    CL8                                                              
PRGDAY   DS    CL4      9   13    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL35     9   24   35   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10    2    8   A    P    N         T         Y           
PRGSEQH  DS    CL8                                                              
PRGSEQ   DS    CL2     10   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL27    10   24   27   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11    2    7   A    P    N         T         Y           
PRGFILTH DS    CL8                                                              
PRGFILT  DS    CL4     11   13    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     12   13    1   A    U    N         T         Y           
PRGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 263  BYTES                            
