*          DATA SET NESPLD5D   AT LEVEL 008 AS OF 07/11/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T31DD5D      DATE 07/11/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
RESSRCEH DS    CL8                                                              
RESSRCE  DS    CL8      6   13    8  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
RESBOOKH DS    CL8                                                              
RESBOOK  DS    CL60     7   13   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A   P    N         T        Y              
RESSTATH DS    CL8                                                              
RESSTAT  DS    CL10     8   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   25   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   49   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   61   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9   25   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A   P    N         T        Y              
RESSTRTH DS    CL8                                                              
RESSTRT  DS    CL8     11   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   25    8  A   P    N         T        Y              
RESENDH  DS    CL8                                                              
RESEND   DS    CL8     11   37    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     12    2    9  A   P    N         T        Y              
RESDAYH  DS    CL8                                                              
RESDAY   DS    CL8     12   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12   23   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13   23   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   23   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   23   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   23   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   23   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18    2   10  A   P    N         T        Y              
RESDPTH  DS    CL8                                                              
RESDPT   DS    CL8     18   13    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A   P    N         T        Y              
RESDETH  DS    CL8                                                              
RESDET   DS    CL40    19   13   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   P    N         T        Y              
RESAVEH  DS    CL8                                                              
RESAVE   DS    CL40    20   13   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A   P    N         T        Y              
RESDEMOH DS    CL8                                                              
RESDEMO  DS    CL60    21   13   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A   P    N         T        Y              
RESOPTH  DS    CL8                                                              
RESOPT   DS    CL60    22   13   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     23    2    9  A   P    N         T        Y              
RESFILTH DS    CL8                                                              
RESFILT  DS    CL60    23   13   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   13    1  A   U    N         T        Y              
RESLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 980  BYTES                            
