*          DATA SET NESPLF9D   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T31DF9D      DATE 12/01/83                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
LAYSRCEH DS    CL8                                                              
LAYSRCE  DS    CL24     6   13   24   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL4      7    2    4   A    P    N         T         Y           
LAYBOOKH DS    CL8                                                              
LAYBOOK  DS    CL24     7   13   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5      8    2    5   A    P    N         T         Y           
LAYDEMOH DS    CL8                                                              
LAYDEMO  DS    CL36     8   13   36   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10    2    8   A    P    N         T         Y           
LAYSTATH DS    CL8                                                              
LAYSTAT  DS    CL7     10   13    7   A    U    N         T         Y           
LAYMKTH  DS    CL8                                                              
LAYMKT   DS    CL24    10   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    11   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    12   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    13   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    14   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    15   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17    2    3   A    P    N         T         Y           
LAYDAYH  DS    CL8                                                              
LAYDAY   DS    CL4     17   13    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    18    2   10   A    P    N         T         Y           
LAYSTRTH DS    CL8                                                              
LAYSTRT  DS    CL7     18   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     19    2    8   A    P    N         T         Y           
LAYENDH  DS    CL8                                                              
LAYEND   DS    CL7     19   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     20    2    6   A    P    N         T         Y           
LAYFILTH DS    CL8                                                              
LAYFILT  DS    CL7     20   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     21   13    1   A    U    N         T         Y           
LAYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 573  BYTES                            
