*          DATA SET NESPLFFD   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T21DFFD      DATE 12/01/83                 
         SPACE 3                                                                
T21DFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
CONHEADH DS    CL8                                                              
CONHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
CONSERVH DS    CL8                                                              
CONSERV  DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9      3    2    9   A    P    N         T         Y           
CONIDH   DS    CL8                                                              
CONID    DS    CL8      3   13    8   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL6      4    2    6   A    P    N         T         Y           
CONREPH  DS    CL8                                                              
CONREP   DS    CL8      4   13    8   A    U    N         T         Y           
CONTAGH  DS    CL8                                                              
CONTAG   DS    CL1      5   13    1   A    P    N         T         Y           
CONWHNHH DS    CL8                                                              
CONWHNH  DS    CL5      7    2    5   A    P    N         T         Y           
CONWHENH DS    CL8                                                              
CONWHEN  DS    CL6      7   13    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      8    2    6   A    P    N         T         Y           
CONOUTH  DS    CL8                                                              
CONOUT   DS    CL6      8   13    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9    2    5   A    P    N         T         Y           
CONDESTH DS    CL8                                                              
CONDEST  DS    CL6      9   13    6   A    U    N         T         Y           
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 250  BYTES                            
