*          DATA SET NESPLEFD   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T31DEFD      DATE 12/01/83                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
SPLFLAVH DS    CL8                                                              
SPLFLAV  DS    CL4      6   13    4   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL15     6   20   15   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6      7    2    6   A    P    N         T         Y           
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL4      7   13    4   A    U    N         T         Y           
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     7   20   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    2    8   A    P    N         T         Y           
SPLSEQH  DS    CL8                                                              
SPLSEQ   DS    CL4      8   13    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL35     8   20   35   A    P    N         T         Y           
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 177  BYTES                            
