*          DATA SET NESPLF4D   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T31DF4D      DATE 12/01/83                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
PURSRCEH DS    CL8                                                              
PURSRCE  DS    CL24     6   13   24   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL4      7    2    4   A    P    N         T         Y           
PURBOOKH DS    CL8                                                              
PURBOOK  DS    CL24     7   13   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      8    2    4   A    P    N         T         Y           
PURDEMOH DS    CL8                                                              
PURDEMO  DS    CL7      8   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13     8   22   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10    2    8   A    P    N         T         Y           
PURSTATH DS    CL8                                                              
PURSTAT  DS    CL7     10   13    7   A    U    N         T         Y           
PURMKTH  DS    CL8                                                              
PURMKT   DS    CL24    10   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    11   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    12   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    13   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    14   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    15   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     16   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    16   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     17   13    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL24    17   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     19    2    7   A    P    N         T         Y           
PUROPT1H DS    CL8                                                              
PUROPT1  DS    CL2     19   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL23    19   22   23   A    P    N         T         Y           
PUROPT2H DS    CL8                                                              
PUROPT2  DS    CL2     20   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL33    20   22   33   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     21   13    1   A    U    N         T         Y           
PURLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PURWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 649  BYTES                            
