*          DATA SET NESPLF2D   AT LEVEL 001 AS OF 12/01/83                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T31DF2D      DATE 12/01/83                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL4      6   13    4   A    U    N         T    I    Y           
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     6   24   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    N         T         Y           
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL4      7   13    4   A    U    N         T         Y           
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     7   24   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    2    8   A    P    N         T         Y           
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   13    8   A    U    N         T         Y           
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     8   24   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10    2    7   A    P    N         T         Y           
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL4     10   13    4   A    U    N         T         Y           
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24    10   24   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11    2    7   A    P    N         T         Y           
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL4     11   13    4   A    U    N         T         Y           
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL8     11   24    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12    2    7   A    P    N         T         Y           
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL4     12   13    4   A    U    N         T         Y           
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    12   24   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14    2    6   A    P    N         T         Y           
SPLFLAVH DS    CL8                                                              
SPLFLAV  DS    CL2     14   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    14   24   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     15    2    9   A    P    N         T         Y           
SPLDOPTH DS    CL8                                                              
SPLDOPT  DS    CL2     15   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL34    15   24   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     16    2    9   A    P    N         T         Y           
SPLSPOTH DS    CL8                                                              
SPLSPOT  DS    CL2     16   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL23    16   24   23   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     17    2    9   A    P    N         T         Y           
SPLGRPTH DS    CL8                                                              
SPLGRPT  DS    CL2     17   13    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    17   24   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    19    2   10   A    P    N         T         Y           
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL8     19   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     20    2    8   A    P    N         T         Y           
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL8     20   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     21    2    6   A    P    N         T         Y           
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL8     21   13    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     22   13    1   A    U    N         T         Y           
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 685  BYTES                            
