*          DATA SET NETAPED    AT LEVEL 007 AS OF 03/16/90                      
*                                                                               
*        NETPAK REQUEST RECORD                                                  
*                                                                               
TAPED1   DSECT            DSECT FOR INTERFACE TAPE                              
TPMED1   DS    CL1                 MEDIA                                        
TPCLT1   DS    CL3                 CLIENT                                       
TPPRD1   DS    CL3                 PRODUCT                                      
TPEST1   DS    CL3                 ESTIMATE                                     
TPRECOD1 DS    CL2                 C'00'                                        
         DS    CL4                                                              
TPNTWK1  DS    CL5                 NETWORK                                      
         DS    CL3                                                              
TPSTART1 DS    CL6                 START TIME(NNNNA)                            
TPEND1   DS    CL6                 END TIME  (NNNNA)                            
         DS    CL152                                                            
TPREQNM  DS    CL12                REQUESTOR'S NAME                             
         EJECT                                                                  
*                                                                               
*        NETPAK SCHEDULE RECORD                                                 
*                                                                               
TAPED    DSECT            DSECT FOR INTERFACE TAPE                              
TPMED    DS    CL1                 MEDIA                                        
TPCLT    DS    CL3                 CLIENT                                       
TPPRD    DS    CL3                 PRODUCT                                      
TPEST    DS    CL3                 ESTIMATE                                     
TPRECODE DS    CL2                 C'20'                                        
         DS    CL4                                                              
TPNTWK   DS    CL5                 NETWORK                                      
TPDAYPT  DS    CL1                 DAYPART                                      
TPSPTLN  DS    CL2                 SPOT LENGTH(PACKED)                          
TPACTDAT DS    CL6                 DATE(YYMMDD)                                 
TPPKGNM  DS    CL1                 PACKAGE NUMBER(BINARY)                       
         DS    CL5                                                              
TPUNITS  DS    CL3                 NUMBER OF UNITS(ALWAYS=1)                    
TPCOST   DS    CL5                 ACTUAL COST(PACKED)                          
TPDEMO   DS    CL7                 DEMO NAME                                    
TPDEMVAL DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
TPDEMTYP DS    CL1                 E=ESTIMATED/A=ACTUAL DEMOS                   
TPPROGNM DS    CL16                PROGRAM NAME                                 
TPSTART  DS    CL5                 START TIME(NNNNA)                            
TPEND    DS    CL5                 END TIME  (NNNNA)                            
TPAFFID  DS    CL5                 AFFID(NNNNA)                                 
TPDAY    DS    CL3                 DAY                                          
         DS    CL8                 (RESERVED)                                   
TPCOST1  DS    CL5                 ASSIGNED COST(PACKED)                        
TPINTEG  DS    CL5                 INTEGRATION  (PACKED)                        
TPFEED   DS    CL2                 FEED PERCENTAGE 2 DEC                        
         DS    CL4                 RESERVED                                     
TPSPCHG  DS    CL5                 SPECIAL CHARGES(PACKED)                      
TPSEQNUM DS    CL4                 SEQUENCE NUMBER(PACKED)                      
         EJECT                                                                  
*                                                                               
*        NETPAK SUMMARY RECORD                                                  
*                                                                               
TAPED3   DSECT            DSECT FOR INTERFACE TAPE                              
TPMED3   DS    CL1                 MEDIA                                        
TPCLT3   DS    CL3                 CLIENT                                       
TPPRD3   DS    CL3                 PRODUCT                                      
TPEST3   DS    CL3                 ESTIMATE                                     
TPRECOD3 DS    CL2                 C'21'                                        
         DS    CL4                                                              
TPNTWK3  DS    CL5                 NETWORK                                      
TPDAYPT3 DS    CL1                 DAYPART                                      
TPSPTLN3 DS    CL2                 SPOT LENGTH(PACKED)                          
TPSTART3 DS    CL6                 START DATE(YYMMDD)                           
TPEND3   DS    CL6                 END DATE  (YYMMDD)                           
TPUNITS3 DS    CL3                 NUMBER OF UNITS(ALWAYS=1)                    
TPCOST3  DS    CL5                 ACTUAL COST(PACKED)                          
TPDEMO3  DS    CL7                 DEMO NAME                                    
TPDEMVL3 DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
         DS    CL7                 DEMO NAME                                    
         DS    CL4                 DEMO VALUE(PACKED)                           
TPDEMTP3 DS    CL1                 E=ESTIMATED/A=ACTUAL DEMOS                   
TPCOST31 DS    CL5                 ASSIGNED COST(PACKED)                        
TPINTEG3 DS    CL5                 INTEGRATION  (PACKED)                        
TPSPCHG3 DS    CL5                 SPECIAL CHARGES (PACKED)                     
         DS    CL53                                                             
TPSEQNM3 DS    CL4                 SEQUENCE NUMBER(PACKED)                      
         EJECT                                                                  
*                                                                               
