*          DATA SET NETBLOCKN  AT LEVEL 087 AS OF 02/03/20                      
         SPACE 3                                                                
*              NETBLOCK - I/O SELECTIONS                                        
         SPACE 3                                                                
         DS    0D                                                               
NETBLOCK DS    0C                                                               
         SPACE 1                                                                
         DS    0D                   I/O SELECTIONS                              
         DS    CL4                 "SELS" LABEL                                 
         DS    CL4                 SPARE                                        
NBSELID  DS    CL2                 ID NUMBER OR...                              
NBSELAGY DS    CL2                 AGENCY                                       
NBSELMED DS    CL1                 AND MEDIA CODE OR...                         
NBSELAM  DS    CL1                 AGENCY/MEDIA COMPRESSED                      
NBSELCLI DS    CL3                 3 BYTE CLIENT CODE OR...                     
NBSELCL2 DS    CL2                 2 BYTE COMPRESSED CLIENT                     
NBSELPRD DS    CL3                 3 BYTE PRODUCT CODE OR...                    
NBSELPNM DS    CL1                 1 BYTE PRODUCT NUMBER                        
NBSELPGR DS    CL5                 PRODUCT GROUP VN TO UNNNN                    
NBSELEST DS    CL1                 ESTIMATE NUMBER                              
NBSELESE DS    CL1                 END RANGE NUMBER                             
NBSELEFL DS    CL3                 ESTIMATE FILTERS                             
NBSELNET DS    CL4                 NETWORK                                      
NBSELDP  DS    CL1                 DAYPART CODE                                 
NBSELPAK DS    CL1                 PACKAGE NUMBER                               
NBSELPST DS    CL1                 L=LOCKED H=HOLD B=BOTH                       
*                                  (DEFAULT=UNLOCKED)                           
NBSELSTR DS    CL6                 START DATE (YYMMDD)                          
NBSELEND DS    CL6                 END DATE (YYMMDD)                            
NBSELPRG DS    CL6                 PROGRAM                                      
NBSELPFL DS    CL3                 PROGRAM FILTERS (*=WILD X'40'=MINUS)         
NBSELMOD DS    CL1                 EXIT NETIO WHEN NBSELMOD=NBMODE              
NBSELUOP DS    CL1                 UNIT SELECTION OPTION                        
*                                  E=ESTIMATES A=ACTUALS B=BOTH(DEFALT)         
NBSELSUB DS    CL1                 SUB-CODE                                     
NBSELFLT DS    CL1                 ACCOUNTING FILTER (0-5)                      
NBSELOFF DS    CL1                 OFFICE                                       
NBSELTRF DS    CL1                 INCLUDE TRAFFIC UNITS? T=TRAF ONLY           
*                                      B=BOTH  DEFAULT= NO                      
NBSELPRN DS    CL1                 Y=DONT PRINT UNITS W/NO PRINT                
*                                  PACKAGE STATUS                               
NBSELPKF DS    CL6                 PACKAGE FILTERING                            
NBSELMFL DS    CL1                 MEDIA FILTER                                 
NBSELLEN DS    CL1                 LENGTH FILTER                                
NBSELPIG DS    XL2                 FILTERING EXACT PIGGYBACK PAIR               
*                                  NBSELPG3 HAS 3 CHAR PIGGY PRODS              
         EJECT                                                                  
*              NETBLOCK - DATA SELECTION OPTIONS                                
         SPACE 3                                                                
         DS    0D                                                               
NBSELNDP DS    CL2                 NEW 2 BYTE DAYPART CODE                      
NBACTNDP DS    CL2                 KEY DPT CODE (REPLACES NBACTDP)              
NB$AMT   DS    CL4                 $$$ IN $TYPE REQUEST                         
*                                                                               
NBDATA   DS    CL1                 DATA REQUIRED U=UNITS, P=PACKAGES            
*                                                B=BOTH (PACKAGES FRST)         
NBSEQ    DS    CL1                 SEQUENCE D=DATE N=NETWORK                    
*                                           P= PROGRAM W/DAYOFWEEK 1ST          
*                                           Q=TRUE PROGRAM                      
NBESTOPT DS    CL1                 Y=ESTIMATED DEMOS REQUIRED                   
*                                  M=RETURN EST DEMOS UNCONDITIONALLY           
*                                   (E.G. FOR MAKE GOODS AND PFBS)              
*                                  OTHERS- IF NBESTFCT SET, USED                
*                                  TO COMPARE VS. NBUNITST                      
NBREVOPT DS    CL1                 A=LATEST EST. RETURNED AS ACTUALS            
*                                  E=LATEST EST. RETURNED AS EST. DEMOS         
NBACTOPT DS    CL1                 Y=ACTUAL DEMOS REQUIRED                      
NBTRCOPT DS    CL1                 Y=TRACE (SUPPLY NBPRINT)                     
NBOPNOPT DS    CL1                 Y=OPEN FILES (OFF-LINE)                      
NBUSER   DS    CL16                USER PROFILE                                 
NBESTFCT DS    CL1                 FUNCTION TO BE APPLIED TO NBESTOPT           
*                                  1=AND, REJECT 0. 2=AND, ACCEPT 0.            
*                                  3=XOR, REJECT 0. 4=XOR, ACCEPT 0.            
*                                  5=EQ, ACCEPT =.  6=EQ, REJECT =.             
NBUSER1  DS    CL16                N1 USER PROFILE                              
NBHUNOPT DS    CL1                 Y=REPORT HANDLES IMPS IN HUNDREDS            
NBSPLOPT DS    XL1                 SPLIT OPTION                                 
*                                  X'80'=SHOW AS SEPARATE UNITS                 
*                                  X'40'=SPLIT EVEN IF POOL                     
*                                  X'20'=CHECK FOR A BILLING ELEMENT            
*                                  X'10'=DONT SPLIT NUM FOR COPY SPLITS         
*                                  X'01'=DONT INCLUDE ADU UNITS                 
NBSPLPRN DS    XL1                 CURRENT SPLIT PRODUCT NUMBER                 
NBDMGOPT DS    XL1                 X'08' PASS DELETED RECORDS                   
NBSURVEY DS    XL1                 N=NETWORK C=CABLE OR X'00'                   
NBCLITOG DS    CL1                 CLIENTS T=TOGETHER S=SEPARATE                
NBUSRMED DS    CL1                 MEDIA CODE FOR USER PROFILES                 
NBPEROVR DS    CL1                 PERIOD TYPE OVERRIDE (B/C/S)                 
NBREROPT DS    CL1                 OPTION TO RERATE                             
*                                  D=DIARY C=CONFORMED I=INTEGRATED             
NBOFFTYP DS    XL1                 X'80'=LIST X'40'=NEGATIVE OFFICE             
NBSPLTYP DS    CL1                 SPLIT TYPE FOUND F=FIRST PRODUCT             
*                                  S=SECOND B=BILLED                            
         EJECT                                                                  
*              NETBLOCK - EQUATES FOR USER PROFILES                             
         SPACE 3                                                                
NBN0B1   EQU   NBUSER              N0 PROFILE BYTES                             
NBN0B2   EQU   NBUSER+1                                                         
NBN0B3   EQU   NBUSER+2                                                         
NBN0B4   EQU   NBUSER+3                                                         
NBN0B5   EQU   NBUSER+4                                                         
NBN0B6   EQU   NBUSER+5                                                         
NBN0B7   EQU   NBUSER+6                                                         
NBN0B8   EQU   NBUSER+7                                                         
NBN0B9   EQU   NBUSER+8                                                         
NBN0B10  EQU   NBUSER+9                                                         
NBN0B11  EQU   NBUSER+10                                                        
NBN0B12  EQU   NBUSER+11                                                        
NBN0B13  EQU   NBUSER+12                                                        
NBN0B14  EQU   NBUSER+13                                                        
NBN0B15  EQU   NBUSER+14                                                        
NBN0B16  EQU   NBUSER+15                                                        
         SPACE 1                                                                
NBN1B1   EQU   NBUSER1             N1 PROFILE BYTES                             
NBN1B2   EQU   NBUSER1+1                                                        
NBN1B3   EQU   NBUSER1+2                                                        
NBN1B4   EQU   NBUSER1+3                                                        
NBN1B5   EQU   NBUSER1+4                                                        
NBN1B6   EQU   NBUSER1+5                                                        
NBN1B7   EQU   NBUSER1+6                                                        
NBN1B8   EQU   NBUSER1+7                                                        
NBN1B9   EQU   NBUSER1+8                                                        
NBN1B10  EQU   NBUSER1+9                                                        
NBN1B11  EQU   NBUSER1+10                                                       
NBN1B12  EQU   NBUSER1+11                                                       
NBN1B13  EQU   NBUSER1+12                                                       
NBN1B14  EQU   NBUSER1+13                                                       
NBN1B15  EQU   NBUSER1+14                                                       
NBN1B16  EQU   NBUSER1+15                                                       
         SPACE 1                                                                
NBN2B1   EQU   NBUSER2             N2 PROFILE BYTES                             
NBN2B2   EQU   NBUSER2+1                                                        
NBN2B3   EQU   NBUSER2+2                                                        
NBN2B4   EQU   NBUSER2+3                                                        
NBN2B5   EQU   NBUSER2+4                                                        
NBN2B6   EQU   NBUSER2+5                                                        
NBN2B7   EQU   NBUSER2+6                                                        
NBN2B8   EQU   NBUSER2+7                                                        
NBN2B9   EQU   NBUSER2+8                                                        
NBN2B10  EQU   NBUSER2+9                                                        
NBN2B11  EQU   NBUSER2+10                                                       
NBN2B12  EQU   NBUSER2+11                                                       
NBN2B13  EQU   NBUSER2+12                                                       
NBN2B14  EQU   NBUSER2+13                                                       
NBN2B15  EQU   NBUSER2+14                                                       
NBN2B16  EQU   NBUSER2+15                                                       
         EJECT                                                                  
*              ADDRESSES AND I/O CONTROLLER FIELDS                              
         SPACE 3                                                                
         DS    0D                                                               
NBDPNAM2 DS    CL6                 DAYPART NAME CONTINUATION                    
NBINDS2  DS    XL1                 GENERAL INDICATOR                            
NB$TYPSP EQU   1                   X'01' $TYPE SPECIAL CHARGE SPLIT             
NBBILLRD EQU   2                   X'02' READ NEW NEGENUBILL RECS               
NBNOBLRD EQU   4                   X'04' DON'T READ NEGENUBILLRECS              
NBERNCOV EQU   8                   X'08' EARNED COST OVERRIDE                   
NBALLDPT EQU   16                  X'10' SUB/REGULAR DPT FILTER                 
NBNOEACT EQU   32                  X'20' DON'T DO EST AS ACT DEMOS              
NBAGYB1S EQU   64                  X'40' B1S PROFILE = Y                        
NBLCMPR  EQU   128                 X'80' PASSED TO NBLFUNC IN BILLRDR           
*                                                                               
NBINDS3  DS    CL1                 SPARE GENERAL INDICATOR                      
NBI3BPRD EQU   X'01'               BILLING PRODUCT MODE                         
*->                                NBSPLPRN IS BILLING PRODUCT                  
NBI3REVO EQU   X'02'               NBREVOPT SET BY APPLICATION                  
NBI3CMRT EQU   X'04'               COMMERCIAL ROTATION MODE                     
NBI3CMPR EQU   X'08'               COMM ROT PASSING PROGRAM DATA                
NBI3AIRV EQU   X'10'               UNIT HAS AIRING VENDOR                       
NBI3ESTM EQU   X'20'               USER SETS ESTIMATE MASK                      
NBI3A2DC EQU   X'40'               2 DECIMAL PRECISION AGENCY                   
NBI3B2DC EQU   X'80'               2 DEC AGY NEW BOOK                           
*                                                                               
NBAIO    DS    A                   A(I/O AREA)  COMPULSORY                      
NBACOM   DS    A                   A(COMFACS)   REQUIRED UNLESS MODULE          
NBLOADER DS    A                   A(LOADER)    REQUIRED IF NO CALLOV           
NBHOOK   DS    A                   A(USER HOOK) CALLED AFTER NETVALUE           
NBACTSTR DS    XL2                 FILTER ON ACTIVITY START                     
NBACTEND DS    XL2                    AND/OR ACTIVITY END                       
NBUSER2  DS    CL16                N2 USER PROFILE                              
NBBILSTR DS    XL2                 FILTER ON BILLED START                       
NBBILEND DS    XL2                    AND/OR BILLED END                         
NBPAYSTR DS    XL2                 FILTER ON PAID START                         
NBPAYEND DS    XL2                    AND/OR PAID END                           
*                                               IS LINKED WITH XTRNS            
NBXTRNS  DS    0C                  XTRNS LINKED IN OR FROM COMFACS              
NBADDAY  DS    V                   V(ADDAY)                                     
NBCALLOV DS    V                   V(CALLOV)                                    
NBCLPACK DS    V                   V(CLPACK)                                    
NBCLUNPK DS    V                   V(CLUNPK)                                    
NBCONFID DS    V                   V(CONFID)                                    
NBDM     DS    V                   V(DATAMGR)                                   
NBDATCON DS    V                   V(DATCON)                                    
NBDEMADR DS    V                   V(DEMADDR)                                   
NBDEMAIN DS    V                   V(DEMAINT)                                   
NBDEMAND DS    V                   V(DEMAND)                                    
NBDEMEL  DS    V                   V(DEMEL)                                     
NBDEMMTH DS    V                   V(DEMOMATH)                                  
NBDEMOUT DS    V                   V(DEMOUT)                                    
NBGETDAY DS    V                   V(GETDAY)                                    
NBHEXOUT DS    V                   V(HEXOUT)                                    
NBHELLO  DS    V                   V(HELLO)                                     
NBNETVAL DS    V                   V(NETVALUE)                                  
NBGTPROF DS    V                   V(GETPROF)                                   
NBDEMCON DS    V                   V(DEMOCON)                                   
NBNETRAT DS    V                   V(NETRATE)                                   
*                                                                               
NBAPLIST DS    A                   OPTIONAL ADDRESS FOR PRODUCT LIST            
*                                  FOR PROD GROUP FILTERS IN WRITER             
NBABDFLT DS    A                   OPTIONAL ADDRESS-BILL DATE COLUMN            
*                                  FILTER IN WRITER                             
NBADRPRG DS    V                   NECESSARY IF REQUESTING PROD GROUPS          
NBUTL    DS    V                   V(UTL)                                       
         SPACE 1                                                                
NBPRINT  DS    V                   V(PRINT)  NEEDED FOR TRACE                   
*                                                                               
NBAAGY   DS    A                   OPTIONAL ADDRESS FOR AGENCY                  
NBACLI   DS    A                   OPTIONAL ADDRESS FOR CLIENT STORAGE          
NBAPRD   DS    A                   OPTIONAL ADDRESS FOR PRODUCT                 
NBAEST   DS    A                   OPTIONAL ADDRESS FOR ESTIMATE                
NBADEM   DS    A                   OPTIONAL ADDRESS FOR  DEMO BLOCK             
NBADTL   DS    A                   OPTIONAL ADDRESS OF DATE SET (INPUT)         
NBAPBUFF DS    A                   OPTIONAL ADDRESS OF PRODUCT BUFFER           
*                                  NEEDED FOR PRODUCT GROUP HANDLING            
*                                  SHOULD BE 440C (220X2)                       
*                                  SEE NEGENPBUFF FOR DETAILS                   
NBANBUFF DS    A                   OPTIONAL ADDRESS OF NETWORK BUFFER           
*                                  NEEDED FOR MEDIA ANALYSIS/FILTER             
*                                  SHOULD BE 4000 (800X5)                       
*                                  SEE NEGENNBUFF FOR DETAILS                   
NBATBUFF DS    A                   OPTIONAL A(TARGET BUFFER)                    
*                                  SEE NEGENTBUFF FOR DETAILS                   
*                                  SHOULD BE 4400 (220X20)                      
NBADMWRK DS    A                   A(DMWORK) REQUIRED IF YOU NEED               
*                                  NETIO TO PUTREC UNITS                        
NBANRATE DS    A                   OPTIONAL ADDRESS OF NETRATE BLOCK            
*                                  BLOCK SHOULD BE 256 BYTES                    
*                                  SEE DETAILS IN NENETRATED                    
NBCNVNTI DS    A                   OPTIONAL ADDRESS OF WORK AREA TO             
*                                  CONVERT STATION CALL LETTERS TO              
*                                  NTI STAION CALL LETTERS                      
         SPACE 1                                                                
         DS    0D                  USED BY I/O CONTROLLER                       
         DS    CL4                 ('KEYS' IN DUMP)                             
NBSPLPR3 DS    CL3                 NBSPLPR3=NBSPLPRN                            
NBPRDALL DS    XL1                 X'FF' = ACCEPT ALL PRODUCTS                  
*                                                                               
NBKEY    DS    CL32                KEY                                          
NBKEYLST DS    CL32                LAST KEY                                     
NBTWAACC DS    CL4                 TWA LIMIT ACCESS CODE                        
NBACCFLT DS    CL1                 X'01'=INTEG BILLED ONLY                      
*                                  X'02'=ALLOCATED UNITS ONLY                   
*                                  X'04'=READ PACKAGE RECORDS                   
*                                  X'08'=SKIP EASI INVOICES                     
*                                  X'10'=ONLY EASI INVOICES                     
*                                  X'20' BHTYPE=CLEARED                         
*                                  X'40' BHTYPE=ORDERED                         
NBDEMLEV DS    CL1                 DEMO RETURN LEVEL P,T,S                      
* - NBSPLCNT WITH MULTIPLE PRODUCT ELEMENTS                                     
NBSPLCNT DS    CL1                 CURRENT PROD POSITION IN ELEM                
NBPRDNO  DS    CL1                 TOTAL NUMBER OF PRODUCTS                     
NBPRDLST DS    CL6                 6 X 1 BYTE PROD CODES FOR UNIT               
*                                                                               
NBVARIND DS    CL1                 INDICATOR (VARIOUS)                          
*                                  X'10' - FOR NIUNIT IN NEWRIDRIVE             
*                                  X'20' - READ INVOICE RECORDS                 
*                                  X'40' - FOR NAD USE NDDEMOS                  
*                                  X'80' - RFP DATES                            
*                                  X'01' - BHRDATEI FILT IN NEWRIGEN            
*                                  X'02' - MRUN UNITS ONLY                      
*                                  X'04' - DO NOT DEFAULT TO 50.00              
*                                  X'08' - DO NOT ROUND CPM                     
*                                                                               
NBSELNGR DS    CL1                 NETWORK GROUP SCHEME                         
NBUSERID DS    XL2                 PERSONAL USER ID                             
NBSECAGY DS    XL2                 PERSONAL USER ID                             
NBINVFLT DS    CL4                 ADDR OF INVOICE FILTERS                      
NBNETGRP DS    CL4                 ADDR OF STATIONS FOR STATION GROUP           
NBAUTHD  DS    CL4                 AUTHORIZATION $ FROM ESTIMATE REC            
*                                                                               
*NBPRDMSK DS    CL32                PRODUCT SELECTION MASK                      
NBSELPG3 DS    CL6                 3 CHAR PROD X 2 = NBSELPIG                   
NBSELPN3 DS    CL3                 3 CHAR PROD = NBSELPNM                       
NBADPLST DS    CL4                 OPTIONAL ADDRESS OF 3 CHAR                   
*                                  MULTIPRODS = NBPRDLST                        
NBVTYPS  DS    XL1                 PROGRAM AVERAGE                              
*              X'00'               LIVE                                         
*              X'01'               SAME DAY                                     
*              X'07'               SAME DAY+7                                   
*              X'F1'               SAME DAY+1                                   
*              X'02'               SAME DAY +2                                  
*              X'03'               SAME DAY +3                                  
NBVTYPS2 DS    XL1                 COMMERCIAL AVERAGE                           
*              X'00'               LIVE                                         
*              X'01'               SAME DAY                                     
*              X'07'               SAME DAY+7                                   
*              X'F1'               SAME DAY+1                                   
*              X'02'               SAME DAY +2                                  
*              X'03'               SAME DAY +3                                  
NBVTYPS3 DS    XL1                                                              
NBVT3OVR EQU   X'01'               X'01' VTYP OVERRIDE ON COLUMN                
NBVT3NET EQU   X'02'               X'02' NETVALUE SET VTYP FLAG                 
NBVT3IGN EQU   X'04'               X'04' NETVALUE-IGNORE NBVTYPS                
NBVT3MXM EQU   X'08'               X'08' MINUTE BY MINUTE POD REQUEST           
NBVT3OOH EQU   X'10'               X'10' OOH/OOHC SOURCE REQUESTED              
*                                                                               
NBDEFINE DS    XL4                                                              
NBINDS8  DS    XL1                 GENERAL INDICATOR                            
NBI8NODL EQU   X'01'               NO DEAL UNITS PASSED BY NETIO                
NBI8CFSM EQU   X'02'               CFSUM FOR CASH FLOW WRITER                   
NBI8CLIV EQU   X'04'               CHQINV REQUESTED AS KEYWORD                  
NBI8IMIR EQU   X'08'               INVOICE MIRROR UNIT OPTION                   
NBI8AST0 EQU   X'10'               NO ASTERISK IN CMLA/CMLAB KEYWORD            
NBI8RNTK EQU   X'20'               RENTRAK OPTION                               
NBI8CBU  EQU   X'40'               REPORT CLEARED BUT UNDISBURSED               
*                                                                               
NBPRDIDX DS    CL1                 INDEX INTO BLDCHGD TBL IN NETVALUE           
NBSELOF2 DS    CL2                 2 CHAR OFFICE (REPLACES NBSELOFF)            
NBEXTEND DS    A                   A(EXTENDED BLOCK)                            
NBINDS9  DS    XL1                 GENERAL INDICATOR 9                          
NBI9CP1  EQU   X'80'               COMSCORE PASS 1                              
NBI9CP2  EQU   X'40'               COMSCORE PASS 2                              
NBI9DOV  EQU   X'20'               SET DEMO OVERRIDE INDICATOR                  
NBI9GDM  EQU   X'10'               REQUESTING GUARANTEE DEMOS                   
NBI9SLDV EQU   X'08'               SHOW LOCKED DEMO VALUES?                     
NBI9DIGI EQU   X'04'               NETWORK IS DIGINET                           
*                                                                               
NBCVTYP  DS    CL1                 COMSCORE VTYPE                               
*                                                                               
         DS    CL2                 SPARE                                        
NBESTMSK DS    CL32                ESTIMATE SELECTION MASK                      
NBDTADSP DS    H                   DISPLACEMENT TO ELEMENTS                     
NBINIT   DS    CL1                 0=INITIALIZE NEBLOCK                         
*              X'01'               OFF LINE                                     
*              X'02'               INITIALIZED                                  
NBQINIT  DS    CL1                 0=INITIALIZE FOR REQUEST                     
NBRETURN DS    CL1                 RETURN CODE NEXT TIME IN                     
NBENDOK  DS    CL1                 SET TO Y FOR END DATE IGNORE                 
NBDONTFD DS    CL1                 Y=DONT FILTER DATES                          
*                                  USED TO PICK UP OUT OF ESTIMATE MG           
NBWHERE  DS    CL1                 FLAG TO NETVALUE I=FROM NETIO                
NBGOR07  DS    8F                  SAVE REGISTERS ON GO                         
NBEFFCLI DS    CL2                 EFFECTIVE CLIENT                             
NBFILE   DS    CL1                 SAVE FILE SWITCH                             
NBEFFNET DS    CL4                 EFFECTIVE NETWORK                            
NBCMPSTR DS    CL2                 COMPRESSED START DATE                        
NBCMPEND DS    CL2                 COMPRESSED END DATE                          
NBUPUNIT DS    CL1                 Y=UNIT HAD BEEN CHANGED - WRITE              
NBDIRECT DS    CL1                 Y=DIRECT UNIT READ. BE CAREFUL!              
NBFUNCT  DS    CL1                 USER DIRECTS FUNCTION OF NETIO:              
NBFNORM  EQU   0                    NORMAL FUNCTION                             
NBFGET   EQU   1                    NBKEY HAS KEY. GETREC AND VALUE.            
NBFVAL   EQU   2                    NBAIO CONTAINS RECORD. VALUE IT.            
NBFRDHI  EQU   3                    DONT DO A SEQ W/OUT RDHI FIRST.             
NBFNXEST EQU   4                    GET NEXT ESTIMATE/ONLY FOR P                
NBFRESTR EQU   5                    HIGH/GETREC/EXIT                            
NBFCLTVL EQU   6                    GOTO VALIDATE CLIENT/PROD/EST               
NBFRDNBK EQU   7                    MOVES NBKEY TO KEY AND THEN READHI          
NBFNXCLT EQU   8                    GET NEXT CLIENT RECORD                      
NBNOWRIT DS    CL1                 N= DONT WRITE TO FILE (OVERRIDES             
*                                         NBUPUNIT)                             
NBRESUME DS    CL1                 RESUME MODE SPECIFIED                        
*                                  NBPROCPK SUPPORTED                           
*                                  NBPROCUN FOR TRAFFIC SCROLLING               
NBCALLRD DS    F                   SAVE REG D OF CALLING ROUTINE                
NBEFFAGY DS    CL2                 EFFECTIVE AGENCY                             
NBEFFPNM DS    XL1                 EFFECTIVE PRODUCT NUMBER                     
NBEFFEST DS    XL1                 EFFECTIVE ESTIMATE NUMBER                    
NBEFFMED DS    XL1                 EFFECTIVE MEDIA CODE (NEED NBANBUFF)         
NBEFFOFF DS    CL1                 EFFECTIVE OFFICE CODE                        
NBSPLBPN DS    CL4                 USED FOR TRACKING BILLED PROD NOS.           
NBINDS   DS    XL1                 X'80' EQUIVALANCE OVERRIDES                  
*                                  X'40' PKG/DEM GUAR PRECISION (PRIMP)         
*                                  X'20' SKIP PKG/DEM GUAR FACTORS              
*                                  X'10' $ OPTION IN EFFICIENCY                 
*                                  X'08' FILTER FOR CABLE UPLOAD UNITS          
*                                  X'04' EQUIVALENCE GOALS                      
*                                  X'02' FILTER EST DEMO OVERRIDES              
*                                  X'01' FILTER ACT DEMO OVERRIDES              
*                                                                               
NBSBKEND DS    CL1                 X'10' 0 DOLLAR UNITS ONLY                    
*                                  X'20' SPLIT BOOKENDS                         
*                                  X'40' NO ZERO DOLLAR UNITS                   
*                                  X'80' USE PRDGRP MASTER PRD IN UDEF          
NBNODPT2 EQU   1                   X'01' DON'T DO 2 CHARACTER DAYPART           
*                                        READ IN NETVALUE                       
NBEXPDEM EQU   2                   X'02' GIVE EXPANDED DEMO VALUE               
*                                        DON'T ROUND - TRUNCATE                 
NBEXPDM6 EQU   4                   X'04' GIVE EXPANDED DEMO VALUE               
*                                        DON'T ROUND, DON'T TRUNCATE            
*                                  X'08' GET TARGET DEMO                        
         EJECT                                                                  
*              ACTUAL DATA (MODE ERROR AND KEY DATA)                            
         SPACE 3                                                                
         DS    0D                                                               
NBABILRD DS    A                   NEBILLRD DSECT AREA                          
NBERNCST DS    XL4                 EARNED COST                                  
*                                                                               
NBMODE   DS    CL1                 MODE SETTING                                 
NBVALAGY EQU   31                  VALIDATE AGENCY                              
NBVALCLI EQU   41                  VALIDATE CLIENT                              
NBVALPRD EQU   51                  VALIDATE PRODUCT                             
NBVALEST EQU   61                  VALIDATE ESTIMATE                            
NBVALPAK EQU   71                  VALIDATE PACKAGE                             
NBVALDAT EQU   81                  VALIDATE DATE                                
NBREQFST EQU   100                 FIRST FOR THIS I/O REQUEST                   
NBPROCPK EQU   140                 PROCESS A PACKAGE                            
NBPROCUN EQU   150                 PROCESS A UNIT                               
NBPROCGL EQU   160                 PROCESS A GOAL                               
NBPROCPP EQU   170                 PROCESS A PUP                                
NBREQLST EQU   190                 LAST FOR REQUEST                             
*                                                                               
NBSUBMSK DS    CL1                 MASK FOR STATUS OF KEY VALUES.               
NBSBMAM  EQU   X'01'               AGENCY/MEDIA.   BITS ON IF KEY VALU          
NBSBMCLI EQU   X'02'               CLIENT          HAS JUST CHANGED.            
NBSBMNET EQU   X'04'               NETWORK                                      
NBSBMPRG EQU   X'08'               PROGRAM                                      
NBSBMEST EQU   X'10'               ESTIMATE                                     
NBSBMPAK EQU   X'20'               PACKAGE                                      
*                                                                               
NBPIGOPT DS    CL1                 Y=PIGGYS ONLY,N=REJECT PIGGYS                
*                                  DEFAULT = BOTH                               
NBBLBOPT DS    CL1                 Y=BILLBOARD UNITS ONLY,N=EXCLUDE             
*                                  DEFAULT = BOTH                               
NBAFFOPT DS    CL1                 Y=USE AFFIDS TIME ,N=USE BUY TIME            
*                                  ,BLANK=WORK OFF OF PROFILE                   
NBPREOPT DS    CL1                 Y=2DEC PLACES FOR RATING,N=STANDARD          
NBDODEMS DS    CL1                 ARE DEMOS REQUIRED(USED BY WRITER)           
NBIOCNT  DS    CL1                 IO ONLINE COUNTER IN NETIO                   
         SPACE 1                                                                
         DS    0D                                                               
NBMAXCST DS    CL4                 MAX COST                                     
NB$SPC   DS    CL3                 SPECIL CHARGE TYPE IN $TYPE REQ              
NBINTPRD DS    CL1                 INTEGRATION PRODUCT                          
NBERROR  DS    CL1                 ERROR CODE                                   
NBGOOD   EQU   0                   ALLS WELL                                    
NBMISS   EQU   1                   MISSING DATA                                 
NBINVAL  EQU   2                   INVALID DATA                                 
NBNOTNUM EQU   3                   NOT NUMERIC                                  
NBINVDAT EQU   6                   NOT A VALID DATE                             
NBEBEFST EQU   7                   END BEFORE START                             
NBINVAGY EQU   152                 INVALID AGENCY                               
NBINVCLI EQU   236                 INVALID CLIENT                               
NBINVPRD EQU   109                 INVALID PRODUCT                              
NBINVEST EQU   237                 INVALID ESTIMATE                             
NBINVNET EQU   238                 INVALID NETWORK                              
NBINVPAK EQU   239                 INVALID PACKAGE                              
NBINVSOO EQU   231                 SOON REQUEST TOO LONG                        
NBFILERR EQU   255                 FILE ERROR SEE NBIOERR                       
NBIOERR  DS    CL1                 IO ERROR                                     
NBUPLD   DS    CL1                 X'01' UPLOADED DATA ONLY                     
*                                  X'02' EXCLUDE UPLOADED DATA                  
*                                  X'04' INCLUDE ONLY PROGRAMS WITH             
*                                  NUMERIC IN 3/4                               
NBUNTCT  DS    CL2                 COUNT OF UNIT IO'S                           
NBAUTH   DS    CL2                 AUTHORIZATION CODE FOR SECURITY              
NBRDBELS DS    CL1                 NET WRITER MULTIPLE CALLS TO DRIVER          
*                                  FLAG/=2 SHUTS OFF ACCGEN ROUTINES            
         DS    A                   A(ERROR FIELD IN BLOCK)                      
         SPACE 1                                                                
         DS    0D                   ACTUAL KEY VALUES                           
         DS    CL4                 'AKEY" LABEL                                 
NBEFFPN3 DS    CL3                 3 CHAR PROD=NBEFFPNM                         
*                                                                               
NBINDS7  DS    XL1                 GENERAL INDICATOR                            
NBI7XTCT EQU   X'01'               CALLED BY XTRACT                             
NBI7DEMO EQU   X'02'               OPTION IN NENTVLDEMO                         
NBI7AIRD EQU   X'04'               IGNORE AIRED VENDOR STATION                  
NBI7XFL  EQU   X'08'               GOALS READ XFILE                             
NBI7NOUP EQU   X'10'               NOT UPDATING FILE                            
NBI7PGL  EQU   X'20'               GOAL RECORD IS GOAL PLAN RECORD              
NBI7NTIO EQU   X'40'               NBANBUFF = 6000 = 1198 STATION RECS          
NBI7DEAL EQU   X'80'               ONLY DEAL UNITS PASSED BY NETIO              
*                                                                               
NBACTAM  DS    CL1                 AGENCY/MEDIA                                 
NBACTCLI DS    CL2                 CLIENT                                       
NBACTDAT DS    CL2                 AIR DATE                                     
NBACTSQH DS    CL1                 START QUARTER HOUR                           
NBACTNET DS    CL4                 NETWORK                                      
NBACTPRG DS    CL6                 PROGRAM CODE                                 
NBACTSUB DS    CL1                 SUB-LINE                                     
NBACTEST DS    CL1                 ESTIMATE NUMBER                              
NBACTDP  DS    CL1                 DAYPART CODE                                 
NBACTPAK DS    CL1                 PACKAGE                                      
NBNTISTA DS    CL4                 NTI STATION                                  
         EJECT                                                                  
*              ACTUAL VALUES EXTRACTED FROM MAIN ELEMENT                        
         SPACE 3                                                                
         DS    0D                   ACTUAL RECORD VALUES                        
NBPR1CL3 DS    CL3                 PROD ALPHA =NBPRD                            
NBPR2CL3 DS    CL3                 PROD ALPHA = NBPRD2                          
NBWBMEDF DS    XL1                 WB FLIGHT FILTER                             
*              X'01'               N                                            
*              X'02'               S                                            
*              X'04'               C                                            
*              X'08'               CABLE/CABLE                                  
*              X'10'               CABLE/TIVO                                   
*              X'08'               CABLE/VOD                                    
*                                                                               
NBWBFLT1 DS    CL1                 WB GENERAL FILTER                            
NBWBFOV  EQU   X'01'               FLIGHT OVERRIDES ONLY                        
NBWBFNOV EQU   X'02'               NO FLIGHT OVERRIDES                          
*                                                                               
NBMAINEL DS    CL1                 ELEMENT CODE X'01'                           
NBMAINLN DS    CL1                 ELEMENT LENGTH 80                            
NBPACK   DS    CL1                 PACKAGE NUMBER                               
NBPACKST DS    CL1                 PACKAGE STATUS X'80'=FROZEN                  
*                                                 X'40'=HOLD                    
*                                                 X'20'=LOCKED                  
*                                                 X'10'=DO NOT PRINT            
*                                                 X'04'=NON-COM INTEG           
NBUNITST DS    CL1                 UNIT STATUS X'80'=MINUS  UNIT                
*                                              X'40'=PREEMPT                    
*                                              X'20'=ACT COST OVERRIDE          
*                                              X'08'=ASSIGNED COST OVER         
*                                              X'04'=PFB                        
*                                              X'02'=MISSED                     
*                                              X'01'=MAKE-GOOD                  
NBPRD    DS    CL1                 ALLOCATED PRODUCT CODE                       
*                                  (0=UNALLOCATED)                              
NBPRD2   DS    CL1                 SECOND ALLOCATION                            
NBP1SHR  DS    CL2                 BRAND 1 SHARE (2 DEC)                        
NBPROGNM DS    CL16                PROGRAM NAME                                 
NBPRFILT DS    CL3                 PROGRAM FILTERS                              
NBLEN    DS    CL1                 LENGTH IN SECONDS (TOTAL)                    
NBDAY    DS    CL1                 DAY BITS (0=SPARE 1=MON.. 7=SUN)             
NBTIME   DS    CL4                 MILITARY START-END TIME                      
NBAFFTIM DS    CL2                 AFFIDAVIT MILITARY TIME                      
NBASSIGN DS    CL4                 ASSIGNED COST (CENTS)                        
NBACTUAL DS    CL4                 ACTUAL COST (CENTS)                          
NBINTEG  DS    CL4                 INTEGRATION (CENTS)                          
NBFEED   DS    CL2                 FEED U.S COVER (2 DEC)                       
NBUNIV   DS    CL2                 UNIVERSE PCT.(2 DEC)                         
NBIMPACT DS    CL2                 IMPACT PCT. (2 DEC)                          
NBNTI    DS    CL2                 NTI CODE                                     
NBNSI    DS    CL2                 NSI CODE                                     
NBUNCODE DS    CL2                 UNIVERSE CODE                                
NBFEEDMG DS    CL3                 FEED MKTGROUP ID/NUMBER                      
NBHUTAVE DS    CL1                 HUT AVERAGEING USED W/M/Q                    
NBHUTSCM DS    CL1                 HUT SCHEME (OR X'00')                        
NBHUTPCT DS    CL2                 HUT PERCENT OVERRIDE (2 DEC)                 
NBACTWHY DS    CL1                 REASON FOR LAST ACTIVITY                     
*                                  X'80'=NEW BUY                                
*                                  X'40'=BRAND ALLOCATION                       
*                                  X'20'=ASSIGNED COST CHANGE                   
*                                  X'10'=COMMENT CHANGE                         
*                                  X'08'=DEMOGRAPHIC OVERRIDE                   
*                                  X'04'=MAKE-GOOD                              
*                                  X'02'=CONVERSION PROGRAM                     
*                                  X'01'=COPIED UNIT                            
NBSUBPRT DS    CL1                 SUB-LINE PRINT                               
NBUNST2  DS    CL1                 UNIT STATUS 2                                
*                                  X'80' = GET HUTS FROM DEMO FILE              
*                                  X'40' = 52 WEEK HUT CALENDAR                 
*                                  X'20' = PRODUCT ALLOCATION FROZEN            
*                                  X'10' = LENGTH FROZEN FOR ALLOCATION         
*                                  X'08' = UNIVERSES ARE CABLE                  
*                                  X'04' = ZERO % FOR FIRST PRODUCT             
*                                  X'02' = UNIT ADD BY PUP TRANSFER             
*                                  X'01' = M/G DEMO RETRIEVAL                   
NBMARKET DS    CL2                 'MARKET' NUMBER FOR PROG READ                
NBALPHA  DS    CL2                 ALPHA AGENCY CODE                            
NBSREP   DS    XL2                 SPECIAL REP (BINARY)                         
NBLEN1   DS    XL1                 LENGTH OF FIRST PARTNER FOR PIGGY            
NBPOSTDT DS    CL1                 POSTING DATA TYPE                            
*                                  D=DIARY I=INTEGRATED C=CONFORMED             
NBXFRAGY DS    CL1                 ATT TRANSFER AGENCY                          
NBHUTTYP DS    CL1                 HUT ADJUSTMENT (I,D)                         
*                                                                               
*                                  NOT FROM MAIN ELEMENT                        
NBGUAFAC DS    CL2                 PACKAGE GUARANTEE FACTOR                     
         SPACE 1                                                                
*                                  DATA FROM X'02' ELEMENT                      
NBUNST3  DS    CL1                 UNIT STATUS 3                                
*                                  X'80' = ASSIGNED COST OVERRIDE               
*                                  X'40' = BUY IS A COPY SPLIT                  
*                                  X'20' = SEED SEEDED NTI                      
*                                  X'10' = UNIT CREATED BY PUP TRANSFER         
*                                  X'08' = WINDOW UNIT 2ND BOOK SET             
*                                  X'04' = UNIT ADD BY CABLE DOWNLOAD           
*                                  X'02' = ADU UNIT (NO COST ALLOWED)           
*                                  X'01' = FEED PCT. HITS IMPS,AND RTGS         
NBHUTFLR DS    CL1                 HUT FLAVOR                                   
NBRTTYPE DS    CL1                 RATE TYPE  (C)                               
NBACT2WY DS    CL1                 LAST ACTIVITY BYTE 2                         
*                                  X'80' = DAY CHANGE                           
*                                  X'40' = DATE CHANGE                          
*                                  X'20' = TIME CHANGE                          
*                                  X'10' = ACTUAL COST CHANGE                   
*                                  X'08' = PREEMPTED UNIT                       
*                                  X'04' = MISSED UNIT                          
NBSTATYP DS    CL1                 STATION TYPE N,C,S,O                         
NBSDSBMD DS    CL1                 SUB MEDIA R=REGIONAL N=NATIONAL              
NBSDROT  DS    CL1                 ROTATION                                     
NBSDAFDT DS    CL2                 AFFIDAVITE DATE                              
NBSDRTCV DS    CL1                 RATE COVERAGE OF SPECIAL RATE CODE.          
*                                  A=ALL COSTS                                  
*                                  T=TIME ONLY                                  
*                                  I=TIME AND INTERGRATION ONLY                 
NBPOSTYP DS    CL1                 STATION TYPE N,C,S,O                         
NBMIRTYP DS    CL1                 MIRROR TYPE A=4HOUR DIFF                     
NBSUBDPT DS    CL3                 SUB-DAYPART                                  
NBUNST4  DS    CL1                 UNIT STATUS 4                                
*                                  X'80' = INT COST INPUTTED                    
*                                  X'40' = UNIT SPLIT BY UTILS                  
*                                  X'20' = TRIGIBACK UNIT                       
*                                  X'10' = CROSS PLATFORM PROGRAM               
*                                  X'08' = UNIT CREATED IN FRONTRNNR            
*                                  X'04' = LIMIT SPECIAL CHARGE SCREEN          
*                                  X'02' = UNIT RESTORED (TEMPORARY)            
NBTCARLV DS    CL1                 TCAR LEVEL 1-5 CHARACTER                     
NBBKTYP  DS    CL1                 BOOK TYPE                                    
NBUNTLEN EQU   *-NBMAINEL                                                       
         EJECT                                                                  
*              SELECTED RECORD INFORMATION                                      
         SPACE 3                                                                
***      DS    D                   FINANCIAL DATA                               
         DS    0D                                                               
NBACCOFF DS    CL2                 CLIENT ACC OFFICE                            
NBPOD    DS    CL3                 POD CODE                                     
NBINDS5  DS    CL1                 GENERAL INDICATOR                            
NBI5XRD  EQU   X'01'               DO SPECIAL READS IN BILLRDR                  
*              X'02'               SKIP MUCH OF NETVALUE (AGY SUMMARY)          
NBI5PLST EQU   X'04'               BRAND LEVEL SEC - OFFICE LIST                
***NBI5PSEC EQU   X'03'               BRAND LEVEL SECURITY (NETIO)              
NBI5PSEC EQU   X'08'               BRAND LEVEL SECURITY (NETIO)                 
NBI5MTN  EQU   X'10'               FILTER BY GOAL MEDIA N                       
NBI5MTS  EQU   X'20'               FILTER BY GOAL MEDIA S                       
NBI5MTC  EQU   X'40'               FILTER BY GOAL MEDIA C                       
NBI5NOGL EQU   X'80'               DONT'T READ GOALS                            
NBTRAPSC DS    CL1                 TRAFFIC BRAND LV SEC (SET BY APP             
*                                  THAT CALL NETIO)                             
NBINDS6  DS    CL1                 GENERAL INDICATOR                            
NBI6SOX  EQU   X'01'               SOX ERROR                                    
NBI6TAL  EQU   X'02'               NETIO USED FOR TALENT                        
NBI6XDEM EQU   X'04'               EXPANDED DEMO BLOCK                          
NBI6XNET EQU   X'08'               EXPANDED NETBLOCK                            
NBI6XINT EQU   X'10'        **NBINTPRD IS A FUDGE -                             
NBI6XOVP EQU   X'20'        ** NBSPLPRN = NOT ACTUAL PROD CODE                  
*                           ** - SET BY NETVALUE FOR INTERNAL                   
*                           ** NETVALUE LOGIC                                   
*                           ** NBSPLPR3 HAS ACTUAL OVERFLOW PROD                
NBI6X1OV EQU   X'40'        **NBPRD=NOT REAL PROD/USE NBPR1CL3                  
NBI6X2OV EQU   X'80'        **NBPRD2=NOT REAL PROD/USE NBPR2CL3                 
*                                                                               
NBBILTGR DS    F                   BILLING TIME GROSS                           
NBBILTNT DS    F                   BILLING TIME NET                             
NBBILIGR DS    F                   BILLING INTEG GROSS                          
NBBILINT DS    F                   BILLING INTEG NET                            
NBPAYTGR DS    F                   PAYING TIME GROSS                            
NBPAYTNT DS    F                   PAYING TIME NET                              
NBPAYIGR DS    F                   PAYING INTEG GROSS                           
NBPAYINT DS    F                   PAYING INTEG NET                             
NBPAYSPC DS    F                   PAYING SPECIAL CHARGE                        
NBSUMLEN EQU   *-NBBILTGR          LENGTH OF SUM DATA                           
NBAPROD DS    CL4                  ADDRESS OF PRODUCT ELEMENT (X'14')           
         SPACE 1                                                                
         DS    0D                                                               
NBASTWRD DS    A                   ADDR OF STEWARD EST LIST                     
NBDAYPAK DS    A                                                                
NBMGFPCD DS    CL6                 PROGRAM CODE                                 
NBMGFPNM DS    CL16                PROGRAM NAME                                 
NBMGFDAT DS    CL2                 DATE                                         
NBMGFSUB DS    CL1                 SUB-CODE                                     
NBMGFLEN EQU   *-NBMGFPCD          LENGTH OF MAKE GOOD FOR DATA                 
NBMGFSBP DS    CL3                 SUB-CODE PRINT                               
NBMGFSTA DS    CL1                 STATUS OF MISSED UNIT                        
*                                  (X'04'=PFB)                                  
NBMGFST2 DS    CL1                 X'02'=ADU(STAT OF MISSED UNIT)               
*                                                                               
NBPPDOPT DS    CL1                 PAYPEND OPTION                               
NBPPDONQ EQU   X'80'               PAYPEND OPTION IN EFFECT                     
NBPPDCKQ EQU   X'40'               PAYPEND OPTION CHECK FOR INCLUSION           
NBPPDINQ EQU   X'20'               PAYPEND OPTION INCLUDE BUY IN RPT            
NBPPDCR  EQU   X'10'               THIS IS A CREDIT                             
NBPPDCK  EQU   X'08'               THIS IS A CASH RECEIPT                       
*                                                                               
NBINDS4  DS    CL1                 GENERAL INDICATOR                            
NBI4BRK  EQU   X'01'               BREAKOUT=YES INDICATOR                       
NBI4BLRD EQU   X'02'               BILLRDR RETURNS $$$ BUT DOES NOT             
*                                  SEED UNIT WITH BILL ELEMS                    
NBI40E0A EQU   X'04'               USE X'0E0A' KEY FOR BILL READER              
NBI4STWY EQU   X'08'               INCLUDE STEWARDSHIP ESTIMATES                
NBI4STWO EQU   X'10'               ONLY STEWARDSHIP ESTIMATES                   
NBI4TRAF EQU   X'20'               USE CLIENT TRAFFIC OFFICE FILTER             
NBI4DISB EQU   X'40'               CASH FLOW OPTION DEFAULT CHK DATE            
NBI4ECOP EQU   X'80'               INCLUDE EC CHARGES                           
         SPACE 1                                                                
         DS    0D                                                               
NBAOFICR DS    A                   ADDRESS OF OFFICER                           
NBWBFLT  DS    A                   BUFFER FOR WB FLT RECORDS                    
NBMGBPCD DS    CL6                 PROGRAM CODE                                 
NBMGBPNM DS    CL16                PROGRAM NAME                                 
NBMGBDAT DS    CL2                 DATE                                         
NBMGBSUB DS    CL1                 SUB-CODE                                     
NBMGBLEN EQU   *-NBMGBPCD          LENGTH OF MAKE GOOD BY DATA                  
NBMGBSBP DS    CL3                 SUB-CODE PRINT                               
NBMGBSTA DS    CL1                 STATUS OF MAKE GOOD UNIT                     
*                                  (X'04'=PFB)                                  
         SPACE 1                                                                
NBNADDEF DS   CL2                 NAD DEFINITIONS LAST ACTIVE DATE              
NBRESULN DS   CL1                 NAD RESULT SEE NBRESULT                       
         SPACE 1                                                                
NBPAKCPM DS    F                   PACKAGE GUARANTEED CPM                       
NBNGUFAC DS    CL4                 NEW PACKAGE GUARANTEE FAC (4 DEC)            
NBPAKNAM DS    CL16                PACKAGE NAME                                 
NBPAKCST DS    F                   PACKAGE COST (DOLLARS)                       
NBDAYNAM DS    CL3                 EXPANDED DAY                                 
NBDPNAM  DS    CL8                 EXPANDED DAYPART                             
NBSUBOUT DS    CL3                 SUB-LINE PRINT                               
NBCLICOD DS    CL3                 3-BYTE PRINTABLE CLIENT CODE                 
NBRESULT DS    CL1                 WHERE ACTUAL DEMOS CAME FROM                 
*                                  M=MANUAL  A=AFFID   P=PROGRAM                
*                                  T=TIME    Z=ZERO    E=ESTIMATED              
*                                  R=ROWPROG C=ROWTIME D=ROWDEDUCED             
NBRES2   DS    CL1                 ABOVE OR X=FROM NETVALUE ELEMENT             
NBUNTSW  DS    XL1                 X'80' ESTIMATED UNIT                         
*                                  X'40' ACTUAL UNIT                            
*                                  X'20' IGNORE CLIENT LOCKOUT                  
*                                  X'10' THIS IS MIDAS CLIENT                   
NBCALCOS DS    F                   CALCULATED COST                              
NBPAKINT DS    F                   PACKAGE INTEGRATION                          
NBPKFILT DS    CL6                 PACKAGE FILTERS                              
NBMGDOPT DS    CL1                 USE MADEGOODFOR PROGRAM REC                  
NBSTSTAT DS    CL1                 STATION TYPE N,C,S,O                         
NBSUBMED DS    CL1                 SUB MEDIA N=NETWORK,R=REGIONAL               
NBDEMRAW DS    CL1                 C'Y' RETURN RAW DEMO NUMBERS                 
NBSPCHRG DS    CL4                 SPECIAL CHARGES                              
NBSTPSTT DS    CL1                 POSTING TYPE N,C,S,O                         
NBSELCGR DS    CL5                 SELECTED CLIENT GROUP                        
NBACTCGR DS    CL1                 ACTUAL CLI GRP (PWOS - 2 BYTES)              
* -NBACTCGR TAKES 2 BYTES/THERE IS ROOM SINCE NEXT ENTRY                        
*  FORCES TO DOUBLE WORKD BOUNDRY                                               
         EJECT                                                                  
*              ESTIMATED AND ACTUAL VALUES                                      
         SPACE 3                                                                
         DS    0D                   ESTIMATED VALUES                            
NBABLDTB DS    CL4                 ADDRESS OF BILLED PROD TABLE                 
NBICOS2  DS    XL4                 ICOS2 $$$                                    
***      DS    D                   ESTIMATED VALUES                             
NBESTUN  DS    CL2                 UNITS                                        
NBESTSHR DS    CL2                 SHARE (1 DEC PLACE)                          
NBESTHUT DS    CL2                 HUT (1DEC PLACE)                             
         DS    CL2                                                              
NBESTHOM DS    CL8                 HOMES                                        
         SPACE 1                                                                
         DS    0D                                                               
NBSECSV  DS    A                   NEW SECURITY                                 
NBADPTSV DS    A                   DAYPART VALUES FOR NETVALUE                  
***      DS    D                   ACTUAL VALUES                                
NBACTUN  DS    CL2                 UNITS                                        
NBACTSHR DS    CL2                 SHARE (1 DEC PLACE)                          
NBACTHUT DS    CL2                 HUT (1DEC PLACE)                             
         DS    CL2                                                              
NBACTHOM DS    CL8                 HOMES                                        
NBDEMLEN EQU   *-NBESTUN           LENGTH OF DEMO DATA                          
NBBLKEND DS    CL1                                                              
