*          DATA SET NETFINB    AT LEVEL 001 AS OF 01/05/84                      
*              NET FINANCIAL BLOCK                                              
         DS    0D                                                               
NEFINBLK DS    0C                                                               
         SPACE 1                                                                
         DS    D                   FINANCIAL DATA                               
NFBILTGR DS    F                   BILLING TIME GROSS                           
NFBILTNT DS    F                   BILLING TIME NET                             
NFBILIGR DS    F                   BILLING INTEG GROSS                          
NFBILINT DS    F                   BILLING INTEG NET                            
NFPAYTGR DS    F                   PAYING TIME GROSS                            
NFPAYTNT DS    F                   PAYING TIME NET                              
NFPAYIGR DS    F                   PAYING INTEG GROSS                           
NFPAYINT DS    F                   PAYING INTEG NET                             
NFSUMLEN EQU   *-NFBILTGR          LENGTH OF SUM DATA                           
         DS    CL60                SPARE                                        
NEFINEND DS    0C                                                               
