*          DATA SET NETPQIND   AT LEVEL 001 AS OF 05/20/99                      
PQINDEX  DSECT                                                                  
PQKEYWRD DS    CL8                 KEYWORD                                      
PQAOUT   DS    F                   A(OUTPUT AREA)                               
PQSTATUS DS    X                   STATUS BYTE                                  
PQCHG    EQU   X'80'                DATA HAS CHANGED                            
*        EQU   X'40'               *** UNUSED ***                               
*        EQU   X'20'               *** UNUSED ***                               
*        EQU   X'10'               *** UNUSED ***                               
*        EQU   X'08'               *** UNUSED ***                               
*        EQU   X'04'               *** UNUSED ***                               
*        EQU   X'02'               *** UNUSED ***                               
*        EQU   X'01'               *** UNUSED ***                               
*                                                                               
PQOUTLEN DS    X                   OUTPUT LENGTH                                
PQPOSO   DS    C                   H=HEAD, M=MID, 0=ROW                         
         DS    X                   SPARE                                        
*                                                                               
PQHEAD1  DS    CL24                HEADLINE 1                                   
PQHEAD2  DS    CL24                HEADLINE 2                                   
PQHEAD3  DS    CL24                HEADLINE 3                                   
PQHEAD4  DS    CL24                HEADLINE 4                                   
*                                                                               
PQINDXEQ EQU   *-PQINDEX                                                        
*                                                                               
