*          DATA SET NETUNIVD   AT LEVEL 001 AS OF 12/27/85                      
NDUNBLOK DS    0D                                                               
NDUEHOME DS    F                   ESTIMATED HOME UNIVERSE                      
NDUEDEM  DS    20F                 UP TO 20 ESTIMATE UNIVERSES                  
NDUAHOME DS    F                   ACTUAL HOME UNIVERSE                         
NDUADEM  DS    20F                 UP TO 20 ACTUAL UNIVERSES                    
         DS    CL16                SPARE                                        
NDUBKEND DS    0C                                                               
