*          DATA SET NETXBLKD   AT LEVEL 009 AS OF 10/04/05                      
*          DATA SET NETXBLKD   AT LEVEL 007 AS OF 09/07/05                      
         SPACE 1                                                                
NXBLKD   DSECT                                                                  
NXBLK    DS    0CL100                                                           
NXBIND   DS    CL1                                                              
NXPRDS   DS    0CL54               9 X 6 PRODS = 48                             
NXPCL1   DS    CL1                 CODE                                         
NXPCL3   DS    CL3                 ALPHA CODE                                   
NXPTYP   DS    CL1                 Y=NXPCL1=FUDGE                               
NXPFD    DS    CL2                 FEED PCT                                     
NXPPCT   DS    CL2                 PROD PERCENT                                 
NXPPLENE EQU   *-NXPRDS                                                         
*                                                                               
         DS    CL45                SPARE                                        
NXBEND   EQU   *                                                                
