*          DATA SET NEUPLOAD2  AT LEVEL 003 AS OF 09/23/99                      
*                                                                               
* THIS DEFINES THE TWA DATA STRUCTURE CONTAINING NET BUY                        
* UPLOAD DATA.  IT IS BUILT BY A $MAD OVERLAY AND IS INTERPRETED BY             
* THE NET BUY PROGRAM.                                                          
*                                                                               
* THE FIRST OBJECT IN THE DATA STRUCTURE IS ALWAYS A HEADER OBJECT.             
* IT BEGINS WITH A TWO-BYTE OBJECT LENGTH (NOT INCLUDING THE LENGTH             
* ITSELF).  THIS IS FOLLOWED BY EIGHT OTHER BYTES, THEN 'HDR*', THEN            
* THE HEADER DATA.                                                              
*                                                                               
* THIS WILL BE FOLLOWED BY A REQUIRED DEAL OBJECT.                              
* NEXT WILL BE AN OPTIONAL PACKAGE OBJECT.  A REQUIRED PROGRAM OBJECT           
* WILL THEN FOLLOW WITH OPTIONAL DEMO OBJECTS.                                  
* THIS WILL FINALLY BE FOLLOWED BY UNIT OBJECTS.                                
* WITHIN A UNIT, THERE WILL OPTIONALLY BE DEMOS, SPECIAL CHARGES,               
* PRODUCT, COMMENT OR COMMERCIAL OBJECTS, FOLLOWED BY AN END-OF-UNIT            
* OBJECT.                                                                       
*                                                                               
* THERE MAY BE MANY UNITS WITHIN A PROGRAM, MANY PROGRAMS WITHIN A              
*                                                                               
* PACKAGE, MANY PACKAGES WITHIN A DEAL, AND MANY DEALS WITHIN AN UPLOAD         
*                                                                               
*                                                                               
*    HDR* (HEADER)                 REQUIRED                                     
*                                                                               
*    DEAL (DEAL)                   REQUIRED                                     
*    DMSG (DEAL MESSAGE)           OPTIONAL                                     
*    CNT* (CONTRACT RECORD)        OPTIONAL                                     
*                                                                               
*    PKG* (PACKAGE)                REQUIRED                                     
*                                                                               
*    PROG (PROGRAM)                REQUIRED                                     
*    PDRE (PROGRAM DEMO ESTIMATED) OPTIONAL                                     
*    PDRA (PROGRAM DEMO ACTUAL)    OPTIONAL                                     
*                                                                               
*    UNIT (UNIT)                   REQUIRED                                     
*    UDRE (UNIT DEMO ESTIMATED)    OPTIONAL                                     
*    UDRA (UNIT DEMO ACTUAL)       OPTIONAL                                     
*    SPCH (SPECIAL CHARGE)         OPTIONAL                                     
*    PROD (PRODUCT)                OPTIONAL                                     
*    CMMT (COMMENT)                OPTIONAL                                     
*    COMM (COMMERCIAL)             OPTIONAL                                     
*    EUNT (END-OF-UNIT)            REQUIRED                                     
*                                                                               
* THERE MAY ALSO BE DEL* OBJECTS, WHICH ARE STAND-ALONE OBJECTS THAT            
* CONTAIN THE KEY OF AN BUY TO BE DELETED.                                      
*                                                                               
* AN OBJECT LENGTH OF ZERO INDICATES THAT THERE ARE NO MORE UNITS               
* IN THIS DATA STRUCTURE.                                                       
*                                                                               
         EJECT                                                                  
         SPACE                                                                  
NHDRD    DSECT                                                                  
NHDRLEN  DS    XL2                 LENGTH OF FILE HEADER OBJECT                 
NHDRODAT EQU   *                   START OF $BUY OBJECT DATA                    
NHDRERNO DS    XL2                 ERROR NUMBER                                 
NHDRERF  DS    X                   FIELD NUMBER IN ERROR                        
         DS    XL7                 SPARE                                        
NHDRTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'HDR*')                 
NHDRSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NHDRSYS  DS    C                   SYSTEM (ALWAYS C'N')                         
NHDRSYSQ EQU   1                                                                
NHDRUTYP DS    CL3                 UPLOAD TYPE (ALWAYS C'BUY')                  
NHDRUTYQ EQU   2                                                                
NHDRAGID DS    CL2                 BUYING AGENCY ID                             
NHDRAGIQ EQU   3                                                                
NHDRUID2 DS    CL2                 1ST 2 CHARS-UNIQUE ID (LOCATION ID)          
NHDRUIDQ EQU   4                                                                
NHDRUPDO DS    CL1                 UPDATES ONLY? (Y/N)                          
         DS    CL32                SPARE                                        
NHDRTSPD DS    CL2                 TECC SPEC DATE                               
NHDRTSPQ EQU   5                                                                
NHDRAGNM DS    CL2                 AGENCY NAME                                  
NHDRAGNQ EQU   6                                                                
NHDRLENQ EQU   *-NHDRODAT          L'OBJECT FOR $BUY                            
NHDRRLNQ EQU   *-NHDRSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NDLD     DSECT                                                                  
NDLLEN   DS    XL2                 LENGTH OF FILE DEAL OBJECT                   
NDLODAT  EQU   *                   START OF DEAL OBJECT DATA                    
NDLERNO  DS    XL2                 ERROR NUMBER                                 
NDLERF   DS    X                   FIELD NUMBER IN ERROR                        
NDLRECN  DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NDLSTRT  EQU   *                   START OF $MAD OBJECT DATA                    
NDLTYPE  DS    CL4                 OBJECT TYPE (ALWAYS C'DEAL')                 
NDLMED   DS    C                   MEDIA CODE                                   
NDLMEDQ  EQU   1                                                                
NDLTPC   DS    CL8                 TRADING PARTNER CODE                         
NDLTPCQ  EQU   2                                                                
NDLNET   DS    CL4                 NETWORK CODE                                 
NDLNETQ  EQU   3                                                                
NDLSNET  DS    CL6                 SELLING NETWORK CODE                         
NDLSNETQ EQU   4                                                                
NDLNTNM  DS    CL15                NETWORK NAME                                 
NDLNTNMQ EQU   5                                                                
NDLCLT   DS    CL3                 CLIENT CODE                                  
NDLCLTQ  EQU   6                                                                
NDLDEAL  DS    CL10                DEAL NUMBER                                  
NDLDEALQ EQU   7                                                                
NDLDLNM  DS    CL20                DEAL NAME                                    
NDLDLNMQ EQU   8                                                                
NDLRLNM  DS    CL2                 RELEASE NUMBER                               
NDLRLNMQ EQU   9                                                                
NDLBTYP  DS    CL1                 BUY TYPE                                     
NDLBTYPQ EQU   10                                                               
NDLGTYP  DS    CL1                 GUARANTEE TYPE                               
NDLGTYPQ EQU   11                                                               
NDL30SC  DS    CL1                 30 SECOND EQUIVALENCY INDICATOR              
NDL30SCQ EQU   12                                                               
NDLADF   DS    CL1                 EST DEMO FORM                                
NDLADFQ  EQU   13                                                               
NDLEDF   DS    CL1                 ACT DEMO FORM                                
NDLEDFQ  EQU   14                                                               
NDLDEL   DS    CL1                 DEAL IS DELETED                              
NDLDELQ  EQU   15                                                               
         DS    CL7                                                              
NDLDEMS  DS    CL198               DEMOS (18 X 11)                              
NDLDEMSQ EQU   16                                                               
NDLPRD   DS    CL3                 MASTER PRODUCT                               
NDLPRDQ  EQU   17                                                               
NDLPRNM  DS    CL15                BRAND NAME                                   
NDLPRNMQ EQU   18                                                               
NDLSALP  DS    CL15                SALESPERSON                                  
NDLSALPQ EQU   19                                                               
NDLBUYR  DS    CL15                BUYER                                        
NDLBUYRQ EQU   20                                                               
NDLSTD   DS    CL8                 DEAL START DATE                              
NDLSTDQ  EQU   21                                                               
NDLEDD   DS    CL8                 DEAL END DATE                                
NDLEDDQ  EQU   22                                                               
NDLTUN   DS    CL5                 UNITS WITHIN DEAL                            
NDLTUNQ  EQU   23                                                               
NDLTBB   DS    CL5                 BILLBOARDS WITHIN DEAL                       
NDLTBBQ  EQU   24                                                               
NDLAMT   DS    CL15                TOTAL AMOUNT                                 
NDLAMTQ  EQU   25                                                               
NDLLENQ  EQU   *-NDLODAT           L'OBJECT FOR $BUY                            
NDLRLNQ  EQU   *-NDLSTRT           L'ORIGINAL UPLOADED RECORD                   
         SPACE 3                                                                
*                                                                               
*                                                                               
NDCMD    DSECT                                                                  
NDCMLEN  DS    XL2                 LENGTH OF COMMENT OBJECT                     
NDCMODAT EQU   *                   START OF OBJECT DATA                         
NDCMERNO DS    XL2                 ERROR NUMBER                                 
NDCMERF  DS    X                   FIELD NUMBER IN ERROR                        
NDCMRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NDCMSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NDCMTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'DMSG')                 
NDCMDATA DS    CL70                COMMENT DATA                                 
NDCMDATQ EQU   1                                                                
NDCMLENQ EQU   *-NDCMODAT          LENGTH OF OBJECT                             
NDCMLNQ  EQU   *-NDCMSTRT          LENGTH OF OBJECT                             
         SPACE 3                                                                
*                                                                               
*                                                                               
NDCRD    DSECT                                                                  
NDCRLEN  DS    XL2                 LENGTH OF COMMENT OBJECT                     
NDCRODAT EQU   *                   START OF OBJECT DATA                         
NDCRERNO DS    XL2                 ERROR NUMBER                                 
NDCRERF  DS    X                   FIELD NUMBER IN ERROR                        
NDCRRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NDCRSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NDCRTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'CNT*')                 
NDCRDATA DS    CL10                CONTRACT NUMBER                              
NDCRDATQ EQU   1                                                                
NDCRLENQ EQU   *-NDCRODAT          LENGTH OF OBJECT                             
NDCRLNQ  EQU   *-NDCRSTRT          LENGTH OF OBJECT                             
         EJECT                                                                  
NPKGD    DSECT                                                                  
NPKGLEN  DS    XL2                 LENGTH OF FILE PACKAGE OBJECT                
NPKGODAT EQU   *                   START OF DEAL OBJECT DATA                    
NPKGERNO DS    XL2                 ERROR NUMBER                                 
NPKGERF  DS    X                   FIELD NUMBER IN ERROR                        
NPKGRECN DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NPKGSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPKGTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PKG*')                 
NPKGEST  DS    CL3                 ESTIMATE CODE                                
NPKGESTQ EQU   1                                                                
NPKGPKG  DS    CL3                 PACKAGE CODE                                 
NPKGPKGQ EQU   2                                                                
NPKGDSC  DS    CL16                PACKAGE DESCRIPTION                          
NPKGDSCQ EQU   3                                                                
NPKGDPT  DS    CL1                 DAYPART CODE                                 
NPKGDPTQ EQU   4                                                                
NPKGCOST DS    CL8                 COST                                         
NPKGCSTQ EQU   5                                                                
NPKGUNV  DS    CL4                 UNIVERSE CODE                                
NPKGUNVQ EQU   6                                                                
NPKGREP  DS    CL3                 SPECIAL REP                                  
NPKGREPQ EQU   7                                                                
NPKGLENQ EQU   *-NPKGODAT          L'OBJECT FOR $BUY                            
NPKGRLNQ EQU   *-NPKGSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NPGMD    DSECT                                                                  
NPGMLEN  DS    XL2                 LENGTH OF FILE PROGRAM OBJECT                
NPGMODAT EQU   *                   START OF DEAL OBJECT DATA                    
NPGMERNO DS    XL2                 ERROR NUMBER                                 
NPGMERF  DS    X                   FIELD NUMBER IN ERROR                        
NPGMRECN DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NPGMSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPGMTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PROG')                 
NPGMEST  DS    CL3                 ESTIMATE CODE                                
NPGMESTQ EQU   1                                                                
NPGMPKG  DS    CL3                 PACKAGE CODE                                 
NPGMPKGQ EQU   2                                                                
NPGMROT  DS    CL7                 ROTATION                                     
NPGMROTQ EQU   3                                                                
NPGMSTM  DS    CL4                 START TIME                                   
NPGMSTMQ EQU   4                                                                
NPGMETM  DS    CL4                 END TIME                                     
NPGMETMQ EQU   5                                                                
NPGMPROG DS    CL16                PROGRAM                                      
NPGMPGMQ EQU   6                                                                
NPGMEPSG DS    CL32                EPISODE                                      
NPGMEPSQ EQU   7                                                                
NPGMPGCD DS    CL6                 PROGRAM CODE                                 
NPGMPGCQ EQU   8                                                                
NPGMULN  DS    CL3                 UNIT LENGTH                                  
NPGMULNQ EQU   9                                                                
NPGMULNT DS    CL1                 UNIT LENGTH TYPE                             
NPGMULTQ EQU   10                                                               
NPGMUST  DS    CL2                 UNIT STYLE                                   
NPGMUSTQ EQU   11                                                               
NPGMMOB  DS    CL2                 MOBILITY CODE                                
NPGMMOBQ EQU   12                                                               
NPGMMST  DS    CL4                 MIRROR START TIME                            
NPGMMSTQ EQU   13                                                               
         DS    CL20                SPARE                                        
NPGMSRC  DS    CL2                 SUPPLEMANTARY RATE CODE                      
NPGMSRCQ EQU   14                                                               
NPGMSRT  DS    CL10                SUPPLEMANTARY RATE                           
NPGMSRTQ EQU   15                                                               
NPGMIRT  DS    CL8                 INTEGRATION RATE                             
NPGMIRTQ EQU   16                                                               
NPGMIRQ  DS    CL1                 INTEGRATION RATE QUALIFIER                   
NPGMIRQQ EQU   17                                                               
NPGMACST DS    CL9                 ASSIGNED COST                                
NPGMACSQ EQU   18                                                               
NPGMLENQ EQU   *-NPGMODAT          L'OBJECT FOR $BUY                            
NPGMRLNQ EQU   *-NPGMSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NPDED    DSECT                                                                  
NPDELEN  DS    XL2                 LENGTH OF FILE PROG EST DEMO OBJECT          
NPDEODAT EQU   *                   START OF DEAL OBJECT DATA                    
NPDEERNO DS    XL2                 ERROR NUMBER                                 
NPDEERF  DS    X                   FIELD NUMBER IN ERROR                        
NPDERECN DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NPDESTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPDETYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PDRE')                 
NPDEEHI  DS    CL6                 ESTIMATE HOMES IMPS                          
NPDEEHIQ EQU   1                                                                
NPDEDEM  DS    18XL6               DEMO VALUES                                  
NPDEDEMQ EQU   2                                                                
NPDELENQ EQU   *-NPDEODAT          L'OBJECT FOR $BUY                            
NPDERLNQ EQU   *-NPDESTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NPDAD    DSECT                                                                  
NPDALEN  DS    XL2                 LENGTH OF FILE PROG ACT DEMO OBJECT          
NPDAODAT EQU   *                   START OF DEAL OBJECT DATA                    
NPDAERNO DS    XL2                 ERROR NUMBER                                 
NPDAERF  DS    X                   FIELD NUMBER IN ERROR                        
NPDARECN DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NPDASTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPDATYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PDRA')                 
NPDAEHI  DS    CL6                 ACTUAL HOMES IMPS                            
NPDAEHIQ EQU   1                                                                
NPDADEM  DS    18XL6               DEMO VALUES                                  
NPDADEMQ EQU   2                                                                
NPDALENQ EQU   *-NPDAODAT          L'OBJECT FOR $BUY                            
NPDARLNQ EQU   *-NPDASTRT          L'ORIGINAL UPLOADED RECORD                   
         SPACE 3                                                                
NEPGD    DSECT                                                                  
NEPGLEN  DS    XL2                 LENGTH OF END-OF-PROGRAM OBJECT              
NEPGODAT EQU   *                                                                
         DS    XL10                SPARE                                        
NEPGSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEPGTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EPGM')                 
NEPGLENQ EQU   *-NEPGODAT          L'OBJECT                                     
NEPGRLNQ EQU   *-NEPGSTRT          L'ORIGINAL UPLOADED RECORD                   
*                                                                               
         EJECT                                                                  
*                                                                               
NUNTD    DSECT                                                                  
NUNTLEN  DS    XL2                 LENGTH OF OBJECT                             
NUNTODAT EQU   *                   START OF $BUY OBJECT DATA                    
NUNTERNO DS    XL2                 ERROR NUMBER                                 
NUNTERF  DS    X                   FIELD NUMBER IN ERROR                        
NUNTRNUM DS    XL2                 BUY NUMBER                                   
NUNTSEQ  DS    X                   SEQUENCE NUMBER (FROM $MAD)                  
NUNTLINE DS    X                   NETPAK LINE NUMBER                           
NUNTLIN2 DS    X                   NETPAK LINE NUMBER 2                         
*                                   ACTION 'A' : NETPAK ASSIGNS                 
*                                   ACTION 'C' : $MAD SUPPLIES                  
NUNTACTN DS    C                   ACTION ('A', 'C')                            
         DS    C                                                                
NUNTSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NUNTTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'UNIT')                 
NUNTSERN DS    CL12                SERIAL NUMBER                                
NUNTSERQ EQU   1                                                                
NUNTUNT  DS    CL2                 UNIT TYPE                                    
NUNTUNTQ EQU   2                                                                
NUNTDQU  DS    CL3                 DATE QUALIFIER                               
NUNTDQAQ EQU   3                                                                
NUNTWOD  DS    CL6                 WEEK OF DATE                                 
NUNTWODQ EQU   4                                                                
NUNTDAYN DS    CL1                 DAY NUMBER                                   
NUNTDYNQ EQU   5                                                                
NUNTACT  DS    CL3                 ACTION (A,C,D)                               
NUNTACTQ EQU   6                                                                
NUNTTRT  DS    CL10                TIME RATE                                    
NUNTTRTQ EQU   7                                                                
NUNTTRQ  DS    CL1                 TIME RATE QUALIFIER                          
NUNTTRQQ EQU   8                                                                
NUNTBLAT DS    CL4                 BILLBOARDS ATTACHED                          
NUNTBLAQ EQU   9                                                                
NUNTSCLT DS    CL2                 SECONDARY LINK                               
NUNTSCLQ EQU   10                                                               
NUNTSSNT DS    CL12                SECONDARY SERIAL NUMBER                      
NUNTSSNQ EQU   11                                                               
NUNTADU  DS    CL1                 ADU FLAG                                     
NUNTADUQ EQU   12                                                               
NUNTADQ  DS    CL8                 ADU QUARTER START DATE                       
NUNTADQQ EQU   13                                                               
NUNTINC  DS    CL8                 INCUMBANCY PERIOD                            
NUNTINCQ EQU   14                                                               
NUNTMG   DS    CL1                 MAKEGOOD                                     
NUNTMGQ  EQU   15                                                               
NUNTPM   DS    CL1                 PRE-EMPTED/MISSED                            
NUNTPMQ  EQU   16                                                               
NUNTMGS  DS    CL12                MAKEGOOD SERIAL NUMBERS                      
NUNTMGSQ EQU   17                                                               
NUNTPES  DS    CL1                 PRE-EMTABLE BY SELLER                        
NUNTPESQ EQU   18                                                               
NUNTBND  DS    CL1                 BOOKEND INDICATOR                            
NUNTBNDQ EQU   19                                                               
NUNTMOB  DS    CL1                 MOBILTY CODE                                 
NUNTMOBQ EQU   20                                                               
NUNTEXC  DS    CL1                 EXCLUSIVITY CODE                             
NUNTEXCQ EQU   21                                                               
NUNTLENQ EQU   *-NUNTODAT          L'OBJECT FOR $BUY                            
NUNTRLNQ EQU   *-NUNTSTRT          L'ORIGINAL UPLOADED RECORD                   
*                                                                               
NUDED    DSECT                                                                  
NUDELEN  DS    XL2                 LENGTH OF FILE UNIT EST DEMO OBJECT          
NUDEODAT EQU   *                   START OF DEAL OBJECT DATA                    
NUDEERNO DS    XL2                 ERROR NUMBER                                 
NUDEERF  DS    X                   FIELD NUMBER IN ERROR                        
NUDERNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NUDESTRT EQU   *                   START OF $MAD OBJECT DATA                    
NUDETYPE DS    CL4                 OBJECT TYPE (ALWAYS C'UDRE')                 
NUDEEHI  DS    CL6                 ESTIMATE HOMES IMPS                          
NUDEEHIQ EQU   1                                                                
NUDEDEM  DS    18XL6               DEMO VALUES                                  
NUDEDEMQ EQU   2                                                                
NUDELENQ EQU   *-NUDEODAT          L'OBJECT FOR $BUY                            
NUDERLNQ EQU   *-NUDESTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NUDAD    DSECT                                                                  
NUDALEN  DS    XL2                 LENGTH OF FILE PROG ACT DEMO OBJECT          
NUDAODAT EQU   *                   START OF DEAL OBJECT DATA                    
NUDAERNO DS    XL2                 ERROR NUMBER                                 
NUDAERF  DS    X                   FIELD NUMBER IN ERROR                        
NUDARNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NUDASTRT EQU   *                   START OF $MAD OBJECT DATA                    
NUDATYPE DS    CL4                 OBJECT TYPE (ALWAYS C'UDRA')                 
NUDAEHI  DS    CL6                 ESTIMATE HOMES IMPS                          
NUDAEHIQ EQU   1                                                                
NUDADEM  DS    18XL6               DEMO VALUES                                  
NUDADEMQ EQU   2                                                                
NUDALENQ EQU   *-NUDAODAT          L'OBJECT FOR $BUY                            
NUDARLNQ EQU   *-NUDASTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NSPCD    DSECT                                                                  
NSPCLEN  DS    XL2                 LENGTH OF ROTATION OBJECT                    
NSPCODAT EQU   *                   START OF OBJECT DATA                         
NSPCERNO DS    XL2                 ERROR NUMBER                                 
NSPCERF  DS    X                   FIELD NUMBER IN ERROR                        
NSPCRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NSPCSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NSPCTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'SPCH')                 
NSPCSPC  DS    CL2                 SPECIAL CHARGE CODE                          
NSPCSPCQ EQU   1                                                                
NSPCAMT  DS    CL9                 SPECIAL CHARGE AMOUNT                        
NSPCAMTQ EQU   2                                                                
NSPCLENQ EQU   *-NSPCODAT          LENGTH OF OBJECT                             
NSPCLNQ  EQU   *-NSPCSTRT          LENGTH OF OBJECT                             
         EJECT                                                                  
*                                                                               
NPRDD    DSECT                                                                  
NPRDLEN  DS    XL2                 LENGTH OF SCHEDULE OBJECT                    
NPRDODAT EQU   *                   START OF OBJECT DATA                         
NPRDERNO DS    XL2                 ERROR NUMBER                                 
NPRDERF  DS    X                   FIELD NUMBER IN ERROR                        
NPRDRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NPRDSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPRDTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PROD')                 
NPRDPR1  DS    CL3                 PRODUCT 1                                    
NPRDPR1Q EQU   1                                                                
NPRDPLN1 DS    CL3                 1ST PROD LENGTH                              
NPRDPL1Q EQU   2                                                                
NPRDPCS1 DS    CL3                 1ST PROD COST PERCENT                        
NPRDPC1Q EQU   3                                                                
NPRDPR2  DS    CL3                 PRODUCT 2                                    
NPRDPR2Q EQU   4                                                                
NPRDPLN2 DS    CL3                 2ND PROD LENGTH                              
NPRDPL2Q EQU   5                                                                
NPRDPCS2 DS    CL3                 2ND PROD COST PERCENT                        
NPRDPC2Q EQU   6                                                                
NPRDPR3  DS    CL3                 PRODUCT 3                                    
NPRDPR3Q EQU   7                                                                
NPRDPLN3 DS    CL3                 3RD PROD LENGTH                              
NPRDPL3Q EQU   8                                                                
NPRDPCS3 DS    CL3                 3RD PROD COST PERCENT                        
NPRDPC3Q EQU   9                                                                
NPRDLENQ EQU   *-NPRDODAT          LENGTH OF OBJECT OVERHEAD                    
NPRDLNQ  EQU   *-NPRDSTRT          LENGTH OF OBJECT                             
         SPACE 3                                                                
*                                                                               
*                                                                               
NCOMD    DSECT                                                                  
NCOMLEN  DS    XL2                 LENGTH OF COMMENT OBJECT                     
NCOMODAT EQU   *                   START OF OBJECT DATA                         
NCOMERNO DS    XL2                 ERROR NUMBER                                 
NCOMERF  DS    X                   FIELD NUMBER IN ERROR                        
NCOMRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NCOMSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NCOMTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'CMMT')                 
NCOMDATA DS    CL70                COMMENT DATA                                 
NCOMDATQ EQU   1                                                                
NCOMLENQ EQU   *-NCOMODAT          LENGTH OF OBJECT                             
NCOMLNQ  EQU   *-NCOMSTRT          LENGTH OF OBJECT                             
         EJECT                                                                  
*                                                                               
NCMLD    DSECT                                                                  
NCMLLEN  DS    XL2                 LENGTH OF COMMERCIAL OBJECT                  
NCMLODAT EQU   *                   START OF OBJECT DATA                         
NCMLERNO DS    XL2                 ERROR NUMBER                                 
NCMLERF  DS    X                   FIELD NUMBER IN ERROR                        
NCMLRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NCMLSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NCMLTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'COMM')                 
NCMLISC  DS    CL8                 ISCII CODE                                   
NCMLISCQ EQU   1                                                                
NCMLISN  DS    CL24                ISCII NAME                                   
NCMLISNQ EQU   2                                                                
NCMLCLS  DS    CL5                 COMMERCIAL CLASS                             
NCMLCLSQ EQU   3                                                                
NCMLPIS  DS    CL8                 PARTNER ISCII NAME                           
NCMLPISQ EQU   4                                                                
NCMLPIN  DS    CL24                PARTNER ISCII NAME                           
NCMLPINQ EQU   5                                                                
NCMLPCL  DS    CL5                 PARTNER COMMERCIAL CLASS                     
NCMLPCLQ EQU   6                                                                
NCMLBIS  DS    CL8                 BB ISCII NAME                                
NCMLBISQ EQU   7                                                                
NCMLBIN  DS    CL24                BB ISCII NAME                                
NCMLBINQ EQU   8                                                                
NCMLBCL  DS    CL5                 BB COMMERCIAL CLASS                          
NCMLBCLQ EQU   9                                                                
NCMLLENQ EQU   *-NCMLODAT          LENGTH OF OBJECT                             
NCMLLNQ  EQU   *-NCMLSTRT          LENGTH OF OBJECT                             
         EJECT                                                                  
*                                                                               
*                                                                               
NEUND    DSECT                                                                  
NEUNLEN  DS    XL2                 LENGTH OF END-OF-UNIT OBJECT                 
NEUNODAT EQU   *                                                                
         DS    XL10                SPARE                                        
NEUNSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEUNTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EUNT')                 
NEUNLENQ EQU   *-NEUNODAT          L'OBJECT                                     
NEUNRLNQ EQU   *-NEUNSTRT          L'ORIGINAL UPLOADED RECORD                   
*                                                                               
         EJECT                                                                  
NEODD    DSECT                                                                  
NEODLEN  DS    XL2                 LENGTH OF END-OF-DEAL OBJECT                 
NEODDAT  EQU   *                                                                
         DS    XL10                SPARE                                        
NEODSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEODTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EOD*')                 
NEODLENQ EQU   *-NEODDAT           L'OBJECT                                     
NEODRLNQ EQU   *-NEODSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
NEOPD    DSECT                                                                  
NEOPLEN  DS    XL2                 LENGTH OF END-OF-FILE OBJECT                 
NEOPDAT  EQU   *                                                                
         DS    XL10                SPARE                                        
NEOPSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEOPTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EPKG')                 
NEOPLENQ EQU   *-NEOPDAT           L'OBJECT                                     
NEOPRLNQ EQU   *-NEOPSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
NEOFD    DSECT                                                                  
NEOFLEN  DS    XL2                 LENGTH OF END-OF-FILE OBJECT                 
NEOFDAT  EQU   *                                                                
         DS    XL10                SPARE                                        
NEOFSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEOFTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EOF*')                 
NEOFLENQ EQU   *-NEOFDAT           L'OBJECT                                     
NEOFRLNQ EQU   *-NEOFSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NDELD    DSECT                                                                  
NDELLEN  DS    XL2                 LENGTH OF DELETE OBJECT                      
NDELODAT EQU   *                                                                
NDELERNO DS    XL2                 ERROR NUMBER                                 
NDELERF  DS    X                   FIELD NUMBER IN ERROR                        
         DS    XL7                 SPARE                                        
NDELSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NDELTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'DEL*')                 
NDELCLT  DS    XL2                 CLIENT                                       
NDELNET  DS    CL4                 NETWORK                                      
NDELPROG DS    CL6                 PROGRAM CODE                                 
NDELDATE DS    XL2                 DATE                                         
NDELEST  DS    XL1                 ESTIMATE                                     
NDELDPT  DS    CL1                 DAYPART                                      
NDELSLN1 DS    XL1                 NETPAK LINE NUMBER 1                         
NDELSLN2 DS    XL1                 NETPAK LINE NUMBER 2                         
NDELSERN DS    CL12                SERIAL NUMBER                                
*                                  INSERTION DETAILS FROM UPLOAD                
NDELLENQ EQU   *-NDELODAT          L'OBJECT                                     
NDELRLNQ EQU   *-NDELSTRT          L'ORIGINAL UPLOADED RECORD                   
         SPACE 3                                                                
