*          DATA SET NEUPLOADD  AT LEVEL 073 AS OF 03/02/05                      
*                                                                               
* THIS DEFINES THE TWA DATA STRUCTURE CONTAINING NET BUY                        
* UPLOAD DATA.  IT IS BUILT BY A $MAD OVERLAY AND IS INTERPRETED BY             
* THE NET BUY PROGRAM.                                                          
*                                                                               
* THE FIRST OBJECT IN THE DATA STRUCTURE IS ALWAYS A HEADER OBJECT.             
* IT BEGINS WITH A TWO-BYTE OBJECT LENGTH (NOT INCLUDING THE LENGTH             
* ITSELF).  THIS IS FOLLOWED BY EIGHT OTHER BYTES, THEN 'HDR*', THEN            
* THE HEADER DATA.                                                              
*                                                                               
* THIS WILL BE FOLLOWED BY A REQUIRED DEAL OBJECT.                              
* NEXT WILL BE AN OPTIONAL PACKAGE OBJECT.  A REQUIRED PROGRAM OBJECT           
* WILL THEN FOLLOW WITH OPTIONAL DEMO OBJECTS.                                  
* THIS WILL FINALLY BE FOLLOWED BY UNIT OBJECTS.                                
* WITHIN A UNIT, THERE WILL OPTIONALLY BE DEMOS, SPECIAL CHARGES,               
* PRODUCT, COMMENT OR COMMERCIAL OBJECTS, FOLLOWED BY AN END-OF-UNIT            
* OBJECT.                                                                       
*                                                                               
* THERE MAY BE MANY UNITS WITHIN A PROGRAM, MANY PROGRAMS WITHIN A              
*                                                                               
* PACKAGE, MANY PACKAGES WITHIN A DEAL, AND MANY DEALS WITHIN AN UPLOAD         
*                                                                               
*                                                                               
*    HDR* (HEADER)                 REQUIRED                                     
*                                                                               
*    DEAL (DEAL)                   REQUIRED                                     
*                                                                               
*    PKG* (PACKAGE)                OPTIONAL                                     
*                                                                               
*    PROG (PROGRAM)                REQUIRED                                     
*    PDRE (PROGRAM DEMO ESTIMATED) OPTIONAL                                     
*    PDRA (PROGRAM DEMO ACTUAL)    OPTIONAL                                     
*                                                                               
*    UNIT (UNIT)                   REQUIRED                                     
*    UDRE (UNIT DEMO ESTIMATED)    OPTIONAL                                     
*    UDRA (UNIT DEMO ACTUAL)       OPTIONAL                                     
*    SPCH (SPECIAL CHARGE)         OPTIONAL                                     
*    PROD (PRODUCT)                OPTIONAL                                     
*    CMMT (COMMENT)                OPTIONAL                                     
*    COMM (COMMERCIAL)             OPTIONAL                                     
*    EUNT (END-OF-UNIT)            REQUIRED                                     
*                                                                               
* THERE MAY ALSO BE DEL* OBJECTS, WHICH ARE STAND-ALONE OBJECTS THAT            
* CONTAIN THE KEY OF AN BUY TO BE DELETED.                                      
*                                                                               
* AN OBJECT LENGTH OF ZERO INDICATES THAT THERE ARE NO MORE UNITS               
* IN THIS DATA STRUCTURE.                                                       
*                                                                               
         EJECT                                                                  
         SPACE                                                                  
NHDRD    DSECT                                                                  
NHDRLEN  DS    XL2                 LENGTH OF FILE HEADER OBJECT                 
NHDRODAT EQU   *                   START OF $BUY OBJECT DATA                    
NHDRERNO DS    XL2                 ERROR NUMBER                                 
NHDRERF  DS    X                   FIELD NUMBER IN ERROR                        
         DS    XL7                 SPARE                                        
NHDRTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'HDR*')                 
NHDRSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NHDRSYS  DS    C                   SYSTEM (ALWAYS C'N')                         
NHDRSYSQ EQU   1                                                                
NHDRUTYP DS    CL3                 UPLOAD TYPE (ALWAYS C'BUY')                  
NHDRUTYQ EQU   2                                                                
NHDRAGID DS    CL2                 BUYING AGENCY ID                             
NHDRAGIQ EQU   3                                                                
NHDRUID2 DS    CL2                 1ST 2 CHARS-UNIQUE ID (LOCATION ID)          
NHDRUIDQ EQU   4                                                                
NHDRUPDO DS    CL1                 UPDATES ONLY? (Y/N)                          
         DS    CL32                SPARE                                        
NHDRLENQ EQU   *-NHDRODAT          L'OBJECT FOR $BUY                            
NHDRRLNQ EQU   *-NHDRSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NDLD     DSECT                                                                  
NDLLEN   DS    XL2                 LENGTH OF FILE DEAL OBJECT                   
NDLODAT  EQU   *                   START OF DEAL OBJECT DATA                    
NDLERNO  DS    XL2                 ERROR NUMBER                                 
NDLERF   DS    X                   FIELD NUMBER IN ERROR                        
NDLRECN  DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NDLSTRT  EQU   *                   START OF $MAD OBJECT DATA                    
NDLTYPE  DS    CL4                 OBJECT TYPE (ALWAYS C'DEAL')                 
NDLMED   DS    C                   MEDIA CODE                                   
NDLMEDQ  EQU   1                                                                
NDLTPC   DS    CL8                 TRADING PARTNER CODE                         
NDLTPCQ  EQU   2                                                                
NDLNET   DS    CL4                 NETWORK CODE                                 
NDLNETQ  EQU   3                                                                
NDLCLT   DS    CL3                 CLIENT CODE                                  
NDLCLTQ  EQU   4                                                                
NDLDEAL  DS    CL10                DEAL NUMBER                                  
NDLDLQ   EQU   5                                                                
NDLEDF   DS    CL1                 EST DEMO FORM                                
NDLEDFQ  EQU   6                                                                
NDLADF   DS    CL1                 ACT DEMO FORM                                
NDLADFQ  EQU   7                                                                
NDLDEL   DS    CL1                 DEAL IS DELETED                              
NDLDELQ  EQU   8                                                                
         DS    CL7                 SPARE                                        
*NDLDEMO  DS    18CL7   9-27        DEMOS                                       
NDLDEMO  DS    18CL11   9-27       DEMOS                                        
NDLLENQ  EQU   *-NDLODAT           L'OBJECT FOR $BUY                            
NDLRLNQ  EQU   *-NDLSTRT           L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
NPKGD    DSECT                                                                  
NPKGLEN  DS    XL2                 LENGTH OF FILE PACKAGE OBJECT                
NPKGODAT EQU   *                   START OF DEAL OBJECT DATA                    
NPKGERNO DS    XL2                 ERROR NUMBER                                 
NPKGERF  DS    X                   FIELD NUMBER IN ERROR                        
NPKGRECN DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NPKGSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPKGTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PKG*')                 
NPKGEST  DS    CL3                 ESTIMATE CODE                                
NPKGESTQ EQU   1                                                                
NPKGPKG  DS    CL3                 PACKAGE CODE                                 
NPKGPKGQ EQU   2                                                                
NPKGDSC  DS    CL16                PACKAGE DESCRIPTION                          
NPKGDSCQ EQU   3                                                                
NPKGDPT  DS    CL1                 DAYPART CODE                                 
NPKGDPTQ EQU   4                                                                
NPKGCOST DS    CL8                 COST                                         
NPKGCSTQ EQU   5                                                                
NPKGUNV  DS    CL4                 UNIVERSE CODE                                
NPKGUNVQ EQU   6                                                                
NPKGREP  DS    CL3                 SPECIAL REP                                  
NPKGREPQ EQU   7                                                                
NPKGLENQ EQU   *-NPKGODAT          L'OBJECT FOR $BUY                            
NPKGRLNQ EQU   *-NPKGSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NPGMD    DSECT                                                                  
NPGMLEN  DS    XL2                 LENGTH OF FILE PROGRAM OBJECT                
NPGMODAT EQU   *                   START OF DEAL OBJECT DATA                    
NPGMERNO DS    XL2                 ERROR NUMBER                                 
NPGMERF  DS    X                   FIELD NUMBER IN ERROR                        
NPGMRECN DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NPGMSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPGMTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PROG')                 
NPGMEST  DS    CL3                 ESTIMATE CODE                                
NPGMESTQ EQU   1                                                                
NPGMPKG  DS    CL3                 PACKAGE CODE                                 
NPGMPKGQ EQU   2                                                                
NPGMROT  DS    CL7                 ROTATION                                     
NPGMROTQ EQU   3                                                                
NPGMSTM  DS    CL4                 START TIME                                   
NPGMSTMQ EQU   4                                                                
NPGMETM  DS    CL4                 END TIME                                     
NPGMETMQ EQU   5                                                                
NPGMPROG DS    CL16                PROGRAM                                      
NPGMPGMQ EQU   6                                                                
NPGMPGCD DS    CL6                 PROGRAM CODE                                 
NPGMPGCQ EQU   7                                                                
NPGMULN  DS    CL3                 UNIT LENGTH                                  
NPGMULNQ EQU   7                                                                
NPGMULNT DS    CL1                 UNIT LENGTH TYPE                             
NPGMULTQ EQU   8                                                                
NPGMTRT  DS    CL9                 TIME RATE                                    
NPGMTRTQ EQU   9                                                                
NPGMTRQT DS    CL1                 TIME RATE QUALIFIER                          
NPGMTRQQ EQU   10                                                               
NPGMMST  DS    CL4                 MIRROR START TIME                            
NPGMMSTQ EQU   11                                                               
NPGMCON  DS    CL10                CONTRACT #                                   
NPGMCONQ EQU   12                                                               
         DS    CL10                SPARE                                        
NPGMIRT  DS    CL8                 INTEGRATION RATE                             
NPGMIRTQ EQU   13                                                               
NPGMIRQ  DS    CL1                 INTEGRATION RATE QUALIFIER                   
NPGMIRQQ EQU   14                                                               
NPGMACST DS    CL9                 ASSIGNED COST                                
NPGMACSQ EQU   15                                                               
NPGMLENQ EQU   *-NPGMODAT          L'OBJECT FOR $BUY                            
NPGMRLNQ EQU   *-NPGMSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NPDED    DSECT                                                                  
NPDELEN  DS    XL2                 LENGTH OF FILE PROG EST DEMO OBJECT          
NPDEODAT EQU   *                   START OF DEAL OBJECT DATA                    
NPDEERNO DS    XL2                 ERROR NUMBER                                 
NPDEERF  DS    X                   FIELD NUMBER IN ERROR                        
NPDERECN DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NPDESTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPDETYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PDRE')                 
NPDEEHI  DS    CL6                 ESTIMATE HOMES IMPS                          
NPDEEHIQ EQU   1                                                                
NPDEDEM  DS    18XL6               DEMO VALUES                                  
NPDEDEMQ EQU   2                                                                
NPDELENQ EQU   *-NPDEODAT          L'OBJECT FOR $BUY                            
NPDERLNQ EQU   *-NPDESTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NPDAD    DSECT                                                                  
NPDALEN  DS    XL2                 LENGTH OF FILE PROG ACT DEMO OBJECT          
NPDAODAT EQU   *                   START OF DEAL OBJECT DATA                    
NPDAERNO DS    XL2                 ERROR NUMBER                                 
NPDAERF  DS    X                   FIELD NUMBER IN ERROR                        
NPDARECN DS    XL2                 RECORD NUMBER                                
         DS    XL5                 SPARE                                        
NPDASTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPDATYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PDRA')                 
NPDAEHI  DS    CL6                 ESTIMATE HOMES IMPS                          
NPDAEHIQ EQU   1                                                                
NPDADEM  DS    18XL6               DEMO VALUES                                  
NPDADEMQ EQU   2                                                                
NPDALENQ EQU   *-NPDAODAT          L'OBJECT FOR $BUY                            
NPDARLNQ EQU   *-NPDASTRT          L'ORIGINAL UPLOADED RECORD                   
         SPACE 3                                                                
NEPGD    DSECT                                                                  
NEPGLEN  DS    XL2                 LENGTH OF END-OF-PROGRAM OBJECT              
NEPGODAT EQU   *                                                                
         DS    XL10                SPARE                                        
NEPGSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEPGTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EPGM')                 
NEPGLENQ EQU   *-NEPGODAT          L'OBJECT                                     
NEPGRLNQ EQU   *-NEPGSTRT          L'ORIGINAL UPLOADED RECORD                   
*                                                                               
         EJECT                                                                  
*                                                                               
NUNTD    DSECT                                                                  
NUNTLEN  DS    XL2                 LENGTH OF OBJECT                             
NUNTODAT EQU   *                   START OF $BUY OBJECT DATA                    
NUNTERNO DS    XL2                 ERROR NUMBER                                 
NUNTERF  DS    X                   FIELD NUMBER IN ERROR                        
NUNTRNUM DS    XL2                 BUY NUMBER                                   
NUNTSEQ  DS    X                   SEQUENCE NUMBER (FROM $MAD)                  
NUNTLINE DS    X                   NETPAK LINE NUMBER                           
NUNTLIN2 DS    X                   NETPAK LINE NUMBER 2                         
*                                   ACTION 'A' : NETPAK ASSIGNS                 
*                                   ACTION 'C' : $MAD SUPPLIES                  
NUNTACTN DS    C                   ACTION ('A', 'C')                            
         DS    C                                                                
NUNTSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NUNTTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'UNIT')                 
NUNTSERN DS    CL12                SERIAL NUMBER                                
NUNTSERQ EQU   1                                                                
NUNTWOD  DS    CL6                 WEEK OF DATE                                 
NUNTWODQ EQU   2                                                                
NUNTDAYN DS    CL1                 DAY NUMBER                                   
NUNTDYNQ EQU   16                                                               
         DS    CL3                                                              
NUNTBLAT DS    CL4                 BILLBOARDS ATTACHED                          
NUNTBLAQ EQU   3                                                                
NUNTADU  DS    CL1                 ADU FLAG                                     
NUNTADUQ EQU   4                                                                
NUNTMG   DS    CL1                 MAKEGOOD                                     
NUNTMGQ  EQU   5                                                                
NUNTPM   DS    CL1                 PRE-EMPTED/MISSED                            
NUNTPMQ  EQU   6                                                                
NUNTMGS  DS    8CL12 7 - 15        MAKEGOOD SERIAL NUMBERS                      
NUNTPROG DS    CL6                 PROGRAM CODE (RETURNED $NBUY)                
NUNTADAT DS    XL2                 AIR DATE (RETURNED BY $NBUY)                 
NUNTASEQ DS    XL4                 AGENCY SEQUENCE NUMBER                       
NUNTAREC DS    XL4                 ABSOLUTE RECORD NUMBER                       
         DS    XL10                                                             
NUNTLENQ EQU   *-NUNTODAT          L'OBJECT FOR $BUY                            
NUNTRLNQ EQU   *-NUNTSTRT          L'ORIGINAL UPLOADED RECORD                   
*                                                                               
NUDED    DSECT                                                                  
NUDELEN  DS    XL2                 LENGTH OF FILE PROG EST DEMO OBJECT          
NUDEODAT EQU   *                   START OF DEAL OBJECT DATA                    
NUDEERNO DS    XL2                 ERROR NUMBER                                 
NUDEERF  DS    X                   FIELD NUMBER IN ERROR                        
NUDERNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NUDESTRT EQU   *                   START OF $MAD OBJECT DATA                    
NUDETYPE DS    CL4                 OBJECT TYPE (ALWAYS C'UDRE')                 
NUDEEHI  DS    CL6                 ESTIMATE HOMES IMPS                          
NUDEEHIQ EQU   1                                                                
NUDEDEM  DS    18XL6               DEMO VALUES                                  
NUDEDEMQ EQU   2                                                                
NUDELENQ EQU   *-NUDEODAT          L'OBJECT FOR $BUY                            
NUDERLNQ EQU   *-NUDESTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NUDAD    DSECT                                                                  
NUDALEN  DS    XL2                 LENGTH OF FILE PROG ACT DEMO OBJECT          
NUDAODAT EQU   *                   START OF DEAL OBJECT DATA                    
NUDAERNO DS    XL2                 ERROR NUMBER                                 
NUDAERF  DS    X                   FIELD NUMBER IN ERROR                        
NUDARNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NUDASTRT EQU   *                   START OF $MAD OBJECT DATA                    
NUDATYPE DS    CL4                 OBJECT TYPE (ALWAYS C'UDRA')                 
NUDAEHI  DS    CL6                 ESTIMATE HOMES IMPS                          
NUDAEHIQ EQU   1                                                                
NUDADEM  DS    18XL6               DEMO VALUES                                  
NUDADEMQ EQU   2                                                                
NUDALENQ EQU   *-NUDAODAT          L'OBJECT FOR $BUY                            
NUDARLNQ EQU   *-NUDASTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NSPCD    DSECT                                                                  
NSPCLEN  DS    XL2                 LENGTH OF ROTATION OBJECT                    
NSPCODAT EQU   *                   START OF OBJECT DATA                         
NSPCERNO DS    XL2                 ERROR NUMBER                                 
NSPCERF  DS    X                   FIELD NUMBER IN ERROR                        
NSPCRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NSPCSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NSPCTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'SPCH')                 
NSPCSPC  DS    CL2                 SPECIAL CHARGE CODE                          
NSPCSPCQ EQU   1                                                                
NSPCAMT  DS    CL9                 SPECIAL CHARGE AMOUNT                        
NSPCAMTQ EQU   2                                                                
NSPCLENQ EQU   *-NSPCODAT          LENGTH OF OBJECT                             
NSPCLNQ  EQU   *-NSPCSTRT          LENGTH OF OBJECT                             
         EJECT                                                                  
*                                                                               
NPRDD    DSECT                                                                  
NPRDLEN  DS    XL2                 LENGTH OF SCHEDULE OBJECT                    
NPRDODAT EQU   *                   START OF OBJECT DATA                         
NPRDERNO DS    XL2                 ERROR NUMBER                                 
NPRDERF  DS    X                   FIELD NUMBER IN ERROR                        
NPRDRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NPRDSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NPRDTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'PROD')                 
NPRDPRD  DS    CL3                 PRODUCT                                      
NPRDPRDQ EQU   1                                                                
NPRDPPRD DS    CL3                 PARTNER PRODUCT                              
NPRDPPRQ EQU   2                                                                
NPRDPLN1 DS    CL3                 1ST PROD LENGTH                              
NPRDPL1Q EQU   3                                                                
NPRDPCS1 DS    CL3                 1ST PROD COST PERCENT                        
NPRDPCSQ EQU   4                                                                
NPRDLENQ EQU   *-NPRDODAT          LENGTH OF OBJECT OVERHEAD                    
NPRDLNQ  EQU   *-NPRDSTRT          LENGTH OF OBJECT                             
         SPACE 3                                                                
*                                                                               
*                                                                               
NCOMD    DSECT                                                                  
NCOMLEN  DS    XL2                 LENGTH OF COMMENT OBJECT                     
NCOMODAT EQU   *                   START OF OBJECT DATA                         
NCOMERNO DS    XL2                 ERROR NUMBER                                 
NCOMERF  DS    X                   FIELD NUMBER IN ERROR                        
NCOMRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NCOMSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NCOMTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'CMMT')                 
NCOMDATA DS    CL70                COMMENT DATA                                 
NCOMDATQ EQU   1                                                                
NCOMLENQ EQU   *-NCOMODAT          LENGTH OF OBJECT                             
NCOMLNQ  EQU   *-NCOMSTRT          LENGTH OF OBJECT                             
         EJECT                                                                  
*                                                                               
NCMLD    DSECT                                                                  
NCMLLEN  DS    XL2                 LENGTH OF COMMERCIAL OBJECT                  
NCMLODAT EQU   *                   START OF OBJECT DATA                         
NCMLERNO DS    XL2                 ERROR NUMBER                                 
NCMLERF  DS    X                   FIELD NUMBER IN ERROR                        
NCMLRNUM DS    CL2                 SUB-RECORD NUMBER                            
         DS    XL5                 SPARE                                        
NCMLSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NCMLTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'COMM')                 
NCMLISC  DS    CL8                 ISCII CODE                                   
NCMLISCQ EQU   1                                                                
NCMLISN  DS    CL24                ISCII NAME                                   
NCMLISNQ EQU   2                                                                
NCMLCLS  DS    CL5                 COMMERCIAL CLASS                             
NCMLCLSQ EQU   3                                                                
NCMLPIS  DS    CL8                 PARTNER ISCII NAME                           
NCMLPISQ EQU   4                                                                
NCMLPIN  DS    CL24                PARTNER ISCII NAME                           
NCMLPINQ EQU   5                                                                
NCMLPCL  DS    CL5                 PARTNER COMMERCIAL CLASS                     
NCMLPCLQ EQU   6                                                                
NCMLBIS  DS    CL8                 BB ISCII NAME                                
NCMLBISQ EQU   7                                                                
NCMLBIN  DS    CL24                BB ISCII NAME                                
NCMLBINQ EQU   8                                                                
NCMLBCL  DS    CL5                 BB COMMERCIAL CLASS                          
NCMLBCLQ EQU   9                                                                
NCMLLENQ EQU   *-NCMLODAT          LENGTH OF OBJECT                             
NCMLLNQ  EQU   *-NCMLSTRT          LENGTH OF OBJECT                             
         EJECT                                                                  
*                                                                               
NCHUD    DSECT                                                                  
NCHULEN  DS    XL2                 LENGTH OF OBJECT                             
NCHUODAT EQU   *                   START OF $BUY OBJECT DATA                    
NCHUERNO DS    XL2                 ERROR NUMBER                                 
NCHUERF  DS    X                   FIELD NUMBER IN ERROR                        
NCHURNUM DS    XL2                 BUY NUMBER                                   
         DS    XL5                 SPARE                                        
NCHUSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NCHUTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'UNUP')                 
NCHUACT  DS    CL2                 ACTION (A=ADD,C=CHANGE)                      
NCHUACTQ EQU   1                                                                
NCHUUID  DS    CL36                UNIT ID (KEY)                                
NCHUUIDQ EQU   2                                                                
NCHUSERN DS    CL12                SERIAL NUMBER                                
NCHUSERQ EQU   3                                                                
NCHURESN DS    CL3                 REASON CODE                                  
NCHURESQ EQU   4                                                                
NCHUCNT  DS    CL10                CONTRACT NUMBER                              
NCHUCNTQ EQU   5                                                                
NCHUPROG DS    CL6                 PROGRAM CODE                                 
NCHUPRGQ EQU   6                                                                
NCHUWOD  DS    CL6                 BUY DATE                                     
NCHUWODQ EQU   7                                                                
NCHUROT  DS    CL7                 ROTATION                                     
NCHUROTQ EQU   8                                                                
NCHUSTM  DS    CL4                 START TIME                                   
NCHUSTMQ EQU   9                                                                
NCHUETM  DS    CL4                 END TIME                                     
NCHUETMQ EQU   10                                                               
NCHUPNM  DS    CL16                PROGRAM NAME                                 
NCHUPNMQ EQU   11                                                               
NCHUULN  DS    CL7                 UNIT LENGTH                                  
NCHUULNQ EQU   12                                                               
NCHUTRT  DS    CL10                TIME RATE                                    
NCHUTRTQ EQU   13                                                               
NCHUIRT  DS    CL9                 INTEGRATION RATE                             
NCHUIRTQ EQU   14                                                               
NCHUACST DS    CL9                 ASSIGNED COST                                
NCHUACSQ EQU   15                                                               
NCHUBLAT DS    CL1                 BILLBOARDS ATTACHED                          
NCHUBLAQ EQU   16                                                               
NCHUADU  DS    CL1                 ADU FLAG                                     
NCHUADUQ EQU   17                                                               
NCHUNPY  DS    CL1                 NO PAY FLAG                                  
NCHUNPYQ EQU   18                                                               
NCHUNIM  DS    CL1                 NO IMPRESSION FLAG                           
NCHUNIMQ EQU   19                                                               
NCHUPRE  DS    CL1                 PRE-EMPT FLAG                                
NCHUPREQ EQU   20                                                               
NCHUPRD  DS    CL7                 PRODUCT                                      
NCHUPRDQ EQU   21                                                               
NCHUPCT  DS    CL6                 1ST PRODUCT PERCENT                          
NCHUPCTQ EQU   22                                                               
NCHUCM1  DS    CL60                1ST COMMENT                                  
NCHUCM1Q EQU   23                                                               
NCHUCM2  DS    CL60                2ND COMMENT                                  
NCHUCM2Q EQU   24                                                               
NCHTLENQ EQU   *-NCHUODAT          L'OBJECT FOR $BUY                            
NCHTRLNQ EQU   *-NCHUSTRT          L'ORIGINAL UPLOADED RECORD                   
NCHTFLDS EQU   *-NCHUCNT           L'DATA FIELDS                                
         EJECT                                                                  
*                                                                               
*                                                                               
NEUND    DSECT                                                                  
NEUNLEN  DS    XL2                 LENGTH OF END-OF-UNIT OBJECT                 
NEUNODAT EQU   *                                                                
         DS    XL10                SPARE                                        
NEUNSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEUNTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EUNT')                 
NEUNLENQ EQU   *-NEUNODAT          L'OBJECT                                     
NEUNRLNQ EQU   *-NEUNSTRT          L'ORIGINAL UPLOADED RECORD                   
*                                                                               
         EJECT                                                                  
NEODD    DSECT                                                                  
NEODLEN  DS    XL2                 LENGTH OF END-OF-DEAL OBJECT                 
NEODDAT  EQU   *                                                                
         DS    XL10                SPARE                                        
NEODSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEODTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EOD*')                 
NEODLENQ EQU   *-NEODDAT           L'OBJECT                                     
NEODRLNQ EQU   *-NEODSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
NEOPD    DSECT                                                                  
NEOPLEN  DS    XL2                 LENGTH OF END-OF-FILE OBJECT                 
NEOPDAT  EQU   *                                                                
         DS    XL10                SPARE                                        
NEOPSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEOPTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EPKG')                 
NEOPLENQ EQU   *-NEOPDAT           L'OBJECT                                     
NEOPRLNQ EQU   *-NEOPSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
NEOFD    DSECT                                                                  
NEOFLEN  DS    XL2                 LENGTH OF END-OF-FILE OBJECT                 
NEOFDAT  EQU   *                                                                
         DS    XL10                SPARE                                        
NEOFSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NEOFTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'EOF*')                 
NEOFLENQ EQU   *-NEOFDAT           L'OBJECT                                     
NEOFRLNQ EQU   *-NEOFSTRT          L'ORIGINAL UPLOADED RECORD                   
         EJECT                                                                  
*                                                                               
NDELD    DSECT                                                                  
NDELLEN  DS    XL2                 LENGTH OF DELETE OBJECT                      
NDELODAT EQU   *                                                                
NDELERNO DS    XL2                 ERROR NUMBER                                 
NDELERF  DS    X                   FIELD NUMBER IN ERROR                        
         DS    XL7                 SPARE                                        
NDELSTRT EQU   *                   START OF $MAD OBJECT DATA                    
NDELTYPE DS    CL4                 OBJECT TYPE (ALWAYS C'DEL*')                 
NDELCLT  DS    XL2                 CLIENT                                       
NDELNET  DS    CL4                 NETWORK                                      
NDELPROG DS    CL6                 PROGRAM CODE                                 
NDELDATE DS    XL2                 DATE                                         
NDELEST  DS    XL1                 ESTIMATE                                     
NDELDPT  DS    CL1                 DAYPART                                      
NDELSLN1 DS    XL1                 NETPAK LINE NUMBER 1                         
NDELSLN2 DS    XL1                 NETPAK LINE NUMBER 2                         
NDELSERN DS    CL12                SERIAL NUMBER                                
*                                  INSERTION DETAILS FROM UPLOAD                
NDELLENQ EQU   *-NDELODAT          L'OBJECT                                     
NDELRLNQ EQU   *-NDELSTRT          L'ORIGINAL UPLOADED RECORD                   
         SPACE 3                                                                
