*          DATA SET NEWRI57D   AT LEVEL 001 AS OF 08/20/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T32057D      DATE 08/20/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   16    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   25    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   27    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL45     5   33   45  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8      6   16    8  A  U N             T        Y   22         
SPLNETX  DS    CL8                                                              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24     6   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
SPLPRGH  DS    CL8                                                              
SPLPRG   DS    CL6      7   16    6  A  U N             T        Y   22         
SPLPRGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
SPLEDTH  DS    CL8                                                              
SPLEDT   DS    CL8      8   16    8  A  U N             T        Y   41         
SPLEDTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
SPLTESTH DS    CL8                                                              
SPLTEST  DS    CL1      9   16    1  A  U N             T        Y   45         
SPLTESTX DS    CL8                                                              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL1     11    2    1  A  P N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 304  BYTES                            
