*          DATA SET NEWRIE6D   AT LEVEL 002 AS OF 08/11/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320E6D      DATE 08/11/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   13    8  A   U    H         T    I   Y   11         
SPLCLIX  DS    CL8                                                              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     7   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    H         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      8   13    8  A   U    H         T        Y   16         
SPLPROX  DS    CL8                                                              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     8   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      9   13    8  A   U    N         T        Y   22         
SPLESTX  DS    CL8                                                              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     9   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8     10   13    8  A   U    N         T        Y   25         
SPLNETX  DS    CL8                                                              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24    10   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL8     11   13    8  A   U    N         T        Y   31         
SPLDPTX  DS    CL8                                                              
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL10    11   24   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8     12   13    8  A   U    N         T        Y   36         
SPLPAKX  DS    CL8                                                              
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    12   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  A   P    N         T        Y              
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL8     14   13    8  A   U    N         T        Y   40         
SPLSTRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15    2    8  A   P    N         T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL8     15   13    8  A   U    N         T        Y   41         
SPLENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL40    16   13   40  A   U    N         T        Y  108         
SPLOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17    2    7  A   P    N         T        Y              
SPLTITH  DS    CL8                                                              
SPLTIT   DS    CL40    17   13   40  A   U    N         T        Y   65         
SPLTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18    2   10  A   P    N         T        Y              
SPLPFBH  DS    CL8                                                              
SPLPFB   DS    CL1     18   13    1  A   U    N         T        Y  109         
SPLPFBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19    2   10  A   P    N         T        Y              
SPLCOSH  DS    CL8                                                              
SPLCOS   DS    CL1     19   13    1  A   U    N         T        Y  110         
SPLCOSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   13    1  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 828  BYTES                            
