*          DATA SET NEWRIE2D   AT LEVEL 004 AS OF 11/14/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320E2D      DATE 11/14/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   16    8  A  U N             T    I   N              
         DS    XL8                                                              
         DS    CL1      6   25    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   27    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL45     6   33   45  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SPLCLIH  DS    XL8                                                              
SPLCLI   DS    CL8      7   16    8  A  U N             T        Y   11         
SPLCLIX  DS    XL8                                                              
SPLCLINH DS    XL8                                                              
SPLCLIN  DS    CL20     7   27   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
SPLESTH  DS    XL8                                                              
SPLEST   DS    CL8      8   16    8  A  U N             T        Y   22         
SPLESTX  DS    XL8                                                              
SPLESTNH DS    XL8                                                              
SPLESTN  DS    CL24     8   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
SPLNETH  DS    XL8                                                              
SPLNET   DS    CL8      9   16    8  A  U N             T        Y   25         
SPLNETX  DS    XL8                                                              
SPLNETNH DS    XL8                                                              
SPLNETN  DS    CL24     9   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P H             T        Y              
SPLNTISH DS    XL8                                                              
SPLNTIS  DS    CL8     10   19    8  A  U N             T        Y   25         
SPLNTISX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P H             T        Y              
SPLNTIEH DS    XL8                                                              
SPLNTIE  DS    CL8     11   19    8  A  U N             T        Y   25         
SPLNTIEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SPLPAKH  DS    XL8                                                              
SPLPAK   DS    CL8     12   19    8  A  U N             T        Y   36         
SPLPAKX  DS    XL8                                                              
SPLPAKNH DS    XL8                                                              
SPLPAKN  DS    CL36    12   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
SPLSTRTH DS    XL8                                                              
SPLSTRT  DS    CL8     13   19    8  A  U N             T        Y   40         
SPLSTRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
SPLENDDH DS    XL8                                                              
SPLENDD  DS    CL8     14   19    8  A  U N             T        Y   41         
SPLENDDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  P H             T        Y              
SPLTSTH  DS    XL8                                                              
SPLTST   DS    CL1     15   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
SPLOPTH  DS    XL8                                                              
SPLOPT   DS    CL40    16   19   40  A  U N             T        Y              
SPLENDH  DS    XL8                                                              
SPLEND   DS    CL1     17    2    1  A  P N             T        Y              
SPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 688  BYTES                            
