*          DATA SET NEWRIE1D   AT LEVEL 009 AS OF 07/08/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320E1D      DATE 07/08/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   13    8  A  U N             T        Y   11         
SPLCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   26    3  A  P N             T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      7   31    8  A  U N             T        Y   16         
SPLPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   42    3  A  P N             T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      7   47    8  A  U N             T        Y   22         
SPLESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8      8   13    8  A  U N             T        Y   25         
SPLNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   24    7  A  P N             T        Y              
SPLPRDH  DS    CL8                                                              
SPLPRD   DS    CL8      8   33    8  A  U N             T        Y   25         
SPLPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21     9    2   21  A  P N             T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL48     9   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    10    2   21  A  P N             T        Y              
SPLDSNH  DS    CL8                                                              
SPLDSN   DS    CL2     10   28    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11    2   21  A  P N             T        Y              
SPLSDCH  DS    CL8                                                              
SPLSDC   DS    CL2     11   28    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    12    2   21  A  P N             T        Y              
SPLPMKH  DS    CL8                                                              
SPLPMK   DS    CL2     12   28    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    13    2   21  A  P N             T        Y              
SPLPIRH  DS    CL8                                                              
SPLPIR   DS    CL2     13   28    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    14    2   21  A  P N             T        Y              
SPLPRBH  DS    CL8                                                              
SPLPRB   DS    CL2     14   28    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    15    2   25  A  P N             T        Y              
SPLUDDH  DS    CL8                                                              
SPLUDD   DS    CL10    15   28   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    16    2   21  A  P N             T        Y              
SPLINDH  DS    CL8                                                              
SPLIND   DS    CL10    16   28   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 688  BYTES                            
