*          DATA SET NEWRID6D   AT LEVEL 001 AS OF 10/31/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320D6D      DATE 10/31/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   10    8  A   U    H         T        Y   11         
SPLCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   20    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      7   28    8  A   U    N         T        Y   16         
SPLPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   38    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      7   47    8  A   U    N         T        Y   22         
SPLESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   56    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8      7   64    8  A   U    N         T        Y   25         
SPLNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL8      8   10    8  A   U    N         T        Y   31         
SPLDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8      8   28    8  A   U    N         T        Y   36         
SPLPAKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      8   38    5  A   P    N         T        Y              
SPLRSTRH DS    CL8                                                              
SPLRSTR  DS    CL8      8   46    8  A   U    N         T        Y   40         
SPLRSTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   56    3  A   P    N         T        Y              
SPLRENDH DS    CL8                                                              
SPLREND  DS    CL8      8   64    8  A   U    N         T        Y   41         
SPLRENDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9    2    9  A   P    H         T        Y              
SPLTESTH DS    CL8                                                              
SPLTEST  DS    CL1      9   12    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   P    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 432  BYTES                            
