*          DATA SET NEWRIMAC   AT LEVEL 001 AS OF 04/05/89                      
*              TABLE TO EXPAND MACRO EXPRESSIONS                                
         SPACE 3                                                                
MACTABLE DS    0D                                                               
MACENTRY DS    CL28                                                             
         DC    CL8'MCEARH  ',A(MCERH),A(MCARH),X'00000000'                      
         DC    CL8'MCEARH1 ',A(MCERH),A(MCAR1),X'00000000'                      
         DC    CL8'MCEARH2 ',A(MCERH),A(MCAR2),X'00000000'                      
         DC    CL8'MCEARH3 ',A(MCERH),A(MCAR3),X'00000000'                      
         DC    CL8'MCEARH4 ',A(MCERH),A(MCAR4),X'00000000'                      
         DC    CL8'MCEARH5 ',A(MCERH),A(MCAR5),X'00000000'                      
         DC    CL8'MCEARH6 ',A(MCERH),A(MCAR6),X'00000000'                      
         DC    CL8'MCEARH7 ',A(MCERH),A(MCAR7),X'00000000'                      
         DC    CL8'MCEARH8 ',A(MCERH),A(MCAR8),X'00000000'                      
         SPACE 1                                                                
MCERH    DC    CL4'ERH '                                                        
