*          DATA SET NEWRIDED   AT LEVEL 014 AS OF 08/03/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320DED      DATE 08/03/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   10    8  A  U N             T        Y   11         
SPLCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   20    7  A  P H             T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8      7   28    8  A  U N             T        Y   25         
SPLNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
SPLEST1H DS    CL8                                                              
SPLEST1  DS    CL3      8    6    3  A  U N             T        Y   22         
SPLEST1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   10    3  A  P N             T        Y              
SPLPAK1H DS    CL8                                                              
SPLPAK1  DS    CL3      8   14    3  A  U N             T        Y   36         
SPLPAK1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8   18    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   23   16  A  U N             T        Y   71         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   42    3  A  P H             T        Y              
SPLEST2H DS    CL8                                                              
SPLEST2  DS    CL3      8   46    3  A  U N             T        Y   22         
SPLEST2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   50    3  A  P N             T        Y              
SPLPAK2H DS    CL8                                                              
SPLPAK2  DS    CL3      8   54    3  A  U N             T        Y   36         
SPLPAK2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8   58    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   63   16  A  U N             T        Y   71         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
SPLDPT1H DS    CL8                                                              
SPLDPT1  DS    CL1      9    6    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    8    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   20    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   26    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   28    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   35    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   37    2  A  U N             T        Y              
SPLDPT2H DS    CL8                                                              
SPLDPT2  DS    CL3      9   42    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   48    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   53    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   58    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   66    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   68    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   77    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P H             T        Y              
SPLEST3H DS    CL8                                                              
SPLEST3  DS    CL3     11    6    3  A  U N             T        Y   22         
SPLEST3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   10    3  A  P N             T        Y              
SPLPAK3H DS    CL8                                                              
SPLPAK3  DS    CL3     11   14    3  A  U N             T        Y   36         
SPLPAK3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11   18    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    11   23   16  A  U N             T        Y   71         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   42    3  A  P H             T        Y              
SPLEST4H DS    CL8                                                              
SPLEST4  DS    CL3     11   46    3  A  U N             T        Y   22         
SPLEST4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   50    3  A  P N             T        Y              
SPLPAK4H DS    CL8                                                              
SPLPAK4  DS    CL3     11   54    3  A  U N             T        Y   36         
SPLPAK4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11   58    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    11   63   16  A  U N             T        Y   71         
         DS    CL8                                                              
SPLDPT3H DS    CL8                                                              
SPLDPT3  DS    CL3     12    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    6    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12    8    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   20    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   26    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   28    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   35    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   37    2  A  U N             T        Y              
SPLDPT4H DS    CL8                                                              
SPLDPT4  DS    CL3     12   42    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   48    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   53    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   58    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   66    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   68    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   77    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P H             T        Y              
SPLEST5H DS    CL8                                                              
SPLEST5  DS    CL3     14    6    3  A  U N             T        Y   22         
SPLEST5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14   10    3  A  P N             T        Y              
SPLPAK5H DS    CL8                                                              
SPLPAK5  DS    CL3     14   14    3  A  U N             T        Y   36         
SPLPAK5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14   18    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   23   16  A  U N             T        Y   71         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14   42    3  A  P H             T        Y              
SPLEST6H DS    CL8                                                              
SPLEST6  DS    CL3     14   46    3  A  U N             T        Y   22         
SPLEST6X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14   50    3  A  P N             T        Y              
SPLPAK6H DS    CL8                                                              
SPLPAK6  DS    CL3     14   54    3  A  U N             T        Y   36         
SPLPAK6X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14   58    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   63   16  A  U N             T        Y   71         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
SPLDPT5H DS    CL8                                                              
SPLDPT5  DS    CL1     15    6    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    8    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   20    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   26    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   28    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   35    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   37    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   42    3  A  P N             T        Y              
SPLDPT6H DS    CL8                                                              
SPLDPT6  DS    CL1     15   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   48    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   53    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   58    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   66    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   68    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   77    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P H             T        Y              
SPLEST7H DS    CL8                                                              
SPLEST7  DS    CL3     17    6    3  A  U N             T        Y   22         
SPLEST7X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17   10    3  A  P N             T        Y              
SPLPAK7H DS    CL8                                                              
SPLPAK7  DS    CL3     17   14    3  A  U N             T        Y   36         
SPLPAK7X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17   18    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   23   16  A  U N             T        Y   71         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17   42    3  A  P H             T        Y              
SPLEST8H DS    CL8                                                              
SPLEST8  DS    CL3     17   46    3  A  U N             T        Y   22         
SPLEST8X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17   50    3  A  P N             T        Y              
SPLPAK8H DS    CL8                                                              
SPLPAK8  DS    CL3     17   54    3  A  U N             T        Y   36         
SPLPAK8X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17   58    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   63   16  A  U N             T        Y   71         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
SPLDPT7H DS    CL8                                                              
SPLDPT7  DS    CL1     18    6    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    8    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   13    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   20    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   26    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   28    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   35    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   37    2  A  U N             T        Y              
SPLDPT8H DS    CL8                                                              
SPLDPT8  DS    CL3     18   42    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   48    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   53    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   58    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   66    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   68    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   77    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20    2   11  A  P N             T        Y              
SPLPCPMH DS    CL8                                                              
SPLPCPM  DS    CL10    20   16   10  A  U N             T        Y   71         
SPLPCPMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     20   40    5  A  P N             T        Y              
SPLINTGH DS    CL8                                                              
SPLINTG  DS    CL10    20   46   10  A  U N             T        Y   71         
SPLINTGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     21    2    4  A  P N             T        Y              
SPLDEMOH DS    CL8                                                              
SPLDEMO  DS    CL10    21   16   10  A  U N             T        Y   36         
SPLDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     21   40    4  A  P N             T        Y              
SPLUNIVH DS    CL8                                                              
SPLUNIV  DS    CL10    21   46   10  A  U N             T        Y   36         
SPLUNIVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
SPLDCPMH DS    CL8                                                              
SPLDCPM  DS    CL10    22   16   10  A  U N             T        Y   71         
SPLDCPMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    22   40   12  A  P N             T        Y              
SPLMALCH DS    CL8                                                              
SPLMALC  DS    CL10    22   53   10  A  U N             T        Y   71         
SPLMALCX DS    CL8                                                              
SPLEXDH  DS    CL8                                                              
SPLEXD   DS    CL1     22   70    1  A  P N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2120 BYTES                            
