*          DATA SET NEWRIDBD   AT LEVEL 006 AS OF 11/12/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320DBD      DATE 11/12/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
NETCLIH  DS    CL8                                                              
NETCLI   DS    CL8      7   15    8  A  U H             T        Y   11         
NETCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
NETPRDH  DS    CL8                                                              
NETPRD   DS    CL8      8   15    8  A  U H             T        Y   22         
NETPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P H             T        Y              
NETESTH  DS    CL8                                                              
NETEST   DS    CL8      9   15    8  A  U H             T        Y   22         
NETESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  P H             T        Y              
NETNETH  DS    CL8                                                              
NETNET   DS    CL4     10   15    4  A  U H             T        Y   22         
NETNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    11    2   10  A  P H             T        Y              
NETSTRH  DS    CL8                                                              
NETSTR   DS    CL10    11   15   10  A  U H             T        Y   22         
NETSTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  P H             T        Y              
NETENDH  DS    CL8                                                              
NETEND   DS    CL10    12   15   10  A  U H             T        Y   22         
NETENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
NETOPTH  DS    CL8                                                              
NETOPT   DS    CL30    14   15   30  A  U N             T        Y   22         
NETOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
NETLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
NETWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
