*          DATA SET NEWRIDAD   AT LEVEL 005 AS OF 06/25/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320DAD      DATE 06/25/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   15    8  A   U    H         T        Y   11         
SPLCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    H         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      8   15    8  A   U    H         T        Y   22         
SPLESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    H         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8      9   15    8  A   U    H         T        Y   25         
SPLNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    H         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8     10   15    8  A   U    H         T        Y   36         
SPLPAKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     11    2    9  A   P    H         T        Y              
SPLRUNH  DS    CL8                                                              
SPLRUN   DS    CL10    11   15   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL40    11   35   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    12   35   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   P    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 384  BYTES                            
