*          DATA SET NEWRIEBD   AT LEVEL 008 AS OF 03/23/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320EBD      DATE 03/23/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL5      7   14    5  A   U    H         T    I   Y              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     7   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL5      8   14    5  A   U    N         T        Y              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     8   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    H         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      9   14    8  A   U    H         T        Y              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     9   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8     10   14    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8     11   14    8  A   U    N         T        Y              
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    11   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL5     12   14    5  A   U    N         T        Y              
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL20    12   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A   P    N         T        Y              
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL8     13   14    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   24    8  A   P    N         T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL8     13   34    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
SPLPGKH  DS    CL8                                                              
SPLPGK   DS    CL8     14   14    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    14   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    15    2   11  A   P    N         T        Y              
SPLASSH  DS    CL8                                                              
SPLASS   DS    CL1     15   14    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL34    15   24   34  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A   P    N         T        Y              
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL1     16   14    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL29    16   24   29  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A   P    N         T        Y              
SPLEQVH  DS    CL8                                                              
SPLEQV   DS    CL2     17   14    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL41    17   24   41  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18    2    4  A   P    N         T        Y              
SPLPFBH  DS    CL8                                                              
SPLPFB   DS    CL1     18   14    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   24   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A   P    N         T        Y              
SPLOPSH  DS    CL8                                                              
SPLOPS   DS    CL40    19   14   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20    2    4  A   P    N         T        Y              
SPLDMOH  DS    CL8                                                              
SPLDMO   DS    CL7     20   14    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     21    2    9  A   P    H         T        Y              
SPLTSTH  DS    CL8                                                              
SPLTST   DS    CL1     21   14    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A   P    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 928  BYTES                            
