*          DATA SET NEWRIEED   AT LEVEL 003 AS OF 05/10/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320EED      DATE 05/10/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL3      7   15    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P H             T        Y              
SPLDATH  DS    CL8                                                              
SPLDAT   DS    CL10     8   15   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A  P N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 152  BYTES                            
