*          DATA SET NEWRICBD   AT LEVEL 009 AS OF 08/26/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320CBD      DATE 08/26/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   16    8  A  U N             T        Y   11         
SPLCLIX  DS    CL8                                                              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     7   27   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      8   16    8  A  U N             T        Y   16         
SPLPROX  DS    CL8                                                              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     8   27   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      9   16    8  A  U N             T        Y   22         
SPLESTX  DS    CL8                                                              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL20     9   27   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8     10   16    8  A  U N             T        Y   23         
SPLNETX  DS    CL8                                                              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24    10   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SPLPRGH  DS    CL8                                                              
SPLPRG   DS    CL6     11   16    6  A  U N             T        Y   24         
SPLPRGX  DS    CL8                                                              
SPLPRGNH DS    CL8                                                              
SPLPRGN  DS    CL20    11   27   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
SPLUSTH  DS    CL8                                                              
SPLUST   DS    CL8     12   16    8  A  U N             T        Y   25         
SPLUSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   28    8  A  P N             T        Y              
SPLUNDH  DS    CL8                                                              
SPLUND   DS    CL8     12   42    8  A  U N             T        Y   26         
SPLUNDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
SPLASTH  DS    CL8                                                              
SPLAST   DS    CL8     13   16    8  A  U N             T        Y   27         
SPLASTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   28    8  A  P N             T        Y              
SPLANDH  DS    CL8                                                              
SPLAND   DS    CL8     13   42    8  A  U N             T        Y   28         
SPLANDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
SPLRSNH  DS    CL8                                                              
SPLRSN   DS    CL4     15   16    4  A  U N             T        Y   29         
SPLRSNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   28    8  A  P N             T        Y              
SPLRTNH  DS    CL8                                                              
SPLRTN   DS    CL5     15   42    5  A  U N             T        Y   30         
SPLRTNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
SPLCSTH  DS    CL8                                                              
SPLCST   DS    CL8     16   16    8  A  U N             T        Y   31         
SPLCSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   28    8  A  P N             T        Y              
SPLTIMH  DS    CL8                                                              
SPLTIM   DS    CL15    16   42   15  A  U N             T        Y   32         
SPLTIMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
SPLLENH  DS    CL8                                                              
SPLLEN   DS    CL3     17   16    3  A  U N             T        Y   33         
SPLLENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   28    8  A  P N             T        Y              
SPLCOMH  DS    CL8                                                              
SPLCOM   DS    CL1     17   42    1  A  U N             T        Y   34         
SPLCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
SPLPBKH  DS    CL8                                                              
SPLPBK   DS    CL1     18   16    1  A  U N             T        Y   35         
SPLPBKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     18   28    9  A  P N             T        Y              
SPLGRPH  DS    CL8                                                              
SPLGRP   DS    CL4     18   42    4  A  U N             T        Y   36         
SPLGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL60    19   16   60  A  U N             T        Y   37         
SPLOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
SPLTITH  DS    CL8                                                              
SPLTIT   DS    CL60    20   16   60  A  U N             T        Y   38         
SPLTITX  DS    CL8                                                              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL1     21    2    1  A  P N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1080 BYTES                            
