*          DATA SET NEWRIE0D   AT LEVEL 016 AS OF 07/27/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320E0D      DATE 07/27/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
SPLNAMH  DS    CL8                                                              
SPLNAM   DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
SPLFLTH  DS    CL8                                                              
SPLFLT   DS    CL4      5   64    4  A  U N             T        Y    2         
SPLFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   10    8  A  U H             T        Y   11         
SPLCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   20    7  A  P H             T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      7   28    8  A  U H             T        Y   16         
SPLPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      7   46    8  A  U H             T        Y   22         
SPLESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   56    7  A  P N             T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8      7   64    8  A  U N             T        Y   25         
SPLNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL8      8   10    8  A  U N             T        Y   31         
SPLDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P N             T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8      8   28    8  A  U N             T        Y   36         
SPLPAKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      8   38    5  A  P N             T        Y              
SPLRSTRH DS    CL8                                                              
SPLRSTR  DS    CL8      8   46    8  A  U N             T        Y   40         
SPLRSTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   56    3  A  P N             T        Y              
SPLRENDH DS    CL8                                                              
SPLREND  DS    CL8      8   64    8  A  U N             T        Y   41         
SPLRENDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P H             T        Y              
SPLFLAVH DS    CL8                                                              
SPLFLAV  DS    CL3      9   10    3  A  U H             T        Y  101         
SPLFLAVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   20    7  A  P N             T        Y              
SPLFILTH DS    CL8                                                              
SPLFILT  DS    CL6      9   28    6  A  U N             T        Y   51         
SPLFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   38    7  A  P N             T        Y              
SPLALLUH DS    CL8                                                              
SPLALLU  DS    CL2      9   46    2  A  U N             T        Y  107         
SPLALLUX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SPLLEFTH DS    CL8                                                              
SPLLEFT  DS    CL16    10   10   16  A  U N             T        Y  111         
SPLLEFTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10   28   16  A  U N             T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10   46   16  A  U N             T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10   64   16  A  U N             T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SPLRGHTH DS    CL8                                                              
SPLRGHT  DS    CL16    11   10   16  A  U N             T        Y  102         
SPLRGHTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    11   28   16  A  U N             T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     11   46    9  A  U N             T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   56    7  A  P N             T        Y              
SPLMIDH  DS    CL8                                                              
SPLMID   DS    CL16    11   64   16  A  U N             T        Y  103         
SPLMIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SPLDETSH DS    CL8                                                              
SPLDETS  DS    CL16    12   10   16  A  U N             T        Y  104         
SPLDETSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   28   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   46   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   64   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   10   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   28   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   46   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   64   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
SPLRECPH DS    CL8                                                              
SPLRECP  DS    CL16    14   10   16  A  U N             T        Y  105         
SPLRECPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   28   16  A  U N             T        Y  105         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   46   16  A  U N             T        Y  105         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   64   16  A  U N             T        Y  105         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15   10    1  A  P N             T        Y              
SPLCOLSH DS    CL8                                                              
SPLCOLS  DS    CL32    15   12   32  A  U N             T        Y  106         
SPLCOLSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    15   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    16   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    16   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL45    21   10   45  A  U N             T        Y  108         
SPLOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     21   56    6  A  P N             T        Y              
SPLEQIVH DS    CL8                                                              
SPLEQIV  DS    CL8     21   64    8  A  U N             T        Y  109         
SPLEQIVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
SPLOTHH  DS    CL8                                                              
SPLOTH   DS    CL45    22   10   45  A  U N             T        Y  110         
SPLOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22   56    7  A  P N             T        Y              
SPLPCTH  DS    CL8                                                              
SPLPCT   DS    CL8     22   64    8  A  U N             T        Y   71         
SPLPCTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     23    2    5  A  P N             T        Y              
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL70    23   10   70  A  U N             T        Y   60         
SPLDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
SPLTITLH DS    CL8                                                              
SPLTITL  DS    CL34    24   10   34  A  U N             T        Y   65         
SPLTITLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    24   46   34  A  U N             T        Y   66         
         DS    CL8                                                              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2384 BYTES                            
