*          DATA SET NEWRIDDD   AT LEVEL 017 AS OF 06/15/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320DDD      DATE 06/15/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   16    8  A  U N             T        Y   11         
SPLCLIX  DS    CL8                                                              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     7   27   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL25     8   16   25  A  U N             T        Y   22         
SPLESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8      9   16    8  A  U N             T        Y   25         
SPLNETX  DS    CL8                                                              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24     9   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL15    10   16   15  A  U N             T        Y   36         
SPLPAKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL8     11   16    8  A  U N             T        Y   31         
SPLDPTX  DS    CL8                                                              
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL8     11   27    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
SPLSTDH  DS    CL8                                                              
SPLSTD   DS    CL8     12   16    8  A  U N             T        Y   31         
SPLSTDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
SPLENDH  DS    CL8                                                              
SPLEND   DS    CL8     13   16    8  A  U N             T        Y   31         
SPLENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  P N             T        Y              
SPLCSTH  DS    CL8                                                              
SPLCST   DS    CL2     14   16    2  A  U N             T        Y   70         
SPLCSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    14   27   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
SPLPDMH  DS    CL8                                                              
SPLPDM   DS    CL8     16   16    8  A  U N             T        Y   71         
SPLPDMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    16   27   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
SPLPCPH  DS    CL8                                                              
SPLPCP   DS    CL8     17   16    8  A  U N             T        Y   71         
SPLPCPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    17   27   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    2    4  A  P N             T        Y              
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL9     18   16    9  A  U N             T        Y  108         
SPLDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    18   27   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
SPLDCPH  DS    CL8                                                              
SPLDCP   DS    CL10    19   16   10  A  U N             T        Y   71         
SPLDCPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    19   27   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     21    2    9  A  P H             T        Y              
SPLTSTH  DS    CL8                                                              
SPLTST   DS    CL2     21   16    2  A  U N             T        Y  108         
SPLTSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    21   27   40  A  P H             T        Y              
SPLEXDH  DS    CL8                                                              
SPLEXD   DS    CL1     22    2    1  A  P N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 960  BYTES                            
