*          DATA SET NEWRIF8D   AT LEVEL 012 AS OF 07/18/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320F8D      DATE 07/18/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL45     5   28   45  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   76    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   16    8  A   U    N         T        Y   11         
SPLCLIX  DS    CL8                                                              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     7   27   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      8   16    8  A   U    N         T        Y   15         
SPLPROX  DS    CL8                                                              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     8   27   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      9   16    8  A   U    N         T        Y   22         
SPLESTX  DS    CL8                                                              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     9   27   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8     10   16    8  A   U    N         T        Y   25         
SPLNETX  DS    CL8                                                              
SPLNETNH DS    CL8                                                              
SPLNETN  DS    CL24    10   27   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A   P    N         T        Y              
SPLSTRTH DS    CL8                                                              
SPLSTRT  DS    CL8     11   16    8  A   U    N         T        Y   40         
SPLSTRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    N         T        Y              
SPLENDDH DS    CL8                                                              
SPLENDD  DS    CL8     12   16    8  A   U    N         T        Y   41         
SPLENDDX DS    CL8                                                              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 464  BYTES                            
