*          DATA SET NEWRIF6D   AT LEVEL 013 AS OF 03/23/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T320F6D      DATE 03/23/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      7   13    8  A   U    N         T        Y   11         
SPLCLIX  DS    CL8                                                              
SPLCLINH DS    CL8                                                              
SPLCLIN  DS    CL20     7   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      8   13    8  A   U    N         T        Y   16         
SPLPROX  DS    CL8                                                              
SPLPRONH DS    CL8                                                              
SPLPRON  DS    CL20     8   24   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    N         T        Y              
SPLESTH  DS    CL8                                                              
SPLEST   DS    CL8      9   13    8  A   U    N         T        Y   22         
SPLESTX  DS    CL8                                                              
SPLESTNH DS    CL8                                                              
SPLESTN  DS    CL24     9   24   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPLNETH  DS    CL8                                                              
SPLNET   DS    CL8     10   13    8  A   U    N         T        Y   25         
SPLNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   24    7  A   P    N         T        Y              
SPLDPTH  DS    CL8                                                              
SPLDPT   DS    CL8     10   33    8  A   U    N         T        Y   31         
SPLDPTX  DS    CL8                                                              
SPLDPTNH DS    CL8                                                              
SPLDPTN  DS    CL8     10   43    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
SPLPAKH  DS    CL8                                                              
SPLPAK   DS    CL8     11   13    8  A   U    N         T        Y   36         
SPLPAKX  DS    CL8                                                              
SPLPAKNH DS    CL8                                                              
SPLPAKN  DS    CL36    11   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     13    2    6  A   P    N         T        Y              
SPLFLAVH DS    CL8                                                              
SPLFLAV  DS    CL8     13   13    8  A   U    N         T        Y  101         
SPLFLAVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
SPLFORMH DS    CL8                                                              
SPLFORM  DS    CL65    14   13   65  A   U    N         T        Y  102         
SPLFORMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15    2   10  A   P    N         T        Y              
SPLDETH  DS    CL8                                                              
SPLDET   DS    CL45    15   13   45  A   U    N         T        Y  103         
SPLDETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15   61    7  A   P    N         T        Y              
SPLSUBH  DS    CL8                                                              
SPLSUB   DS    CL8     15   69    8  A   U    N         T        Y  104         
SPLSUBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16    2   10  A   P    N         T        Y              
SPLRECH  DS    CL8                                                              
SPLREC   DS    CL45    16   13   45  A   U    N         T        Y  105         
SPLRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16   61    7  A   P    N         T        Y              
SPLRSUBH DS    CL8                                                              
SPLRSUB  DS    CL8     16   69    8  A   U    N         T        Y  106         
SPLRSUBX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17    2   10  A   P    N         T        Y              
SPLRSTRH DS    CL8                                                              
SPLRSTR  DS    CL8     17   13    8  A   U    N         T        Y   40         
SPLRSTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   24    8  A   P    N         T        Y              
SPLRENDH DS    CL8                                                              
SPLREND  DS    CL8     17   33    8  A   U    N         T        Y   41         
SPLRENDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   43    6  A   P    N         T        Y              
SPLFILTH DS    CL8                                                              
SPLFILT  DS    CL8     17   51    8  A   U    N         T        Y   51         
SPLFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17   61    7  A   P    N         T        Y              
SPLALLUH DS    CL8                                                              
SPLALLU  DS    CL8     17   69    8  A   U    N         T        Y  107         
SPLALLUX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18    2   10  A   P    N         T        Y              
SPLBSTRH DS    CL8                                                              
SPLBSTR  DS    CL8     18   13    8  A   U    N         T        Y   42         
SPLBSTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   24    8  A   P    N         T        Y              
SPLBENDH DS    CL8                                                              
SPLBEND  DS    CL8     18   33    8  A   U    N         T        Y   43         
SPLBENDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18   43    7  A   P    N         T        Y              
SPLPCTH  DS    CL8                                                              
SPLPCT   DS    CL8     18   51    8  A   U    N         T        Y   71         
SPLPCTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18   61    7  A   P    N         T        Y              
SPLCOMH  DS    CL8                                                              
SPLCOM   DS    CL8     18   69    8  A   U    N         T        Y   75         
SPLCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19    2   10  A   P    N         T        Y              
SPLPSTRH DS    CL8                                                              
SPLPSTR  DS    CL8     19   13    8  A   U    N         T        Y   44         
SPLPSTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   24    8  A   P    N         T        Y              
SPLPENDH DS    CL8                                                              
SPLPEND  DS    CL8     19   33    8  A   U    N         T        Y   45         
SPLPENDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     20    2    5  A   P    N         T        Y              
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL60    20   13   60  A   U    N         T        Y   60         
SPLDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  A   P    N         T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL40    21   13   40  A   U    N         T        Y  108         
SPLOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    22    2   10  A   P    N         T        Y              
SPLTITLH DS    CL8                                                              
SPLTITL  DS    CL40    22   13   40  A   U    N         T        Y   65         
SPLTITLX DS    CL8                                                              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1497 BYTES                            
