*          DATA SET NODESCT    AT LEVEL 003 AS OF 07/12/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN S110FFD      DATE 07/12/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CNTMSGH  DS    CL8                                                              
CNTMSG   DS    CL60     1    2   60  A  P N             T        Y              
CNTSREQH DS    CL8                                                              
CNTSREQ  DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     3    2   12  L  P H             T        Y              
CNTIDH   DS    CL8                                                              
CNTID    DS    CL44     3   15   44  A  U N        M    T    I   Y              
CNTX1H   DS    CL8                                                              
CNTX1    DS    CL16     3   64   16  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     4    2   12  L  P H             T        Y              
CNTSYSH  DS    CL8                                                              
CNTSYS   DS    CL44     4   15   44  A  U N        M    T        Y              
CNTX2H   DS    CL8                                                              
CNTX2    DS    CL16     4   64   16  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     5    2   12  L  P H             T        Y              
CNTPGMH  DS    CL8                                                              
CNTPGM   DS    CL44     5   15   44  A  U N        M    T        Y              
CNTX3H   DS    CL8                                                              
CNTX3    DS    CL16     5   64   16  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  L  P H             T        Y              
CNTPWDH  DS    CL8                                                              
CNTPWD   DS    CL44     6   15   44  A  U Z        M    T        Y              
CNTX4H   DS    CL8                                                              
CNTX4    DS    CL16     6   64   16  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  L  P N             T        Y              
CNTDATAH DS    CL8                                                              
CNTDATA  DS    CL44     7   15   44  A  U N        M    T        Y              
CNTTABH  DS    CL8                                                              
CNTTAB   DS    CL1      7   64    1  A  U N             T        Y              
CNTC01H  DS    CL8                                                              
CNTC01   DS    CL44     9   19   44  L  U H             T        Y              
CNTC02H  DS    CL8                                                              
CNTC02   DS    CL44    10   19   44  L  U H             T        Y              
CNTC03H  DS    CL8                                                              
CNTC03   DS    CL44    11   19   44  L  U H             T        Y              
CNTC04H  DS    CL8                                                              
CNTC04   DS    CL44    12   19   44  L  U H             T        Y              
CNTC05H  DS    CL8                                                              
CNTC05   DS    CL44    13   19   44  L  U H             T        Y              
CNTC06H  DS    CL8                                                              
CNTC06   DS    CL44    14   19   44  L  U H             T        Y              
CNTC07H  DS    CL8                                                              
CNTC07   DS    CL44    15   19   44  L  U H             T        Y              
CNTC08H  DS    CL8                                                              
CNTC08   DS    CL44    16   19   44  L  U H             T        Y              
CNTC09H  DS    CL8                                                              
CNTC09   DS    CL44    17   19   44  L  U H             T        Y              
CNTC10H  DS    CL8                                                              
CNTC10   DS    CL44    18   19   44  L  U H             T        Y              
CNTC11H  DS    CL8                                                              
CNTC11   DS    CL44    19   19   44  L  U H             T        Y              
CNTC12H  DS    CL8                                                              
CNTC12   DS    CL44    20   19   44  L  U H             T        Y              
CNTSLOGH DS    CL8                                                              
CNTSLOG  DS    CL48    22   17   48  L  P H             T        Y              
CNTWWWH  DS    CL8                                                              
CNTWWW   DS    CL78    23    2   78  L  P N             T        Y              
CNTADDRH DS    CL8                                                              
CNTADDR  DS    CL78    24    2   78  L  P N             T        Y              
CNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1416 BYTES                            
