*          DATA SET NTXRECID   AT LEVEL 091 AS OF 12/10/20                      
***********************************************************************         
* NET    SYSTEM EXTRACT     RECORD TYPES                             *          
***********************************************************************         
*NOTE THERE IS A 3 CHAR CODE ASSOCIATED WITH EACH OF THESE RECORDS              
*WHICH UNIQUELY DEFINES THE RECORD TYPE. IT IS USED WHEN RUNNING THE            
*EXTRACT FOR A SINGLE RECORD TYPE. IT ALSO GIVES THE NAME OF THE REP            
*BOOK WHICH RELATES TO THIS RECORD, AND THE RECORD`S ENTRY IN RECNVX            
*WHICH BUILDS THE VARIABLE LENGTH TABLE ENTRIES FOR SQL RECORDS                 
*THE 3 CHAR CODE IS THE 4.5.6 CHARS OF THE EQUATE NAME -E.G. FOR THE            
*CONTRACT HDR  RECORD, THE 3 CHAR CODE IS CON.                                  
                                                                                
NTMDQ     DC   CL5'06500'          MEDIA                                        
NTCNQ     DC   CL5'06501'          CLIENT                                       
NTPLQ     DC   CL5'06502'          CLIENT PRODUCT LIST                          
NTPDQ     DC   CL5'06503'          PRODUCT                                      
NTESQ     DC   CL5'06504'          ESTIMATE                                     
NTEDQ     DC   CL5'06505'          ESTIMATE DEMO LIST                           
NTSTQ     DC   CL5'06506'          STATION                                      
NTDPQ     DC   CL5'06507'          DAYPART                                      
NTPRQ     DC   CL5'06508'          PROGRAM                                      
NTPKQ     DC   CL5'06509'          PACKAGE                                      
NTUNQ     DC   CL5'06510'          UNIT                                         
NTUAQ     DC   CL5'06511'          UNIT - PRODUCT/ALLOCATION                    
NTUPQ     DC   CL5'06512'          UNIT - PAID SUMMARY                          
NTUCQ     DC   CL5'06513'          UNIT - SPECIAL CHARGES                       
NTUSQ     DC   CL5'06514'          UNIT - SUMMARY                               
NTUEQ     DC   CL5'06515'          UNIT - ESTIMATE DEMO LIST                    
NTGHQ     DC   CL5'06516'          GOAL (SPTFIL)                                
NTGDQ     DC   CL5'06517'          GOAL - WEEKLY DATA (SPTFIL)                  
NTPHQ     DC   CL5'06518'          PRODUCT GROUP                                
NTPGQ     DC   CL5'06519'          PRODUCT GROUP PRODUCTS                       
NTUTQ     DC   CL5'06520'          UNIT - NTI                                   
NTADQ     DC   CL5'06521'          UNIT - ACTUAL DEMOS                          
NTECQ     DC   CL5'06522'          EARNED COST                                  
NTSGDQ    DC   CL5'06523'          STATION GROUP DEFINITION                     
NTSGQ     DC   CL5'06524'          STATION GROUP                                
NTSGSQ    DC   CL5'06525'          STATION GROUP STATIONS                       
NTCGDQ    DC   CL5'06526'          CLIENT GROUP DEFINITION                      
NTCGGQ    DC   CL5'06527'          CLIENT GROUP                                 
NTCGCQ    DC   CL5'06528'          CLIENT GROUP STATIONS                        
NTGXHQ    DC   CL5'06529'          GOAL (XSPFIL)                                
NTGXDQ    DC   CL5'06530'          GOAL - WEEKLY DATA (XSPFIL)                  
NTREPQ    DC   CL5'06531'          REP                                          
NTUBQ     DC   CL5'06532'          UNIT - BARTER CREDITS                        
NTFLTQ    DC   CL5'06533'          FLIGHTS                                      
NTUCMQ    DC   CL5'06534'          UCOM                                         
NTCMLQ    DC   CL5'06535'          COMMERCIAL                                   
NTBFQ     DC   CL5'06536'          BFORM                                        
NTMKTQ    DC   CL5'06537'          MARKET                                       
NTUVQ     DC   CL5'06538'          UNIVERSE                                     
NTUDQ     DC   CL5'06539'          UNIVERSE - DEMOS                             
NTUUQ     DC   CL5'06540'          UNIVERSE - USER DEMOS                        
NTPTQ     DC   CL5'06541'          PATTERN                                      
NTPTCQ    DC   CL5'06542'          PATTERN - COMMERCIAL                         
NTPTMQ    DC   CL5'06543'          PATTERN - COMMENTS                           
NTPTHQ    DC   CL5'06544'          PATTERN - HIATUS                             
