*          DATA SET NTXRECD    AT LEVEL 226 AS OF 02/25/21                      
       ++INCLUDE DXHDRD                                                         
*                                                                               
       ++INCLUDE DXTRLD            TRAILER                                      
*                                                                               
***********************************************************************         
* NET   SYSTEM EXTRACT - MEDIA RECORD                                 *         
***********************************************************************         
NTTMDD   DSECT                     MEDIA RECORD                                 
NTTMDLEN DS    CL4                 RECORD LENGTH                                
NTTMDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTMDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTMDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTMDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTMDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTMDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTMDAGN DS    CL33                AGENCY NAME                                  
         DS    C                                                                
NTTMDMDN DS    CL20                MEDIA NAME                                   
*                                                                               
NTTMDDX  DS    CL2                 RECORD END                                   
NTTMDDL  EQU   *-NTTMDD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM EXTRACT - CLIENT RECORD                                            
***********************************************************************         
NTTCND   DSECT                     CLIENT RECORD                                
NTTCNLEN DS    CL4                 RECORD LENGTH                                
NTTCNTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTCNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTCNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTCNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTCNAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTCNMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTCNCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTCNNME DS    CL20                NAME                                         
         DS    C                                                                
NTTCNOFF DS    CL1                 OFFICE                                       
         DS    C                                                                
NTTCNPU1 DS    CL20                PRODUCT USER 1                               
         DS    C                                                                
NTTCNPU2 DS    CL20                PRODUCT USER 2                               
         DS    C                                                                
NTTCNEU1 DS    CL20                ESTIMATE USER 1                              
         DS    C                                                                
NTTCNEU2 DS    CL20                ESTIMATE USER 2                              
         DS    C                                                                
NTTCNINT DS    CL8                 CLIENT INTERFACE                             
         DS    C                                                                
NTTCNEQU DS    CL1                 EQUIVILIZATION                               
         DS    C                                                                
NTTCNOF2 DS    CL2                 2 CHARACTER OFFICE CODE                      
         DS    C                                                                
NTTCNRAT DS    CL1                 CLIENT RATE CONTROL                          
         DS    C                                                                
NTTCNAOF DS    CL2                 ACC OFFICE CODE                              
         DS    C                                                                
NTTCNAAO DS    CL2                 ACC AGENCY OVERRIDE                          
         DS    C                                                                
NTTCNBAG DS    CL3                 BUYING AGENCY                                
*                                                                               
NTTCNDX  DS    CL2                 RECORD END                                   
NTTCNDL  EQU   *-NTTCND            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM EXTRACT - CLIENT PRODUCT LIST                                      
***********************************************************************         
NTTPLD   DSECT                     PRODUCT RECORD                               
NTTPLLEN DS    CL4                 RECORD LENGTH                                
NTTPLTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTPLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTPLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTPLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTPLAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTPLMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTPLCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTPLPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTPLNUM DS    CL3                 PRODUCT NUMBER                               
*                                                                               
NTTPLDX  DS    CL2                 RECORD END                                   
NTTPLDL  EQU   *-NTTPLD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM EXTRACT - PRODUCT                                                  
***********************************************************************         
NTTPDD   DSECT                     PRODUCT RECORD                               
NTTPDLEN DS    CL4                 RECORD LENGTH                                
NTTPDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTPDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTPDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTPDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTPDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTPDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTPDCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTPDPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTPDNME DS    CL20                NAME                                         
         DS    C                                                                
NTTPDBBG DS    CL1                 IS BILL BASE GROSS                           
         DS    C                                                                
NTTPDCBG DS    CL1                 IS COMM BASE GROSS                           
         DS    C                                                                
NTTPDUV1 DS    CL32                USER1 VALUE                                  
         DS    C                                                                
NTTPDUV2 DS    CL16                USER2 VALUE                                  
         DS    C                                                                
NTTPDTAX DS    CL1                 TAXCODE                                      
         DS    C                                                                
NTTPDINT DS    CL4                 PRODUCT INTERFACE                            
         DS    C                                                                
NTTPDCP  DS    CL8                 COMM PCT                                     
         DS    C                                                                
NTTPDBTN DS    CL30                BILL TO NAME                                 
         DS    C                                                                
NTTPDAD1 DS    CL30                ADDRESS LINE 1                               
         DS    C                                                                
NTTPDAD2 DS    CL30                ADDRESS LINE 2                               
         DS    C                                                                
NTTPDAD3 DS    CL30                ADDRESS LINE 3                               
*                                                                               
NTTPDDX  DS    CL2                 RECORD END                                   
NTTPDDL  EQU   *-NTTPDD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM EXTRACT - ESTIMATE RECORD                                          
***********************************************************************         
*                                                                               
NTTESD   DSECT                     ESTIMATE RECORD                              
NTTESLEN DS    CL4                 RECORD LENGTH                                
NTTESTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTESACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTESDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTESTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTESAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTESMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTESCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTESPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTESEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
NTTESNAM DS    CL20                NAME                                         
         DS    C                                                                
NTTESSRT DS    CL8                 START DATE                                   
         DS    C                                                                
NTTESEND DS    CL8                 END DATE                                     
         DS    C                                                                
NTTESBBG DS    CL1                 IS BILL BASE GROSS?                          
         DS    C                                                                
NTTESCBG DS    CL1                 IS COMM BASE GROSS?                          
         DS    C                                                                
NTTESUV1 DS    CL32                USER1 VALUE                                  
         DS    C                                                                
NTTESUV2 DS    CL16                USER2 VALUE                                  
         DS    C                                                                
NTTESSTW DS    CL1                 IS STEWARDSHIP ESTIMATE?                     
         DS    C                                                                
NTTESFLT DS    CL3                 FILTERS                                      
         DS    C                                                                
NTTESCP  DS    CL8                 COMM PCT                                     
*                                                                               
NTTESDX  DS    CL2                 RECORD END                                   
NTTESDL  EQU   *-NTTESD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM STATION RECORD                                                     
***********************************************************************         
NTTSTD   DSECT                     STATION RECORD                               
NTTSTLEN DS    CL4                 RECORD LENGTH                                
NTTSTTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTSTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTSTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTSTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTSTAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTSTMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTSTSTA DS    CL5                 STATION                                      
         DS    C                                                                
NTTSTNAM DS    CL24                STATION NAME                                 
         DS    C                                                                
NTTSTNMD DS    CL1                 NETWORK MEDIA                                
         DS    C                                                                
NTTSTPTY DS    CL1                 POSTING TYPE                                 
         DS    C                                                                
NTTSTNTI DS    CL5                 NTI STATION                                  
         DS    C                                                                
NTTSTTTP DS    CL1                 TRAFFIC TYPE                                 
         DS    C                                                                
NTTSTMKT DS    CL4                 MARKET                                       
*                                                                               
NTTSTDX  DS    CL2                 RECORD END                                   
NTTSTDL  EQU   *-NTTSTD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM PROGRAM RECORD                                                     
***********************************************************************         
NTTPRD   DSECT                     PROGRAM RECORD                               
NTTPRLEN DS    CL4                 RECORD LENGTH                                
NTTPRTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTPRACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTPRDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTPRTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTPRAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTPRMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTPRSTA DS    CL5                 STATION                                      
         DS    C                                                                
NTTPRPGM DS    CL6                 PROGRAM                                      
         DS    C                                                                
NTTPREND DS    CL8                 END DATE                                     
         DS    C                                                                
NTTPRNAM DS    CL16                NAME                                         
         DS    C                                                                
NTTPRSTD DS    CL8                 START DATE                                   
         DS    C                                                                
NTTPRSTT DS    CL8                 START TIME                                   
         DS    C                                                                
NTTPRENT DS    CL8                 END TIME                                     
         DS    C                                                                
NTTPRMIR DS    CL1                 MIRROR CODE                                  
         DS    C                                                                
NTTPRPTY DS    CL2                 PROGRAM TYPE                                 
         DS    C                                                                
NTTPRSPT DS    CL4                 SUB PROGRAM TYPE                             
         DS    C                                                                
NTTPRNEW DS    CL1                 NEW (Y/N)                                    
         DS    C                                                                
NTTPRRET DS    CL1                 RETURNING (Y/N)                              
         DS    C                                                                
NTTPRRAT DS    CL2                 PROGRAM RATING (CONTENT TYPE)                
         DS    C                                                                
NTTPRTIE DS    CL1                 TIER                                         
         DS    C                                                                
NTTPRDPT DS    CL2                 DAYPART                                      
         DS    C                                                                
NTTPRDAY DS    CL7                 DAY                                          
         DS    C                                                                
NTTPRCDT DS    CL8                 LAST CHANGE DATE                             
*                                                                               
NTTPRDX  DS    CL2                 RECORD END                                   
NTTPRDL  EQU   *-NTTPRD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM DAYPART RECORD                                                     
***********************************************************************         
NTTDPD   DSECT                     DAYPART RECORD                               
NTTDPLEN DS    CL4                 RECORD LENGTH                                
NTTDPTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTDPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTDPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTDPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTDPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTDPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTDPCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTDPDPT DS    CL2                 2 CHAR DAYPART CODE                          
         DS    C                                                                
NTTDPNAM DS    CL14                DAYPART NAME                                 
*                                                                               
NTTDPTX  DS    CL2                 RECORD END                                   
NTTDPTL  EQU   *-NTTDPD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM ESTIMATE DEMO LIST                                                 
***********************************************************************         
NTTEDD   DSECT                     DAYPART RECORD                               
NTTEDLEN DS    CL4                 RECORD LENGTH                                
NTTEDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTEDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTEDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTEDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTEDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTEDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTEDCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTEDPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTEDEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
NTTEDNAD DS    CL3                 NAD CATEGORY                                 
         DS    C                                                                
NTTEDMOD DS    CL1                 MODIFIER                                     
         DS    C                                                                
NTTEDASC DS    CL3                 AGE/SEX CATEGORY                             
         DS    C                                                                
NTTEDPOS DS    CL3                 POSITION IN DEMLST                           
*                                                                               
NTTEDDX  DS    CL2                 RECORD END                                   
NTTEDDL  EQU   *-NTTEDD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM PACKAGE RECORD                                                     
***********************************************************************         
NTTPKD   DSECT                     PACKAGE RECORD                               
NTTPKLEN DS    CL4                 RECORD LENGTH                                
NTTPKTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTPKACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTPKDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTPKTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTPKAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTPKMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTPKCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTPKSTA DS    CL5                 NETWORK                                      
         DS    C                                                                
NTTPKEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
NTTPKPAK DS    CL3                 PACKAGE                                      
         DS    C                                                                
NTTPKNAM DS    CL16                NAME                                         
         DS    C                                                                
NTTPKNA2 DS    CL16                NAME 2                                       
         DS    C                                                                
NTTPKDPT DS    CL2                 DAYPART CODE                                 
         DS    C                                                                
NTTPKCST DS    CL10                COST DEC (10,0)                              
         DS    C                                                                
NTTPKCUP DS    CL1                 Y/N CABLE UPLOAD                             
         DS    C                                                                
NTTPKCPM DS    CL11                COST PER THOUSAND DEC (10,2)                 
         DS    C                                                                
NTTPKFL1 DS    CL1                 FILTER 1                                     
         DS    C                                                                
NTTPKFL2 DS    CL1                 FILTER 2                                     
         DS    C                                                                
NTTPKFL3 DS    CL1                 FILTER 3                                     
         DS    C                                                                
NTTPKFL4 DS    CL1                 FILTER 4                                     
         DS    C                                                                
NTTPKFL5 DS    CL1                 FILTER 5                                     
         DS    C                                                                
NTTPKFL6 DS    CL1                 FILTER 6                                     
         DS    C                                                                
NTTPKAGR DS    CL4                 AUDIT GROUP                                  
         DS    C                                                                
NTTPKANM DS    CL16                AUDIT NAME                                   
         DS    C                                                                
NTTPKFRZ DS    CL1                 IS PACKAGE FROZEN? (Y/N)                     
         DS    C                                                                
NTTPKLCK DS    CL1                 IS PACKAGE LOCKED? (Y/N)                     
         DS    C                                                                
NTTPKBTY DS    CL1                 PACKAGE BUY TYPE (U,S,O)                     
         DS    C                                                                
NTTPKCAT DS    CL3                 GUARANTEED DEMO CAGEGORY                     
         DS    C                                                                
NTTPKMOD DS    CL1                 GUARANTEED DEMO MODIFIER                     
         DS    C                                                                
NTTPKASX DS    CL3                 GUARANTEED DEMO AGE SEX CATEGORY             
*                                                                               
NTTPKDX  DS    CL2                 RECORD END                                   
NTTPKDL  EQU   *-NTTPKD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM UNIT RECORD                                                        
***********************************************************************         
NTTUND   DSECT                     UNIT RECORD                                  
NTTUNLEN DS    CL4                 RECORD LENGTH                                
NTTUNTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTUNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTUNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTUNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTUNAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTUNUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTUNMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTUNCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTUNAIR DS    CL8                 AIR DATE                                     
         DS    C                                                                
NTTUNQTR DS    CL3                 START QUARTE HOUR                            
         DS    C                                                                
NTTUNSTA DS    CL5                 NETWORK                                      
         DS    C                                                                
NTTUNPGM DS    CL6                 PROGRAM                                      
         DS    C                                                                
NTTUNEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
NTTUNPAK DS    CL3                 PACKAGE                                      
         DS    C                                                                
NTTUNSUB DS    CL3                 SUB-LINE                                     
         DS    C                                                                
NTTUNDPT DS    CL2                 DAYPART 2 BYTE CODE                          
         DS    C                                                                
NTTUNSDP DS    CL2                 SUB DAYPART                                  
         DS    C                                                                
NTTUNADP DS    CL2                 ALL DAYPART                                  
         DS    C                                                                
NTTUNIMU DS    CL1                 IS MINUS UNIT Y/N                            
         DS    C                                                                
NTTUNIPU DS    CL1                 IS PREEMTED UNIT Y/N                         
         DS    C                                                                
NTTUNIMS DS    CL1                 IS MISSED UNIT Y/N                           
         DS    C                                                                
NTTUNIMG DS    CL1                 IS MAKE GOOD Y/N                             
         DS    C                                                                
NTTUNPFB DS    CL1                 BUY AFTER PACKAGE FREEZE Y/N                 
         DS    C                                                                
NTTUNIBB DS    CL1                 IS BILLBOARD Y/N                             
         DS    C                                                                
NTTUNADU DS    CL1                 ADU UNIT Y/N                                 
         DS    C                                                                
NTTUNPGN DS    CL16                PROGRAM NAME                                 
         DS    C                                                                
NTTUNSEC DS    CL3                 SECONDS                                      
         DS    C                                                                
NTTUNDAY DS    CL3                 DAY                                          
         DS    C                                                                
NTTUNSTT DS    CL8                 START TIME                                   
         DS    C                                                                
NTTUNENT DS    CL8                 END TIME                                     
         DS    C                                                                
NTTUNADT DS    CL8                 AFFIDAVIT DATE                               
         DS    C                                                                
NTTUNATM DS    CL8                 AFFIDAVIT TIME                               
         DS    C                                                                
NTTUNNTI DS    CL5                 NTI CODE                                     
         DS    C                                                                
NTTUNNSI DS    CL5                 NSI CODE                                     
         DS    C                                                                
NTTUNTSC DS    CL13                TOTAL SPECIAL CHARGES                        
         DS    C                                                                
NTTUNNTR DS    CL1                 NTI RESULT CODE                              
         DS    C                                                                
NTTUNCPY DS    CL1                 COPY SPLIT Y/N                               
         DS    C                                                                
NTTUNPIG DS    CL1                 PIGGY BACK Y/N                               
         DS    C                                                                
NTTUNTRI DS    CL1                 TRIGGY BACK Y/N                              
         DS    C                                                                
NTTUNMIR DS    CL1                 MIRROR CODE                                  
         DS    C                                                                
NTTUNROT DS    CL12                ROTATION                                     
         DS    C                                                                
NTTUNCON DS    CL10                CONTRACT #                                   
         DS    C                                                                
NTTUNDEA DS    CL10                DEAL #                                       
         DS    C                                                                
NTTUNSER DS    CL12                SERIAL #                                     
         DS    C                                                                
NTTUNNPA DS    CL1                 NO PAY (Y/N)                                 
         DS    C                                                                
NTTUNNIM DS    CL1                 NO IMP (Y/N)                                 
         DS    C                                                                
NTTUNPAI DS    CL1                 PAID?                                        
         DS    C                                                                
NTTUNBIL DS    CL1                 BILLED?                                      
         DS    C                                                                
NTTUNBRD DS    CL8                 BROADCAST AIR DATE                           
         DS    C                                                                
NTTUNFLT DS    CL10                FLIGHT ID                                    
         DS    C                                                                
NTTUNRTE DS    CL1                 RATE TYPE                                    
         DS    C                                                                
NTTUNPOD DS    CL3                 POD POSITION                                 
         DS    C                                                                
NTTUNBDT DS    CL8                 UNIT BUY DATE                                
         DS    C                                                                
NTTUNVTY DS    CL3                 V TYPE                                       
         DS    C                                                                
NTTUREP  DS    CL3                 SPECIAL REP                                  
         DS    C                                                                
NTTUCHDT DS    CL8                 LAST CHANGE DATE                             
         DS    C                                                                
NTTUPID  DS    CL8                 LAST CHANGE PID                              
         DS    C                                                                
NTTUBTY  DS    CL1                 BUY TYPE                                     
         DS    C                                                                
NTTUIAT  DS    CL1                 IS AFFID TIME?                               
*                                                                               
NTTUNDX  DS    CL2                 RECORD END                                   
NTTUNDL  EQU   *-NTTUND            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM UNITPAID SUMMARY                                                   
***********************************************************************         
NTTUPD   DSECT                     UNIT RECORD                                  
NTTUPLEN DS    CL4                 RECORD LENGTH                                
NTTUPTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTUPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTUPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTUPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTUPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTUPUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTUPPTG DS    CL13                PAID TIME GROSS                              
         DS    C                                                                
NTTUPPTN DS    CL13                PAID TIME NET                                
         DS    C                                                                
NTTUPPIG DS    CL13                PAID INT GROSS                               
         DS    C                                                                
NTTUPPIN DS    CL13                PAID INT NET                                 
         DS    C                                                                
NTTUPPSG DS    CL13                PAID SPECIAL GROSS                           
         DS    C                                                                
NTTUPPSN DS    CL13                PAID SPECIAL GROSS                           
*                                                                               
NTTUPDX  DS    CL2                 RECORD END                                   
NTTUPDL  EQU   *-NTTUPD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM SPECIAL CHARGES                                                    
***********************************************************************         
NTTUCD   DSECT                     UNIT RECORD                                  
NTTUCLEN DS    CL4                 RECORD LENGTH                                
NTTUCTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTUCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTUCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTUCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTUCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTUCUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTUCADG DS    CL13                ADMINISTRATION                               
         DS    C                                                                
NTTUCADN DS    CL13                                                             
         DS    C                                                                
NTTUCBOG DS    CL13                BLACKOUT                                     
         DS    C                                                                
NTTUCBON DS    CL13                                                             
         DS    C                                                                
NTTUCCSG DS    CL13                COPY SPLIT                                   
         DS    C                                                                
NTTUCCSN DS    CL13                                                             
         DS    C                                                                
NTTUCCIG DS    CL13                CUT IN                                       
         DS    C                                                                
NTTUCCIN DS    CL13                                                             
         DS    C                                                                
NTTUCDAG DS    CL13                DELIVERY ADJUSTMENT                          
         DS    C                                                                
NTTUCDAN DS    CL13                                                             
         DS    C                                                                
NTTUCECG DS    CL13                EARNED COST                                  
         DS    C                                                                
NTTUCECN DS    CL13                                                             
         DS    C                                                                
NTTUCLCG DS    CL13                LATE CHARGE                                  
         DS    C                                                                
NTTUCLCN DS    CL13                                                             
         DS    C                                                                
NTTUCOTG DS    CL13                OTHER                                        
         DS    C                                                                
NTTUCOTN DS    CL13                                                             
         DS    C                                                                
NTTUCSEG DS    CL13                SECTIONAL                                    
         DS    C                                                                
NTTUCSEN DS    CL13                                                             
         DS    C                                                                
NTTUCTXG DS    CL13                TAX                                          
         DS    C                                                                
NTTUCTXN DS    CL13                                                             
*                                                                               
NTTUCDX  DS    CL2                 RECORD END                                   
NTTUCDL  EQU   *-NTTUCD            RECORD LENGTH                                
*                                                                               
NTTUCADL EQU   0                                                                
NTTUCBOL EQU   8                                                                
NTTUCCSL EQU   16                                                               
NTTUCCIL EQU   24                                                               
NTTUCDAL EQU   32                                                               
NTTUCECL EQU   40                                                               
NTTUCLCL EQU   48                                                               
NTTUCOTL EQU   56                                                               
NTTUCSEL EQU   64                                                               
NTTUCTXL EQU   72                                                               
*                                                                               
***********************************************************************         
* NET SYSTEM UNIT SUMMARY                                                       
***********************************************************************         
NTTUSD   DSECT                     UNIT RECORD                                  
NTTUSLEN DS    CL4                 RECORD LENGTH                                
NTTUSTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTUSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTUSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTUSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTUSAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTUSUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTUSPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTUSPOS DS    CL3                 POSITION OF PRODUCT                          
         DS    C                                                                
NTTUSSCC DS    CL12                SCHEDULED COMMERCIAL CODE                    
         DS    C                                                                
NTTUSACC DS    CL12                ACTUAL COMMERCIAL CODE                       
         DS    C                                                                
NTTUSANM DS    CL24                ACTUAL COMMERCIAL NAME                       
         DS    C                                                                
NTTUSSEC DS    CL3                 SECONDS                                      
         DS    C                                                                
NTTUSPCT DS    CL6                 PRODUCT PERCENTAGE                           
         DS    C                                                                
NTTUSASS DS    CL13                ASSIGNED COST                                
         DS    C                                                                
NTTUSACS DS    CL13                ACTUAL COST                                  
         DS    C                                                                
NTTUSINT DS    CL13                INTEGRATION                                  
         DS    C                                                                
NTTUSMAX DS    CL13                MAX COST                                     
         DS    C                                                                
NTTUSEAR DS    CL13                EARNED COST                                  
         DS    C                                                                
NTTUSAIC DS    CL13                MAXCOST - ACTUALCOST                         
         DS    C                                                                
NTTUSSNM DS    CL24                SCHED COMMERCIAL NAME                        
         DS    C                                                                
NTTUSAN2 DS    CL24                ACTUAL COMMERCIAL NAME LINE 2                
         DS    C                                                                
NTTUSAN3 DS    CL24                ACTUAL COMMERCIAL NAME LINE 3                
         DS    C                                                                
NTTUSSN2 DS    CL24                SCHED COMMERCIAL NAME  LINE 2                
         DS    C                                                                
NTTUSSN3 DS    CL24                SCHED COMMERCIAL NAME  LINE 3                
         DS    C                                                                
NTTUSCO1 DS    CL60                BUY COMMENT LINE 1                           
         DS    C                                                                
NTTUSCO2 DS    CL60                BUY COMMENT LINE 2                           
         DS    C                                                                
NTTUSBLG DS    CL13                BILL DOLLAR GROSS                            
         DS    C                                                                
NTTUSBLN DS    CL13                BILL DOLLAR NET                              
         DS    C                                                                
NTTUSNET DS    CL13                ESTIMATED NET COST                           
         DS    C                                                                
NTTUSFLT DS    CL10                BILLED FLIGHT ID                             
*                                                                               
NTTUSDX  DS    CL2                 RECORD END                                   
NTTUSDL  EQU   *-NTTUSD            RECORD LENGTH                                
***********************************************************************         
* NET SYSTEM UNIT PRODUCT ALLOCATION                                            
***********************************************************************         
NTTUPDD  DSECT                     UNIT RECORD                                  
NTTUPDLE DS    CL4                 RECORD LENGTH                                
NTTUPDTY DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTUPDAC DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTUPDDT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTUPDTM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTUPDAG DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTUPDID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTUPDPR DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTUPPOS DS    CL3                 POSITION OF PRODUCT                          
         DS    C                                                                
NTTUPDAL DS    CL6                 ALLOCATION                                   
         DS    C                                                                
NTTUPFED DS    CL6                 FEED PERCENTAGE                              
         DS    C                                                                
NTTUPISR DS    CL1                 IS FEED APPLIED TO RATING (Y/N)              
*                                                                               
NTTUPDDX DS    CL2                 RECORD END                                   
NTTUPDDL EQU   *-NTTUPDD           RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET UNIT ESTIMATE DEMO LIST                                                   
***********************************************************************         
NTTUEDD  DSECT                     DAYPART RECORD                               
NTTUELEN DS    CL4                 RECORD LENGTH                                
NTTUETYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTUEACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTUEDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTUETME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTUEAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTUEUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTUENAD DS    CL3                 NAD CATEGORY                                 
         DS    C                                                                
NTTUEMOD DS    CL1                 MODIFIER                                     
         DS    C                                                                
NTTUEASC DS    CL3                 AGE/SEX CATEGORY                             
         DS    C                                                                
NTTUERRA DS    CL11                RATING RAW VALUE                             
         DS    C                                                                
NTTUEREQ DS    CL11                RATING EQUIVALENT VALUE                      
         DS    C                                                                
NTTUEIRA DS    CL11                IMPRESSION RAW VALUE                         
         DS    C                                                                
NTTUEIEQ DS    CL11                IMPRESSION EQUIVALENT VALUE                  
*                                                                               
NTTUEDX  DS    CL2                 RECORD END                                   
NTTUEDL  EQU   *-NTTUEDD           RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET UNIT BARTER CREDITS                                                       
***********************************************************************         
NTTUBD   DSECT                     UNIT RECORD                                  
NTTUBLEN DS    CL4                 RECORD LENGTH                                
NTTUBTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTUBACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTUBDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTUBTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTUBAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTUBUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTUBACP DS    CL3                 BARTER ACTUAL CREDIT PRODUCT                 
         DS    C                                                                
NTTUBACC DS    CL13                BARTER ACTUAL CREDIT                         
         DS    C                                                                
NTTUBASP DS    CL3                 BARTER ASSIGNED CREDIT PRODUCT               
         DS    C                                                                
NTTUBASC DS    CL13                BARTER ASSIGNED CREDIT                       
*                                                                               
NTTUBDX  DS    CL2                 RECORD END                                   
NTTUBDL  EQU   *-NTTUBD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET UNIT ACTUAL DEMOS                                                         
***********************************************************************         
NTTADD   DSECT                     DAYPART RECORD                               
NTTADLEN DS    CL4                 RECORD LENGTH                                
NTTADTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTADACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTADDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTADTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTADAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTADUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTADNAD DS    CL3                 NAD CATEGORY                                 
         DS    C                                                                
NTTADMOD DS    CL1                 MODIFIER                                     
         DS    C                                                                
NTTADASC DS    CL3                 AGE/SEX CATEGORY                             
         DS    C                                                                
NTTADRRA DS    CL11                RATING RAW VALUE                             
         DS    C                                                                
NTTADREQ DS    CL11                RATING EQUIVALENT VALUE                      
         DS    C                                                                
NTTADIRA DS    CL11                IMPRESSION RAW VALUE                         
         DS    C                                                                
NTTADIEQ DS    CL11                IMPRESSION EQUIVALENT VALUE                  
*                                                                               
NTTADDX  DS    CL2                 RECORD END                                   
NTTADDL  EQU   *-NTTADD           RECORD LENGTH                                 
*                                                                               
***********************************************************************         
* NET NTI TABLE                                                                 
***********************************************************************         
NTTUTD   DSECT                                                                  
NTTUTLEN DS    CL4                 RECORD LENGTH                                
NTTUTTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTUTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTUTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTUTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTUTAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTUTUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTUTCOD DS    CL5                 NTI CODE                                     
         DS    C                                                                
NTTUTRES DS    CL2                 NTI RESULT CODE                              
         DS    C                                                                
NTTUTRFR DS    CL1                 NTI RESULT CODE SOURCE (A=ACTUAL)            
*                                                         (P=PROFILE)           
NTTUTDX  DS    CL2                 RECORD END                                   
NTTUTDL  EQU   *-NTTUTD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET GOAL HEADER RECORDS                                                       
***********************************************************************         
NTTGHDD  DSECT                     DAYPART RECORD                               
NTTGHLEN DS    CL4                 RECORD LENGTH                                
NTTGHTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTGHACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTGHDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTGHTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTGHAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTGHUID DS    CL13                GOAL ID                                      
         DS    C                                                                
NTTGHMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTGHCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTGHPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTGHNET DS    CL5                 NETWORK                                      
         DS    C                                                                
NTTGHEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
NTTGHDPT DS    CL2                 DAYPART                                      
         DS    C                                                                
NTTGHSEC DS    CL3                 SECONDS                                      
         DS    C                                                                
NTTGHPLN DS    CL1                 PLANNED GOAL? (Y/N)                          
*                                                                               
NTTGHDX  DS    CL2                 RECORD END                                   
NTTGHDL  EQU   *-NTTGHDD           RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET GOAL WEEKLY RECORDS                                                       
***********************************************************************         
NTTGDDD  DSECT                     DAYPART RECORD                               
NTTGDLEN DS    CL4                 RECORD LENGTH                                
NTTGDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTGDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTGDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTGDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTGDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTGDUID DS    CL13                GOAL ID                                      
         DS    C                                                                
NTTGDWK  DS    CL8                 WEEK START                                   
         DS    C                                                                
NTTGDBM  DS    CL8                 BROADCAST MONTH                              
         DS    C                                                                
NTTGDDOL DS    CL10                DOLLARS                                      
         DS    C                                                                
NTTGDRP1 DS    CL11                RATING POINT 1                               
         DS    C                                                                
NTTGDRP2 DS    CL11                RATING POINT 2                               
         DS    C                                                                
NTTGDRP3 DS    CL11                RATING POINT 3                               
*                                                                               
NTTGDDX  DS    CL2                 RECORD END                                   
NTTGDDL  EQU   *-NTTGDDD           RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET PRODUCT GROUP HEADER INFORMATION                                          
***********************************************************************         
NTTPHD   DSECT                     DAYPART RECORD                               
NTTPHLEN DS    CL4                 RECORD LENGTH                                
NTTPHTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTPHACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTPHDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTPHTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTPHAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTPHMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTPHCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTPHID  DS    CL4                 PRODUCT GROUP ID                             
         DS    C                                                                
NTTPHBK1 DS    CL12                BREAK 1                                      
         DS    C                                                                
NTTPHNM1 DS    CL24                NAME 1                                       
         DS    C                                                                
NTTPHBK2 DS    CL12                BREAK 2                                      
         DS    C                                                                
NTTPHNM2 DS    CL24                NAME 2                                       
         DS    C                                                                
NTTPHBK3 DS    CL12                BREAK 3                                      
         DS    C                                                                
NTTPHNM3 DS    CL24                NAME 3                                       
         DS    C                                                                
NTTPHAD1 DS    CL30                ADDRESS LINE 1                               
         DS    C                                                                
NTTPHAD2 DS    CL30                ADDRESS LINE 2                               
         DS    C                                                                
NTTPHAD3 DS    CL30                ADDRESS LINE 3                               
         DS    C                                                                
NTTPHAD4 DS    CL30                ADDRESS LINE 4                               
         DS    C                                                                
NTTPHMPR DS    CL3                 MASTER PRODUCT                               
*                                                                               
NTTPHDX  DS    CL2                 RECORD END                                   
NTTPHDL  EQU   *-NTTPHD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET PRODUCT GROUP PRODUCTS                                                    
***********************************************************************         
NTTPGD   DSECT                     DAYPART RECORD                               
NTTPGLEN DS    CL4                 RECORD LENGTH                                
NTTPGTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTPGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTPGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTPGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTPGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTPGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTPGCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTPGID  DS    CL4                 PRODUCT GROUP ID                             
         DS    C                                                                
NTTPGPRD DS    CL3                 PRODUCT                                      
*                                                                               
NTTPGDX  DS    CL2                 RECORD END                                   
NTTPGDL  EQU   *-NTTPGD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM EARNED COST                                                        
***********************************************************************         
NTTECD   DSECT                     UNIT RECORD                                  
NTTECLEN DS    CL4                 RECORD LENGTH                                
NTTECTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTECACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTECDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTECTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTECAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTECUID DS    CL18                UNIT ID                                      
         DS    C                                                                
NTTECPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTECPOS DS    CL3                 POSITION OF PRODUCT                          
         DS    C                                                                
NTTECASS DS    CL13                ASSIGNED COST                                
*                                                                               
NTTECDX  DS    CL2                 RECORD END                                   
NTTECDL  EQU   *-NTTECD            RECORD LENGTH                                
***********************************************************************         
* NET SYSTEM STATION GROUP DEFINITION                                           
***********************************************************************         
NTSGDD   DSECT                     UNIT RECORD                                  
NTSGDLEN DS    CL4                 RECORD LENGTH                                
NTSGDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTSGDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTSGDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTSGDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTSGDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTSGDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTSGDID  DS    CL2                 ID                                           
         DS    C                                                                
NTSGDD1  DS    CL12                BREAK 1 DEFINITION                           
         DS    C                                                                
NTSGDLN1 DS    CL3                 BREAK 1 LENGTH                               
         DS    C                                                                
NTSGDD2  DS    CL12                BREAK 2 DEFINITION                           
         DS    C                                                                
NTSGDLN2 DS    CL3                 BREAK 2 LENGTH                               
*                                                                               
NTSGDDX  DS    CL2                 RECORD END                                   
NTSGDDL  EQU   *-NTSGDD            RECORD LENGTH                                
***********************************************************************         
* NET SYSTEM STATION GROUP                                                      
***********************************************************************         
NTSGGD   DSECT                     UNIT RECORD                                  
NTSGGLEN DS    CL4                 RECORD LENGTH                                
NTSGGTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTSGGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTSGGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTSGGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTSGGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTSGGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTSGGID  DS    CL2                 ID                                           
         DS    C                                                                
NTSGGGRP DS    CL4                 GROUP                                        
         DS    C                                                                
NTSGGSGR DS    CL6                 STATION GROUP                                
         DS    C                                                                
NTSGGC1  DS    CL4                 BREAK 1 CODE                                 
         DS    C                                                                
NTSGGC2  DS    CL4                 BREAK 2 CODE                                 
         DS    C                                                                
NTSGGN1  DS    CL24                BREAK 1 NAME                                 
         DS    C                                                                
NTSGGN2  DS    CL24                BREAK 2 NAME                                 
*                                                                               
NTSGGDX  DS    CL2                 RECORD END                                   
NTSGGDL  EQU   *-NTSGGD            RECORD LENGTH                                
***********************************************************************         
* NET SYSTEM STATION GROUP STATIONS                                             
***********************************************************************         
NTSGSD   DSECT                     UNIT RECORD                                  
NTSGSLEN DS    CL4                 RECORD LENGTH                                
NTSGSTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTSGSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTSGSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTSGSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTSGSAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTSGSMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTSGSGRP DS    CL6                 ID                                           
         DS    C                                                                
NTSGSSTA DS    CL5                 STATION                                      
*                                                                               
NTSGSDX  DS    CL2                 RECORD END                                   
NTSGSDL  EQU   *-NTSGSD            RECORD LENGTH                                
***********************************************************************         
* NET SYSTEM CLIENT GROUP DEFINITION                                            
***********************************************************************         
NTCGDD   DSECT                     UNIT RECORD                                  
NTCGDLEN DS    CL4                 RECORD LENGTH                                
NTCGDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTCGDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTCGDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTCGDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTCGDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTCGDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTCGDID  DS    CL2                 ID                                           
         DS    C                                                                
NTCGDD1  DS    CL12                BREAK 1 DEFINITION                           
         DS    C                                                                
NTCGDLN1 DS    CL3                 BREAK 1 LENGTH                               
         DS    C                                                                
NTCGDD2  DS    CL12                BREAK 2 DEFINITION                           
         DS    C                                                                
NTCGDLN2 DS    CL3                 BREAK 2 LENGTH                               
         DS    C                                                                
NTCGDD3  DS    CL12                BREAK 3 DEFINITION                           
         DS    C                                                                
NTCGDLN3 DS    CL3                 BREAK 3 LENGTH                               
*                                                                               
NTCGDDX  DS    CL2                 RECORD END                                   
NTCGDDL  EQU   *-NTCGDD            RECORD LENGTH                                
***********************************************************************         
* NET SYSTEM CLIENT GROUP                                                       
***********************************************************************         
NTCGGD   DSECT                     UNIT RECORD                                  
NTCGGLEN DS    CL4                 RECORD LENGTH                                
NTCGGTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTCGGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTCGGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTCGGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTCGGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTCGGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTCGGID  DS    CL2                 ID                                           
         DS    C                                                                
NTCGGGRP DS    CL4                 GROUP                                        
         DS    C                                                                
NTCGGCGR DS    CL6                 STATION GROUP                                
         DS    C                                                                
NTCGGC1  DS    CL4                 BREAK 1 CODE                                 
         DS    C                                                                
NTCGGC2  DS    CL4                 BREAK 2 CODE                                 
         DS    C                                                                
NTCGGC3  DS    CL4                 BREAK 3 CODE                                 
         DS    C                                                                
NTCGGN1  DS    CL24                BREAK 1 NAME                                 
         DS    C                                                                
NTCGGN2  DS    CL24                BREAK 2 NAME                                 
         DS    C                                                                
NTCGGN3  DS    CL24                BREAK 3 NAME                                 
*                                                                               
NTCGGDX  DS    CL2                 RECORD END                                   
NTCGGDL  EQU   *-NTCGGD            RECORD LENGTH                                
***********************************************************************         
* NET SYSTEM CLIENT GROUP CLIENTS                                               
***********************************************************************         
NTCGCD   DSECT                     UNIT RECORD                                  
NTCGCLEN DS    CL4                 RECORD LENGTH                                
NTCGCTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTCGCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTCGCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTCGCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTCGCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTCGCMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTCGCGRP DS    CL6                 ID                                           
         DS    C                                                                
NTCGCCLT DS    CL3                 STATION                                      
*                                                                               
NTCGCDX  DS    CL2                 RECORD END                                   
NTCGCDL  EQU   *-NTCGCD            RECORD LENGTH                                
***********************************************************************         
* NEW GOAL HEADER RECORDS                                                       
***********************************************************************         
NTGXHDD  DSECT                     DAYPART RECORD                               
NTGXHLEN DS    CL4                 RECORD LENGTH                                
NTGXHTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTGXHACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTGXHDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTGXHTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTGXHAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTGXHUID DS    CL32                GOAL ID                                      
         DS    C                                                                
NTGXHMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTGXHCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTGXHPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTGXHNET DS    CL5                 NETWORK                                      
         DS    C                                                                
NTGXHEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
NTGXHDPT DS    CL2                 DAYPART                                      
         DS    C                                                                
NTGXHSEC DS    CL3                 SECONDS                                      
         DS    C                                                                
NTGXHPLN DS    CL1                 PLANNED GOAL? (Y/N)                          
*                                                                               
NTGXHDX  DS    CL2                 RECORD END                                   
NTGXHDL  EQU   *-NTGXHDD           RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET GOAL WEEKLY RECORDS                                                       
***********************************************************************         
NTGXDDD  DSECT                     DAYPART RECORD                               
NTGXDLEN DS    CL4                 RECORD LENGTH                                
NTGXDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTGXDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTGXDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTGXDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTGXDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTGXDUID DS    CL32                GOAL ID                                      
         DS    C                                                                
NTGXDWK  DS    CL8                 WEEK START                                   
         DS    C                                                                
NTGXDBM  DS    CL8                 BROADCAST MONTH                              
         DS    C                                                                
NTGXDDOL DS    CL10                DOLLARS                                      
         DS    C                                                                
NTGXDRP1 DS    CL11                RATING POINT 1                               
         DS    C                                                                
NTGXDRP2 DS    CL11                RATING POINT 2                               
         DS    C                                                                
NTGXDRP3 DS    CL11                RATING POINT 3                               
*                                                                               
NTGXDDX  DS    CL2                 RECORD END                                   
NTGXDDL  EQU   *-NTGXDDD           RECORD LENGTH                                
*                                                                               
***********************************************************************         
* REP TABLE EXTRACT                                                             
***********************************************************************         
NTREPD   DSECT                     MEDIA RECORD                                 
NTREPLEN DS    CL4                 RECORD LENGTH                                
NTREPTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTREPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTREPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTREPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTREPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTREPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTREPCOD DS    CL3                 REP CODE                                     
         DS    C                                                                
NTREPNAM DS    CL22                REP NAME                                     
         DS    C                                                                
NTREPADD DS    CL24                STREET                                       
         DS    C                                                                
NTREPCIT DS    CL24                CITY                                         
         DS    C                                                                
NTREPSTA DS    CL3                 STATE                                        
         DS    C                                                                
NTREPZIP DS    CL10                ZIP                                          
         DS    C                                                                
NTREPCON DS    CL1                 COUNTRY                                      
         DS    C                                                                
NTREPUNW DS    CL1                 UNWIRED NETWORK                              
*                                                                               
NTREPDX  DS    CL2                 RECORD END                                   
NTREPDL  EQU   *-NTREPD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* FLIGHT RECORDS                                                                
***********************************************************************         
NTFLTD   DSECT                     FLIGHT RECORD                                
NTFLTLEN DS    CL4                 RECORD LENGTH                                
NTFLTTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTFLTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTFLTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTFLTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTFLTAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTFLTCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTFLTINT DS    CL6                 INTERNAL CODE                                
         DS    C                                                                
NTFLTID  DS    CL10                FLIGHT ID                                    
         DS    C                                                                
NTFLTTPE DS    CL1                 TYPE                                         
         DS    C                                                                
NTFLTDPT DS    CL2                 DAYPART                                      
         DS    C                                                                
NTFLTSTD DS    CL8                 START DATE                                   
         DS    C                                                                
NTFLTEND DS    CL8                 END DATE                                     
         DS    C                                                                
NTFLTPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTFLTSTA DS    CL8                 STATUS                                       
*                                                                               
NTFLTDX  DS    CL2                 RECORD END                                   
NTFLTDL  EQU   *-NTFLTD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* UCOM RECORDS                                                                  
***********************************************************************         
NTUCMD   DSECT                     FLIGHT RECORD                                
NTUCMLEN DS    CL4                 RECORD LENGTH                                
NTUCMTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTUCMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTUCMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTUCMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTUCMAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTUCMMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTUCMCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTUCMPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTUCMEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
NTUCMSQN DS    CL3                 SEQUENCE NUMBER                              
         DS    C                                                                
NTUCMFNM DS    CL20                FIELD NAME                                   
         DS    C                                                                
NTUCMFDT DS    CL32                FIELD DATA                                   
         DS    C                                                                
NTUCMMLN DS    CL2                 MAX FIELD LENGTH                             
         DS    C                                                                
NTUCMETP DS    CL1                 EDIT TYPE                                    
         DS    C                                                                
NTUCMMBI DS    CL1                 MEDIA BILLING INTERFACE                      
*                                                                               
NTUCMDX  DS    CL2                 RECORD END                                   
NTUCMDL  EQU   *-NTUCMD            RECORD LENGTH                                
NTUCFLDS EQU   *-NTUCMSQN          FIELDS TO CLEAR                              
*                                                                               
***********************************************************************         
* COMMERCIAL RECORD                                                             
***********************************************************************         
*                                                                               
NTCMD    DSECT                     COMMERCIAL RECORD                            
NTCMLEN  DS    CL4                 RECORD LENGTH                                
NTCMTYP  DS    CL5                 RECORD TYPE  '06535'                         
         DS    C                                                                
NTCMACT  DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTCMDAT  DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTCMTME  DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTCMAGY  DS    CL2                 AGENCY                                       
         DS    C                                                                
NTCMMED  DS    CL1                 MEDIA                                        
         DS    C                                                                
NTCMCNT  DS    CL3                 CLIENT                                       
         DS    C                                                                
NTCMCML  DS    CL12                COMMERCIAL                                   
         DS    C                                                                
NTCMTTL1 DS    CL24                TITLE 1                                      
         DS    C                                                                
NTCMTTL2 DS    CL24                TITLE 2                                      
         DS    C                                                                
NTCMTTL3 DS    CL24                TITLE 3                                      
         DS    C                                                                
NTCMHD   DS    CL12                HI-DEF COMMERCIAL                            
         DS    C                                                                
NTCMCCN  DS    CL20                CLIENT COMMERCIAL NUMBER                     
         DS    C                                                                
NTCMAC1  DS    CL12                ACT COMMERCIAL 1                             
         DS    C                                                                
NTCMAC2  DS    CL12                ACT COMMERCIAL 2                             
         DS    C                                                                
NTCMAC3  DS    CL12                ACT COMMERCIAL 3                             
         DS    C                                                                
NTCMAC4  DS    CL12                ACT COMMERCIAL 4                             
         DS    C                                                                
NTCMCLS  DS    CL4                 CLASS                                        
*                                                                               
NTCMDX   DS    CL2                 RECORD END                                   
NTCMDL   EQU   *-NTCMD             RECORD LENGTH                                
***********************************************************************         
* NET SYSTEM MARKET RECORD                                                      
***********************************************************************         
NTTMKD   DSECT                     MARKET RECORD                                
NTTMKLEN DS    CL4                 RECORD LENGTH                                
NTTMKTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTMKACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTMKDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTMKTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTMKAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTMKMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTMKMKT DS    CL4                 MARKET                                       
         DS    C                                                                
NTTMKNAM DS    CL24                MARKET NAME                                  
*                                                                               
NTTMKDX  DS    CL2                 RECORD END                                   
NTTMKDL  EQU   *-NTTMKD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM UNIVERSE RECORD                                                    
***********************************************************************         
NTUVD    DSECT                     UNIVERSE RECORD                              
NTUVLEN  DS    CL4                 RECORD LENGTH                                
NTUVTYP  DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTUVACT  DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTUVDATE DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTUVTIME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTUVAGY  DS    CL2                 AGENCY                                       
         DS    C                                                                
NTUVID   DS    CL3                 UNIVERSE ID                                  
         DS    C                                                                
NTUVCODE DS    CL4                 CODE                                         
         DS    C                                                                
NTUVEND  DS    CL8                 DATE                                         
         DS    C                                                                
NTUVCOM  DS    CL60                COMMENT                                      
*                                                                               
NTUVDX   DS    CL2                 RECORD END                                   
NTUVDL   EQU   *-NTUVD             RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM UNIVERSE DEMO RECORD                                               
***********************************************************************         
NTUDD    DSECT                     UNIVERSE DEMO RECORD                         
NTUDLEN  DS    CL4                 RECORD LENGTH                                
NTUDTYP  DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTUDACT  DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTUDDATE DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTUDTIME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTUDAGY  DS    CL2                 AGENCY                                       
         DS    C                                                                
NTUDID   DS    CL3                 UNIVERSE ID                                  
         DS    C                                                                
NTUDNAD  DS    CL3                 NAD CATEGORY                                 
         DS    C                                                                
NTUDMOD  DS    CL1                 MODIFIER                                     
         DS    C                                                                
NTUDASC  DS    CL3                 AGE/SEX CATEGORY                             
         DS    C                                                                
NTUDPOS  DS    CL3                 POSITION                                     
         DS    C                                                                
NTUDVALU DS    CL12                UNIVERSE VALUE                               
*                                                                               
NTUDDX   DS    CL2                 RECORD END                                   
NTUDDL   EQU   *-NTUDD             RECORD LENGTH                                
*                                                                               
***********************************************************************         
* NET SYSTEM UNIVERSE USER DEMO RECORD                                          
***********************************************************************         
NTUUD    DSECT                     UNIVERSE USER DEMO RECORD                    
NTUULEN  DS    CL4                 RECORD LENGTH                                
NTUUTYP  DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTUUACT  DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTUUDATE DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTUUTIME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTUUAGY  DS    CL2                 AGENCY                                       
         DS    C                                                                
NTUUID   DS    CL3                 UNIVERSE ID                                  
         DS    C                                                                
NTUUDEMO DS    CL7                 USER DEMO CATEGORY                           
         DS    C                                                                
NTUUPOS  DS    CL3                 POSITION                                     
         DS    C                                                                
NTUUVALU DS    CL12                UNIVERSE VALUE                               
*                                                                               
NTUUDX   DS    CL2                 RECORD END                                   
NTUUDL   EQU   *-NTUUD             RECORD LENGTH                                
*                                                                               
***********************************************************************         
* BFORM RECORD                                                                  
***********************************************************************         
NTTBFD   DSECT                     BFORM RECORD                                 
NTTBFLEN DS    CL4                 RECORD LENGTH                                
NTTBFTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTTBFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTTBFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTTBFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTTBFAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
NTTBFID  DS    CL10                BFORM ID                                     
         DS    C                                                                
NTTBFMOS DS    CL6                 MOS                                          
         DS    C                                                                
NTTBFMED DS    CL1                 MEDIA                                        
         DS    C                                                                
NTTBFCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
NTTBFPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTTBFEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
NTTBFSMD DS    CL1                 SUBMEDIA                                     
         DS    C                                                                
NTTBFBFM DS    CL30                BILL FORMULA                                 
*                                                                               
NTTBFDX  DS    CL2                 RECORD END                                   
NTTBFDL  EQU   *-NTTBFD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* PATTERN RECORD                                                                
***********************************************************************         
NTPTD    DSECT                     PATTERN RECORD                               
NTPTLEN  DS    CL4                 RECORD LENGTH                                
NTPTTYP  DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTPTACT  DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTPTDAT  DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTPTTIME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTPTAGY  DS    CL2                 AGENCY                                       
         DS    C                                                                
NTPTID   DS    CL29                PATTERN ID                                   
         DS    C                                                                
NTPTMED  DS    CL1                 MEDIA                                        
         DS    C                                                                
NTPTCLI  DS    CL3                 CLIENT                                       
         DS    C                                                                
NTPTSMED DS    CL1                 SUB-MEDIA                                    
         DS    C                                                                
NTPTNET  DS    CL4                 NETWORK                                      
         DS    C                                                                
NTPTPGM  DS    CL6                 PROGRAM                                      
         DS    C                                                                
NTPTDPT  DS    CL3                 DAYPART                                      
         DS    C                                                                
NTPTFEED DS    CL4                 FEED                                         
         DS    C                                                                
NTPTPRD  DS    CL3                 PRODUCT                                      
         DS    C                                                                
NTPTPRDL DS    CL3                 PRODUCT LENGTH                               
         DS    C                                                                
NTPTPTN  DS    CL3                 PARTNER                                      
         DS    C                                                                
NTPTPTNL DS    CL3                 PARTNER LENGTH                               
         DS    C                                                                
NTPTREF  DS    CL5                 REFERENCE                                    
         DS    C                                                                
NTPTISD  DS    CL1                 IS DELETED?                                  
         DS    C                                                                
NTPTDESC DS    CL25                DESCRIPTION                                  
         DS    C                                                                
NTPTSDAT DS    CL8                 START DATE                                   
         DS    C                                                                
NTPTEDAT DS    CL8                 END DATE                                     
         DS    C                                                                
NTPTSTIM DS    CL8                 START TIME                                   
         DS    C                                                                
NTPTETIM DS    CL8                 END TIME                                     
         DS    C                                                                
NTPTROT  DS    CL69                ROTATION                                     
         DS    C                                                                
NTPTDROT DS    CL69                DERIVED ROTATION                             
*                                                                               
NTPTDX   DS    CL2                 RECORD END                                   
NTPTDL   EQU   *-NTPTD             RECORD LENGTH                                
*                                                                               
***********************************************************************         
* PATTERN COMMERCIAL RECORD                                                     
***********************************************************************         
NTPCD    DSECT                     PATTERN COMMERCIAL RECORD                    
NTPCLEN  DS    CL4                 RECORD LENGTH                                
NTPCTYP  DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTPCACT  DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTPCDAT  DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTPCTIME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTPCAGY  DS    CL2                 AGENCY                                       
         DS    C                                                                
NTPCID   DS    CL29                PATTERN ID                                   
         DS    C                                                                
NTPCROT  DS    CL1                 ROTATION                                     
         DS    C                                                                
NTPCPRDC DS    CL12                PRODUCT COMMERCIAL                           
         DS    C                                                                
NTPCPTNC DS    CL12                PARTNER COMMERCIAL                           
         DS    C                                                                
NTPCPCT  DS    CL8                 PERCENTAGE                                   
         DS    C                                                                
NTPCISD  DS    CL1                 IS DELETED?                                  
*                                                                               
NTPCDX   DS    CL2                 RECORD END                                   
NTPCDL   EQU   *-NTPCD             RECORD LENGTH                                
*                                                                               
***********************************************************************         
* PATTERN COMMENT RECORD                                                        
***********************************************************************         
NTPMD    DSECT                     PATTERN COMMENT RECORD                       
NTPMLEN  DS    CL4                 RECORD LENGTH                                
NTPMTYP  DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTPMACT  DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTPMDAT  DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTPMTIME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTPMAGY  DS    CL2                 AGENCY                                       
         DS    C                                                                
NTPMID   DS    CL29                PATTERN ID                                   
         DS    C                                                                
NTPMLINE DS    CL3                 LINE NUMBER                                  
         DS    C                                                                
NTPMCOM  DS    CL52                COMMENT                                      
*                                                                               
NTPMDX   DS    CL2                 RECORD END                                   
NTPMDL   EQU   *-NTPMD             RECORD LENGTH                                
*                                                                               
***********************************************************************         
* PATTERN HIATUS RECORD                                                         
***********************************************************************         
NTPHD    DSECT                     PATTERN HIATUS RECORD                        
NTPHLEN  DS    CL4                 RECORD LENGTH                                
NTPHTYP  DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
NTPHACT  DS    CL1                 RECORD ACTION                                
         DS    C                                                                
NTPHDAT  DS    CL8                 RECORD DATE                                  
         DS    C                                                                
NTPHTIME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
NTPHAGY  DS    CL2                 AGENCY                                       
         DS    C                                                                
NTPHID   DS    CL29                PATTERN ID                                   
         DS    C                                                                
NTPHPOS  DS    CL3                 POSITION                                     
         DS    C                                                                
NTPHDATA DS    CL20                HIATUS DATA                                  
*                                                                               
NTPHDX   DS    CL2                 RECORD END                                   
NTPHDL   EQU   *-NTPHD             RECORD LENGTH                                
*                                                                               
