*          DATA SET NUGENPACK  AT LEVEL 001 AS OF 05/26/83                      
*              PACKAGE RECORD                                                   
         SPACE 3                                                                
NPRECD   DSECT                                                                  
NPKEY    DS    CL20                KEY                                          
NPKTYPE  DS    CL1                 RECORD TYPE X'02'                            
NPKAM    DS    CL1                 AGENCY/MEDIA                                 
NPKCLT   DS    CL2                 CLIENT                                       
NPKNET   DS    CL4                 NETWORK                                      
NPKEST   DS    CL1                 ESTIMATE                                     
NPKPACK  DS    CL1                 PACKAGE NUMBER                               
         DS    CL10                SPARE                                        
         SPACE 1                                                                
         DS    CL7                 LENGTH/STATUS/LINK                           
         SPACE 3                                                                
NPAKEL   DS    CL1                 ELEMENT CODE X'01'                           
NPAKLEN  DS    CL1                 ELEMENT LENGTH (40)                          
NPAKNAM  DS    CL16                PACKAGE NAME                                 
NPAKDP   DS    CL1                 DAYPART                                      
NPAKSTAT DS    CL1                 STATUS X'80'=FROZEN                          
*                                         X'20'=LOCKED                          
*                                         X'04'=INTEGRTION NON-COMM             
NPAKCOST DS    CL4                 PACKAGE COST                                 
         SPACE 1                                                                
*                                  UNITS WILL GET THESE VALUES                  
*                                  UNLESS OVERRIDDEN AT THE UNIT LEVEL          
NPAKINT  DS    CL4                 INTEGRATION DEFAULT                          
NPAKUNIV DS    CL2                 UNIVERSE CODE DEFAULT                        
NPAKFEED DS    CL2                 FEED PCT (2DEC)                              
NPAKMA   DS    CL1                 MASTER ALLOCATION PRODUCT                    
         DS    CL15                SPARE                                        
