*          DATA SET PBDECEL    AT LEVEL 002 AS OF 05/08/92                      
*                          **PRINTPAK - BUY RECORD SPECIAL                      
*                          DEC (DAILY EFFECTIVE CIRCULATION) ELEMENT            
PBDECEL  DS    0C                  DEC ELEMENT                                  
         DS    X'81'               ELEM CODE                                    
         DS    AL1(10)             ELEM LEN                                     
PBDEC    DS    PL6 .               DEC (DAILY EFFECTIVE CIRCULATION)            
         DS    CL2 .               SPARE                                        
