*          DATA SET PBFSIEL    AT LEVEL 005 AS OF 06/12/03                      
*                          **PRINTPAK - BUY RECORD SPECIAL                      
*                          FSI (FREE STANDING INSERTS) ELEMENT                  
PBFSIEL  DS    0C                  FSI ELEMENT                                  
         DS    X'82'               ELEM CODE                                    
PBFSIELQ EQU   X'82'               EQU                                          
         DS    AL1(13)             ELEM LEN                                     
PBFSIIND DS    XL1 .               X'01' LOOKED-UP FROM FSI REC                 
*                                  X'02' OVERRIDDEN                             
PBFSILDT DS    XL3 .               DATE OF LOOK-UP OR OVERRIDE                  
PBFSI    DS    PL5 .               FSI (FREE STANDING INSERTS)                  
PBFSIPID DS    XL2 .               PERSONAL ID                                  
