*          DATA SET PBGENFILE  AT LEVEL 001 AS OF 06/04/98                      
*                                                                               
*                                                                               
*        MEDIABASE RECORD DSECTS                                                
*        -----------------------                                                
*                                                                               
*         MAIN RECORD CODE    DESCRIPTION            SUB-RECORDS                
*         ----------------    -----------            -----------                
*             X'10'           GLOBAL DATABASE POINTER                           
*             X'41'           PUB (PRESS SUPPLIER)   01-03                      
*             X'41'           STATN (BDCST SUPPLIER) 01-03                      
*             X'51'           OWNER                  01                         
*             X'52'           REP                    01                         
*             X'53'           PERSONEL               01                         
*             X'54'           EDITORIAL GRP          01                         
*                             (POSTER SYSTEM)                                   
*             X'41'           SUPPLIER               01,02,04 PCHTER           
*             X'61'           BILL STICKER           01       KLEBER            
*             X'62'           POSTER TYPE            01       ANSCH-ART         
*             X'63'           SHOPPING CENTER        01       EKZ               
*             X'64'           CHAIN                  01       EKZ-KETTE         
*             X'65'           GEO                    05,06    ORT,KREIS         
*                                                             (LAND)            
*         SUB-RECORD CODE     DESCRIPTION                                       
*         ---------------     -----------                                       
*             X'01'           HEADER                                            
*             X'02'           RATE CARDS                                        
*             X'03'           MECHANICALS                                       
*             X'04'           POSTER DETAIL                                     
*             X'05'           LOCATION               ORT                        
*             X'06'           DISTRICT               KREIS,(LAND)               
*                                                                               
*          ** MISCELLANEOUS RECORD VALUE EQUATES **                             
*                                                                               
MBKEYL   EQU   32            KEY LENGTH                                         
MBEKEYL  EQU   6             ELEMENT KEY LENGTH                                 
MBDIRL   EQU   44            LENGTH OF DIRECTORY RECORD                         
MBCNTLD  EQU   32            DIRECTORY CONTROL BYTES DISPLACEMENT               
MBCNTLF  EQU   34            FILE CONTROL BYTES DISPLACEMENT                    
MBLEND   EQU   32            RECORD LENGTH DISPLACEMENT                         
MBELSTRT EQU   46            START OF FIRST ELEMENT                             
MBSTATN  EQU   8             NUMBER OF STATUS BYTES                             
*                                                                               
MBLINKD  EQU   2             DISPLACEMENT OF ELEMENT LINK VALUE                 
MBLINKL  EQU   1             LENGTH OF ELEMENT LINK VALUE FIELD                 
         EJECT                                                                  
*                                  MEDIABASE ENTRY ACTIVE KEY                   
*                                  --------------------------                   
MBAREC   DSECT                                                                  
MBAKEY   DS    0XL32                                                            
MBAKDB   DS    XL1                 DATABASE                                     
MBAKAGY  DS    CL2                 AGENCY (NULL = DDS)                          
*                                                                               
MBAKMRC  DS    XL1                 MAIN RECORD CODE                             
MBAKDBAQ EQU   X'10'                -GLOBAL DATABASE POINTER                    
MBAKPUBQ EQU   X'41'                -PUB-      PRESS SUPPLIER                   
MBAKSTNQ EQU   X'41'                -STATION-  BROADCAST SUPPLIER               
MBAKSUPQ EQU   X'41'                -SUPPLIER- OTHER MEDIA                      
MBAKOWNQ EQU   X'51'                -OWNER                                      
MBAKREPQ EQU   X'52'                -REP                                        
MBAKPERQ EQU   X'53'                -PERSONEL                                   
MBAKEGRQ EQU   X'54'                -EDITORIAL GROUP                            
*   POSTER SYSTEM                                                               
MBAKBSTQ EQU   X'61'                -BILL STICKER                               
MBAKPSTQ EQU   X'62'                -POSTER TYPE                                
MBAKSHCQ EQU   X'63'                -SHOPPING CENTER                            
MBAKCHNQ EQU   X'64'                -CHAIN                                      
MBAKGEOQ EQU   X'65'                -GEO                                        
*                                                                               
MBAKMBN  DS    XL3                 MEDIABASE NUMBER                             
*                                                                               
MBAKSRC  DS    XL1                 SUB RECORD CODE                              
MBAKHDRQ EQU   X'01'                -HEADER                                     
MBAKRATQ EQU   X'02'                -RATE CARD                                  
MBAKMECQ EQU   X'03'                -MECHANICALS                                
MBAKPSDQ EQU   X'04'                -POSTER DETAIL                              
MBAKLOCQ EQU   X'05'                -LOCATION                                   
MBAKDSTQ EQU   X'06'                -DISTRICT                                   
*                                                                               
MBAKCTYP DS    XL1                 CARD TYPE                                    
MBAKDSPQ EQU   X'01'                -DISPLAY                                    
MBAKCLSQ EQU   X'02'                -CLASSIFIED                                 
MBAKRETQ EQU   X'10'                -RETAIL                                     
*                                    NULL FOR BROADCAST                         
*                                                                               
MBAKEFD  DS    XL2                 EFFECTIVE DATE- COMPLEMENTED                 
*                                                                               
         ORG  MBAKCTYP  *POSTER*   FOR POSTER DETAIL RECORDS SUPPLIER           
MBAKMBN2 DS    XL3                 LOCATION MBNUM OVERLAYS TYPE + DATE          
         ORG                                                                    
*                                                                               
MBAKMINK DS    XL6                 MINIO ELEMENT KEY                            
         DS    XL15                SPARE                                        
         SPACE 1                                                                
*                                  DIRECTORY FIELDS                             
MBADSTAT DS    XL(MBSTATN)         STATUS BYTES                                 
MBADISK  DS    XL4                 DISK ADDRESS                                 
*                                                                               
         ORG   MBADSTAT            FILE RECORD FIELDS                           
MBARLEN  DS    XL2                 RECORD LENGTH                                
MBAFSTAT DS    XL(MBSTATN)         STATUS BYTES                                 
         DS    XL4                 DISK LINK                                    
         SPACE 2                                                                
MBAELS   DS    0X                  START OF FIRST ELEMENT                       
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
* NOTE- ALL 'RECORDS' ARE ACTUALLY MINIO RECORD SETS. MBAKMINK IS     *         
*       THE MINIO ELEMENT KEY. EACH SET WILL HAVE ONE RECORD WITH     *         
*       FF'S IN THIS THIS FIELD.                                      *         
*                                                                     *         
* NOTE- MBAKCTYP MAY BE CLASSIFIED OR DISPLAY ON RATE CARD AND        *         
*       MECHANICAL RECORDS, AND RETAIL ON RATE RECORDS ONLY.          *         
*                                                                     *         
*       MBAKEFD IS USED ONLY ON SUPPLIER HEADERS, RATE CARDS, AND     *         
*       MECHANICAL RECORDS.                                           *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
         ORG   MBADSTAT        **   DIRECTORY STATUS BYTES FOR    **            
*                              ** PUB HEADER RECORDS AND PASSIVES **            
         SPACE 1                                                                
MBADCNTL DS    XL1                 CONTROL BYTE                                 
MBDELQ   EQU   X'80'                 DELETED                                    
MBMLTQ   EQU   X'04'                 MULTI-REC MINIO SET                        
MBADMULQ EQU   MBMLTQ                                                           
MBADMTYP DS    XL1                 MEDIA TYPE                                   
MBADFRQ  DS    XL1                 FREQUENCY                                    
MBADIGR  DS    XL1                 INTEREST GROUP                               
MBADMSK1 DS    XL1                 FILTER MASK 1                                
MBADMBLQ EQU   X'40'                 BLEED AVAILABLE                            
MBADMCLQ EQU   X'20'                 COLORS AVAILABLE                           
MBADMINQ EQU   X'10'                 INSERTS AVAILABLE                          
MBADMGRQ EQU   X'08'                 SUPPLIER TYPE IS GROUP                     
MBADDIST DS    XL1                 DISTRIBUTION                                 
MBADEDT  DS    XL2                 END DATE                                     
         ORG   MBADMTYP                                                         
MBADFLET DS    CL1                 FILE-SET LETTER (MBAKMRC=MBAKDBAQ)           
         SPACE 2                                                                
         ORG   MBAFSTAT           ** FILE STATUS BYTES FOR  **                  
*                                 **  PUB HEADER RECORDS    **                  
         SPACE 1                                                                
MBAFCNTL DS    XL1                 CONTROL BYTE - SEE ABOVE                     
MBAFMTYP DS    XL1                 MEDIA TYPE                                   
MBAFFRQ  DS    XL1                 FREQUENCY                                    
MBAFIGR  DS    XL1                 INTEREST GROUP                               
MBAFMSK1 DS    XL1                 FILTER MASK 1 - SEE ABOVE                    
MBAFDIST DS    XL1                 DISTRIBUTION                                 
MBAFEDT  DS    XL2                 END DATE                                     
         ORG   MBAFMTYP                                                         
MBAFFLET DS    CL1                 FILE-SET LETTER (MBAKMRC=MBAKDBAQ)           
         EJECT                                                                  
         ORG   MBADSTAT            ** DIRECTORY STATUS BYTES FOR **             
*                                  ** EDITORIAL GRP RECS & PASSIVES **          
         SPACE 1                                                                
         DS    XL1                 CONTROL BYTE - SEE ABOVE                     
MBADEDGC DS    XL1                 EDITORIAL GROUP CLASSIFICATION               
         DS    XL6                 SPARE                                        
         SPACE 2                                                                
         ORG   MBAFSTAT            ** FILE STATUS BYTES FOR  **                 
*                                  ** EDITORIAL GRP RECS & PASSIVES **          
         SPACE 1                                                                
         DS    XL1                 CONTROL BYTE - SEE ABOVE                     
MBAFEDGC DS    XL1                 EDITORIAL GROUP CLASSIFICATION               
         DS    XL6                 SPARE                                        
         SPACE 4                                                                
         ORG   MBADSTAT            ** DIRECTORY STATUS BYTES FOR **             
*                                  ** GEO RECORDS & PASSIVES **                 
*                                  ** POSTER DETAIL RATES    **                 
         SPACE 1                                                                
         DS    XL1                 CONTROL BYTE - SEE ABOVE                     
MBADDREG DS    0XL1                REGION  -IC-, ONLY IF DISTRICT               
MBADLMSK DS    XL1                 MASK, ONLY IF LOCATION                       
MBADLMAQ EQU   X'80'               POSTER DETAIL RATES PRESENT FOR THIS         
*                                  LOCATION                                     
MBADLINH DS    XL2                 INHABITANTS / 1000                           
         DS    XL4                 SPARE                                        
         SPACE 2                                                                
         ORG   MBAFSTAT            ** FILE STATUS BYTES FOR  **                 
*                                  ** GEO RECORDS & PASSIVES **                 
*                                  ** POSTER DETAIL RATES    **                 
         SPACE 1                                                                
         DS    XL1                 CONTROL BYTE - SEE ABOVE                     
MBAFDREG DS    0XL1                REGION  -IC-, ONLY IF DISTRICT               
MBAFLMSK DS    XL1                 MASK, ONLY IF LOCATION                       
MBAFLINH DS    XL2                 INHABITANTS / 1000                           
         DS    XL4                 SPARE                                        
         EJECT                                                                  
*                                  MEDIABASE PASSIVES                           
*                                  ------------------                           
         ORG   MBAKEY                                                           
MBPKEY   DS    0XL32                                                            
MBPKDB   DS    XL1                 DATABASE                                     
MBPKAGY  DS    CL2                 AGENCY (NULL = DDS)                          
*                                                                               
MBPKPSV  DS    XL1                 PASSIVE POINTER TYPE                         
MBPKNSCQ EQU   X'A1'                -NAME SEARCH                                
MBPKMNEQ EQU   X'A3'                -MNEMONIC                                   
MBPKABBQ EQU   X'A3'                -ABBREVIATION (=MNEMONIC)                   
MBPKIGRQ EQU   X'A4'                -INTEREST GROUP                             
MBPKEGRQ EQU   X'A5'                -EDITORIAL GROUP                            
MBPKMTPQ EQU   X'A6'                -MEDIA TYPE                                 
MBPKTDAQ EQU   X'A7'                -TRADE ASSOCIATION                          
MBPKFRQQ EQU   X'A8'                -FREQUENCY                                  
MBPKCRCQ EQU   X'A9'                -CIRCULATION                                
MBPKGEOQ EQU   X'AA'                -GEO ASSIGNMMENT                            
MBPKOWNQ EQU   X'B1'                -OWNER                                      
MBPKREPQ EQU   X'B2'                -REP                                        
MBPKCMBQ EQU   X'B3'                -COMBO                                      
MBPKGRPQ EQU   X'B4'                -GROUP                                      
MBPKODCQ EQU   X'B5'                -OTHER DATABASE CODE                        
MBPKPERQ EQU   X'B6'                -PERSONNEL/PUB                              
MBPKACTQ EQU   X'B7'                -LAST ACTIVITY DATE/TIME                    
MBPKRQAQ EQU   X'D0'                -REQUESTING AGENCY                          
MBPKIPTQ EQU   X'D1'                -INPUTTER                                   
MBPKCHKQ EQU   X'D2'                -CHECKER                                    
*                                                                               
*        POSTER SYSTEM                                                          
*                                                                               
*        NOTE- ALSO USES THE GENERIC PASSIVE TYPES                              
*              LIKE ABBREVIATION, NAME SEARCH, ETC.                             
*                                                                               
MBPKDTWQ EQU   X'B8'               DISTRICT STATUS                              
MBPKDSTQ EQU   X'B9'               DISTRICT                                     
MBPKNRGQ EQU   X'BA'               NIELSEN REGION                               
MBPKSECQ EQU   X'BB'               SECTION                                      
MBPKINHQ EQU   X'BC'               INHABITANTS                                  
MBPKPCDQ EQU   X'BD'               POSTAL CODE                                  
MBPKREGQ EQU   X'BE'               REGION                                       
*        EQU   X'BF'               SPARE BUT CAN BE USED                        
MBPKCHNQ EQU   X'C0'               CHAIN                                        
MBPKLOCQ EQU   X'C1'               LOCATION                                     
MBPKPTCQ EQU   X'C2'               POSTER TYPE CATEGORY                         
MBPKPTDQ EQU   X'C3'               POSTER TYPE DETAIL                           
MBPKLCDQ EQU   X'C4'               LOCATION DETAIL                              
*                                                                               
MBPKVAL  DS    0X                  VALUE FOR PASSIVE                            
         SPACE 2                                                                
         ORG   MBPKVAL             ** NAME SEARCH PASSIVE -WORD HIGH **         
         SPACE 1                                                                
MBPKNSWR DS    XL1                 RECORD TYPE (SEE MBAKMRC)                    
MBPKNSWU DS    XL1                 SUB-RECORD  (SEE MBAKSRC)                    
MBPKNSWT DS    XL1                 X'01' SEARCH POINTER TYPE 1                  
MBPKNSWW DS    CL8                 WORD                                         
MBPKNSWS DS    XL3                 NAME SEARCH SEQ NO.                          
MBPKNSWN DS    XL3                 MBNUM                                        
MBPKNSWD DS    XL2                 START DATE                                   
         DS    XL9                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** NAME SEARCH PASSIVE -SEQ HIGH *           
         SPACE 1                                                                
MBPKNSNR DS    XL1                 RECORD TYPE (SEE MBAKMRC)                    
MBPKNSNU DS    XL1                 SUB-RECORD  (SEE MBAKSRC)                    
MBPKNSNT DS    XL1                 X'02' SEARCH POINTER TYPE 2                  
MBPKNSNS DS    XL3                 NAME SEARCH SEQ NO.                          
MBPKNSNW DS    CL8                 WORD                                         
MBPKNSNN DS    XL3                 MBNUM                                        
MBPKNSND DS    XL2                 START DATE                                   
         DS    XL9                 SPARE                                        
         EJECT                                                                  
         ORG   MBPKVAL           ** MNEMONIC (ABBREVIATION) PASSIVE **          
         SPACE 1                                                                
MBPKMNER DS    0XL1                RECORD TYPE (SEE MBAKMRC)                    
MBPKABBR DS    XL1                                                              
MBPKMNEU DS    0XL1                SUB-RECORD  (SEE MBAKSRC)                    
MBPKABBU DS    XL1                                                              
MBPKMNEC DS    0CL8                MNEMONIC CODE                                
MBPKABBC DS    CL8                                                              
MBPKMNEN DS    0XL3                PUB MBNUM                                    
MBPKABBN DS    XL3                                                              
MBPKMNES DS    0XL2                START DATE                                   
MBPKABBS DS    XL2                                                              
         DS    XL13                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** INTEREST GROUP PASSIVE **                 
         SPACE 1                                                                
MBPKIGRC DS    XL1                 INTEREST GROUP                               
MBPKIGRN DS    XL3                 PUB MBNUM                                    
MBPKIGRS DS    XL2                 START DATE                                   
         DS    XL22                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** EDITORIAL GROUP PASSIVE **                
         SPACE 1                                                                
MBPKEGRC DS    XL3                 EDITORIAL GROUP (MBNUM)                      
MBPKEGRN DS    XL3                 PUB MBNUM                                    
MBPKEGRS DS    XL2                 START DATE                                   
         DS    XL20                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** MEDIA TYPE **                             
         SPACE 1                                                                
MBPKMTPC DS    XL1                 MEDIA TYPE                                   
MBPKMTPN DS    XL3                 PUB MBNUM                                    
MBPKMTPS DS    XL2                 START DATE                                   
         DS    XL22                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** TRADE ASSOCIATION **                      
         SPACE 1                                                                
MBPKTDAC DS    XL1                 TRADE ASSOCIATION                            
MBPKTDAN DS    XL3                 PUB MBNUM                                    
MBPKTDAS DS    XL2                 START DATE                                   
         DS    XL22                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** FREQUENCY **                              
         SPACE 1                                                                
MBPKFRQC DS    XL1                 FREQUENCY                                    
MBPKFRQN DS    XL3                 PUB MBNUM                                    
MBPKFRQS DS    XL2                 START DATE                                   
         DS    XL22                SPARE                                        
         EJECT                                                                  
         ORG   MBPKVAL             ** CIRCULATION **                            
         SPACE 1                                                                
MBPKCRCV DS    XL4                 CIRCULATION VALUE (COMPLEMENTED)             
MBPKCRCN DS    XL3                 PUB MBNUM                                    
MBPKCRCS DS    XL2                 PUB EFFECTIVE DATE                           
MBPKCSRC DS    XL1                 CIRC SOURCE                                  
MBPKCRCD DS    XL4                 START-END DATES FOR CIRC VALUE               
MBPKCRCL DS    XL1                 LINK VALUE (FOR DIFFERENT EDITIONS)          
         DS    XL13                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** GEO ASSIGNMENT **                         
         SPACE 1                                                                
MBPKGEOA DS    XL2                 AREA SET IC                                  
MBPKGEOC DS    XL8                 AREA CODE                                    
MBPKGEON DS    XL3                 PUB MBNUM                                    
MBPKGEOS DS    XL2                 PUB EFFECTIVE DATE                           
         DS    XL13                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** OWNER **                                  
         SPACE 1                                                                
MBPKOWNM DS    XL3                 OWNER MBNUM                                  
MBPKOWNN DS    XL3                 PUB MBNUM                                    
MBPKOWNS DS    XL2                 START DATE                                   
         DS    XL20                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** REP **                                    
         SPACE 1                                                                
MBPKREPM DS    XL3                 REP MBNUM                                    
MBPKREPN DS    XL3                 PUB MBNUM                                    
MBPKREPS DS    XL2                 START DATE                                   
         DS    XL20                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** COMBO **                                  
         SPACE 1                                                                
MBPKCMBM DS    XL3                 COMBO MBNUM                                  
MBPKCMBN DS    XL3                 PUB MBNUM                                    
MBPKCMBS DS    XL2                 START DATE                                   
         DS    XL20                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** GROUP **                                  
         SPACE 1                                                                
MBPKGRPM DS    XL3                 GROUP MBNUM                                  
MBPKGRPN DS    XL3                 PUB MBNUM                                    
MBPKGRPS DS    XL2                 START DATE                                   
         DS    XL20                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** PERSONNEL/PUB **                          
         SPACE 1                                                                
MBPKPERM DS    XL3                 PERSON MBNUM                                 
MBPKPERD DS    XL2                 COMPLEMENTED START DATE                      
MBPKPERR DS    XL1                 MAJOR RECORD TYPE                            
MBPKPERN DS    XL3                 MRT MBNUM                                    
MBPKPERS DS    XL1                 PEREL SEQN                                   
         DS    XL9                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** OTHER DATABASE NUMBER **                  
         SPACE 1                                                                
MBPKODCT DS    XL2                 TYPE OF CODE (IC)                            
MBPKODCC DS    CL12                CODE                                         
MBPKODCN DS    XL3                 PUB MBNUM                                    
MBPKODCS DS    XL2                 START DATE                                   
         DS    XL09                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** LAST ACTIVITY DATE/TIME **                
         SPACE 1                                                                
MBPKACTR DS    XL1                 MASTER RECORD TYPE                           
MBPKACTD DS    XL2                 ACTIVITY DATE                                
MBPKACTT DS    XL4                 TIME (STANDARD)                              
MBPKACTN DS    XL3                 PUB MBNUM                                    
MBPKACTS DS    XL2                 START DATE                                   
         DS    XL16                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** DISTRICT **                               
         SPACE 1                                                                
MBPKDSTM DS    XL3                 DISTRICT MBNUM                               
MBPKDSTN DS    XL3                 LOCATION MBNUM                               
MBPKDST1 DS    XL2                 NIELSEN AREA                                 
MBPKDST2 DS    XL1                 SECTION                                      
MBPKDST3 DS    XL1                 DISTRICT STATUS                              
MBPKDST4 DS    XL4                 INHABITANTS                                  
MBPKDST6 DS    XL10                POSTAL CODE                                  
MBPKDST7 DS    XL1                 REGION                                       
         DS    XL3                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** NIELSEN **                                
         SPACE 1                                                                
MBPKNRGM DS    XL2                 NIELSEN AREA  -  IC                          
MBPKNRGN DS    XL3                 LOCATION MBNUM                               
MBPKNRG2 DS    XL1                 SECTION                                      
MBPKNRG3 DS    XL1                 DISTRICT STATUS                              
MBPKNRG4 DS    XL4                 INHABITANTS                                  
MBPKNRG5 DS    XL3                 DISTRICT                                     
MBPKNRG6 DS    XL10                POSTAL CODE                                  
MBPKNRG7 DS    XL1                 REGION                                       
         DS    XL3                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** INHABITANTS  **                           
         SPACE 1                                                                
MBPKINHM DS    XL4                 INHABITANTS                                  
MBPKINHN DS    XL3                 LOCATION MBNUM                               
MBPKINH1 DS    XL2                 NIELSEN AREA  -  IC                          
MBPKINH2 DS    XL1                 SECTION                                      
MBPKINH3 DS    XL1                 DISTRICT STATUS                              
MBPKINH5 DS    XL3                 DISTRICT                                     
MBPKINH6 DS    XL10                POSTAL CODE                                  
MBPKINH7 DS    XL1                 REGION                                       
         DS    XL3                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** POSTAL CODE  **                           
         SPACE 1                                                                
MBPKPCDM DS    XL10                POSTAL CODE                                  
MBPKPCDN DS    XL3                 LOCATION MBNUM                               
MBPKPCD1 DS    XL2                 NIELSEN AREA  -  IC                          
MBPKPCD2 DS    XL1                 SECTION                                      
MBPKPCD3 DS    XL1                 DISTRICT STATUS                              
MBPKPCD4 DS    XL4                 INHABITANTS                                  
MBPKPCD5 DS    XL3                 DISTRICT                                     
MBPKPCD7 DS    XL1                 REGION                                       
         DS    XL3                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** DISTRICT STATUS  **                       
         SPACE 1                                                                
MBPKDTWM DS    XL1                 DISTRICT STATUS  -  IC                       
MBPKDTWN DS    XL3                 LOCATION MBNUM                               
MBPKDTW1 DS    XL2                 NIELSEN AREA  -  IC                          
MBPKDTW2 DS    XL1                 SECTION                                      
MBPKDTW4 DS    XL4                 INHABITANTS                                  
MBPKDTW5 DS    XL3                 DISTRICT                                     
MBPKDTW6 DS    XL10                POSTAL CODE                                  
MBPKDTW7 DS    XL1                 REGION                                       
         DS    XL3                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** SECTION  **                               
         SPACE 1                                                                
MBPKSECM DS    XL1                 SECTION  -  IC                               
MBPKSECN DS    XL3                 LOCATION MBNUM                               
MBPKSEC1 DS    XL2                 NIELSEN AREA  -  IC                          
MBPKSEC3 DS    XL1                 DISTRICT STATUS                              
MBPKSEC4 DS    XL4                 INHABITANTS                                  
MBPKSEC5 DS    XL3                 DISTRICT                                     
MBPKSEC6 DS    XL10                POSTAL CODE                                  
MBPKSEC7 DS    XL1                 REGION                                       
         DS    XL3                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** REGION  **                                
         SPACE 1                                                                
MBPKREGM DS    XL1                 REGION  -  IC                                
MBPKREGN DS    XL3                 LOCATION MBNUM                               
MBPKREG1 DS    XL2                 NIELSEN AREA  -  IC                          
MBPKREG2 DS    XL1                 SECTION                                      
MBPKREG3 DS    XL1                 DISTRICT STATUS                              
MBPKREG4 DS    XL4                 INHABITANTS                                  
MBPKREG5 DS    XL3                 DISTRICT                                     
MBPKREG6 DS    XL10                POSTAL CODE                                  
         DS    XL3                 SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** POSTER TYPE RATE **                       
         SPACE 1                                                                
MBPKPTDM DS    XL3                 POSTER TYPE MBNUM                            
MBPKPTDN DS    XL3                 SUPPLIER MBNUM                               
MBPKPTDL DS    XL3                 LOCATION MBNUM                               
MBPKPTDS DS    XL2                 START DATE                                   
MBPKPTDC DS    XL3                 SHOPPING CENTER                              
         DS    XL14                SPARE                                        
         SPACE 2                                                                
         SPACE 2                                                                
         ORG   MBPKVAL             ** LOCATION RATE **                          
         SPACE 1                                                                
MBPKLCDM DS    XL3                 LOCATION MBNUM                               
MBPKLCDN DS    XL3                 SUPPLIER MBNUM                               
MBPKLCDP DS    XL3                 POSTER TYPE MBNUM                            
MBPKLCDS DS    XL2                 START DATE                                   
MBPKLCDC DS    XL3                 SHOPPING CENTER                              
         DS    XL14                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** CHAIN **                                  
         SPACE 1                                                                
MBPKCHNM DS    XL3                 CHAIN MBNUM                                  
MBPKCHNN DS    XL3                 SHOPPING CENTER MBNUM                        
MBPKCHNS DS    XL2                 START DATE                                   
         DS    XL20                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** LOCATION **                               
         SPACE 1                                                                
MBPKLOCM DS    XL3                 LOCATION MBNUM                               
MBPKLOCN DS    XL3                 SHOPPING CENTER MBNUM                        
MBPKLOCS DS    XL2                 START DATE                                   
         DS    XL20                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** POSTER TYPE CATEGORIE **                  
         SPACE 1                                                                
MBPKPTCM DS    XL1                 POSTER TYPE CATEGORIE  -  IC                 
MBPKPTCN DS    XL3                 POSTER TYPE MBNUM                            
MBPKPTCS DS    XL2                 START DATE                                   
         DS    XL22                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** REQUESTING AGENCY **                      
         SPACE 1                                                                
MBPKRQAC DS    XL2                 AGENCY (IC)                                  
MBPKRQAN DS    XL3                 PUB MBNUM                                    
MBPKRQAS DS    XL2                 START DATE                                   
         DS    XL22                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** INPUTTER/DATE **                          
         SPACE 1                                                                
MBPKIPTC DS    XL2                 INPUTTER (IC)                                
MBPKIPID DS    XL2                 DATE INPUT                                   
MBPKIPCC DS    XL2                 CHECKER (IC)                                 
MBPKIPCD DS    XL2                 DATE CHECKED                                 
MBPKIPTN DS    XL3                 PUB MBNUM                                    
MBPKIPTS DS    XL2                 START DATE                                   
         DS    XL25                SPARE                                        
         SPACE 2                                                                
         ORG   MBPKVAL             ** CHECKER/DATE **                           
         SPACE 1                                                                
MBPKCHKC DS    XL2                 CHECKER (IC)                                 
MBPKCHCD DS    XL2                 DATE CHECKED                                 
MBPKCHIC DS    XL2                 INPUTTER (IC)                                
MBPKCHID DS    XL2                 DATE INPUT                                   
MBPKCHKN DS    XL3                 PUB MBNUM                                    
MBPKCHKS DS    XL2                 START DATE                                   
         DS    XL25                SPARE                                        
         SPACE 2                                                                
         EJECT                                                                  
**********************************************************************          
*                                                                               
*     -- GLOBAL CONTROL RECORDS (NO DATABASE NUMBER IN THE KEY)                 
*                                                                               
**********************************************************************          
         SPACE 2                                                                
         ORG   MBAKEY                                                           
MBCKEY   DS    0XL32               CONTROL RECORD KEYS                          
         DS    XL3                 NULLS                                        
MBCKMRC  DS    XL1                 MAIN RECORD CODE                             
MBCKDBAQ EQU   X'10'               - DATABASE CONTROL RECORD                    
         DS    XL3                 SPARE                                        
MBCKDBN  DS    XL1                 DATABASE NUMBER (MBCKMRC=MBCKDBAQ)           
         DS    XL24                SPARE                                        
         ORG   MBADSTAT                                                         
MBCDCNTL DS    XL1                 CONTROL BYTE                                 
MBCDFLET DS    CL1                 FILE-SET LETTER                              
         DS    XL6                                                              
         ORG   MBAFSTAT                                                         
MBCFCNTL DS    XL1                 CONTROL BYTE                                 
MBCFFLET DS    CL1                 FILE-SET LETTER                              
         DS    XL6                                                              
         ORG   MBAELS                                                           
MBCELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*                                  DEFAULTS ELEMENT                             
*                                  ----------------                             
DEFELD   DSECT                                                                  
DEFELEM  DS    XL1                                                              
DEFELQ   EQU   X'10'                                                            
DEFLEN   DS    XL1                                                              
DEFVALS  DS    0XL16               DEFAULT VALUES                               
DEFLANG  DS    XL2                 DEFAULT LANGUAGE INTERNAL CODE               
DEFCURR  DS    XL2                 DEFAULT CURRENCY INTERNAL CODE               
DEFBASED DS    XL2                 DEFAULT BASE DATE TYPE INTERNAL CODE         
DEFCTRY  DS    XL1                 DEFAULT INDEX INTO COUNTRY TABLE             
         DS    XL09                SPARE                                        
DEFLENQ  EQU   *-DEFELD                                                         
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*     -- NOTES ON RECORD STRUCTURE --                                 *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
*   ALL RECORDS MINIO RECORD SETS.                                              
*                                                                               
*   THE MINIO ELEMENT KEY LENGTH IS 6-                                          
*                                                                               
*      -ELEMENT GROUP CODE 1                                                    
*      -LINK FIELD         1                                                    
*      -ELEMENT TYPE CODE  1                                                    
*      -DATA TYPE CODE     2                                                    
*      -SEQUENCE NUMBER    1                                                    
*                                                                               
*   NOT ALL ELEMENTS ARE ACTUALLY STRUCTURED THIS WAY, BUT ALL MUST BE          
*   CONSTRUCTED SO AS TO GUARANTEE UNIQUENESS ON THE ELEMENT CODE AND           
*   THE FIRST 5 DATA BYTES.                                                     
*                                                                               
*   IN ORDER TO KEEP RELATED ELEMENTS PHYSICALLY CLOSE TOGETHER ALL             
*   FOR IMPROVED EFFICIENCY WITH MINIO, AN ELEMENT GROUP SCHEME HAS             
*   BE EMPLOYED. ALL ELEMENTS IN A GIVEN GROUP, TYPCIALLY COVERED BY            
*   ONE ENTRY SCREEN, SHARE A COMMON ELEMENT GROUP CODE AT ELEM+0.              
*   ELEM+2(1) IS A LINK FIELD WHICH IS USED TO TIE TOGETHER ALL ELEMS           
*   OF A GIVEN LINKED SET WITHIN THE GROUP. ELEM+3(1) IS AN ELEMENT             
*   TYPE CODE WHICH IDENTIFIES THE ACTUAL CONTENTS OF THE ELEMENT.              
*                                                                               
*   FOR EXAMPLE, THERE IS-                                                      
*                                                                               
*      -AN ELEMENT GROUP CODE FOR SPACE RATES                                   
*      -A UNIQUE LINK VALUE FOR EACH INDIVIDUAL SCREEN OF RATES                 
*      -A ELEMENT TYPE CODE FOR RATE ELEMENT, QUALIFIER ELEMENT,                
*       NOTE ELEMENT, ETC.                                                      
*                                                                               
*   LINK FIELD VALUES ARE UNIQUE WITHIN AN ELEMENT GROUP CODE.                  
*                                                                               
*   NOTE- NOT ALL ELEMENTS ARE GROUPED THIS WAY.                                
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*        -- SYSTEM WIDE / GENERIC ELEMENTS --                         *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
*        ELEMENT CODES                                                          
         SPACE 1                                                                
ACTELQ   EQU   X'F1'               ACTIVITY ELEMENT                             
         SPACE 1                                                                
*        ELEMENT TYPE CODES  (ELEM+3)                                           
         SPACE 1                                                                
QLYELTQ  EQU   X'21'               QUALIFYING ELEMENT                           
TXTELTQ  EQU   X'C1'               TEXT ELEMENT                                 
ITMELTQ  EQU   X'C2'               ITEM ELEMENT                                 
         SPACE 2                                                                
*                                  ACTIVITY ELEMENT                             
*                                  ----------------                             
ACTELD   DSECT                                                                  
ACTELEM  DS    XL1                                                              
ACTELEML DS    XL1                 ELEMENT LENGTH                               
         DS    XL5                 SPARE                                        
ACTADDT  DS    XL3                 DATE ADDED (PWOS)                            
ACTADTIM DS    XL4                 TIME ADDED                                   
ACTADID  DS    XL2                 ID THAT ADDED RECORD                         
ACTADPW  DS    XL2                 ADDER'S PASSWORD                             
ACTCHDT  DS    XL3                 DATE LAST CHANGE (PWOS)                      
ACTCHTIM DS    XL4                 TIME LAST CHANGE (STANDARD FORMAT)           
ACTCHID  DS    XL2                 ID THAT MADE LAST CHANGE                     
ACTCHPW  DS    XL2                 CHANGER'S PASSWORD                           
ACTCHFL1 DS    XL1                 CHANGE FLAGS - 1ST BYTE                      
ACTCHFL2 DS    XL1                              - 2ND BYTE                      
ACTCHFL3 DS    XL1                              - 3RD BYTE                      
         DS    XL3                 SPARE                                        
ACTELLN  EQU    *-ACTELEM                                                       
         EJECT                                                                  
*                                  GENERIC QUALIFYING ELEMENT                   
*                                  --------------------------                   
QLYELD   DSECT                                                                  
QLYELEM  DS    XL1                 ELEMENT GROUP CODE                           
QLYELEML DS    XL1                 ELEMENT LENGTH                               
QLYLINK  DS    XL1                 LINK                                         
QLYELTYP DS    XL1                 ELEMENT TYPE CODE                            
QLYUSER  DS    XL8                 USE SPECIFIC BYTES- CONTENTS                 
*                                  DESCRIBED WITH ASSOCIATED ELEM GRP           
QLYQLYL  DS    XL1                 LENGTH OF QUALIFIER SUFFIX                   
         DS    XL1                 SPARE                                        
QLYFXLN  EQU   *-QLYELEM           FIXED LENGTH                                 
*                                                                               
QLYQNO   DS    XL1                 NUMBER OF QUALIFIERS                         
*                                  FOR EACH QUALIFIER                           
QLYCTL   DS    XL1                 CONTROL                                      
QLYNOTQ  EQU   X'80'                 LOGICAL NOT                                
QLYGTQ   EQU   X'40'                 GREATER THAN                               
QLYLTQ   EQU   X'20'                 LESS THAN                                  
QLYEQQ   EQU   X'10'                 EQUAL TO                                   
QLYVALQ  EQU   X'08'                 QLYQVAL IS VALUE, NOT IC                   
QLYTPMQ  EQU   X'04'                 ENTERED WITH TRAILING +/-                  
QLYVLEN  DS    XL1                 LENGTH OF QUALIFIER VALUE                    
QLYVLENQ EQU   X'1F'                 LOW ORDER 5 BITS ONLY                      
QLYQTIC  DS    XL1                 QUALIFIER TYPE (IC)                          
QLYQVAL  DS    0X                  QUALIFIER VALUE (IC OR VALUE)                
         SPACE 1                                                                
*  NOTE- THIS ELEMENT IS ALWAYS PART OF A LINKED ELEMENT GROUP.                 
*                                                                               
*  NOTE - THERE ARE ALSO CASES WHERE QUALIFYING INFORMATION IS                  
*         CONTAINED WITHIN A DATA ELEMENT ITSELF. AS IN QLYELEM, THE            
*         FIXED PORTION OF THE ELEMENT IS FOLLOWED BY THE VALUES FOR            
*         EACH QUALIFIER. THIS IS ALLOWS SPECIFIC QUALIFICATION                 
*         OF AN ELEMENT WITHIN A MORE GENERALLY QUALIFIED SET OF                
*         ELEMENTS, FOR EXAMPLE A PARTICULAR SPACE/RATE ELEMENET                
*         ON A RATE SCREEN.                                                     
         EJECT                                                                  
*                                  GENERIC TEXT ELEMENT                         
*                                  --------------------                         
TXTELD   DSECT                                                                  
TXTELEM  DS    XL1                 ELEMENT GROUP CODE                           
TXTELEML DS    XL1                 ELEMENT LENGTH                               
TXTLINK  DS    XL1                 LINK                                         
TXTELTYP DS    XL1                 ELEMENT TYPE CODE                            
TXTDTIC  DS    XL2                 DATA TYPE (IC)                               
TXTSQN   DS    XL1                 SEQ. NO. (FOR MULTIPLE LINES)                
TXTFXLN  EQU   *-TXTELEM           FIXED LENGTH                                 
*                                                                               
TXTVAL   DS    0X                  TEXT                                         
         SPACE 1                                                                
*        EQUATES FOR TXTELEM DATA TYPES                                         
         SPACE 1                                                                
TXTABBQ  EQU   X'0001'             ABBREVIATION (MNEMONIC)                      
TXTNAMQ  EQU   X'0002'             NAME                                         
TXTTTLQ  EQU   X'0003'             FULL TITLE                                   
TXTADLQ  EQU   X'0004'             ADDRESS LINE                                 
TXTASNQ  EQU   X'0005'             ASSOCIATED NAME (EG EDITORIAL GROUP)         
TXTSUFQ  EQU   X'0006'             SUFFIX                                       
TXTTELQ  EQU   X'0007'             TELEPHONE                                    
TXTEDCQ  EQU   X'0008'             EDITORIAL CONTENT                            
TXTRESQ  EQU   X'0009'             RESEARCH                                     
TXTWKAQ  EQU   X'000A'             WAS KNOWN AS                                 
TXTNKAQ  EQU   X'000B'             NOW KNOWN AS                                 
TXTCNAMQ EQU   X'000C'             CONTACT NAME                                 
TXTCTELQ EQU   X'000D'             CONTACT TELEPHONE                            
TXTCOTHQ EQU   X'000E'             CONTACT OTHER                                
TXTPOCDQ EQU   X'000F'             POSTAL CODES                                 
TXTFAXQ  EQU   X'0010'             FAX                                          
TXTTELXQ EQU   X'0011'             TELEX                                        
TXTID1Q  EQU   X'0012'             ADDRESS ID 01                                
TXTID2Q  EQU   X'0013'             ADDRESS ID 02 (UK - AD-DOC NO.)              
TXTID3Q  EQU   X'0014'             ADDRESS ID 03 (UK - AD-DOC EXCH.)            
TXTDESCQ EQU   X'0017'             DESCRIPTION                                  
TXTOWNRQ EQU   X'0018'             OWNER                                        
TXTCLTQ  EQU   X'0019'             CLIENT                                       
TXTPRDQ  EQU   X'001A'             PRODUCT                                      
TXTCMPQ  EQU   X'001B'             CAMPAIGN                                     
TXTBNKNQ EQU   X'001C'             BANK NAME                                    
TXTSRTCQ EQU   X'001D'             SORT CODE                                    
TXTANUMQ EQU   X'001E'             ACCOUNT NUMBER                               
TXTANAMQ EQU   X'001F'             ACCOUNT NAME                                 
TXTATYPQ EQU   X'0020'             ACCOUNT TYPE                                 
TXTNOTQ  EQU   X'0021'             GENERAL NOTES                                
TXTCLLQ  EQU   X'0022'             CALL LETTERS                                 
TXTFRQQ  EQU   X'0023'             FREQUENCY                                    
TXTMKTQ  EQU   X'0024'             MARKETING FACILITIES                         
TXTIPRQ  EQU   X'0025'             ISSUE PRICE                                  
TXTSPRQ  EQU   X'0026'             SUBSCRIPTION PRICE                           
TXTTFXQ  EQU   X'0029'             TELEFAX NUMBER                               
*        POSTER SYSTEM                                                          
TXTEXPQ  EQU   X'0027'             EXPRESS DELIVERY LOCATION                    
TXTFRTQ  EQU   X'0028'             FREIGHT DELIVERY LOCATION                    
TXTTLAVQ EQU   X'002A'             TEL. AVIS                                    
         SPACE 1                                                                
*                                  GENERIC ITEM ELEMENT                         
*                                  --------------------                         
ITMELD   DSECT                                                                  
ITMELEM  DS    XL1                 ELEMENT GROUP CODE                           
ITMELEML DS    XL1                 ELEMENT LENGTH                               
ITMLINK  DS    XL1                 LINK                                         
ITMELTYP DS    XL1                 ELEMENT TYPE CODE                            
ITMDTIC  DS    XL2                 DATA TYPE (IC)                               
ITMSQN   DS    XL1                 SEQUENCE NUMBER                              
ITMVLEN  DS    XL1                 VALUE LENGTH                                 
         DS    XL1                 SPARE                                        
ITMFXLN  EQU   *-ITMELEM           FIXED LENGTH                                 
*                                                                               
ITMVAL   DS    0X                  ITEM VALUE                                   
*                                                                               
*        EQUATES FOR ITMELEM DATA TYPES                                         
         SPACE 1                                                                
ITMIGRQ  EQU   X'0001'             INTEREST GROUPS                              
ITMEGRQ  EQU   X'0002'             EDITORIAL GROUPS                             
ITMTDAQ  EQU   X'0003'             TRADE ASSOCIATIONS                           
ITMOWNQ  EQU   X'0004'             OWNER (NB-IF ITMVLEN=4+,VAL IS TEXT)         
ITMREPQ  EQU   X'0005'             REP                 ''                       
ITMCMBQ  EQU   X'0006'             COMBO                                        
ITMGRPQ  EQU   X'0007'             GROUP                                        
ITMODBQ  EQU   X'0008'             OTHER DATABASE CODE (NOTE- VALUE IS          
*                                  OTHER DB IC PLUS CODE)                       
ITMFMTQ  EQU   X'0009'             PUB FORMATS                                  
ITMLANQ  EQU   X'000A'             LANGUAGE                                     
ITMREFQ  EQU   X'000B'             REFERRAL SUPPLIER                            
ITMCLSQ  EQU   X'000C'             EDITORIAL GROUP CLASSIFICATION               
ITMSTPQ  EQU   X'000D'             STATION TYPE                                 
ITMBDMQ  EQU   X'000E'             BROADCAST METHOD                             
*        POSTER SYSTEM                                                          
ITMBSTQ  EQU   X'000F'             BILL STICKER                                 
ITMPSTQ  EQU   X'0010'             POSTER TYPE                                  
ITMLOCQ  EQU   X'0011'             LOCATION                                     
ITMSUPQ  EQU   X'0012'             SUPPLIER                                     
ITMDSTQ  EQU   X'0013'             DISTRICT                                     
ITMCHNQ  EQU   X'0014'             CHAIN                                        
*                                                                               
ITMREQA  EQU   X'0020'             REQUESTING AGENCY                            
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*        -- PUB HEADER RECORD ELEMENTS --                             *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
*                        ELEMENT GROUP/TYPE                                     
*                        ------------------                                     
*                                                                               
         SPACE 1                                                                
PHDELGQ  EQU   X'11'     PUB HEADER GROUP                                       
PHDELTQ  EQU   X'31'      -HEADER                                               
GEAELTQ  EQU   X'32'      -GEO ASSIGNMENT                                       
EDIELTQ  EQU   X'33'      -EDITION HEADER ELEMENT                               
*                                                                               
*        TEXT ELEMENTS    -MNEMONIC (ABBR)    (1X8)                             
*                         -NAME               (1X40)                            
*                         -FULL TITLE         (2X70)                            
*                         -OWNER NAME         (1X40)                            
*                         -REP NAME           (1X40)                            
*                         -EDIT. DESCRIPTION  (3X70)                            
*                         -PRIMARY TELEPHONE  (1X20)                            
*                         -RESEARCH AVAILABLE (2X70)                            
*                         -WAS KNOWN AS       (1X70)                            
*                         -NOW KNOWN AS       (1X70)                            
*                         -WHEN ISSUED NOTES  (2X70)                            
*                         -NOTES              (5X70)                            
*       ITEM VALUE ELEMS  -INTEREST GROUPS    (IC)                              
*                         -EDITORIAL GROUPS   (MBNUM)                           
*                         -TRADE ASSOCIATIONS (IC)                              
*                         -OWNER              (MBNUM)                           
*                         -REPS               (MBNUM)                           
*                         -GROUP/COMBO        (MBNUM)                           
*                         -REFERRALS          (MBNUM)                           
*                         -PUB FORMATS        (IC)                              
*                         -LANGUAGES          (IC)                              
*                         -OTHER DB CODE      (IC,VALUE)                        
*        (NO QUALIFYING ELEMENTS)                                               
         EJECT                                                                  
BHDELGQ  EQU   X'11'     BROADCAST HEADER GROUP                                 
BHDELTQ  EQU   X'31'      -HEADER                                               
HRSELTQ  EQU   X'32'      -HOURS                                                
*                                                                               
*        TEXT ELEMENTS    -MNEMONIC (ABBR)    (1X8)                             
*                         -NAME               (1X40)                            
*                         -FULL TITLE         (2X70)                            
*                         -OWNER NAME         (1X40)                            
*                         -REP NAME           (1X40)                            
*                         -EDIT. DESCRIPTION  (3X70)                            
*                         -PRIMARY TELEPHONE  (1X20)                            
*                         -RESEARCH AVAILABLE (2X70)                            
*                         -WAS KNOWN AS       (1X70)                            
*                         -NOW KNOWN AS       (1X70)                            
*                         -CALL LETTERS       (1X04)                            
*                         -FREQUENCY          (1X10)                            
*                         -NOTES              (5X70)                            
*       ITEM VALUE ELEMS  -INTEREST GROUPS    (IC)                              
*                         -EDITORIAL GROUPS   (MBNUM)                           
*                         -TRADE ASSOCIATIONS (IC)                              
*                         -OWNER              (MBNUM)                           
*                         -REPS               (MBNUM)                           
*                         -GROUP/COMBO        (MBNUM)                           
*                         -REFERRALS          (MBNUM)                           
*                         -LANGUAGES          (IC)                              
*                         -OTHER DB CODE      (IC,VALUE)                        
*                         -BROADCAST BAND     (IC)                              
*                         -BROADCAST METHOD   (IC)                              
*                         -STATION TYPE       (IC)                              
*        (NO QUALIFYING ELEMENTS)                                               
         EJECT                                                                  
CRCELGQ  EQU   X'A0'     CIRCULATION GROUP (A0-AF)                              
CHDELTQ  EQU   X'31'      -HEADER                                               
CRCELTQ  EQU   X'32'      -VALUE                                                
*        TEXT ELEMENTS    -CIRCULATION NOTES  (3X70)                            
*        QUALIFYING ELEMENT                                                     
         SPACE 2                                                                
ADDELGQ  EQU   X'13'     ADDRESS GROUP                                          
ADHELTQ  EQU   X'31'      -HEADER                                               
*                                                                               
*        TEXT ELEMENTS                                                          
*                         -CONTACT NAME    (1X30)                               
*                         -CONTACT PHONE   (1X20)                               
*                         -CONTACT OTHER   (1X40)                               
*                         -ADDRESS LINE    (6X40)                               
*                         -POSTAL CODE     (1X20)                               
*                         -TELEPHONE       (1X20)                               
*                         -TELEX           (1X20)                               
*                         -FAX             (1X20)                               
*                         -ADDRESS ID 01   (1X20)                               
*                         -ADDRESS ID 02   (1X20)                               
*                         -ADDRESS ID 03   (1X20)                               
*        QUALIFYING ELEMENT                                                     
         SPACE 2                                                                
MBCELGQ  EQU   X'12'     MEDIABASE CONTROL ELEMENT GROUP                        
MBCELTQ  EQU   X'33'      -MEDIABASE CONTROL                                    
MBRELTQ  EQU   X'34'      -MEDIABASE REQUEST HISTORY                            
*        TEXT ELEMENTS    -CONTROL NOTES                                        
*        ITEM VALUE ELEMS -REQUESTING AGENCY                                    
*                         -INPUTTER/DATE                                        
*                         -CHECKER/DATE                                         
*        NO QUALIFYING ELEMENT                                                  
         SPACE 2                                                                
PERELGQ  EQU   X'15'     PERSONNEL GROUP                                        
PERELTQ  EQU   X'32'      -DETAIL                                               
*        TEXT ELEMENTS    -PERSONNEL NOTES                                      
*        NO QUALIFYING ELEMENT                                                  
         SPACE 2                                                                
BNKELGQ  EQU   X'16'     BANKING GROUP                                          
*        TEXT ELEMENTS                          UK       GER                    
*                         -BANK NAME             -      (1X50)                  
*                         -SORT CODE           (1X6)    (1X8)                   
*                         -ACCOUNT NUMBER      (1X8)    (1X12)                  
*                         -ACCOUNT NAME        (1X18)     -                     
*                         -ACCOUNT TYPE        (1X1)      -                     
*                         -BANKING NOTES                                        
*        QUALIFYING ELEMENT                                                     
         SPACE 2                                                                
MSCELGQ  EQU   X'1A'     MISCELLANEOUS GROUP - ALL RECORDS                      
*        TEXT ELEMENTS                                                          
*                            - DETERMINED DYNAMICALLY FROM SELECT FIELD         
*        QUALIFYING ELEMENT  - MAY OR MAY NOT BE PRESENT                        
         SPACE 2                                                                
*        NON-GROUP ELEMENTS                                                     
*                                                                               
QLRELQ   EQU   X'51'     QUALIFIER ELEMENT                                      
PERELQ   EQU   X'62'     PERSONEL ELEMENT                                       
         EJECT                                                                  
*                                  BROADCAST HEADER ELEMENT                     
*                                  ------------------------                     
BHDELD   DSECT                                                                  
BHDELEM  DS    XL1                 ELEMENT GROUP CODE                           
BHDELEML DS    XL1                 ELEMENT LENGTH                               
BHDLINK  DS    XL1                 LINK                                         
BHDELTYP DS    XL1                 ELEMENT TYPE CODE                            
BHDSTDT  DS    XL2                 START (EFFECTIVE) DATE                       
BHDENDT  DS    XL2                 END DATE                                     
*                                                                               
         DS    XL5                 SPARE                                        
*                                                                               
BHDESTDI DS    XL1                 INDICATOR FOR DATE ESTABLISHED               
*                                    X'80' =BHDESTDT IS YL2(YEAR ALONE)         
BHDESTDT DS    XL2                 DATE ESTABLISHED                             
BHDKILDT DS    XL2                 KILL DATE                                    
         DS    XL1                 SPARE                                        
BHDSTYP  DS    XL1                 SUPPLIER TYPE                                
         DS    XL3                 SPARE                                        
BHDMTYP  DS    XL1                 MEDIA TYPE                                   
         DS    XL7                 SPARE                                        
BHDBAND  DS    XL1                 BROADCAST BAND                               
         DS    XL40                SPARE                                        
BHDELLN  EQU    *-BHDELEM                                                       
*                                  HOURS ELEMENT                                
*                                  -------------                                
HRSELD   DSECT                                                                  
HRSELEM  DS    XL1                 ELEMENT GROUP CODE                           
HRSELEML DS    XL1                 ELEMENT LENGTH                               
HRSLINK  DS    XL1                 LINK                                         
HRSELTYP DS    XL1                 ELEMENT TYPE CODE                            
HRSDTIC  DS    XL2                 ELEMENT DATA TYPE IC                         
HRSBRDQ  EQU   1                     HOURS OF BROADCAST                         
HRSADVQ  EQU   2                     HOURS OF ADVERTISING                       
HRSSQN   DS    XL1                 SEQUENCE NUMBER                              
*                                                                               
         DS    XL4                 SPARE                                        
*                                                                               
HRSVLEN  DS    XL1                 LENGTH OF DATA AT HRSDATA                    
*                                                                               
HRSFXLN  EQU   *-HRSELD            ELEMENT FIXED LENGTH                         
*                                                                               
HRSDATA  DS    0X                  START OF HOURS DATA                          
*                                                                               
HRSDTLS  DS    0XL6                DETAILS FOR EACH SET OF HOURS                
HRSCTL   DS    XL1                 CONTROL BYTE                                 
HRSCSICQ EQU   X'80'                 START TIME IS AN IC                        
HRSCEICQ EQU   X'40'                 END   TIME IS AN IC                        
HRSCDICQ EQU   X'20'                 DAYS       IS AN IC                        
HRSDAYS  DS    XL1                 DAYS IN STANDARD BIT FORMAT                  
HRSSTTM  DS    XL2                 START TIME - MILITARY FORMAT                 
HRSSTEN  DS    XL2                 END   TIME - MILITARY FORMAT                 
*                                                                               
         EJECT                                                                  
*                                  PUB HEADER ELEMENT                           
*                                  ------------------                           
PHDELD   DSECT                                                                  
PHDELEM  DS    XL1                 ELEMENT GROUP CODE                           
PHDELEML DS    XL1                 ELEMENT LENGTH                               
PHDLINK  DS    XL1                 LINK                                         
PHDELTYP DS    XL1                 ELEMENT TYPE CODE                            
PHDSTDT  DS    XL2                 START (EFFECTIVE) DATE                       
PHDENDT  DS    XL2                 END DATE                                     
PHDCTRY  DS    XL2                 COUNTRY                                      
*                                                                               
         DS    XL3                 SPARE                                        
*                                                                               
PHDESTDI DS    XL1                 INDICATOR FOR DATE ESTABLISHED               
*                                    X'80' =PHDESTDT IS YL2(YEAR ALONE)         
PHDESTDT DS    XL2                 DATE ESTABLISHED                             
PHDKILDT DS    XL2                 KILL DATE                                    
         DS    XL1                 SPARE                                        
PHDSTYP  DS    XL1                 SUPPLIER TYPE                                
PHDCURP  DS    XL2                 CURRENCY FOR PRICE                           
         DS    XL1                 SPARE                                        
PHDMTYP  DS    XL1                 MEDIA TYPE                                   
PHDCLUB  DS    XL1                 READING CLUB                                 
PHDBLD   DS    XL1                 BLEED AVAILABILITY                           
PHDCLR   DS    XL1                 COLOR AVAILABILITY                           
PHDSPRI  DS    XL4                 SUBSCRIPTION PRICE                           
PHDIPRI  DS    XL4                 ISSUE PRICE                                  
PHDDIST  DS    XL1                 DISTRIBUTION (PAID,FREE,ETC)                 
PHDINSA  DS    XL1                 INSERTS AVAILABLE                            
PHDFREQ  DS    XL1                 FREQUENCY OF PUBLICATION                     
PHDIDOM  DS    XL1                 DATE OF MONTH  (01-31)                       
*                                    X'8N' = NTH DAY OF WEEK OF MONTH           
PHDIDAYS DS    XL1                 DAYS OF WEEK ISSUED                          
*                                  X'40-01' = MON-SUN, 80=EXCEPT, OR            
*                                  1-7 = MON-SUN IF PHDIDOM = X'8N'             
PHDIMTHS DS    XL2                 MONTHS OF YEAR ISSUED                        
*                                  LOW 12 BITS, X'80'='EXCEPT'                  
PHDME    DS    XL1                 MORNING/EVENING                              
PHDIDOM2 DS    XL1                 2ND DATE OF MONTH (SEE PHDIDOM)              
PHDIDYS2 DS    XL1                 2ND DAYS OF WEEK  (SEE PHDIDAYS)             
         DS    XL7                 SPARE                                        
*                                                                               
         ORG   PHDCLUB  *POSTER*   FOR POSTER SUPPLIERS, REDEFINE               
PHDPSTR  DS    XL28                FROM HERE ON                                 
*                                  AT PRESENT, NO SPECIAL POSTER DATA           
PHDELLN  EQU    *-PHDELEM                                                       
         SPACE 2                                                                
         EJECT                                                                  
*                                  EDITION HEADER ELEMENT                       
*                                  ------------------                           
EDIELD   DSECT                                                                  
EDIELEM  DS    XL1                 ELEMENT GROUP CODE                           
EDIELEML DS    XL1                 ELEMENT LENGTH                               
EDILINK  DS    XL1                 LINK                                         
EDIELTYP DS    XL1                 ELEMENT TYPE CODE                            
EDIEDIIC DS    XL2                 EDITION ICODE                                
         DS    XL1                 SPARE                                        
*                                                                               
         DS    XL6                 SPARE                                        
*                                                                               
EDIESTDI DS    XL1                 INDICATOR FOR DATE ESTABLISHED               
*                                    X'80' =EDIESTDT IS YL2(YEAR ALONE)         
EDIESTDT DS    XL2                 DATE ESTABLISHED                             
EDIKILDT DS    XL2                 KILL DATE                                    
         DS    XL2                 SPARE                                        
EDICURP  DS    XL2                 CURRENCY FOR PRICE                           
         DS    XL3                 SPARE                                        
EDIBLD   DS    XL1                 BLEED AVAILABILITY                           
EDICLR   DS    XL1                 COLOR AVAILABILITY                           
EDISPRI  DS    XL4                 SUBSCRIPTION PRICE                           
EDIIPRI  DS    XL4                 ISSUE PRICE                                  
EDIDIST  DS    XL1                 DISTRIBUTION (PAID,FREE,ETC)                 
EDIINSA  DS    XL1                 INSERTS AVAILABLE                            
*                                                                               
EDIFREQ  DS    XL1                 FREQUENCY OF PUBLICATION                     
EDIIDOM  DS    XL1                 DATE OF MONTH  (01-31)                       
*                                    X'8N' = NTH DAY OF WEEK OF MONTH           
EDIIDAYS DS    XL1                 DAYS OF WEEK ISSUED                          
*                                  X'40-01' = MON-SUN, 80=EXCEPT, OR            
*                                  1-7 = MON-SUN IF EDIIDOM = X'8N'             
EDIIMTHS DS    XL2                 MONTHS OF YEAR ISSUED                        
*                                  LOW 12 BITS, X'80'='EXCEPT'                  
EDIME    DS    XL1                 MORNING/EVENING                              
EDIIDOM2 DS    XL1                 2ND DATE OF MONTH (SEE EDIIDOM)              
EDIIDYS2 DS    XL1                 2ND DAYS OF WEEK  (SEE EDIIDAYS)             
         DS    XL7                 SPARE                                        
EDIELLN  EQU    *-EDIELEM                                                       
         SPACE 2                                                                
*                                  GEOGRAPHIC ASSIGNMENT ELEMENT                
*                                  -----------------------------                
GEAELD   DSECT                                                                  
GEAELEM  DS    XL1                 ELEMENT GROUP CODE                           
GEAELEML DS    XL1                 ELEMENT LENGTH                               
GEALINK  DS    XL1                 LINK                                         
GEAELTYP DS    XL1                 ELEMENT TYPE CODE                            
GEAASIC  DS    XL2                 AREA SET IC                                  
GEAACOD  DS    XL8                 AREA CODE                                    
         DS    XL2                 SPARE                                        
GEAELLN  EQU    *-GEAELEM                                                       
         EJECT                                                                  
*                                  CONTROL ELEMENT                              
*                                  ---------------                              
MBCELD   DSECT                                                                  
MBCELEM  DS    XL1                 ELEMENT GROUP CODE                           
MBCELEML DS    XL1                 ELEMENT LENGTH                               
MBCLINK  DS    XL1                 LINK                                         
MBCELTYP DS    XL1                 ELEMENT TYPE CODE                            
MBCUCDCM DS    XL1                 UPDATE CYCLE DATE - MONTH                    
MBCUCDCD DS    XL1                                   - DAY                      
MBCUCF   DS    XL1                 UPDATE CYCLE FREQ- # OF MONTHS               
MBCURD   DS    XL2                 DATA LAST UDPATE RECEIVED                    
MBCCNTL  DS    XL1                 CONTROL BYTE                                 
MBCMANQ  EQU   X'80'                -DATA FROM EXTERNAL SOURCE                  
*                                    IS MANUALLY MAINTAINED                     
*        NOTE - FIELDS BELOW PRESENT ONLY IF ELEM LENGTH > 15                   
MBCIPTR  DS    XL2                 INPUTTER IC                                  
MBCIPDT  DS    XL2                 INPUT DATE                                   
MBCCHKR  DS    XL2                 CHECKER IC                                   
MBCCHDT  DS    XL2                 CHECKED DATE                                 
MBCPRI   DS    XL1                 PRIORITY                                     
*                                                                               
         DS    XL9                 SPARE                                        
MBCELLN  EQU    *-MBCELEM                                                       
*                                  REQUEST HISTORY ELEMENT                      
*                                  -----------------------                      
*                                                                               
*      **THIS ELEMENT IS CREATED FOR EACH REQUEST LETTER PRODUCED**             
*                                                                               
MBRELD   DSECT                                                                  
MBRELEM  DS    XL1                 ELEMENT GROUP CODE                           
MBRELEML DS    XL1                 ELEMENT LENGTH                               
MBRLINK  DS    XL1                 LINK                                         
MBRELTYP DS    XL1                 ELEMENT TYPE CODE                            
MBRDATE  DS    XL2                 DATE REQUEST SENT                            
MBRTYPE  DS    XL1                 TYPE OF REQUEST                              
         DS    XL4                 SPARE                                        
MBRELLN  EQU    *-MBRELEM                                                       
         EJECT                                                                  
*                                  CIRCULATION HEADER ELEMENT                   
*                                  --------------------------                   
CHDELD   DSECT                                                                  
CHDELEM  DS    XL1                 ELEMENT GROUP                                
CHDELEML DS    XL1                 ELEMENT LENGTH                               
CHDLINK  DS    XL1                 LINK                                         
CHDELTYP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3                 KEY FILLER                                   
CHDSTDT  DS    XL2                 START DATE                                   
CHDENDT  DS    XL2                 END DATE                                     
CHDSRC   DS    XL1                 CIRC SOURCE (IC)                             
CHDFMT   DS    XL1                 CIRC FORMAT (IC)                             
CHDISRC  DS    XL1                 CIRC INPUT SOURCE (IC)                       
         DS    XL4                 SPARE                                        
CHDELLN  EQU    *-CHDELEM                                                       
         SPACE 2                                                                
*                                  CIRCULATION VALUE ELEMENT                    
*                                  -------------------------                    
CRCELD   DSECT                                                                  
CRCELEM  DS    XL1                 ELEMENT GROUP CODE                           
CRCELEML DS    XL1                 ELEMENT LENGTH                               
CRCLINK  DS    XL1                 LINK                                         
CRCELTYP DS    XL1                 ELEMENT TYPE CODE                            
*                                                                               
*        UK FORMAT - TYPE,SUB-TYPE,GEO (1,0,1 = TOTAL)                          
*                                                                               
CRCCTP   DS    XL1                 CIRCULATION TYPE                             
CRCTTOTQ EQU   1                   TOTAL CIRCULATION                            
CRCTPDQ  EQU   2                   PAID CIRCULATION                             
CRCTUPDQ EQU   3                   OTHER UNPAID CIRCULATION                     
CRCTSOCQ EQU   4                   SOCIETY                                      
CRCTCTLQ EQU   5                   CONTROLLED                                   
CRCTCFDQ EQU   6                   CERTIFIED AVERAGE NET DISTRIBUTION           
CRCTPAGQ EQU   7                   AVERAGE PAGINATION                           
CRCTAPCQ EQU   8                   AVERAGE % ADVERTISING CONTENT                
CRCTNISQ EQU   9                   NUMBER OF ISSUES                             
CRCTPTSQ EQU   10                  DISTRIBUTION POINTS PER ISSUE                
*              X'80' BIT ON MEANS MONTH 1 - 12 IN LOW NIBBLE                    
*                                                                               
CRCSTP   DS    XL1                 CIRCULATION SUB-TYPE                         
*                                  NULL=TOTAL                                   
CRCSNWSQ EQU   1                   NEWSTANDS                                    
CRCSSUBQ EQU   2                   SUBSCRIPTIONS                                
CRCSREQQ EQU   3                   REQUESTED                                    
CRCSNRQQ EQU   4                   NON-REQUESTED                                
*                                                                               
CRCGEO   DS    XL1                 GEOGRAPHIC BREAK OUT                         
CRCGTOTQ EQU   1                   WORLD TOTAL                                  
CRCGHOMQ EQU   2                   HOME COUNTRY                                 
CRCGABRQ EQU   3                   ABROAD                                       
*                                                                               
*        DEUTSCHLAND FORMAT - SEQUENCE,GEO,SUB-TYPE (1,0,1 = TOTAL)             
*                                                                               
         ORG   CRCCTP                                                           
CRCDSQN  DS    XL1                 SEQUENCE NUMBER                              
*                                  STARTS WITH 128 TO KEEP OUT OF               
*                                  UK FORMAT'S WAY                              
CRCDCTRY DS    XL1                 COUNTRY                                      
*                                                                               
*    **  NOTE- THERE ARE ALSO EQUATES FOR THESE VALUES IN MBGLOBEQUS            
*              UNDER MBQCNTRY                                                   
*                                                                               
CRCDGBRQ EQU   1 *  LOW NUMBERED   GREAT BRITAIN                                
CRCDUSAQ EQU   2 *  COUNTRIES      US                                           
CRCDGERQ EQU   3 *  FOLLOW         GERMANY                                      
CRCDFRAQ EQU   4 *  DDCTRYEQUS     FRANCE                                       
CRCDSPAQ EQU   5 *  CONVENTIONS    SPAIN                                        
CRCDITAQ EQU   6 *                 ITALY                                        
CRCDHOLQ EQU   7 *                 HOLLAND                                      
CRCDCANQ EQU   8 *                 CANADA                                       
CRCDSWIQ EQU   20                  SWITZERLAND                                  
CRCDAUSQ EQU   21                  AUSTRIA                                      
*                                                                               
CRCDCTP  DS    XL1                 CIRCULATION SUB TYPE                         
CRCDTOTQ EQU   1                   TOTAL                                        
CRCDPRTQ EQU   17                  PRINTED                                      
CRCDSUBQ EQU   18                  SUBSCRIPTION                                 
CRCDPURQ EQU   19                  PURCHASED                                    
CRCDDISQ EQU   20                  DISTRIBUTED                                  
         ORG                                                                    
CRCVAL   DS    XL4                 VALUE                                        
CRCDAYS  DS    XL1                 DAYS OF THE WEEK                             
         DS    XL1                 SPARE                                        
CRCELLN  EQU    *-CRCELEM                                                       
         EJECT                                                                  
*                                  ADDRESS HEADER ELEMENT                       
*                                  ----------------------                       
ADHELD   DSECT                                                                  
ADHELEM  DS    XL1                 ELEMENT GROUP                                
ADHELEML DS    XL1                 ELEMENT LENGTH                               
ADHLINK  DS    XL1                 LINK VALUE                                   
ADHELTYP DS    XL1                 ELEMENT TYPE                                 
         DS    XL3                 'KEY' SPARE                                  
ADHLOC   DS    CL20                LOCATION CODE                                
ADHUSE   DS    XL1                 ADDRESS USE                                  
AUSESLSQ EQU   X'80'                 SALES/MAIN                                 
AUSEORDQ EQU   X'40'                 ORDER                                      
AUSECPYQ EQU   X'20'                 COPY                                       
AUSEPAYQ EQU   X'10'                 PAYMENT                                    
AUSEZIPQ EQU   X'08'                 GERMAN ADDRESS THAT IS POSTAL CODE         
AUSEVLGQ EQU   X'04'                 GERMAN PUBLISHER ADDRESS                   
*                                      ONLY                                     
*                                                                               
ADHKILL  DS    XL2                 KILL DATE                                    
ADHSRCE  DS    0XL9                SOURCE OF ADDRESS (MAY BE NULL)              
ADHSMRCD DS    XL1                   -MAIN RECORD TYPE                          
ADHSMBN  DS    XL3                   -MEDIABASE NUMBER                          
ADHSLNK  DS    XL1                   -LINK VALUE                                
         DS    XL4                   -SPARE                                     
         DS    XL4                 SPARE                                        
ADHFXLN  EQU   *-ADHELEM           FIXED LENGTH                                 
*                                                                               
*  NOTE- IF AN ADDRESS SOURCE IS PRESENT IN THE HEADER THE ONLY TEXT            
*        ELEMENTS SHOULD BE FOR CONTACT OVERRIDES.                              
         SPACE 2                                                                
*                                  PERSONEL ELEMENT                             
*                                  ----------------                             
PERELD   DSECT                                                                  
PERELEM  DS    XL1                                                              
PERELEML DS    XL1                 ELEMENT LENGTH                               
PERLINK  DS    XL1                 LINK VALUE                                   
PERELTYP DS    XL1                 ELEMENT TYPE                                 
PERSQN   DS    XL2                 SEQUENCE NUMBER                              
*                                                                               
PERTIC   DS    XL2                 TITLE (IC)                                   
         DS    XL4                 SPARE                                        
PERTTLL  DS    XL1                 LENGTH OF TITLE                              
PERNAML  DS    XL1                 LENGTH OF NAME                               
PERTELL  DS    XL1                 LENGTH OF TELEPHONE                          
PERFXLN  EQU   *-PERELEM           FIXED LENGTH                                 
*                                                                               
PERDATA  DS    0C                  EXTRA DATA 1) TITLE                          
*                                             2) NAME                           
*                                             3) TELEPHONE                      
         EJECT                                                                  
*                                  QUALIFIER DEFINITION ELEMENT                 
*                                  ----------------------------                 
QLRELD   DSECT                                                                  
QLRELEM  DS    XL1                                                              
QLRELEML DS    XL1                 ELEMENT LENGTH                               
QLRQTIC  DS    XL1                 QUALIFIER TYPE IC                            
QLRQVIC  DS    XL2                 VALUE IC                                     
QLRGLOBL DS    XL2                 GLOBOAL IC, FOR HYBRIDS                      
QLRSHRT  DS    CL4                 SHORT NAME                                   
QLRCTYP  DS    XL1                 CARD TYPE MASK                               
QLRCTL   DS    XL1                 CONTROL BYTE                                 
QLRDELQ  EQU   X'80'                 DELETED                                    
QLRVLEN  DS    XL1                 LENGTH OF VALUE                              
QLRQLYL  DS    XL1                 LENGTH OF QUALIFIER SUFFIX                   
QLRMINO  DS    XL1                 MINIMUM OUTPUT LENGTH                        
         DS    XL1                 SPARE                                        
QLRFXLN  EQU   *-QLRELEM           FIXED LENGTH                                 
*                                                                               
QLRVAL   DS    0X                  VALUE                                        
*                                                                               
*  NOTE- ELEMENT MAY CONTINUE WITH A QUALIFIER SUFFIX.                          
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*        -- OWNER HEADER RECORD ELEMENTS --                           *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
*                        ELEMENT GROUP/TYPE                                     
*                        ------------------                                     
*                                                                               
         SPACE 1                                                                
OHDELGQ  EQU   X'11'     OWNER HEADER GROUP                                     
*                                                                               
*        TEXT ELEMENTS    -MNEMONIC (ABBR)    (1X8)                             
*                         -NAME               (1X40)                            
*                         -NOTES              (5X70)                            
*        (NO QUALIFYING ELEMENTS)                                               
         SPACE 2                                                                
*                                                                               
* ALSO   ADDELGQ         ADDRESS ELEMENT GROUP (SEE PUB HEADER RECORD)          
*        MSCELGQ         MISCELLANEOUS   GROUP (SEE PUB HEADER RECORD)          
*        PERELEM         PERSONEL ELEMENT            ''                         
*                                                                               
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
*        -- REP HEADER RECORD ELEMENTS --                             *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
*                        ELEMENT GROUP/TYPE                                     
*                        ------------------                                     
*                                                                               
         SPACE 1                                                                
RHDELGQ  EQU   X'11'     REP HEADER GROUP                                       
*                                                                               
*        TEXT ELEMENTS    -MNEMONIC (ABBR)    (1X8)                             
*                         -NAME               (1X40)                            
*                         -NOTES              (5X70)                            
*        (NO QUALIFYING ELEMENTS)                                               
         SPACE 2                                                                
*                                                                               
* ALSO   ADDELGQ         ADDRESS ELEMENT GROUP (SEE PUB HEADER RECORD)          
*        MSCELGQ         MISCELLANEOUS   GROUP (SEE PUB HEADER RECORD)          
*        PERELEM         PERSONEL ELEMENT            ''                         
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*        -- EDITORIAL GROUP RECORD ELEMENTS --                        *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
*                        ELEMENT GROUP/TYPE                                     
*                        ------------------                                     
*                                                                               
         SPACE 1                                                                
EHDELGQ  EQU   X'11'     EDITORIAL GROUP HEADER ELEMENT GROUP                   
*                                                                               
*        TEXT ELEMENTS    -MNEMONIC (ABBR)    (1X8)                             
*                         -NAME               (1X40)                            
*                         -ASSOCIATED NAMES   (NX40)                            
*                         -NOTES              (NX40)                            
*        ITEM ELEMENTS    -RELATED GROUPS     (MBNUM)                           
*                         -CLASSIFICATION     (IC)                              
*        (NO QUALIFYING ELEMENTS)                                               
* NOTE - CLASSIFICATION IS ALSO HELD IN THE STATUS BYTES                        
         SPACE 2                                                                
*                                                                               
*ALSO    MSCELGQ         MISCELLANEOUS   GROUP (SEE PUB HEADER RECORD)          
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*     -- PERSONEL RECORD --                                           *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
*                        ELEMENT GROUP/TYPE                                     
*                        ------------------                                     
*                                                                               
         SPACE 1                                                                
PEHDELGQ EQU   X'11'     PERSONEL HEADER ELEMENT GROUP                          
*                                                                               
*        TEXT ELEMENTS    -MNEMONIC (ABBR)    (1X8)                             
*                         -NAME               (1X40)                            
*                         -PERSONAL TITLE     (1X40)                            
*                         -NOTES              (5X70)                            
*        (NO QUALIFYING ELEMENTS)                                               
         SPACE 1                                                                
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*        -- MECHANICAL RECORD ELEMENTS --                             *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
*                        ELEMENT GROUP/TYPE                                     
*                        ------------------                                     
         SPACE 1                                                                
MCHELGQ  EQU   X'21'     MECHANICALS HEADER                                     
MCHELTQ  EQU   X'31'      -MECHANICALS HEADER                                   
         SPACE 1                                                                
         SPACE 1                                                                
CLMELGQ  EQU   X'22'     COLUMN DATA                                            
CLHELTQ  EQU   X'31'       COLUMN DATA HEADER                                   
CLOELTQ  EQU   X'32'       OVERRIDES FOR COLUMN WIDTH AND MINIMUM DEPTH         
*        TEXT ELEMENT     -COLUMN NOTES       (5X70)                            
*        QUALIFYING ELEMENT                                                     
         SPACE 2                                                                
SIZELGQ  EQU   X'23'     SIZE                                                   
SZHELTQ  EQU   X'31'      -SIZE DATA HEADER                                     
SIZELTQ  EQU   X'32'      -SIZE DETAIL                                          
*        TEXT ELEMENT     -SIZE NOTES         (5X70)                            
*        QUALIFYING ELEMENT                                                     
         SPACE 2                                                                
BLDELGQ  EQU   X'24'     BLEED DATA                                             
BLHELTQ  EQU   X'31'      -BLEED HEADER                                         
BLSELTQ  EQU   X'32'      -BLEED SPACE DATA                                     
*        TEXT ELEMENT     -BLEED NOTES        (5X70)                            
*        QUALIFYING ELEMENT                                                     
         SPACE 2                                                                
PSPELGQ  EQU   X'25'     PRINTING SPECS                                         
*        TEXT ELEMENTS    -FOR VARIOUS SPEC TYPE DATA  (NX70)                   
*        QUALIFYING ELEMENT                                                     
*                                                                               
*ALSO    MSCELGQ  X'1A'  MISCELLANEOUS   GROUP (SEE PUB HEADER RECORD)          
         EJECT                                                                  
*                                  MECHANICALS HEADER ELEMENT                   
*                                  --------------------------                   
MCHELD   DSECT                                                                  
MCHELEM  DS    XL1                 ELEMENT GROUP CODE                           
MCHELEML DS    XL1                 ELEMENT LENGTH                               
MCHLINK  DS    XL1                 LINK - ALWAYS '1'                            
MCHELTYP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3'00'             SPARE                                        
MCHCNTL  DS    XL1                 CONTROL BYTE                                 
MCHCMANQ EQU   X'80'                -DATA FROM EXTERNAL SOURCE                  
*                                    IS MANUALLY MAINTAINED                     
         DS    XL19                SPARE                                        
MCHELLN  EQU    *-MCHELEM          ELEMENT LENGTH                               
         SPACE 2                                                                
*                                  COLUMN DATA HEADER ELEMENT                   
*                                  --------------------------                   
CLHELD   DSECT                                                                  
CLHELEM  DS    XL1                 ELEMENT GROUP CODE                           
CLHELEML DS    XL1                 LENGTH OF ELEMENT                            
CLHLINK  DS    XL1                 LINK                                         
CLHELTYP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3'00'             SPARE                                        
CLHNCOL  DS    XL1                 NUMBER OF COLUMNS                            
CLHUNIT  DS    XL2                 UNIT OF MEASURE (IC)                         
CLHLEN   DS    XL4                 COLUMN LENGTH           -NOTE                
CLHLENUN DS    XL2                 UNIT OF MEASURE (IC) - OVERRIDE              
CLHWID   DS    XL4                 COLUMN WIDTH             ''                  
CLHWIDUN DS    XL2                 UNIT OF MEASURE (IC) - OVERRIDE              
CLHICG   DS    XL4                 INTER-COLUMN GAP          ''                 
CLHICGUN DS    XL2                 UNIT OF MEASURE (IC) - OVERRIDE              
CLHFCC   DS    XL4                 LEN FOR FULL CLM CHARGE   ''                 
CLHFCCUN DS    XL2                 UNIT OF MEASURE (IC) - OVERRIDE              
         DS    XL8                 SPARE                                        
CLHELLN  EQU    *-CLHELEM          ELEMENT LENGTH                               
         SPACE 2                                                                
*                                  COLUMN OVERRIDE ELEMENT                      
*                                  -----------------------------                
CLOELD   DSECT                                                                  
CLOELEM  DS    XL1                 ELEMENT GROUP CODE                           
CLOELEML DS    XL1                 LENGTH OF ELEMENT                            
CLOLINK  DS    XL1                 LINK                                         
CLOELTYP DS    XL1                 ELEMENT TYPE CODE                            
CLOCLMNO DS    XL1                 NUMBER OF COLUMNS                            
         DS    XL2'00'             SPARE                                        
CLOWID   DS    XL4                 WIDTH                    -NOTE               
CLOWIDUN DS    XL2                 WIDTH UNIT OVERRIDE                          
CLOMIND  DS    XL4                 MINIMUM DEPTH            -NOTE               
CLOMINDU DS    XL2                 MINIMUM DEPTH UNIT OVERRIDE                  
         DS    XL6                 SPARE                                        
CLOELLN  EQU    *-CLOELEM          ELEMENT LENGTH                               
         EJECT                                                                  
*                                  SPACE SIZE HEADER ELEMENT                    
*                                  ------------------                           
SZHELD   DSECT                                                                  
SZHELEM  DS    XL1                 ELEMENT GROUP CODE                           
SZHELEML DS    XL1                 LENGTH OF ELEMENT                            
SZHLINK  DS    XL1                 LINK                                         
SZHELTYP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3'00'             SPARE                                        
*                                                                               
SZHUNIT  DS    XL1                 UNIT OF MEASURE                              
*                                                                               
SZHTHZUN DS    XL1                 TRIM WIDTH  UNITS OVERRIDE                   
SZHTHZ   DS    XL4                 TRIM WIDTH          -NOTE                    
SZHTVTUN DS    XL1                 TRIM HEIGHT UNITS OVERRIDE                   
SZHTVT   DS    XL4                 TRIM HEIGHT           ''                     
SZHDHZUN DS    XL1                 DOUBLE TRIM WIDTH  UNITS OVERRIDE            
SZHDHZ   DS    XL4                 DOUBLE TRIM WIDTH          -NOTE             
SZHDVTUN DS    XL1                 DOUBLE TRIM HEIGHT UNITS OVERRIDE            
SZHDVT   DS    XL4                 DOUBLE TRIM HEIGHT           ''              
         DS    XL4                 SPARE                                        
SZHELLN  EQU   *-SZHELEM           ELEMENT LENGTH                               
         SPACE 2                                                                
*                                  SPACE SIZE DETAIL ELEMENT                    
*                                  ------------------                           
SIZELD   DSECT                                                                  
SIZELEM  DS    XL1                 ELEMENT GROUP CODE                           
SIZELEML DS    XL1                 LENGTH OF ELEMENT                            
SIZLINK  DS    XL1                 LINK                                         
SIZELTYP DS    XL1                 ELEMENT TYPE CODE                            
SIZSQN   DS    XL2                 SEQUENCE NUMBER                              
         DS    XL1                 SPARE                                        
*                                                                               
SIZHZUN  DS    XL1                 HORIZONTAL DIMENSION UNIT OVERRIDE           
SIZHZ    DS    XL4                 HORIZONTAL DIMENSION                         
SIZVTUN  DS    XL1                 VERTICAL   DIMENSION UNIT OVERRIDE           
SIZVT    DS    XL4                 VERTICAL   DIMENSION                         
         DS    XL8                 SPARE                                        
*                                                                               
SIZSPC   DS    0XL14               SPACE DESCRIPTION                            
SIZUN1   DS    XL1                   DIMENSION 1 -UNITS                         
SIZSZ1   DS    XL4                               -SIZE                          
SIZUN2   DS    XL1                   DIMENSION 2 -UNITS                         
SIZSZ2   DS    XL4                               -SIZE                          
         DS    XL3                 SPARE                                        
SIZSQOVR DS    XL1                 SEQUENCE OVERRIDE                            
*                                                                               
SIZTXTL  DS    XL1                 LENGTH OF SPACE TEXT                         
SIZQLYL  DS    XL1                 LENGTH OF QUALIFYING SUFFIX                  
         DS    XL6                 SPARE                                        
SIZFXLN  EQU   *-SIZELEM           FIXED ELEMENT LENGTH                         
SIZEXTRA DS    0X                  EXTRA DATA                                   
*                                                                               
*  NOTE- IF SIZTXTL  IS NON-ZERO, ADDITIONAL SPACE DESCRIPTION TEXT             
*        WILL BE AT SIZEXTRA.                                                   
*  NOTE- IF SIZQLYL IS NON-ZERO, A QUALIFYING SUFFIX WILL FOLLOW                
*        TEXT (IF ANY) AT SIZEXTRA.                                             
         EJECT                                                                  
*                                  BLEED HEADER ELEMENT                         
*                                  --------------------                         
BLHELD   DSECT                                                                  
BLHELEM  DS    XL1                 ELEMENT GROUP CODE                           
BLHELEML DS    XL1                 LENGTH OF ELEMENT                            
BLHLINK  DS    XL1                 LINK                                         
BLHELTYP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3'00'             SPARE                                        
BLHUNIT  DS    XL1                 UNIT OF MEASURE                              
BLHAHZUN DS    XL1                 BLEED AREA HORIZONTAL UNIT OVERRRIDE         
BLHAHZ   DS    XL4                 BLEED AREA HORIZONTAL    -NOTE               
BLHAVTUN DS    XL1                 BLEED AREA VERTICAL   UNIT OVERRRIDE         
BLHAVT   DS    XL4                 BLEED AREA VERTICAL      -NOTE               
BLHTOPUN DS    XL1                 BLEED MARGIN- TOP     UNIT OVERRRIDE         
BLHTOP   DS    XL4                 BLEED MARGIN- TOP        -NOTE               
BLHBOTUN DS    XL1                             - BOTTOM  UNIT OVERRIDE          
BLHBOT   DS    XL4                             - BOTTOM       ''                
BLHOUTUN DS    XL1                             - OUTSIDE UNIT OVERRIDE          
BLHOUT   DS    XL4                             - OUTSIDE      ''                
BLHGUTUN DS    XL1                             - GUTTER  UNIT OVERRIDE          
BLHGUT   DS    XL4                             - GUTTER       ''                
         DS    XL12                SPARE                                        
BLHELLN  EQU    *-BLHELEM          ELEMENT LENGTH                               
         SPACE 2                                                                
* NOTE - MEASUREMENT VALUES ARE AS FOLLOWS-                                     
*                                                                               
*       -IF X'80' IN BYTE 0, VALUE IS A FRACTION. BYTES 0-1 HAVE THE            
*        INTEGRAL PART, BYTE 2 THE NUMERATOR, BYTE 3 THE DENOMINATOR.           
*                                                                               
*       -OTHERWISE, VALUE IS FULL WORD WITH 5 IMPLIED DECIMAL PLACES.           
         EJECT                                                                  
*                                  BLEED SPACE DETAIL ELEMENT                   
*                                  ------------------                           
BLSELD   DSECT                                                                  
BLSELEM  DS    XL1                 ELEMENT GROUP CODE                           
BLSELEML DS    XL1                 LENGTH OF ELEMENT                            
BLSLINK  DS    XL1                 LINK                                         
BLSELTYP DS    XL1                 ELEMENT TYPE CODE                            
BLSSQN   DS    XL2                 SEQUENCE NUMBER                              
         DS    XL1                 SPARE                                        
*                                                                               
BLSHZUN  DS    XL1                 HORIZONTAL DIMENSION UNIT OVERRIDE           
BLSHZ    DS    XL4                 HORIZONTAL DIMENSION                         
BLSVTUN  DS    XL1                 VERTICAL   DIMENSION UNIT OVERRIDE           
BLSVT    DS    XL4                 VERTICAL   DIMENSION                         
         DS    XL8                 SPARE                                        
*                                                                               
BLSSPC   DS    0XL14               SPACE DESCRIPTION                            
BLSUN1   DS    XL1                   DIMENSION 1 -UNITS                         
BLSSZ1   DS    XL4                               -SIZE                          
BLSUN2   DS    XL1                   DIMENSION 2 -UNITS                         
BLSSZ2   DS    XL4                               -SIZE                          
         DS    XL3                 SPARE                                        
BLSSQOVR DS    XL1                 SEQUENCE OVERRIDE                            
*                                                                               
BLSTXTL  DS    XL1                 LENGTH OF SPACE TEXT                         
BLSQLYL  DS    XL1                 LENGTH OF QUALIFYING SUFFIX                  
         DS    XL6                 SPARE                                        
BLSFXLN  EQU   *-BLSELEM           FIXED ELEMENT LENGTH                         
BLSEXTRA DS    0X                  EXTRA DATA                                   
*                                                                               
*  NOTE- IF BLSTXTL  IS NON-ZERO, ADDITIONAL SPACE DESCRIPTION TEXT             
*        WILL BE AT BLSEXTRA.                                                   
*  NOTE- IF BLSQLYL IS NON-ZERO, A QUALIFYING SUFFIX WILL FOLLOW                
*        TEXT (IF ANY) AT BLSEXTRA.                                             
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*        -- RATE CARD ELEMENTS --                                     *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
*                        ELEMENT GROUP/TYPE                                     
*                        ------------------                                     
         SPACE 1                                                                
RCHELGQ  EQU   X'31'     RATE CARD HEADER                                       
RCHELTQ  EQU   X'31'      -RATE CARD HEADER                                     
TMSELTQ  EQU   X'34'      -TERMS (AND CASH DISCOUNT) ELEM                       
*        TEXT ELEMENTS    -CARD HEADER NOTES  (5X70)                            
*                                                                               
BSRELGQ  EQU   X'32'     BASIC SPACE RATE                                       
BSRELTQ  EQU   X'32'      -BASIC RATE - SPACE                                   
*        TEXT ELEMENTS    -BASIC RATE NOTES   (5X70)                            
*        QUALIFYING ELEMENT                                                     
*                                                                               
BARELGQ  EQU   X'33'     BASIC ADJUSTMENT RATE                                  
BARELTQ  EQU   X'32'      -BASIC RATE - ADJUSTMENT                              
*        TEXT ELEMENTS    -BASIC RATE NOTES   (5X70)                            
*        QUALIFYING ELEMENT                                                     
*                                                                               
DFMELGQ  EQU   X'35'     DATE FORMULA                                           
DFMELTQ  EQU   X'31'     DATE FORMULA                                           
DFOELTQ  EQU   X'32'     DATE FORMULA OVERRIDE                                  
DFHELTQ  EQU   X'33'     DATE FORMULA HEADER                                    
*        TEXT ELEMENTS    -DATE NOTES         (5X70)                            
*        QUALIFYING ELEMENT                                                     
*                                                                               
DLVELGQ  EQU   X'36'     DISCOUNT LEVEL                                         
DLHELTQ  EQU   X'31'      -DISCOUNT LEVEL HEADER                                
DLDELTQ  EQU   X'32'      -DISCOUNT LEVEL DETAIL                                
*        TEXT ELEMENTS    -DISCOUNT NOTES     (5X70)                            
*        QUALIFYING ELEMENT                                                     
*                                                                               
*ALSO    MSCELGQ  X'1A'  MISCELLANEOUS   GROUP (SEE PUB HEADER RECORD)          
*                                                                               
         EJECT                                                                  
*                                  RATE CARD HEADER ELEMENT                     
*                                  ------------------------                     
RCHELD   DSECT                                                                  
RCHELEM  DS    XL1                                                              
RCHELEML DS    XL1                 ELEMENT LENGTH                               
RCHLINK  DS    XL1                 LINK VALUE                                   
RCHELTYP DS    XL1                 ELEM TYPE CODE                               
RCHNUM   DS    CL10                RATE CARD NUMBER                             
RCHDTI   DS    XL2                 DATE ISSUED                                  
RCHCURR  DS    XL2                 CURRENCY FOR RATES                           
RCHACOM  DS    XL4                 AGENCY COMMISSION (NN.NNNNN)                 
RCHDISC  DS    XL4          ****   CASH DISCOUNT     (NN.NNNNN)                 
RCHCTMN  DS    XL1          ****   CD TERMS - MONTH      (SEE DFMELEM)          
RCHCTDT  DS    XL1          ****   CD TERMS - DAY NUMBER      ''                
RCHCTDA  DS    XL1          ****   CD TERMS - DAY VALUE       ''                
RCHVOL   DS    CL6      **PRINT**  STARTING VOLUME NUMBER                       
RCHISS   DS    CL6      **PRINT**  START ISSUE NUMBER                           
RCHLKCS  DS    0XL10               **LOOKUP ALGORITHM CONTROLS**                
RCHROUND DS    XL1                 ROUNDING                                     
*                                    0=NO SPECIAL ROUNDING                      
*                                    1=ROUND TO NEAREST UNIT (EG $)             
*                                    N=TO NEAREST N UNITS, ETC.                 
         ORG   RCHLKCS+L'RCHLKCS                                                
*                                                                               
RCHPTMN  DS    XL1          ****   PAY TERMS - MONTH      (SEE DFMELEM)         
RCHPTDT  DS    XL1          ****   PAY TERMS - DAY NUMBER      ''               
RCHPTDA  DS    XL1          ****   PAY TERMS - DAY VALUE       ''               
*                                                                               
RCHSDT   DS    XL2      **PRINT**  STARTING ISSUE DATE                          
RCHVATM  DS    XL1                 VAT MODE                                     
*                                                                               
RCHCNTL  DS    XL1                 CONTROL BYTE                                 
RCHCMANQ EQU   X'80'                -DATA FROM EXTERNAL SOURCE                  
*                                    IS MANUALLY MAINTAINED                     
RCHEND   DS    XL2                 END DATE - IF ENTERED                        
         DS    XL1                 SPARE                                        
RCHELLN  EQU    *-RCHELEM                                                       
         SPACE 3                                                                
*                                  TERMS/DISCOUNTS ELEMENT                      
*                                  -----------------------                      
TMSELD   DSECT                                                                  
TMSELEM  DS    XL1                                                              
TMSELEML DS    XL1                 ELEMENT LENGTH                               
TMSLINK  DS    XL1                 LINK VALUE (NOT USED)                        
TMSELTYP DS    XL1                 ELEM CODE                                    
TMSPMODE DS    XL1                 PAYMENT MODE                                 
         DS    XL1                 SPARE                                        
TMSSEQ   DS    XL1                 SEQUENCE NUMBER                              
*                                                                               
TMSDAYS  DS    XL1                 NUMBER OF DAYS                               
TMSCTRL  DS    XL1                 CONTROL (IC FROM DATE FORM FRAGS)            
*                                   IF EOM, NEXTEOM, ETC. DAYS=0                
*                                   IF CURR,NEXT,PREV DAYS=DATE OF MTH)         
*                                   IF DAYS, DAYS = +/- NO OF DAYS)             
TMSCD    DS    XL4                 CASH DISCOUNT PERCENT (N.NNNNN)              
         DS    XL2                 SPARE                                        
TMSELLN  EQU   *-TMSELD                                                         
         EJECT                                                                  
*                                                                               
*                                  BASIC RATE - SPACE                           
*                                  ------------------                           
BSRELD   DSECT                                                                  
BSRELEM  DS    XL1                 ELEMENT GROUP CODE                           
BSRELEML DS    XL1                 ELEMENT LENGTH                               
BSRLINK  DS    XL1                 LINK                                         
BSRELTYP DS    XL1                 ELEMENT TYPE CODE                            
BSRSQN   DS    XL2                 SEQUENCE NUMBER                              
         DS    XL1                 SPARE                                        
*                                                                               
BSRRTE   DS    0XL7                RATE DESCRIPTION FIELDS                      
BSRRRTYP DS    XL1                 RATE TYPE                                    
*                                    SEE BARSRTYP FOR DESCRIPTOION              
*                                    IF SPECIAL CODE THEN STORED IN             
*                                      BSRRUNIC                                 
BSRPREC  DS    XL1                 PRECISION - SEE RTVPREC                      
BSRRATE  DS    XL4                 RATE                                         
BSRSCDE  DS    0XL1                IC OF SPECIAL CODE                           
BSRRUNIC DS    XL1                 RATE UNIT OVERRIDE                           
*                                                                               
BSRORTE  DS    0XL7                ORTSPREISE RATE DESCRIPTION FIELDS           
BSRORTYP DS    XL1                 RATE TYPE                                    
*                                    SEE BARSRTYP FOR DESCRIPTOION              
*                                    IF SPECIAL CODE THEN STORED IN             
*                                      BSRRUNIC                                 
BSROPREC DS    XL1                 PRECISION - SEE RTVPREC                      
BSRORATE DS    XL4                 RATE                                         
BSROSCDE DS    0XL1                IC OF SPECIAL CODE                           
BSROUNIC DS    XL1                 RATE UNIT OVERRIDE                           
*                                                                               
         DS    XL2                 SPARE                                        
*                                                                               
BSRSPC   DS    0XL14               SPACE                                        
BSRUN1   DS    XL1                   DIMENSION 1 -UNITS                         
BSRSZ1   DS    XL4                               -SIZE                          
BSRUN2   DS    XL1                   DIMENSION 2 -UNITS                         
BSRSZ2   DS    XL4                               -SIZE                          
BSRNOTE  DS    XL1                 NOTE POINTER                                 
BSRCNTL  DS    XL1                 VARIOUS CONTROLS                             
BSRCLTQ  EQU   X'80'                -SPACE INPUT AS <                           
BSRCGTQ  EQU   X'40'                -SPACE INPUT AS >                           
BSRCEQQ  EQU   X'20'                -SPACE INPUT AS = (WITH < OR >)             
BSRREPL  DS    XL1                 REPLICATION FACTOR                           
BSRSQOVR DS    XL1                 SEQUENCE OVERRIDE                            
*                                                                               
BSRTXTL  DS    XL1                 LENGTH OF SPACE TEXT                         
BSRQLYL  DS    XL1                 LENGTH OF QUALIFYING SUFFIX                  
         DS    XL6                 SPARE                                        
*                                                                               
BSRFXLN  EQU   *-BSRELEM           FIXED ELEMENT LENGTH                         
BSREXTRA DS    0X                  EXTRA DATA                                   
*                                                                               
*  NOTE- IF BSRTXTLN IS NON-ZERO, ADDITIONAL SPACE DESCRIPTION TEXT             
*        WILL BE AT BSREXTRA.                                                   
*  NOTE- IF BSRQLYL IS NON-ZERO, A QUALIFYING SUFFIX WILL FOLLOW                
*        TEXT (IF ANY) AT BSREXTRA.                                             
*                                                                               
*  NOTE- ELEMENT WILL CONTINUE WITH A LIST OF QUALIFYING ITEMS.                 
*        SEE QLYELEM FOR STRUCTURE.                                             
*        USED TO IDENTIFY THE ADJUSTMENT - COLOR, COVER, BLEED, ETC             
*                                                                               
QLYELD   DSECT                     BASIC RATE GROUP DATA IN QLY ELEM            
*                                                                               
         ORG   QLYUSER                                                          
QLYDISCT DS    XL1                 DISCOUNT TYPE                                
QLYDISCL DS    XL3                 DISCOUNT LEVEL                               
QLYDISCD DS    XL1                 DISCOUNT LEVEL DECIMAL PLACES                
         EJECT                                                                  
*                                  BASIC RATE - ADJUSTMENT                      
*                                  -----------------------                      
BARELD   DSECT                                                                  
BARELEM  DS    XL1                 ELEMENT GROUP CODE                           
BARELEML DS    XL1                 ELEMENT LENGTH                               
BARLINK  DS    XL1                 LINK                                         
BARELTYP DS    XL1                 ELEMENT TYPE CODE                            
BARSQN   DS    XL2                 SEQUENCE NUMBER                              
         DS    XL1                 SPARE                                        
*                                                                               
BARSCHG  DS    0XL16               SURCHARGE DATA                               
BARSRTE  DS    0XL8                SURCHARGE RATE                               
BARSRTYP DS    XL1                 RATE TYPE                                    
RATPCTQ  EQU   X'80'                 PERCENT +/-                                
RATAMTQ  EQU   X'40'                 AMOUNT  +/-                                
RATFLTQ  EQU   X'20'                 FLAT AMOUNT                                
RATCODEQ EQU   X'10'                 SPECIAL CODE                               
*                                  FOLLOWING LABELS APPLY DEPENDING ON          
*                                    RATE TYPE IN BARSRTYP                      
BARSCODE DS    0XL1                IC OF SPECIAL CODE                           
BARSPREC DS    XL1                 PRECISION                                    
*                                  NUMBER OF DECIMAL PLACES                     
*                                   NEGATIVES IMPLY SCALING APPLIED             
*                                   I.E. -2 MEANS DATA TO NEAREST 100           
BARSSIGN DS    XL1                 ADJUSTMENT SIGN +, -, =                      
BARSRATE DS    XL4                 RATE                                         
BARSUNIC DS    XL1                 ADJUSTMENT UNIT IC                           
*                                                                               
BARMCHG  DS    0XL5                MINIMUM CHARGE                               
BARMPREC DS    XL1                 PRECISION - SEE BARSPREC                     
BARMRATE DS    XL4                 RATE                                         
*                                                                               
         DS    CL3                 SPARE                                        
*                                                                               
*                                                                               
BAROSCHG DS    0XL16               ORTSPREISE SURCHARGE DATA                    
BAROSRTE DS    0XL8                ORTSPREISE SURCHARGE RATE                    
BAROSRTP DS    XL1                 ORTSPREISE SURCHARGE RATE TYPE               
*                                  FOLLOWING LABELS APPLY DEPENDING ON          
*                                    RATE TYPE IN BAROSRTP                      
BAROSCDE DS    0XL1                ORTSPREISE IC OF SPECIAL CODE                
BAROSPRC DS    XL1                 ORSTPREISE PRECISION (SEE BARSPREC)          
BAROSSGN DS    XL1                 ORTSPREISE ADJUSTMENT SIGN +, -, =           
BAROSRAT DS    XL4                 ORTSPREISE SURCHARGE RATE                    
BAROSUIC DS    XL1                 ORTSPREISE ADJUSTMENT UNIT IC                
*                                                                               
BAROMCHG DS    0XL5                ORTSPREISE MINIMUM CHARGE                    
BAROMPRC DS    XL1                 ORTSPREISE PRECISION - SEE BARSPREC          
BAROMRAT DS    XL4                 ORTSPREISE MINIMUM RATE                      
*                                                                               
         DS    CL3                 SPARE                                        
*                                                                               
*                                                                               
BARMSPC  DS    0XL14               MINIMUM SIZE DESCRIPTION                     
BARMUN1  DS    XL1                   DIMENSION 1 -UNITS                         
BARMSZ1  DS    XL4                               -SIZE                          
BARMUN2  DS    XL1                   DIMENSION 2 -UNITS                         
BARMSZ2  DS    XL4                               -SIZE                          
         DS    XL4                 SPARE                                        
*                                                                               
BAROPTS  DS    XL2                 OPTIONS DATA - BIT ON MEANS OPT=NO           
*                                   SEE MBQAO... FOR EUQATES                    
         DS    XL4                 SPARE                                        
*                                                                               
*                                  ATTRIBUTE REQUIRING RATE ADJUSTMENT          
*                                                                               
BARASPC  DS    0XL14               ATTRIBUTE SPACE DESCRIPTION                  
BARAUN1  DS    XL1                   DIMENSION 1 -UNITS                         
BARASZ1  DS    XL4                               -SIZE                          
BARAUN2  DS    XL1                   DIMENSION 2 -UNITS                         
BARASZ2  DS    XL4                               -SIZE                          
         DS    XL3                 SPARE                                        
BARSQOVR DS    XL1                 SEQUENCE OVERRIDE                            
*                                                                               
BARATXTL DS    XL1                 LENGTH OF SPACE TEXT                         
BARAQLYL DS    XL1                 LENGTH OF QUALIFYING SUFFIX                  
         DS    XL6                 SPARE                                        
BARFXLN  EQU   *-BARELEM           FIXED LENGTH                                 
BARAXTRA DS   0X                   EXTRA DATA                                   
         EJECT                                                                  
*                                  DATE FORMULA ELEMENT                         
*                                  --------------------                         
DFMELD   DSECT                                                                  
DFMELEM  DS    XL1                 ELEMENT GROUP CODE                           
DFMELEML DS    XL1                 ELEMENT LENGTH                               
DFMLINK  DS    XL1                 LINK                                         
DFMELTYP DS    XL1                 ELEMENT TYPE CODE                            
DFMDTIC  DS    XL2                 DATE TYPE                                    
         DS    XL1                 KEY FILLER                                   
*                                                                               
         DS    XL1                 SPARE                                        
DFMMTHN  DS    XL1                 MONTH (-N,0,+N)                              
*                                  X'40' = INPUT WITH +, X'80' = -              
DFMDAYN  DS    XL1                 DAY NUMBER (-N,0,+N)                         
*                                  X'40' = INPUT WITH +, X'80' = -              
DFMDAYV  DS    XL1                 DAY VALUE                                    
*                                    0   = DAY IS DATE/NO. OF DAYS              
*                                    1-7 = MONDAY-SUNDAY                        
*                                    10  = WORKING DAYS                         
*                                    11  = WEEKS                                
DFMTIME  DS    XL2                 HHMM PWOS MILITARY                           
DFMCTL   DS    XL1                 CONTROL                                      
DFMOVRQ  EQU   X'80'                 CALENDAR OVERRIDE EXISTS                   
DFMBASIS DS    XL1                 BASIS DATE FOR FORMULA (NULL=COVER)          
         DS    XL3                 SPARE                                        
DFMELLN  EQU    *-DFMELEM                                                       
         SPACE 2                                                                
*                                  DATE FORMULA OVERRIDE ELEMENT                
*                                  -----------------------------                
DFOELD   DSECT                                                                  
DFOELEM  DS    XL1                 ELEMENT GROUP CODE                           
DFOELEML DS    XL1                 ELEMENT LENGTH                               
DFOLINK  DS    XL1                 LINK                                         
DFOELTYP DS    XL1                 ELEMENT TYPE CODE                            
DFOBAS   DS    XL2                 BASE DATE                                    
DFOSQN   DS    XL1                 SEQUENCE NUMBER                              
*                                                                               
DFOINDS  DS    XL1                 INDICATORS                                   
DFOCANQ  EQU   X'80'               ISSUE CANCELLED                              
DFONEWQ  EQU   X'40'               NEW ISSUE ADDED                              
         DS    XL4                 SPARE                                        
DFOISSL  DS    XL1                 LENGTH OF ISSUE TITLE                        
DFONOVS  DS    XL1                 NUMBER OF OVERRIDES                          
DFOFXLN  EQU   *-DFOELEM           FIXED LENGTH                                 
*                                                                               
DFOISS   DS    0X                  ISSUE TITLE OVERRIDE                         
*                                                                               
DFODDATE DS    0XL3                FOR EACH DATE OVERRIDDEN                     
DFODDTIC DS    XL1                 DATE IC                                      
DFODDTE  DS    XL2                 COMPRESSED DATE                              
*                                                                               
*  NOTE- THE FIRST OVERRIDE DATE MAY BE THE BASE DATE. IF IT IS,                
*        THAT MEANS THE REGULAR BASE DATE IS CHANGED FOR THIS                   
*        ISSUE. IF THE BASE DATE OVERRIDE IS NULL, THAT MEANS THE               
*        ISSUE IS SKIPPED.                                                      
         SPACE 2                                                                
*                                  DATE FORMULA HEADER ELEMENT                  
*                                  -----------------------------                
DFHELD   DSECT                                                                  
DFHELEM  DS    XL1                 ELEMENT GROUP CODE                           
DFHELEML DS    XL1                 ELEMENT LENGTH                               
DFHLINK  DS    XL1                 LINK                                         
DFHELTYP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3                 SPARE                                        
*                                                                               
DFHDETLS DS    0XL9                HEADER DETAILS                               
DFHDTSW  DS    XL1                 AUTO DATES SWITCH                            
DFHNODTQ EQU   C'Y'                NO AUTO DATES TO BE SHOWN                    
         DS    XL8                 SPARE                                        
DFHFXLN  EQU   *-DFHELEM           FIXED LENGTH                                 
*                                                                               
         EJECT                                                                  
*                                  DISCOUNT LEVEL HEADER ELEMENT                
*                                  -----------------------------                
DLHELD   DSECT                                                                  
DLHELEM  DS    XL1                 ELEMENT GROUP CODE                           
DLHELEML DS    XL1                 LENGTH                                       
DLHLINK  DS    XL1                 LINK                                         
DLHELTYP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3                 SPARE                                        
DLHUNIC  DS    XL1                 NULL=%, ELSE IC FOR RATE UNIT TYPE           
DLHPGDEC DS    XL1                 IF DISC LEVS ARE PAGES, THIS IS THE          
*                                  PRECISION OF NUMBER OF PAGES (==3?)          
*                                  (OTHER ALWAYS WHOLE NUMBERS)                 
         DS    XL3                 SPARE                                        
DLHELLN  EQU    *-DLHELEM          ELEMENT LENGTH                               
*                                                                               
         SPACE 2                                                                
*                                  -----------------------------                
*                                  DISCOUNT LEVEL DETAIL ELEMENT                
*                                  -----------------------------                
DLDELD   DSECT                                                                  
DLDELEM  DS    XL1                 ELEMENT GROUP CODE                           
DLDELEML DS    XL1                 LENGTH                                       
DLDLINK  DS    XL1                 LINK                                         
DLDELTYP DS    XL1                 ELEMENT TYPE CODE                            
DLDLEV   DS    XL3                 LEVEL IN WHOLE NUMBERS - EXCEPT              
*                                    X'80' IN HOB MEANS 000'S                   
*                                    FOR PAGES SEE DLHPGDEC (==3?)              
DLDPRATE DS    XL4                 PERCENT DISCOUNT (NN.NN)                     
*                                  OR UNIT RATE (NN.NNNNN)                      
         DS    XL4                 SPARE                                        
DLDELLN  EQU    *-DLDELEM          ELEMENT LENGTH                               
*                                                                               
*        NOTE- THE FIRST BYTE AT QLYUSER IN THE QLYELEM HAS THE                 
*              DISCOUNT LEVEL TYPE. SEE QLYDISCT AT END OF BSRELEM.             
         EJECT                                                                  
***********************************************************************         
*                                                                               
*        -- POSTER TYPE RECORD ELEMENTS --                                      
*           (ANSCHLAG-ART)                                                      
*                                                                               
***********************************************************************         
         SPACE 1                                                                
*                         ELEMENT GROUP/TYPE                                    
*                         ------------------                                    
*                                                                               
PSTHELGQ EQU   X'11'      POSTER TYPE HEADER GROUP                              
PSTHELTQ EQU   X'31'       -HEADER                                              
*                                                                               
*        TEXT ELEMENTS     -MNEMONIC (ABBR)       (1X8)                         
*                          -NAME                  (1X40)                        
*                          -NOTES                 (5X70)                        
*        (NO QUALIFIER ELEMENTS)                                                
*                                                                               
*                                  POSTER TYPE HEADER ELEMENT                   
*                                  --------------------------                   
*                                                                               
PSTHELD  DSECT                                                                  
PSTHELEM DS    XL1                 ELEMENT GROUP CODE                           
PSTHELML DS    XL1                 ELEMENT LENGTH                               
PSTHLINK DS    XL1                 LINK VALUE - ALWAYS 1                        
PSTHELTP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3                 SPARE                                        
PSTHCAT  DS    XL1                 POSTER TYPE CATEGORY (IC)                    
PSTHPMOD DS    XL1                 PRICE MODE (IC)                              
         DS    XL10                SPARE                                        
PSTHELLN EQU   *-PSTHELEM                                                       
         EJECT                                                                  
***********************************************************************         
*                                                                               
*        -- POSTER BILL STICKER RECORD ELEMENTS --                              
*           (KLEBER)                                                            
*                                                                               
***********************************************************************         
         SPACE 1                                                                
*                         ELEMENT GROUP/TYPE                                    
*                         ------------------                                    
*                                                                               
BSTHELGQ EQU   X'11'      BILL STICKER HEADER GROUP                             
BSTHELTQ EQU   X'31'       -HEADER                                              
*                                                                               
*        TEXT ELEMENTS     -MNEMONIC (ABBR)       (1X8)                         
*                          -NAME                  (1X40)                        
*                          -EXPRESS LOCATION      (1X20)                        
*                          -FREIGHT LOCATION      (1X20)                        
*                          -NOTES                 (5X70)                        
*        (NO QUALIFIER ELEMENTS)                                                
*                                                                               
*                                                                               
* ALSO ADDELGQ           ADDRESS ELEMENT GROUP (SEE PUB HEADER REC)             
*                                                                               
*                                                                               
*                                  BILL STICKER HEADER ELEMENT                  
*                                  ---------------------------                  
*                                                                               
BSTHELD  DSECT                                                                  
BSTHELEM DS    XL1                 ELEMENT GROUP CODE                           
BSTHELML DS    XL1                 ELEMENT LENGTH                               
BSTHLINK DS    XL1                 LINK VALUE - ALWAYS 1                        
BSTHELTP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3                 SPARE                                        
BSTHPCST DS    CL1                 PARCEL STORED? (BAHNLAGERND?) (IC)           
         DS    XL10                SPARE                                        
BSTHELLN EQU   *-BSTHELEM                                                       
         EJECT                                                                  
***********************************************************************         
*                                                                               
*        -- DISTRICT RECORD ELEMENTS --                                         
*           (KREIS)                                                             
*                                                                               
***********************************************************************         
         SPACE 1                                                                
*                         ELEMENT GROUP/TYPE                                    
*                         ------------------                                    
*                                                                               
DSTHELGQ EQU   X'11'      DISTRICT HEADER GROUP                                 
*                                                                               
*        TEXT ELEMENTS     -MNEMONIC (ABBR)       (1X8)                         
*                          -NAME                  (1X40)                        
*        ITEM VALUE ELEMS  -OTHER DATA BASE       (IC + STATISTIC)              
*                                                  MBQODEXT                     
*        (NO QUALIFIER ELEMENTS)                                                
*        NOTE- 1ST 3 DIGITS OF KREIS MBNUM ARE LAND                             
*                                                                               
         EJECT                                                                  
***********************************************************************         
*                                                                               
*        -- LOCATION RECORD ELEMENTS --                                         
*           (ORT)                                                               
*                                                                               
***********************************************************************         
         SPACE 1                                                                
*                         ELEMENT GROUP/TYPE                                    
*                         ------------------                                    
*                                                                               
LOCHELGQ EQU   X'11'      LOCATION HEADER GROUP                                 
LOCHELTQ EQU   X'31'       -HEADER                                              
*                                                                               
*        TEXT ELEMENTS     -MNEMONIC (ABBR)       (1X8)                         
*                          -NAME                  (1X40)                        
*                          -POSTAL CODE           (1X20)                        
*                          -NOTES                 (5X70)                        
*        ITEM VALUE ELEMS  -KREIS                 (MBNUM)                       
*                          -OTHER DATA BASE       (IC + STATISTIC)              
*                                                  MBQODEXT                     
*                           *NOTE- 1ST 3 DIGITS OF KREIS ARE LAND               
*        (NO QUALIFIER ELEMENTS)                                                
*                                                                               
*                                                                               
*                                  LOCATION HEADER ELEMENT                      
*                                  -----------------------                      
*                                                                               
LOCHELD  DSECT                                                                  
LOCHELEM DS    XL1                 ELEMENT GROUP CODE                           
LOCHELML DS    XL1                 ELEMENT LENGTH                               
LOCHLINK DS    XL1                 LINK VALUE - ALWAYS 1                        
LOCHELTP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3                 SPARE                                        
LOCNIELS DS    XL2                 NIELSEN REGION - IC                          
LOCSECT  DS    XL1                 SECTION (WEST/OST) - IC                      
LOCREGN  DS    XL1                 REGION  -  IC                                
LOCDSTS  DS    XL1                 DISTRICT STATUS - IC                         
LOCBLOCK DS    CL1                 MAIN BLOCK                                   
LOCSBLK1 DS    CL1                 SUB BLOCK 1                                  
LOCSBLK2 DS    CL1                 SUB BLOCK 2                                  
LOCINHS  DS    XL4                 INHABITANTS                                  
         DS    XL10                SPARE                                        
LOCHELLN EQU   *-LOCHELEM                                                       
         EJECT                                                                  
***********************************************************************         
*                                                                               
*        -- SHOPPING CENTER RECORD ELEMENTS --                                  
*           (EKZ / EINKAUFSZENTRUM)                                             
*                                                                               
***********************************************************************         
         SPACE 1                                                                
*                         ELEMENT GROUP/TYPE                                    
*                         ------------------                                    
*                                                                               
SHCHELGQ EQU   X'11'      SHOPPING CENTER HEADER GROUP                          
SHCHELTQ EQU   X'31'       -HEADER                                              
*                                                                               
*        TEXT ELEMENTS     -MNEMONIC (ABBR)       (1X8)                         
*                          -NAME                  (1X40)                        
*                          -NOTES                 (5X70)                        
*        ITEM VALUE ELEMS  -LOCATION              (MBNUM)                       
*                          -CHAIN                 (MBNUM)                       
*        (NO QUALIFIER ELEMENTS)                                                
*                                                                               
* ALSO ADDELGQ           ADDRESS ELEMENT GROUP (SEE PUB HEADER REC)             
*                                                                               
*                                  SHOPPING CENTER HEADER ELEMENT               
*                                  ------------------------------               
SHCHELD  DSECT                                                                  
SHCHELEM DS    XL1                 ELEMENT GROUP CODE                           
SHCHELML DS    XL1                 ELEMENT LENGTH                               
SHCHLINK DS    XL1                 LINK VALUE - ALWAYS 1                        
SHCHELTP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3                 SPARE                                        
SHCSIZ   DS    XL4                 SIZE IN SQUARE METERS                        
SHCNPANS DS    XL4                 NUMBER OF PANELS                             
         DS    XL10                                                             
SHCHELLN EQU   *-SHCHELEM                                                       
         EJECT                                                                  
***********************************************************************         
*                                                                               
*        -- CHAIN RECORD ELEMENTS --                                            
*           (EKZ-KETTE)                                                         
*                                                                               
***********************************************************************         
         SPACE 1                                                                
*                         ELEMENT GROUP/TYPE                                    
*                         ------------------                                    
*                                                                               
CHNHELGQ EQU   X'11'      CHAIN HEADER GROUP                                    
CHNHELTQ EQU   X'31'       -HEADER                                              
*                                                                               
*        TEXT ELEMENTS     -MNEMONIC (ABBR)       (1X8)                         
*                          -NAME                  (1X40)                        
*                          -NOTES                 (5X70)                        
*        (NO QUALIFIER ELEMENTS)                                                
*                                                                               
* ALSO ADDELGQ           ADDRESS ELEMENT GROUP (SEE PUB HEADER REC)             
*                                                                               
*                                  CHAIN HEADER ELEMENT                         
*                                  --------------------                         
CHNHELD  DSECT                                                                  
CHNHELEM DS    XL1                 ELEMENT GROUP CODE                           
CHNHELML DS    XL1                 ELEMENT LENGTH                               
CHNHLINK DS    XL1                 LINK VALUE - ALWAYS 1                        
CHNHELTP DS    XL1                 ELEMENT TYPE CODE                            
         DS    XL3                 SPARE                                        
         DS    XL10                SPARE                                        
*        NOTE- NO DATA IN THIS ELEM FOR NOW                                     
CHNHELLN EQU   *-CHNHELEM                                                       
         EJECT                                                                  
***********************************************************************         
*                                                                               
*        -- POSTER DETAIL RECORD ELEMENTS --                                    
*           (DETAIL)                                                            
*                                                                               
***********************************************************************         
         SPACE 1                                                                
*                         ELEMENT GROUP/TYPE                                    
*                         ------------------                                    
*                                                                               
PSDHELGQ EQU   X'11'      POSTER DETAIL HEADER GROUP                            
PSDHELTQ EQU   X'31'       -HEADER                                              
*                                                                               
*        TEXT ELEMENTS     -NOTES                 (5X70)                        
*        (NO QUALIFIER ELEMENTS)                                                
*                                                                               
*                                  POSTER DETAIL HEADER ELEMENT                 
*                                  ----------------------------                 
PSDHELD  DSECT                                                                  
PSDHELEM DS    XL1                 ELEMENT GROUP CODE                           
PSDHELML DS    XL1                 ELEMENT LENGTH                               
PSDHLINK DS    XL1                 LINK VALUE - ALWAYS 1                        
PSDHELTP DS    XL1                 ELEMENT TYPE CODE                            
PSDHPTYP DS    XL2                 POSTER TYPE (LAST 2 BYTES OF MBNUM)          
PSDHSQN  DS    XL1                 SEQUENCE NUMBER                              
*                                                                               
PSDSDAT  DS    XL2                 START DATE                                   
PSDEDAT  DS    XL2                 END DATE FOR RATE                            
PSDSHC   DS    XL3                 SHOPPING CENTER  (MBNUM)                     
PSDCLASS DS    XL2                 CLASS?                                       
PSDPRICE DS    XL4                 PRICE            (NNNNNNN,NN)                
PSDNPANS DS    XL4                 NUMBER OF PANELS (STELLEN)                   
PSDNSITS DS    XL4                 NUMBER OF SITES  (STANDORTE)                 
PSDTB1   DS    XL4                 TB 1             (TEILBELEGUNG 1)            
PSDTB2   DS    XL4                 TB 2             (TEILBELEGUNG 2)            
PSDTB3   DS    XL4                 TB 3             (TEILBELEGUNG 3)            
PSDTB4   DS    XL4                 TB 4             (TEILBELEGUNG 4)            
PSDBLOCK DS    CL1                 MAIN BLOCK       (IF OVERRIDE)               
PSDBLCKS DS    CL2                 SEC. BLOCKS      (IF OVERRIDE)               
PSDMVG   DS    XL2                 MVG %            (NN,NN)                     
PSDBST   DS    XL3                 BILL STICKER     (MBNUM)                     
         DS    XL10                                                             
PSDHELLN EQU   *-PSDHELEM                                                       
