*          DATA SET PBKREC     AT LEVEL 001 AS OF 01/21/82                      
PBKREC   DS    0C                  ** PRINTPAK - BUCKET RECORD **               
*                                                                               
PBKKEY   DS    0CL25                                                            
PBKKAGY  DS    CL2                 AGENCY                                       
PBKKMED  DS    CL1                 MEDIA                                        
PBKKRCD  DS    X'09'               RECORD CODE                                  
PBKKCLT  DS    CL3                 CLIENT                                       
PBKKPRD  DS    CL3                 PRD                                          
PBKKEST  DS    XL2                 ESTIMATE                                     
         DS    XL13'00'                                                         
*                                                                               
PBKLEN   DS    XL2                 LENGTH                                       
PBKCNTL  DS    XL2                 CONTROL BYTES                                
         DS    XL4                                                              
*                                                                               
*        BKELEM DSECT IN BOOK DDBKELEM                                          
*                                                                               
