*          DATA SET PBOKBUY    AT LEVEL 002 AS OF 03/20/00                      
PBOKBUY  DSECT                     ** PRINTPAK - BOOKING BUY ELEMENT**          
*                                                                               
         DS    X'20' .   B         ELEMENT CODE                                 
         DS    AL1(20)   B         ELEMENT LENGTH                               
PBOKBDAT DS    XL3 .     B         INSERTION DATE (YMD)                         
PBOKBLIN DS    XL1 .     B         LINE NUMBER                                  
         DS    CL14 .              SPARE                                        
