*          DATA SET PBREFEL    AT LEVEL 006 AS OF 02/02/93                      
*                          **PRINTPAK - BUY RECORD SPECIAL                      
*                          REFERENCE NUMBER ELEM                                
PBREFEL  DS    0C                  REF ELEMENT                                  
         DS    X'83'               ELEM CODE                                    
         DS    AL1(15)             ELEM LEN                                     
PBREFNOB DS    0XL6                BACKER IS ONLY 6 CHARS                       
PBREFNO  DS    XL10 .              REFERENCE NUMBER (MAXIMUM FOR MBC)           
         DS    CL3 .               SPARE                                        
