*          DATA SET PBRPTEL    AT LEVEL 007 AS OF 06/15/94                      
*                          **PRINTPAK - BUY RECORD                              
*                          OUTDOOR REPAINT ELEMENT                              
PBRPTEL  DS    0C                  RPT ELEMENT                                  
         DS    X'85'               ELEM CODE                                    
         DS    AL1(05)             ELEM LEN                                     
PBRPTNO  DS    PL3                 NUMBER OF REPAINTS                           
