*          DATA SET PBUDREC    AT LEVEL 001 AS OF 08/15/75                      
PBUDREC  DS    0C .                ** PRINTPAK BUDGET RECORD **                 
*                                                                               
*                                                                               
PBUDKAGY DS    CL2 .     A                                                      
PBUDKMED DS    CL1 .     A                                                      
PBUDKRCD DS    X'18' .   B                                                      
PBUDKCLT DS    CL3 .     A                                                      
PBUDKPRD DS    CL3 .     A                                                      
PBUDKEST DS    CL3 .     N                                                      
PBUDKREG DS    CL3 .     N                                                      
PBUDKDST DS    CL3 .     N                                                      
         DS    XL6 .                                                            
*                                                                               
PBUDLEN  DS    CL2 .     B                                                      
PBUDCNTL DS    CL2 .     B                                                      
PBUDDISK DS    CL4 .     B                                                      
*                                                                               
PBUDELEM DS    X'01'                                                            
         DS    AL1(100)                                                         
PBUDAMTS DS    CL52 .    B         AMOUNTS - 12 MONTHS + TOTAL                  
PBUDST   DS    CL6 .     N         START - TAKEN FROM ESTIMATE                  
PBUDEND  DS    CL6 .     N         END   - TAKEN FROM ESTIMATE                  
         DS    CL34 .              SPARE                                        
*                                                                               
*                                  COMMENT ELEMENTS MAY APPEAR HERE             
PBUDCOML DS    X'66'                                                            
         DS    AL1(0)                                                           
PBUDCOM  DS    0C                                                               
*                                                                               
