*          DATA SET PBYPSTEL   AT LEVEL 002 AS OF 04/12/02                      
*                                                                               
PBYPSTEL DSECT                     ** PRINTPAK - PBUYREC PST ELEM **            
         DS    X'84'                                                            
         DS    AL1(12)                                                          
*                                                                               
PBYPSTC  DS    XL10 .    C         PST CODES FOR CANADIAN PROVINCES             
*                                                                               
