*          DATA SET PCLICKTEL  AT LEVEL 009 AS OF 10/29/96                      
*                          **PRINTPAK - BUY RECORD                              
*                          CLICK THROUGH ELEMENT (FOR WEBSITES)                 
PCLCKTEL DS    0C                  CLICK THRUS ELEMENT                          
         DS    X'88'               ELEM CODE                                    
         DS    AL1(07)             ELEM LEN                                     
PCLCKTS  DS    PL5                 NUMBER OF CLICK THROUGHS                     
