*          DATA SET PCLTAORELM AT LEVEL 004 AS OF 09/27/90                      
*==========================================*                                    
*     ADVERTISER LINK TO AOR CLIENT        *                                    
*==========================================*                                    
PCLTAOID DS    XL1'0C'             ELEMENT ID                                   
         DS    X'11'               ELEMENT LENGTH                               
PCLTAPC  DS    CL2                 POWER CODE FOR AOR                           
*                                   POWER CODE IS TO BE USED AS                 
*                                   MASTER CLIENT                               
PCLTASGN DS    CL5                 SIGN ON FOR AOR                              
PCLTACLT DS    CL3                 AOR CLIENT CODE FOR THIS ADV                 
         DS    CL5                 SPARE                                        
*              -----                                                            
*             CL17    X'11'                                                     
*                                                                               
