*          DATA SET PCMTTWA    AT LEVEL 014 AS OF 09/17/09                      
         ORG   T408FFD+2000                                                     
CHSW     DS    CL1                                                              
CMTSW    DS    CL1                                                              
SVKEY    DS    CL10                PREV KEY                                     
PREVCOM  DS    CL10                                                             
WKNO     DS    CL6                                                              
ELCODE   DS    CL1                                                              
ADDSW    DS    CL1                                                              
ATIOB    DS    AL4                 A(TIOB)                                      
ALINCUR  DS    AL2                 DISPLACEMENT(LINE WITH CURSOR)               
ELEM     DS    CL128               ELEMENT BUILD AREA                           
LASTLIN  DS    X                   NUMBER OF LAST COMMENT LINE                  
QCTL     DS    CL26                                                             
QAREA    DS    CL80                                                             
TSTOFF   DS    CL1                 OFFICE TO BE TESTED BY OFFICER               
TSTOFF2  DS    CL2                 2-CHR OFFICE TO BE TESTED BY OFFICER         
TRFAGSW  DS    CL1                 "Y" = TRAFFIC AGENCY SIGN-ON                 
HEXFLG   DS    XL1                 1 = ONLY REC DISPLAY ALLOWED                 
*                                  2 = NO I/OCOM REC MAINT ALLOWED              
*                                  3 = I/OCOM REC ACCESS NOT ALLOWED            
SECBLK   DS    CL1024              SECURITY BLOCK                               
*                                                                               
         EJECT                                                                  
