*          DATA SET PCOMELEM   AT LEVEL 003 AS OF 03/25/96                      
PCOMELEM DS    0C .                ** PRINTPAK - COMMENT ELEMENT **             
*                                                                               
*                                  THIS ELEMENT MAY APPEAR IN VARIOUS           
*                                  PRINTPAK RECORD                              
*                                                                               
         DS    X'66' .   B         ELEMENT CODE                                 
         DS    CL1 .     B         ELEMENT LENGTH- VARIABLE                     
PCOMDATA DS    0C .      A         COMMENT DATA                                 
