*          DATA SET PCOMSEPEL  AT LEVEL 010 AS OF 04/09/96                      
PCSEPEL  DS   0C      ** PRINTPAK - COMPETITIVE SEPERATION ELEM**               
         DS   X'96'                                                             
PCSEPLEN DS   AL1(38)        LENGTH OF ELEMENT                                  
*                                                                               
PCSCOMP  DS   CL20           COMPETITOR                                         
PCSSEP   DS   XL2            SEPERATION UNITS                                   
PCSCOMM  DS   CL10           COMMENT                                            
PCSSEPI  DS   CL1            SEPERATION UNIT TYPE                               
*                            (IF BLANK - NO UNITS ENTERED-                      
*                            PCSSEP WILL BE X'0000')                            
*                            (IF NOT BLANK AND PCSSEP IS X'0000'-               
*                            THEN ZERO UNITS WAS ENTERED)                       
*                            P=PAGES                                            
*                            F=FEET (FOR OUTDOOR)                               
*                            L=LINES                                            
*                            I=INCHES                                           
*                            K=KILOMETERS (FOR OUTDOOR)                         
*                            M=MILES (FOR OUTDOOR)                              
*                                                                               
         DS   XL3            SPARE                                              
