*          DATA SET PCOS2FACEL AT LEVEL 003 AS OF 10/11/05                      
*                          **PRINTPAK - BUY RECORD                              
*                          COST 2 FACTOR ELEMENT                                
PCOS2FEL DS    0C                  COST 2 FACTOR ELEMENT                        
         DS    X'91'               ELEM CODE                                    
         DS    AL1(08)             ELEM LEN                                     
PCOS2FAC DS    PL5                 COST 2 FACTOR   (6 DECIMAL PLACES)           
PCOS2FLG DS    XL1                 FLAGS                                        
PCOS2RND EQU   X'80'               ROUND RESULT                                 
PCOS2OVR EQU   X'40'               FACTOR IS OVERRIDDEN IN BUY                  
