*          DATA SET PCPMELEM   AT LEVEL 003 AS OF 01/25/01                      
*                          **PRINTPAK - BUY RECORD                              
*                          EXTENSION DATE ELEMENT                               
PEXDATEL DS    0C                                                               
         DS    X'96'               ELEM CODE                                    
         DS    AL1(05)             ELEM LEN                                     
PEXDATE  DS    CL3                 EXTENSION DATE                               
