*          DATA SET PCTFELEM   AT LEVEL 013 AS OF 08/03/99                      
PCTFELEM DS    0C                  CONTRACT TEL AND FAX ELEMENT                 
         DS    X'55'    B          ELEMENT CODE                                 
PCTFLEN  DS    AL1(34)  B          ELEMENT LENGTH                               
*                                                                               
PCONTELE DS    CL12     A          TELEPHONE NUMBER                             
         DS    CL4                 SPARE                                        
PCONFAX  DS    CL12     A          FAX NUMBER                                   
         DS    CL4                 SPARE                                        
