*          DATA SET PDIVREC    AT LEVEL 012 AS OF 06/28/05                      
PDIVREC  DS    0C .                *** PRINTPAK - DIVISION RECORD ***           
*                                                                               
*                                                                               
PDIVKEY  DS    0CL25                                                            
PDIVKAGY DS    CL2 .     A         AGENCY CODE                                  
PDIVKMED DS    CL1 .     A         PRINT MEDIA CODE                             
PDIVKRCD DS    X'03' .   B         RECORD CODE                                  
PDIVKCLT DS    CL3 .     A         CLIENT CODE                                  
PDIVKDIV DS    CL3 .     N         DIVISION CODE                                
         DS    15X'00' .           SPARE                                        
*                                                                               
PDIVLEN  DS    CL2 .     B         RECORD LENGTH                                
*                                                                               
PDIVCNTL DS    CL2 .     B         CONTROL BYTES                                
         DS    CL4 .     B         DISK ADDRESS FOR LINKED RECORDS              
*                                                                               
PDIVELEM DS    0C                                                               
         DS    X'03' .   B         ELEMENT CODE                                 
         DS    CL1 .     B         ELEMENT LENGTH                               
PDIVNAME DS    CL20 .    AN        DIVISION NAME                                
         DS    CL10  .             SPARE                                        
PDIVREP  DS    CL4  .    N         REP CODE                                     
         DS    CL104 .             SPARE                                        
