*          DATA SET PDSTREC    AT LEVEL 008 AS OF 01/10/75                      
PDSTREC  DS    0C .                *** PRINTPAK - DISTRICT RECORD ***           
*                                                                               
*                                                                               
PDSTKEY  DS    0CL25                                                            
PDSTKAGY DS    CL2 .     A         AGENCY CODE                                  
PDSTKMED DS    CL1 .     A         PRINT MEDIA CODE                             
PDSTKRCD DS    X'05' .   B         RECORD CODE                                  
PDSTKCLT DS    CL3 .     A         CLIENT CODE                                  
PDSTKDIV DS    CL3 .     N         DIVISION  (000= ALL DIVISIONS)               
PDSTKREG DS    CL3 .     N         REGION (000= ALL REGIONS)                    
PDSTKDST DS    CL3 .     N         DISTRICT CODE                                
         DS    9X'00'                                                           
*                                                                               
PDSTLEN  DS    CL2 .     B         RECORD LENGTH                                
*                                                                               
PDSTCNTL DS    CL2 .     B                                                      
         DS    CL4 .     B         DISK ADDRESS FOR LINKED RECORDS              
*                                                                               
PDSTELEM DS    0C                                                               
         DS    X'05' .   B         ELEMENT CODE                                 
         DS    CL1 .     B         ELEMENT LENGTH                               
PDSTNAME DS    CL20 .    AN        DISTRICT NAME                                
         DS    CL118  X'00'       SPARE                                         
