*          DATA SET PEIMPRSEL  AT LEVEL 013 AS OF 05/05/00                      
*                          **PRINTPAK - BUY RECORD                              
*                                                                               
* ACTUAL IMPRESSIONS ELEMENT (FOR WEBSITES)                                     
*                                                                               
PAIMSPEL DS    0C                  ACTUAL IMPRESSIONS ELEMENT                   
*                                                                               
         DS    X'93'               ELEM CODE                                    
         DS    AL1(07)             ELEM LEN                                     
PAIMPRS  DS    PL5                 ACTUAL NUMBER OF IMPRESSIONS                 
*                                                                               
