*          DATA SET PELEVFFD   AT LEVEL 006 AS OF 07/17/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE0AFFD      DATE 07/17/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LEVHDRH  DS    XL8                                                              
LEVHDR   DS    CL60     1    2   60  L  P N             T        Y              
LEVSRVH  DS    XL8                                                              
LEVSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      2    2    4  L  P H             T        Y              
LEVBOOH  DS    XL8                                                              
LEVBOO   DS    CL10     2    8   10  A  U N             T    I   Y    1         
LEVBOOX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      2   20    7  L  P H             T        Y              
LEVLIBH  DS    XL8                                                              
LEVLIB   DS    CL7      2   28    7  A  U N             T        Y    2         
LEVLIBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      2   36    8  L  P H             T        Y              
LEVOPTH  DS    XL8                                                              
LEVOPT   DS    CL16     2   45   16  A  U N             T        Y    3         
LEVOPTX  DS    XL8                                                              
LEVINFH  DS    XL8                                                              
LEVINF   DS    CL78     3    2   78  L  P H             T        Y              
LEVSELH  DS    XL8                                                              
LEVSEL   DS    CL2      4    2    2  A  U N             T        Y              
LEVFRSH  DS    XL8                                                              
LEVFRS   DS    CL75     4    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      5    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     5    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      6    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     6    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      7    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     7    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      8    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     8    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     9    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    10    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    11    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    12    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    13    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    14    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    15    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    16    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    17    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    18    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    19    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    20    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    21    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    22    5   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    23    5   75  L  P N             T        Y              
LEVPFKH  DS    XL8                                                              
LEVPFK   DS    CL78    24    2   78  L  P H             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2256 BYTES                            
