*          DATA SET PEMAPF2D   AT LEVEL 002 AS OF 05/30/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BF2D      DATE 05/30/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7   A    P    N         T         Y           
PERCODH  DS    CL8                                                              
PERCOD   DS    CL8      5   10    8   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL1      6    2    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL14     7    2   14   A    P    N         T         Y           
PERSECH  DS    CL8                                                              
PERSEC   DS    CL8      7   20    8   A    U    N         T         Y           
PERPNAMH DS    CL8                                                              
PERPNAM  DS    CL11     8    2   11   A    P    N         T         Y           
PERNAMEH DS    CL8                                                              
PERNAME  DS    CL20     8   20   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9    2    8   A    P    N         T         Y           
PERPOSH  DS    CL8                                                              
PERPOS   DS    CL20     9   20   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL15    11    2   15   A    P    N         T         Y           
PERNOTEH DS    CL8                                                              
PERNOTE  DS    CL50    11   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    12   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    13   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    14   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    15   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    16   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    17   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    18   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    19   20   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    20   20   50   A    U    N         T         Y           
PERLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PERWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 775  BYTES                            
