*          DATA SET PEMAPF6D   AT LEVEL 003 AS OF 07/19/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BF6D      DATE 07/19/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6   A    P    N         T         Y           
TSRSYSH  DS    CL8                                                              
TSRSYS   DS    CL8      5   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   20    7   A    P    N         T         Y           
TSRPRJH  DS    CL8                                                              
TSRPRJ   DS    CL8      5   28    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      5   38    4   A    P    N         T         Y           
TSRTYPEH DS    CL8                                                              
TSRTYPE  DS    CL8      5   46    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      5   56    4   A    P    N         T         Y           
TSRCODH  DS    CL8                                                              
TSRCOD   DS    CL8      5   64    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      6    2    1   A    P    N         T         Y           
TSRPPERH DS    CL8                                                              
TSRPPER  DS    CL16     7    2   16   A    P    N         T         Y           
TSRPERH  DS    CL8                                                              
TSRPER   DS    CL8      7   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL15     8    2   15   A    P    N         T         Y           
TSRSTRTH DS    CL8                                                              
TSRSTRT  DS    CL8      8   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL15     9    2   15   A    P    N         T         Y           
TSRTIMEH DS    CL8                                                              
TSRTIME  DS    CL4      9   20    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL15    10    2   15   A    P    N         T         Y           
TSRPCTH  DS    CL8                                                              
TSRPCT   DS    CL4     10   20    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    12    2   16   A    P    N         T         Y           
TSRWRKH  DS    CL8                                                              
TSRWRK   DS    CL30    12   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30    13   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30    14   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    16    2   17   A    P    N         T         Y           
TSRCOMPH DS    CL8                                                              
TSRCOMP  DS    CL4     16   20    4   A    U    N         T         Y           
TSRONH   DS    CL8                                                              
TSRON    DS    CL11    16   28   11   A    P    N         T         Y           
TSRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TSRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 472  BYTES                            
