*          DATA SET PEMAPD2D   AT LEVEL 004 AS OF 05/14/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BD2D      DATE 05/14/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    H         T         Y           
PERPERSH DS    CL8                                                              
PERPERS  DS    CL8      6   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    H         T         Y           
PERDATEH DS    CL8                                                              
PERDATE  DS    CL8      7   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      8    2    1   A    P    N         T         Y           
PERLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PERWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 73   BYTES                            
