*          DATA SET PEMAPD5D   AT LEVEL 002 AS OF 06/12/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BD5D      DATE 06/12/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6   A    P    H         T         Y           
PJLSYSH  DS    CL8                                                              
PJLSYS   DS    CL8      5   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      6    2    7   A    P    H         T         Y           
PJLCODH  DS    CL8                                                              
PJLCOD   DS    CL8      6   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      7    2    4   A    P    H         T         Y           
PJLUSERH DS    CL8                                                              
PJLUSER  DS    CL8      7   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      8    2    6   A    P    H         T         Y           
PJLSCHEH DS    CL8                                                              
PJLSCHE  DS    CL2      8   10    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9    2    5   A    P    H         T         Y           
PJLDONEH DS    CL8                                                              
PJLDONE  DS    CL2      9   10    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     10    2    5   A    P    H         T         Y           
PJLCOORH DS    CL8                                                              
PJLCOOR  DS    CL8     10   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11    2    6   A    P    H         T         Y           
PJLPERH  DS    CL8                                                              
PJLPER   DS    CL11    11   10   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12    2    6   A    P    H         T         Y           
PJLOTHH  DS    CL8                                                              
PJLOTH   DS    CL32    12   10   32   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13    2    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     14    2    1   A    U    N         T         Y           
PJLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PJLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 273  BYTES                            
