*          DATA SET PEMAPC2D   AT LEVEL 001 AS OF 05/01/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BC2D      DATE 01/05/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL50     6    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     7    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     8    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     9    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    10    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    11    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    12    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    13    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    14    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    15    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    16    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    17    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    18    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    19    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    20    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    21    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    22    2   50   A    P    N         T         Y           
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 989  BYTES                            
