*          DATA SET PEMAPC5D   AT LEVEL 001 AS OF 09/26/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BC5D      DATE 09/26/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6   A    P    H         T         Y           
PJLSYSH  DS    CL8                                                              
PJLSYS   DS    CL8      5   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      6    2    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1      7    2    1   A    U    N         T         Y           
PJLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PJLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 51   BYTES                            
