*          DATA SET PEMAPDFD   AT LEVEL 001 AS OF 05/01/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BDFD      DATE 01/05/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL70     8    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70     9    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    10    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    11    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    12    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    13    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    14    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    15    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    16    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    17    2   70   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL70    18    2   70   A    P    N         T         Y           
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 861  BYTES                            
