*          DATA SET PEMAPF5D   AT LEVEL 005 AS OF 07/20/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BF5D      DATE 07/20/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6   A    P    N         T         Y           
PJRSYSH  DS    CL8                                                              
PJRSYS   DS    CL8      5   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   20    7   A    P    N         T         Y           
PJRCODH  DS    CL8                                                              
PJRCOD   DS    CL8      5   28    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      6    2    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11     7    2   11   A    P    N         T         Y           
PJRDESCH DS    CL8                                                              
PJRDESC  DS    CL30     7   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30     8   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30     9   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    10    2   16   A    P    N         T         Y           
PJRUSERH DS    CL8                                                              
PJRUSER  DS    CL17    10   20   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    10   40   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    10   60   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    11   20   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    11   40   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    11   60   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    12   20   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    12   40   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    12   60   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    13    2   17   A    P    N         T         Y           
PJRDURH  DS    CL8                                                              
PJRDUR   DS    CL3     13   20    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    14    2   17   A    P    N         T         Y           
PJRAPPH  DS    CL8                                                              
PJRAPP   DS    CL30    14   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30    15   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30    16   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13    17    2   13   A    P    N         T         Y           
PJRSCHDH DS    CL8                                                              
PJRSCHD  DS    CL11    17   20   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    18    2   16   A    P    N         T         Y           
PJRCOORH DS    CL8                                                              
PJRCOOR  DS    CL8     18   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    20    2   16   A    P    N         T         Y           
PJRCOMPH DS    CL8                                                              
PJRCOMP  DS    CL3     20   20    3   A    U    N         T         Y           
PJRONH   DS    CL8                                                              
PJRON    DS    CL11    20   28   11   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     21    2    8   A    P    N         T         Y           
PJRCOMMH DS    CL8                                                              
PJRCOMM  DS    CL30    21   20   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30    22   20   30   A    U    N         T         Y           
PJRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PJRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
