*          DATA SET PEMAPE6D   AT LEVEL 003 AS OF 06/29/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1BE6D      DATE 06/29/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6   A    P    H         T         Y           
TSLSYSH  DS    CL8                                                              
TSLSYS   DS    CL8      5   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   20    7   A    P    H         T         Y           
TSLPRJH  DS    CL8                                                              
TSLPRJ   DS    CL8      5   28    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      5   38    4   A    P    H         T         Y           
TSLTYPEH DS    CL8                                                              
TSLTYPE  DS    CL8      5   46    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      5   56    4   A    P    H         T         Y           
TSLTASKH DS    CL8                                                              
TSLTASK  DS    CL8      5   64    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    H         T         Y           
TSLSTATH DS    CL8                                                              
TSLSTAT  DS    CL8      6   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      6   20    6   A    P    H         T         Y           
TSLPERSH DS    CL8                                                              
TSLPERS  DS    CL8      6   28    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      6   38    4   A    P    H         T         Y           
TSLDATEH DS    CL8                                                              
TSLDATE  DS    CL8      6   46    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      7    2    1   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      8    2    3   A    P    H         T         Y           
TSLHEDH  DS    CL8                                                              
TSLHED   DS    CL68     8   10   68   A    P    H         T         Y           
TSLSELH  DS    CL8                                                              
TSLSEL   DS    CL3      9    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68     9   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     10    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    10   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     11    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    11   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     12    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    12   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     13    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    13   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    14   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     15    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    15   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     16    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    16   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    17   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     18    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    18   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     19    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    19   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     20    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    20   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     21    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    21   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     22    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    22   10   68   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     23    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL68    23   10   68   A    P    N         T         Y           
TSLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1609 BYTES                            
