*          DATA SET PEMSGFCD   AT LEVEL 004 AS OF 10/03/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1DFCD      DATE 10/03/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    5    7   A    P    N         T         Y           
NEWCMMDH DS    CL8                                                              
NEWCMMD  DS    CL1      3   13    1   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL7      5    2    7   A    P    N         T         Y           
NEWCONNH DS    CL8                                                              
NEWCONN  DS    CL8      5   10    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      5   21    4   A    P    N         T         Y           
NEWNAMEH DS    CL8                                                              
NEWNAME  DS    CL8      5   26    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      5   37    8   A    P    N         T         Y           
NEWNICKH DS    CL8                                                              
NEWNICK  DS    CL8      5   46    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      5   56    8   A    P    N         T         Y           
NEWPSWDH DS    CL8                                                              
NEWPSWD  DS    CL8      5   65    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16     6    2   16   A    P    N         T         Y           
NEWUPH   DS    CL8                                                              
NEWUP    DS    CL1      6   25    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL21    24    3   21   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     24   60    6   A    P    N         T         Y           
NEWLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
NEWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 226  BYTES                            
