*          DATA SET PEMSGFED   AT LEVEL 005 AS OF 10/03/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1DFED      DATE 10/03/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    2    7   A    P    N         T         Y           
MENCMMDH DS    CL8                                                              
MENCMMD  DS    CL1      3   10    1   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL4      3   15    4   A    P    N         T         Y           
MENNAMEH DS    CL8                                                              
MENNAME  DS    CL8      3   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25     5    2   25   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL25     6    2   25   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL25     7    2   25   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL25     8    2   25   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL25     9    2   25   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL25    10    2   25   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL25    11    2   25   A    P    N         T         Y           
MENLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MENWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 286  BYTES                            
