*          DATA SET PEMSGF8D   AT LEVEL 008 AS OF 09/21/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1DF8D      DATE 09/21/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    5    7  A   P    N         T        Y              
ADLCMMDH DS    CL8                                                              
ADLCMMD  DS    CL1      3   13    1  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL4      3   15    4  A   P    N         T        Y              
ADLNAMEH DS    CL8                                                              
ADLNAME  DS    CL8      3   20    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      3   30    2  A   P    N         T        Y              
ADLPAGEH DS    CL8                                                              
ADLPAGE  DS    CL3      3   33    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      3   38    4  A   P    N         T        Y              
ADLDESCH DS    CL8                                                              
ADLDESC  DS    CL30     3   43   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4    6   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4   31   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4   56   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   40    7  A   P    N         T        Y              
ADLFSTGH DS    CL8                                                              
ADLFSTG  DS    CL8      6    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      6   23    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      6   48    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6   53    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      6   73    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      7   23    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      7   48    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7   53    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      7   73    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      8   23    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      8   48    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8   53    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      8   73    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   23    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   48    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9   53    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   73    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   40    7  A   P    N         T        Y              
ADLNXTGH DS    CL8                                                              
ADLNXTG  DS    CL8     11    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   23    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   48    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   53    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   73    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   23    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   48    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   53    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   73    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   23    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   48    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   53    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   73    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   23    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   38    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   48    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   53    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   63    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   73    2  A   U    N         T        Y              
ADLDKTSH DS    CL8                                                              
ADLDKTS  DS    CL15    23    3   15  A   P    N         T        Y              
ADLLPMSH DS    CL8                                                              
ADLLPMS  DS    CL9     23   55    9  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL20    24    3   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     24   60    6  A   P    N         T        Y              
ADLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ADLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1318 BYTES                            
