*          DATA SET PEMSGFBD   AT LEVEL 010 AS OF 12/02/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1DFBD      DATE 12/02/85                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
REPE1H   DS    CL8                                                              
REPE1    DS    CL7      3    5    7  A   P    N         T        Y              
REPCMMDH DS    CL8                                                              
REPCMMD  DS    CL8      3   13    8  A   U    N         T    I   Y              
REPE2H   DS    CL8                                                              
REPE2    DS    CL8      4    3    8  A   P    N         T        Y              
REPNAMH  DS    CL8                                                              
REPNAM   DS    CL8      5    3    8  A   U    N         T        Y              
REPFILH  DS    CL8                                                              
REPFIL   DS    CL8      6    3    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL19     7    3   19  A   P    N         T        Y              
REPDAPH  DS    CL8                                                              
REPDAP   DS    CL1      7   25    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL40    24    3   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     24   60    6  A   P    N         T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 180  BYTES                            
