*          DATA SET PEMSGFDD   AT LEVEL 016 AS OF 10/03/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1DFDD      DATE 10/03/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    3    7   A    P    N         T         Y           
MSGCMMDH DS    CL8                                                              
MSGCMMD  DS    CL1      3   11    1   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL4      3   15    4   A    P    N         T         Y           
MSGNAMEH DS    CL8                                                              
MSGNAME  DS    CL8      3   20    8   A    U    N         T         Y           
MSGFILEH DS    CL8                                                              
MSGFILE  DS    CL8      3   35    8   A    P    H         T         Y           
MSGWTNGH DS    CL8                                                              
MSGWTNG  DS    CL12     3   59   12   A    P    H         T         Y           
         DS    CL8                                                              
         DS    CL38     5    2   38   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   42    7   A    P    N         T         Y           
MSGSELH  DS    CL8                                                              
MSGSEL   DS    CL3      6    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74     6    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      7    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74     7    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      8    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74     8    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      9    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74     9    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     10    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    10    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     11    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    11    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     12    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    12    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     13    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    13    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    14    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     15    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    15    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     16    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    16    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    17    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     18    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    18    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     19    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    19    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     20    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    20    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     21    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    21    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     22    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    22    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34    23    3   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL29    23   38   29   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL22    24    3   22   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     24   60    6   A    P    N         T         Y           
MSGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MSGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1856 BYTES                            
