*          DATA SET PEMSGFAD   AT LEVEL 019 AS OF 10/14/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1DFAD      DATE 10/14/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    2    7   A    P    N         T         Y           
PAGCMMDH DS    CL8                                                              
PAGCMMD  DS    CL2      3   10    2   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL4      3   17    4   A    P    N         T         Y           
PAGNAM1H DS    CL8                                                              
PAGNAM1  DS    CL8      3   22    8   A    U    N         T         Y           
PAGNAM2H DS    CL8                                                              
PAGNAM2  DS    CL8      3   32    8   A    U    N         T         Y           
PAGWTNGH DS    CL8                                                              
PAGWTNG  DS    CL12     3   59   12   A    P    H         T         Y           
PAGCOPYH DS    CL8                                                              
PAGCOPY  DS    CL4      3   73    4   A    P    H         T         Y           
PAGFROMH DS    CL8                                                              
PAGFROM  DS    CL38     4   40   38   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   15    7   A    P    N         T         Y           
PAGSUBJH DS    CL8                                                              
PAGSUBJ  DS    CL40     5   25   40   L    U    N         T         Y           
PAGLINEH DS    CL8                                                              
PAGLINE  DS    CL78     6    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78     7    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78     8    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78     9    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    10    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    11    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    12    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    13    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    14    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    15    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    16    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    17    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    18    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    19    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    20    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    21    2   78   L    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    22    2   78   L    U    N         T         Y           
PAGTITLH DS    CL8                                                              
PAGTITL  DS    CL36    23    3   36   A    P    N         T         Y           
PAGMOREH DS    CL8                                                              
PAGMORE  DS    CL4     23   65    4   A    P    H         T         Y           
         DS    CL8                                                              
         DS    CL20    24    3   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     24   60    6   A    P    N         T         Y           
PAGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PAGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1773 BYTES                            
