*          DATA SET PEMSGF7D   AT LEVEL 003 AS OF 06/13/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1DF7D      DATE 06/13/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    5    7   A    P    N         T         Y           
LADCMMDH DS    CL8                                                              
LADCMMD  DS    CL1      3   13    1   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL3      4    3    3   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      4   11    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11     4   40   11   A    P    N         T         Y           
LADSELH  DS    CL8                                                              
LADSEL   DS    CL3      5    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50     5   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      6    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50     6   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      7    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50     7   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      8    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50     8   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      9    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50     9   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     10    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    10   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     11    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    11   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     12    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    12   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     13    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    13   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    14   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     15    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    15   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     16    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    16   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    17   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     18    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    18   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     19    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    19   11   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5     23    3    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL19    24    3   19   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     24   60    6   A    P    N         T         Y           
LADLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1162 BYTES                            
