*          DATA SET PEPANFFD   AT LEVEL 001 AS OF 06/15/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE08FFD      DATE 06/15/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PANHDRH  DS    XL8                                                              
PANHDR   DS    CL60     1    2   60  L  P N             T        Y              
PANSRVH  DS    XL8                                                              
PANSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      2    2    4  L  P H             T        Y              
PANSCNH  DS    XL8                                                              
PANSCN   DS    CL16     2    8   16  A  U N             T    I   Y    1         
PANSCNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      2   25    7  L  P H             T        Y              
PANBOOH  DS    XL8                                                              
PANBOO   DS    CL10     2   33   10  A  U N             T        Y    2         
PANBOOX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      2   44    8  L  P H             T        Y              
PANIGNH  DS    XL8                                                              
PANIGN   DS    CL8      2   53    8  A  U N             T        Y    3         
PANIGNX  DS    XL8                                                              
PANINFH  DS    XL8                                                              
PANINF   DS    CL78     3    2   78  L  P H             T        Y              
PANSELH  DS    XL8                                                              
PANSEL   DS    CL5      4    2    5  A  U N             T        Y              
PANFRSH  DS    XL8                                                              
PANFRS   DS    CL72     4    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72     5    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72     6    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72     7    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72     8    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72     9    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    10    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    11    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    12    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    13    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    14    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    15    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    16    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    17    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    18    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    19    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    20    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    21    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    22    8   72  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     23    2    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    23    8   72  L  P N             T        Y              
PANPFKH  DS    XL8                                                              
PANPFK   DS    CL78    24    2   78  L  P H             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2256 BYTES                            
