*          DATA SET PEREQFCD   AT LEVEL 002 AS OF 05/27/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE04FCD      DATE 05/27/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL24     6    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     6   29   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     6   56   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     7    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     7   29   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     7   56   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  U N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 208  BYTES                            
