*          DATA SET PEREQFED   AT LEVEL 002 AS OF 05/27/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE04FED      DATE 05/27/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL79     6    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79     7    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79     8    2   79  A  P N             T        Y              
ENQFRSTH DS    CL8                                                              
ENQFRST  DS    CL78     9    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  U N             T        N              
ENQTABH  DS    CL8                                                              
ENQTAB   DS    CL1     24    2    1  A  U N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1568 BYTES                            
