*          DATA SET PETSTFDD   AT LEVEL 001 AS OF 09/22/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE09FDD      DATE 09/22/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      4    2    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     4   11   30  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      4   42    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     4   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5    2    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     5   11   30  A  U N             T        Y    4         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   42    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     5   51   30  A  P N             T        Y              
TSTLI1H  DS    XL8                                                              
TSTLI1   DS    CL78     6    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     7    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
TSTLIXH  DS    XL8                                                              
TSTLIX   DS    CL1     20    2    1  A  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1448 BYTES                            
