*          DATA SET PETSTFFD   AT LEVEL 002 AS OF 09/22/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE09FFD      DATE 09/22/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TSTMSGH  DS    XL8                                                              
TSTMSG   DS    CL60     1    2   60  L  P N             T        Y              
TSTSRVH  DS    XL8                                                              
TSTSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      2    2    8  L  P H             T        Y              
TSTACTH  DS    XL8                                                              
TSTACT   DS    CL10     2   11   10  A  U N             T    I   Y    1         
TSTACTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      2   22    8  L  P H             T        Y    8         
         DS    XL8                                                              
TSTOPTH  DS    XL8                                                              
TSTOPT   DS    CL30     2   31   30  A  U N             T        Y    2         
TSTOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      2   62    8  L  P H             T        Y    9         
         DS    XL8                                                              
TSTOFFH  DS    XL8                                                              
TSTOFF   DS    CL3      2   72    3  A  U N             T        Y    3         
TSTOFFX  DS    XL8                                                              
TSTTABH  DS    XL8                                                              
TSTTAB   DS    CL1      3    2    1  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      4    2    8  L  P H             T        Y              
TSTIN1H  DS    XL8                                                              
TSTIN1   DS    CL30     4   11   30  A  U N             T        Y    3         
TSTIN1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      4   42    8  L  P H             T        Y              
TSTOUT1H DS    XL8                                                              
TSTOUT1  DS    CL30     4   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5    2    8  L  P H             T        Y              
TSTIN2H  DS    XL8                                                              
TSTIN2   DS    CL30     5   11   30  A  U N             T        Y    4         
TSTIN2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   42    8  L  P H             T        Y              
TSTOUT2H DS    XL8                                                              
TSTOUT2  DS    CL30     5   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  L  P H             T        Y              
TSTIN3H  DS    XL8                                                              
TSTIN3   DS    CL30     6   11   30  A  U N             T        Y    5         
TSTIN3X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   42    8  L  P H             T        Y              
TSTOUT3H DS    XL8                                                              
TSTOUT3  DS    CL30     6   51   30  A  P N             T        Y              
TSTLOADH DS    XL8                                                              
TSTLOAD  DS    CL8      7    2    8  L  P H             T        Y              
TSTIN4H  DS    XL8                                                              
TSTIN4   DS    CL30     7   11   30  A  U N             T        Y    6         
TSTIN4X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   42    8  L  P H             T        Y              
TSTOUT4H DS    XL8                                                              
TSTOUT4  DS    CL30     7   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  L  P H             T        Y              
TSTIN5H  DS    XL8                                                              
TSTIN5   DS    CL30     8   11   30  A  U N             T        Y    7         
TSTIN5X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      8   42    8  L  P H             T        Y              
TSTOUT5H DS    XL8                                                              
TSTOUT5  DS    CL30     8   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  L  P H             T        Y              
TSTIN6H  DS    XL8                                                              
TSTIN6   DS    CL30     9   11   30  A  U N             T        Y    7         
TSTIN6X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9   42    8  L  P H             T        Y              
TSTOUT6H DS    XL8                                                              
TSTOUT6  DS    CL30     9   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    2    8  L  P H             T        Y              
TSTIN7H  DS    XL8                                                              
TSTIN7   DS    CL30    10   11   30  A  U N             T        Y    7         
TSTIN7X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     10   42    8  L  P H             T        Y              
TSTOUT7H DS    XL8                                                              
TSTOUT7  DS    CL30    10   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  L  P H             T        Y              
TSTIN8H  DS    XL8                                                              
TSTIN8   DS    CL30    11   11   30  A  U N             T        Y    7         
TSTIN8X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11   42    8  L  P H             T        Y              
TSTOUT8H DS    XL8                                                              
TSTOUT8  DS    CL30    11   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  L  P H             T        Y              
TSTIN9H  DS    XL8                                                              
TSTIN9   DS    CL30    12   11   30  A  U N             T        Y    7         
TSTIN9X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12   42    8  L  P H             T        Y              
TSTOUT9H DS    XL8                                                              
TSTOUT9  DS    CL30    12   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    2    8  L  P H             T        Y              
TSTINAH  DS    XL8                                                              
TSTINA   DS    CL30    13   11   30  A  U N             T        Y    7         
TSTINAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   42    8  L  P H             T        Y              
TSTOUTAH DS    XL8                                                              
TSTOUTA  DS    CL30    13   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL64    14    2   64  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  L  P N             T        Y              
TSTHX1IH DS    XL8                                                              
TSTHX1I  DS    CL64    15   11   64  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  L  P N             T        Y              
TSTHX1OH DS    XL8                                                              
TSTHX1O  DS    CL64    16   11   64  A  P N             T        Y              
TSTTAB1H DS    XL8                                                              
TSTTAB1  DS    CL78    17    2   78  A  P N             T        Y              
TSTTAB2H DS    XL8                                                              
TSTTAB2  DS    CL78    18    2   78  A  P N             T        Y              
TSTTAB3H DS    XL8                                                              
TSTTAB3  DS    CL78    19    2   78  A  P N             T        Y              
TSTTAB4H DS    XL8                                                              
TSTTAB4  DS    CL78    20    2   78  A  P N             T        Y              
TSTTAB5H DS    XL8                                                              
TSTTAB5  DS    CL78    21    2   78  A  P N             T        Y              
TSTTAB6H DS    XL8                                                              
TSTTAB6  DS    CL78    22    2   78  A  P N             T        Y              
TSTTABXH DS    XL8                                                              
TSTTABX  DS    CL78    23    2   78  A  P N             T        Y              
TSTLST1H DS    XL8                                                              
TSTLST1  DS    CL1     24    2    1  A  U N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2280 BYTES                            
