*          DATA SET PEXDAYEL   AT LEVEL 002 AS OF 12/22/98                      
*                          **PRINTPAK - BUY RECORD                              
*                          EXTENSION DAYS ELEMENT                               
PEXDAYEL DS    0C                                                               
         DS    X'89'               ELEM CODE                                    
         DS    AL1(04)             ELEM LEN                                     
PEXDAYS  DS    PL2                 NUMBER OF EXTENSION DAYS                     
