*          DATA SET PEXXXF5D   AT LEVEL 002 AS OF 10/15/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE1DF5D      DATE 10/15/85                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    5    7  A   P    N         T        Y              
SPCCMMDH DS    CL8                                                              
SPCCMMD  DS    CL1      3   13    1  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL6     24   60    6  A   P    N         T        Y              
SPCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 41   BYTES                            
