*          DATA SET PFRACTAB   AT LEVEL 002 AS OF 06/24/98                      
*        PRINTPAK FRACTIONS TABLE                                               
*                                                                               
*        ENTRIES ARE CODE,DECIMAL EQUIVALENT(5 DECIMAL),FRACTION (6)            
*                                                                               
PFRACTAB DC    AL1(00),AL4(00000),CL6'0/0'                                      
         DC    AL1(02),AL4(03125),CL6'1/32'                                     
         DC    AL1(04),AL4(06250),CL6'1/16'                                     
         DC    AL1(06),AL4(08333),CL6'1/12'                                     
         DC    AL1(08),AL4(09375),CL6'3/32'                                     
         DC    AL1(10),AL4(10000),CL6'1/10'                                     
         DC    AL1(12),AL4(12500),CL6'1/8'                                      
         DC    AL1(14),AL4(15625),CL6'5/32'                                     
         DC    AL1(16),AL4(16667),CL6'1/6'                                      
         DC    AL1(18),AL4(18750),CL6'3/16'                                     
         DC    AL1(20),AL4(20000),CL6'1/5'                                      
         DC    AL1(22),AL4(21875),CL6'7/32'                                     
         DC    AL1(24),AL4(25000),CL6'1/4'                                      
         DC    AL1(26),AL4(28125),CL6'9/32'                                     
         DC    AL1(28),AL4(30000),CL6'3/10'                                     
         DC    AL1(30),AL4(31250),CL6'5/16'                                     
         DC    AL1(32),AL4(33333),CL6'1/3'                                      
         DC    AL1(34),AL4(34375),CL6'11/32'                                    
         DC    AL1(36),AL4(37500),CL6'3/8'                                      
         DC    AL1(38),AL4(40000),CL6'2/5'                                      
         DC    AL1(40),AL4(40625),CL6'13/32'                                    
         DC    AL1(42),AL4(41667),CL6'5/12'                                     
         DC    AL1(44),AL4(43750),CL6'7/16'                                     
         DC    AL1(46),AL4(46875),CL6'15/32'                                    
         DC    AL1(48),AL4(50000),CL6'1/2'                                      
         DC    AL1(50),AL4(53125),CL6'17/32'                                    
         DC    AL1(52),AL4(56250),CL6'9/16'                                     
         DC    AL1(54),AL4(58333),CL6'7/12'                                     
         DC    AL1(56),AL4(59375),CL6'19/32'                                    
         DC    AL1(58),AL4(60000),CL6'3/5'                                      
         DC    AL1(60),AL4(62500),CL6'5/8'                                      
         DC    AL1(62),AL4(65625),CL6'21/32'                                    
         DC    AL1(64),AL4(66667),CL6'2/3'                                      
         DC    AL1(66),AL4(68750),CL6'11/16'                                    
         DC    AL1(68),AL4(70000),CL6'7/10'                                     
         DC    AL1(70),AL4(71875),CL6'23/32'                                    
         DC    AL1(72),AL4(75000),CL6'3/4'                                      
         DC    AL1(74),AL4(78125),CL6'25/32'                                    
         DC    AL1(76),AL4(80000),CL6'4/5'                                      
         DC    AL1(78),AL4(81250),CL6'13/16'                                    
         DC    AL1(80),AL4(83333),CL6'5/6'                                      
         DC    AL1(82),AL4(84375),CL6'27/32'                                    
         DC    AL1(84),AL4(87500),CL6'7/8'                                      
         DC    AL1(86),AL4(90000),CL6'9/10'                                     
         DC    AL1(88),AL4(90625),CL6'29/32'                                    
         DC    AL1(90),AL4(91667),CL6'11/12'                                    
         DC    AL1(92),AL4(93750),CL6'15/16'                                    
         DC    AL1(94),AL4(96875),CL6'31/32'                                    
         DC    AL1(96),AL4(100000),CL6'1/1'                                     
         DC    X'FF'         END OF TABLE                                       
         EJECT                                                                  
*                                                                               
*        USE THIS TABLE TO CONVERT A DECIMAL TO A FRACTION                      
*        IF THE DECIMAL LIES WITHIN THE GIVEN RANGE USE THAT FRACTION           
*        AND INTERNAL CODE                                                      
PFREQVT  DC    AL4(00000),AL4(01562),AL1(00),CL6'0/0'                           
         DC    AL4(01563),AL4(04687),AL1(02),CL6'1/32'                          
         DC    AL4(04688),AL4(07291),AL1(04),CL6'1/16'                          
         DC    AL4(07292),AL4(08854),AL1(06),CL6'1/12'                          
         DC    AL4(08855),AL4(09687),AL1(08),CL6'3/32'                          
         DC    AL4(09688),AL4(11250),AL1(10),CL6'1/10'                          
         DC    AL4(11251),AL4(14062),AL1(12),CL6'1/8'                           
         DC    AL4(14063),AL4(16146),AL1(14),CL6'5/32'                          
         DC    AL4(16147),AL4(17708),AL1(16),CL6'1/6'                           
         DC    AL4(17709),AL4(19375),AL1(18),CL6'3/16'                          
         DC    AL4(19376),AL4(20937),AL1(20),CL6'1/5'                           
         DC    AL4(20938),AL4(23437),AL1(22),CL6'7/32'                          
         DC    AL4(23438),AL4(26562),AL1(24),CL6'1/4'                           
         DC    AL4(26563),AL4(29062),AL1(26),CL6'9/32'                          
         DC    AL4(29063),AL4(30625),AL1(28),CL6'3/10'                          
         DC    AL4(30626),AL4(32291),AL1(30),CL6'5/16'                          
         DC    AL4(32292),AL4(33854),AL1(32),CL6'1/3'                           
         DC    AL4(33855),AL4(35937),AL1(34),CL6'11/32'                         
         DC    AL4(35938),AL4(38750),AL1(36),CL6'3/8'                           
         DC    AL4(38751),AL4(40312),AL1(38),CL6'2/5'                           
         DC    AL4(40313),AL4(41146),AL1(40),CL6'13/32'                         
         DC    AL4(41147),AL4(42708),AL1(42),CL6'5/12'                          
         DC    AL4(42709),AL4(45312),AL1(44),CL6'7/16'                          
         DC    AL4(45313),AL4(48437),AL1(46),CL6'15/32'                         
         DC    AL4(48438),AL4(51562),AL1(48),CL6'1/2'                           
         DC    AL4(51563),AL4(54687),AL1(50),CL6'17/32'                         
         DC    AL4(54688),AL4(57291),AL1(52),CL6'9/16'                          
         DC    AL4(57292),AL4(58854),AL1(54),CL6'7/12'                          
         DC    AL4(58855),AL4(59687),AL1(56),CL6'19/32'                         
         DC    AL4(59688),AL4(61250),AL1(58),CL6'3/5'                           
         DC    AL4(61251),AL4(64062),AL1(60),CL6'5/8'                           
         DC    AL4(64063),AL4(66146),AL1(62),CL6'21/32'                         
         DC    AL4(66147),AL4(67708),AL1(64),CL6'2/3'                           
         DC    AL4(67709),AL4(69375),AL1(66),CL6'11/16'                         
         DC    AL4(69376),AL4(70937),AL1(68),CL6'7/10'                          
         DC    AL4(70938),AL4(73437),AL1(70),CL6'23/32'                         
         DC    AL4(73438),AL4(76562),AL1(72),CL6'3/4'                           
         DC    AL4(76563),AL4(79062),AL1(74),CL6'25/32'                         
         DC    AL4(79063),AL4(80625),AL1(76),CL6'4/5'                           
         DC    AL4(80626),AL4(82291),AL1(78),CL6'13/16'                         
         DC    AL4(82292),AL4(83854),AL1(80),CL6'5/6'                           
         DC    AL4(83855),AL4(85937),AL1(82),CL6'27/32'                         
         DC    AL4(85938),AL4(88750),AL1(84),CL6'7/8'                           
         DC    AL4(88751),AL4(90312),AL1(86),CL6'9/10'                          
         DC    AL4(90313),AL4(91146),AL1(88),CL6'29/32'                         
         DC    AL4(91147),AL4(92708),AL1(90),CL6'11/12'                         
         DC    AL4(92709),AL4(95312),AL1(92),CL6'15/16'                         
         DC    AL4(95313),AL4(98437),AL1(94),CL6'31/32'                         
         DC    AL4(98438),AL4(100000),AL1(96),CL6'1/1'                          
         DC    X'FFFF'               END OF TABLE                               
