*          DATA SET PIMPRSEL   AT LEVEL 011 AS OF 04/01/99                      
*                          **PRINTPAK - BUY RECORD                              
*                          IMPRESSIONS ELEMENT (FOR WEBSITES)                   
PIMPRSEL DS    0C                  IMPRESSIONS ELEMENT                          
         DS    X'92'               ELEM CODE                                    
         DS    AL1(07)             ELEM LEN                                     
PIMPRS   DS    PL5                 NUMBER OF IMPRESSIONS                        
