*          DATA SET PISITEEL   AT LEVEL 009 AS OF 03/07/02                      
*                          **PRINTPAK - BUY RECORD                              
*                          INTERNET SITE ELEMENT                                
PISITEEL DSECT                                                                  
         DS    X'98'               ELEM CODE                                    
         DS    AL1(22)             ELEM LEN                                     
PISITE   DS    CL20                INTERNET SITE                                
