*          DATA SET PISNMEL    AT LEVEL 001 AS OF 11/29/01                      
*                          **PRINTPAK - BUY RECORD                              
*                          ACTUAL CPM                                           
PACPMELD DSECT                                                                  
PACPMEL  DS    X'A1'               ELEM CODE                                    
         DS    AL1(09)             ELEM LEN                                     
PACPM    DS    PL5                 CPM (2 DECIMALS)                             
         DS    XL2                 SPARE BYTES                                  
