*          DATA SET PLISDTEL   AT LEVEL 002 AS OF 10/07/74                      
*                                  ** PRINTPAK LIST DATE ELEMENT **             
PLISDTEL DS    0C .                                                             
         DS    X'10' .   B         ELEMENT CODE                                 
         DS    AL1(27) . B         ELEMENT LENGTH                               
*                                                                               
PLISDAT  DS    XL3 .     B         DATE OF CREATION                             
*                                  LAST MAINTENANCE - YYMMDD                    
PLISNPBS DS    XL2 .     B         NUMBER OF PUBS IN LIST                       
PLISDESC DS    CL20 .    AN        LIST DESCRIPTION                             
*                                                                               
