*          DATA SET POFFPRDPP  AT LEVEL 001 AS OF 12/13/00                      
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
*       PRINTPAK OFFICE/PRODUCT PASSIVE POINTER                                 
*                                                                               
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
POFPKEY  DS    0CL25                                                            
POFPKAGY DS    CL2                 AGENCY CODE                                  
POFPKMED DS    CL1                 MEDIA                                        
POFPKRCD DS    XL1'A3'                                                          
POFPKIDQ EQU   X'A3'               OFFICE/PRD PP RECORD ID                      
POFPKCLT DS    CL3                 CLIENT CODE                                  
POFPKOFF DS    CL1                 OFFICE CODE                                  
POFPKPRD DS    CL3                 PRODUCT CODE                                 
         DS    CL14                SPARE                                        
*                                                                               
POFPCNTL DS    XL2                                                              
POFPDISK DS    XL4                 DISK ADDRESS (PRODUCT)                       
