*          DATA SET POFFCLTPP  AT LEVEL 001 AS OF 06/13/95                      
*=======================================================*                       
*                                                                               
*       PRINTPAK OFFICE/CLIENT PASSIVE POINTER                                  
*                                                                               
*=======================================================*                       
*                                                                               
POFCKEY  DS    0CL25                                                            
POFCKAGY DS    CL2                 AGENCY CODE                                  
POFCKMED DS    CL1                 MEDIA                                        
POFCKRCD DS    XL1'A2'             RECORD ID                                    
POFCKIDQ EQU   X'A2'               OFF-CLT POINTER ID                           
POFCKOFF DS    CL1                 OFFICE CODE                                  
POFCKCLT DS    CL3                 CLIENT CODE                                  
         DS    CL17                SPARE                                        
*                                                                               
POFCCNTL DS    XL2                                                              
POFCDISK DS    XL4                 DISK ADDRESS (CLIENT)                        
