*          DATA SET POTHAGY    AT LEVEL 016 AS OF 08/10/88                      
POTHREC  DS    0C .                *** PRINTPAK - OTHER AGENCY RECORD *         
*                                                                               
*                                                                               
POTHKEY  DS    0CL25                                                            
POTHKAGY DS    CL2 .     A         AGENCY CODE                                  
POTHKMED DS    CL1 .     A         MEDIA CODE                                   
POTHKRCD DS    X'16' .   B         RECORD CODE                                  
POTHCODE DS    CL2       A         OTHER AGENCY POWER CODE                      
         DS    19X'00'                                                          
POTHLEN  DS    CL2 .     B         RECORD LENGTH                                
POTHCNTL DS    CL2 .     B         CONTROL BYTES                                
         DS    CL4 .     B         DISK ADDRESS FOR LINKED RECORDS              
*                                                                               
POTHELEM DS    0CL179                                                           
         DS    X'01' .   B         AGENCY ELEMENT CODE                          
         DS    X'B3' .   B         ELEMENT LENGTH                               
POTHNAME DS    CL33 .    AN        AGENCY NAME                                  
POTHADDR DS    CL33 .    AN        AGENCY ADDRESS 1                             
POTHADD2 DS    CL33 .    AN        AGENCY ADDRESS 2                             
POTHADD3 DS    CL33 .    AN        AGENCY ADDRESS 3                             
POTHADD4 DS    CL33 .    AN        AGENCY ADDRESS 4                             
         DS    CL14 .    N         SPARE                                        
