*          DATA SET PP20WRKC   AT LEVEL 005 AS OF 03/18/75                      
         TITLE 'PP20WRK - ICL WORK AREA'                                        
PP20WRKC CSECT                                                                  
*                                                                               
*                        PUB TOTALS - 4F                                        
*                             GROSS                                             
*                             GROSS LESS AGY COMM                               
*                             CASH DISC                                         
*                             NET PAYABLE                                       
PUBTOTS  DS    4F                                                               
*                                                                               
PAYSW    DS    CL1                                                              
PUSW     DS    CL1                                                              
SPSW     DS    CL1                                                              
PRNTSW   DS    CL1                                                              
BUYSW    DS    CL1                                                              
*                                                                               
ELCODE   DS    C                                                                
*                                                                               
BSTART   DS    XL3                                                              
BEND     DS    XL3                                                              
STPUB    DS    CL89                                                             
         SPACE 2                                                                
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'005PP20WRKC  03/18/75'                                      
         END                                                                    
