*          DATA SET PP66WRKN   AT LEVEL 035 AS OF 10/11/85                      
PP66WRKD DSECT                                                                  
*                                                                               
APUBTOT  DS    A                                                                
AVENTOT  DS    A                                                                
AMKTTOT  DS    A                                                                
ADSTTOT  DS    A                                                                
AREGTOT  DS    A                                                                
AESTTOT  DS    A                                                                
APRDTOT  DS    A                                                                
ADIVTOT  DS    A                                                                
ACLTTOT  DS    A                                                                
ADSTTOTB DS    A                                                                
AREGTOTB DS    A                                                                
AESTTOTB DS    A                                                                
APRDTOTB DS    A                                                                
ADIVTOTB DS    A                                                                
ACLTTOTB DS    A                                                                
ABRDT    DS    A                                                                
ABRDTX   DS    A                                                                
ABRDTB   DS    A                                                                
ABRDTBX  DS    A                                                                
APRDTAB  DS    A                                                                
APRDTABX DS    A                                                                
AKLINES  DS    A                                                                
AILINES  DS    A                                                                
ASPCTAB  DS    A                                                                
ASPCTABX DS    A                                                                
AJOBLST  DS    A                                                                
AESSUM   DS    A                                                                
ABRDSUM  DS    A                                                                
ARTLOOK  DS    A                                                                
ASUMFMT  DS    A                                                                
ACOMPRT  DS    A                                                                
AWFMOD   DS    A                                                                
APUBEDIT DS    A                                                                
APUBOUT  DS    A                                                                
AENDPUB  DS    A                                                                
AENDPTOT DS    A                                                                
AGETBUD  DS    A                                                                
ABUYACC  DS    A                                                                
APRNT    DS    A                                                                
AOUTER   DS    A                                                                
AFNDJOB  DS    A                                                                
ARTLKELS DS    A                                                                
ABUYINV  DS    A                                                                
ABUYCON  DS    A                                                                
AENDBRKS DS    A                                                                
AESMTHS  DS    A                                                                
APPRDSHR DS    A                                                                
APPUNBUY DS    A                                                                
ACHOPPER DS    A                                                                
*                                                                               
*                                                                               
REPRESV  DS    F                                                                
*                                                                               
SAVERE   DS    A                                                                
IMDSPL   DS    A                                                                
BMDSPL   DS    A                                                                
ACURKLN  DS    A                                                                
ATOT     DS    A                                                                
LASTCKEY DS    CL8                                                              
ELCODE   DS    C                                                                
CONSW    DS    C              0 IF CONTRACT NOT PRINTED YET                     
HAVCSW   DS    CL1                 SET TO X'01' IF I HAVE A CON                 
ESTACTIV DS    X                                                                
BTODAY   DS    CL3                                                              
BSTART   DS    CL3                                                              
BEND     DS    CL3                                                              
EDITCNT  DS    H                   COUNT OF EDITIONS PER VENDOR                 
EDVENSW  DS    C                                                                
LASTEDVN DS    C                                                                
LASTMODE DS    X                                                                
PBRCNT   DS    H                   COUNT OF PUBS PER MKT                        
MYDUB    DS    D                                                                
JOBFILT  DS    CL6                                                              
COMSW    DS    X                                                                
         DS    0F                                                               
RMTAB    DS    CL44                21 MONTHS + 2X'00'                           
WORK2    DS    CL40                                                             
SAVEP    DS    CL132                                                            
SAVEP2   DS    CL132                                                            
SAVPUBN1 DS    CL132                                                            
SAVPUBN2 DS    CL132                                                            
SAVPUBN3 DS    CL132                                                            
PLINSW   DS    X                                                                
*                                                                               
PRDESTSW DS    X                                                                
MEDIANM  DS    CL25                                                             
MEDIAUL  DS    CL25                                                             
PERHD    DS    CL25                                                             
RDHEAD11 DS    CL18                                                             
RDHEAD12 DS    CL18                                                             
PBHEAD10 DS    CL132                                                            
PBHEAD11 DS    CL132                                                            
PBHEAD12 DS    CL132                                                            
SAVEMAX  DS    CL1                                                              
WRITTOTS DS    CL40            5 PL8'S                                          
REGNOTE  DS    F                                                                
REGNOTE2 DS    H                                                                
DSTNOTE  DS    F                                                                
DSTNOTE2 DS    H                                                                
DSTBUD   DS    PL8                                                              
REGBUD   DS    PL8                                                              
WFREC    DS    CL120                                                            
WFREGSW  DS    X                                                                
WFDSTSW  DS    X                                                                
SUMSUMS  DS    XL5                                                              
SUMSW    DS    XL1                                                              
BUDSW    DS    X                                                                
PRNTSW   DS    XL1                                                              
MYHEAD8  DS    CL132                                                            
MYHEAD9  DS    CL132                                                            
MYHEAD10 DS    CL132                                                            
MYSUMHD8 DS    CL132                                                            
MYSUMH10 DS    CL132                                                            
MYSUMH11 DS    CL132                                                            
MYSUMH12 DS    CL132                                                            
MYSMBH10 DS    CL132                                                            
MYSMBH11 DS    CL132                                                            
MYSMBH12 DS    CL132                                                            
         ORG                                                                    
         DS    0F                                                               
QTRTOTS  DS    0CL40                                                            
QTRTOT   DS    5PL8                                                             
GRDTOTS  DS    0CL40                                                            
GRDTOT   DS    5PL8                                                             
*                                                                               
SAVPVALS DS    CL68                                                             
SAVESPC  DS    X                                                                
DASHES   DS    CL30                                                             
SAVBKEY  DS    CL25                                                             
RPAGE    DS    XL2                                                              
SPAGE    DS    XL2                                                              
RDPACT   DS    X                                                                
CONWRK   DS    CL100                                                            
         DS    0F                                                               
SAVPARS  DS    0CL24                                                            
         DS    6F                                                               
SAVEKEY  DS    CL32                                                             
SVKEY    DS    CL32                                                             
SVASPO   DS    CL13                                                             
OLDPUB   DS    CL6                                                              
OLDCPUB  DS    CL6                                                              
AREC     DS    A                                                                
ACURILN  DS    A                                                                
         DS    0F                                                               
SVGROSS  DS    CL12                                                             
BUYASPO  DS    CL13                                                             
*                                                                               
SPPGMODE DS    CL1                 SAVED PPG MODE                               
LSORTREC DS    CL96                SAVED LAST SORTREC                           
*                                                                               
         SPACE 2                                                                
         EJECT                                                                  
*          DATA SET PPUNBUYD   AT LEVEL 004 AS OF 11/18/76                      
         SPACE                                                                  
* DSECT FOR PPUNBUY FIELD EXPANSIONS                                            
         SPACE                                                                  
PPUNBPRT DS    H                   NUMBER OF PRINT LINES REQUIRED               
PPUNBDT  DS    CL8       MN        INSERTION DATE                               
PPUNBLNS DS    CL5        N        LINEAGE                                      
PPUNBRT  DS    CL8        N        LINE RATE                                    
PPUNBPR  DS    CL10       N        PREMIUM                                      
PPUNBGR  DS    CL12      MN        GROSS                                        
         DS    CL5                 SPARE                                        
PPUNBZZZ DS    CL50      MN        POOL ALLOCATIONS                             
PPUNBCOM DS    CL47                COMMENT                                      
PPUNBBFD DS    CL27                BFD COMMENT                                  
         DS    CL26                                                             
*                                                                               
* TOTAL LEN= 200 BYTES                                                          
*                                  ESTIMATE PRINT CONTROLS                      
*                                                                               
ESCTL    DS    0CL25                                                            
ESCDATS  DS    XL2                 DATES TO PRINT - MAG                         
*                                  X'06' =  CLOSE                               
*                                  X'07' =  SALE                                
*                                  X'08' =  PAYABLE                             
ESCDETS  DS    XL3                 DETAIL $ TO PRINT                            
*                                  X'01' =  GROSS                               
*                                  X'02' =  NET                                 
*                                  X'03' =  CD                                  
*                                  X'04' = GROSS - CD                           
*                                  X'05' = NET - CD                             
ESCSUMS  DS    XL5                 SUMMARY $ TO PRINT                           
*                                  X'01' =  GROSS                               
*                                  X'02' =  NET                                 
*                                  X'03' =  CD                                  
*                                  X'04' =  GROSS - CD                          
*                                  X'05' =  NET - CD                            
ESCSUMSB DS    XL5                 SUMMARY $ TO PRINT (BILLING)                 
ESCPBAD  DS    X                   C'0'  =  NO PUB ADDR TO PRINT                
ESCCONC  DS    X                   CONTRACT PRINT CONTROL                       
*                                  C'N'  =  NONE                                
*                                  C'S'  =  SUPPRESS RATES                      
*                                  C'0'  =  ALL                                 
ESCLINS  DS    X                   LINEAGE TOTALS - NEWS                        
*                                  C'0' = NONE                                  
*                                  C'1' = DETAIL LINES                          
*                                  C'A' = DETAIL INCHES                         
*                                  C'2' = DET + SUM LINES                       
*                                  C'B' = DET + SUM INCHES                      
ESCOS    DS    X                   C'1'  = OS SUMMARY NOT INSERT - MAG          
ESCQTRS  DS    X                   C'Q'  = QTR TOTS ON SUMMARIES                
ESCPBTOT DS    X                   C'1'  = 1 PUB PER PAGE + PUB TOTS            
ESCPBREC DS    X                   C'1'  = PUB RECAP ON SUMMARIES               
ESCBUDG  DS    X                   C'1'  = BUDGET $ ON SUMMARIES                
ESCCIRC  DS    X                   C'0' = CIRC TO PRINT                         
*                                  C'S' = SUPPRESS CIRC                         
ESCJOB   DS    CL1                 C'1' = COPY NO.                              
*                                  C'2' = COPY NO. + CAPTION                    
ESCCENTS DS    CL1                 C'$' = NO CENTS IN SUMMARYS                  
         DS    4X                  SPARE                                        
*                                                                               
*                                                                               
PROF     DS    CL32                                                             
*                                                                               
HOLDSPAC DS    CL17                                                             
SVPKPUB  DS    XL6                                                              
SVPNAME  DS    CL20                                                             
SVPZNAME DS    CL20                                                             
SVPCITY  DS    CL16                                                             
SVPSTATE DS    CL2                                                              
*                                                                               
*                                                                               
LNKPUBS  DS    CL95                10 LINKS PLUS 5 X'FF' S                      
*                                                                               
*                                                                               
RDSHROUT DS    0CL227              OUTPUT AREA FOR PPRDHSR                      
RDSHRFST DS    X                   X'1' = PRIMARY REG/DST                       
RDSHRLNC DS    X                   NO OF LINES TO PRINT                         
RDSHRLNS DS    5CL45                                                            
*                                                                               
         DS    X                                                                
ACCL     EQU   880          105 ACCUMS X 8BYTES EACH                            
*                           PLUS 40 SPARE                                       
ACCN     EQU   105          21 MTHS X 5 ACCUMS                                  
ROWL     EQU   40           5 PL8'S                                             
*                                                                               
DGRS     EQU   0                                                                
DCD      EQU   8                                                                
DAC      EQU   16                                                               
DLNS     EQU   24                                                               
DBUD     EQU   32                                                               
*                                                                               
*                                                                               
SORTRECD DSECT                                                                  
SORTREC  DS    0CL96                                                            
SORTCLI  DS    CL3                                                              
SORTDIV  DS    CL3                                                              
SORTASPO DS    CL13                                                             
SORTPUB  DS    CL26                                                             
SORTCON  DS    CL2                                                              
SORTAP   DS    CL5                 AGY/PRD                                      
SORTCUST DS    CL10                CUSTOMER                                     
SORTSPCE DS    CL13                SHORTENED SPACE                              
SORTDATE DS    CL3                                                              
SORTLIN  DS    CL1                                                              
SORTDISK DS    CL4                                                              
SAVEASPO DS    CL13                                                             
