*          DATA SET PP79BRECS  AT LEVEL 001 AS OF 07/19/78                      
         DS    F                                                                
SLRREC   DS    0CL200                                                           
SLRCOD   DS    CL1'R'                                                           
SLRNAM   DS    CL30                                                             
SLRLIN1  DS    CL30                                                             
SLRLIN2  DS    CL30                                                             
SLRCOM1  DS    CL35                                                             
SLRCOM2  DS    CL35                                                             
SLRCOM3  DS    CL35                                                             
         DS    CL4                                                              
         DS    F                                                                
SLAREC   DS    0CL130                                                           
SLACOD   DS    CL1'A'                                                           
SLANAM   DS    CL30                                                             
SLALIN1  DS    CL30                                                             
SLALIN2  DS    CL30                                                             
SLALIN3  DS    CL30                                                             
SLACOUNT DS    PL2                                                              
         DS    CL7                                                              
