*          DATA SET PPADSD5D   AT LEVEL 015 AS OF 12/22/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40BD5D      DATE 12/22/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
ISSTYPH  DS    CL8                                                              
ISSTYP   DS    CL2      5    7    2  A  U N             T        Y   10         
ISSTYPX  DS    CL8                                                              
ISSTYNH  DS    CL8                                                              
ISSTYN   DS    CL8      5   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   21    5  A  P N             T        Y              
ISSTITH  DS    CL8                                                              
ISSTIT   DS    CL50     5   27   50  A  U N             T        Y   20         
ISSTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
ISSDATAH DS    CL8                                                              
ISSDATA  DS    CL8      6    7    8  A  U N             T        Y   30         
ISSDATAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     8   35   19  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  A  P N             T        Y              
ISSMOR1H DS    CL8                                                              
ISSMOR1  DS    CL2     10    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
ISSIS1H  DS    CL8                                                              
ISSIS1   DS    CL78    11    2   78  A  P N             T        Y              
ISSIS2H  DS    CL8                                                              
ISSIS2   DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
ISSISLH  DS    CL8                                                              
ISSISL   DS    CL78    23    2   78  A  P N             T        Y              
ISSMORLH DS    CL8                                                              
ISSMORL  DS    CL2     24    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL40    24    5   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   68    6  A  P N             T        Y              
ISSSCRLH DS    CL8                                                              
ISSSCRL  DS    CL5     24   75    5  L  U N             T        Y  190         
ISSSCRLX DS    CL8                                                              
ISSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ISSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1592 BYTES                            
