*          DATA SET PPADSD2D   AT LEVEL 009 AS OF 12/22/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40BD2D      DATE 12/22/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
BLDTYPH  DS    CL8                                                              
BLDTYP   DS    CL2      5    7    2  A  U N             T        Y   10         
BLDTYPX  DS    CL8                                                              
BLDTYNH  DS    CL8                                                              
BLDTYN   DS    CL8      5   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   21    5  A  P N             T        Y              
BLDTITH  DS    CL8                                                              
BLDTIT   DS    CL50     5   27   50  A  U N             T        Y   20         
BLDTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
BLDDATAH DS    CL8                                                              
BLDDATA  DS    CL8      6    7    8  A  U N             T        Y   30         
BLDDATAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     7    2   20  A  P N             T        Y              
BLDMOR1H DS    CL8                                                              
BLDMOR1  DS    CL2      7   24    2  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     7   41   20  A  P N             T        Y              
BLDAD1H  DS    CL8                                                              
BLDAD1   DS    CL17     8    2   17  A  P N             T        Y              
BLDSZ1H  DS    CL8                                                              
BLDSZ1   DS    CL19     8   21   19  A  P N             T        Y              
BLDADJH  DS    CL8                                                              
BLDADJ   DS    CL17     8   41   17  A  P N             T        Y              
BLDSZJH  DS    CL8                                                              
BLDSZJ   DS    CL19     8   59   19  A  P N             T        Y              
BLDAD2H  DS    CL8                                                              
BLDAD2   DS    CL17     9    2   17  A  P N             T        Y              
BLDSZ2H  DS    CL8                                                              
BLDSZ2   DS    CL19     9   21   19  A  P N             T        Y              
BLDADKH  DS    CL8                                                              
BLDADK   DS    CL17     9   41   17  A  P N             T        Y              
BLDSZKH  DS    CL8                                                              
BLDSZK   DS    CL19     9   59   19  A  P N             T        Y              
BLDAD3H  DS    CL8                                                              
BLDAD3   DS    CL17    10    2   17  A  P N             T        Y              
BLDSZ3H  DS    CL8                                                              
BLDSZ3   DS    CL19    10   21   19  A  P N             T        Y              
BLDADLH  DS    CL8                                                              
BLDADL   DS    CL17    10   41   17  A  P N             T        Y              
BLDSZLH  DS    CL8                                                              
BLDSZL   DS    CL19    10   59   19  A  P N             T        Y              
BLDAD5H  DS    CL8                                                              
BLDAD5   DS    CL17    11    2   17  A  P N             T        Y              
BLDSZ5H  DS    CL8                                                              
BLDSZ5   DS    CL19    11   21   19  A  P N             T        Y              
BLDADNH  DS    CL8                                                              
BLDADN   DS    CL17    11   41   17  A  P N             T        Y              
BLDSZNH  DS    CL8                                                              
BLDSZN   DS    CL19    11   59   19  A  P N             T        Y              
BLDAD6H  DS    CL8                                                              
BLDAD6   DS    CL17    12    2   17  A  P N             T        Y              
BLDSZ6H  DS    CL8                                                              
BLDSZ6   DS    CL19    12   21   19  A  P N             T        Y              
BLDADOH  DS    CL8                                                              
BLDADO   DS    CL17    12   41   17  A  P N             T        Y              
BLDSZOH  DS    CL8                                                              
BLDSZO   DS    CL19    12   59   19  A  P N             T        Y              
BLDAD7H  DS    CL8                                                              
BLDAD7   DS    CL17    13    2   17  A  P N             T        Y              
BLDSZ7H  DS    CL8                                                              
BLDSZ7   DS    CL19    13   21   19  A  P N             T        Y              
BLDADPH  DS    CL8                                                              
BLDADP   DS    CL17    13   41   17  A  P N             T        Y              
BLDSZPH  DS    CL8                                                              
BLDSZP   DS    CL19    13   59   19  A  P N             T        Y              
BLDAD8H  DS    CL8                                                              
BLDAD8   DS    CL17    14    2   17  A  P N             T        Y              
BLDSZ8H  DS    CL8                                                              
BLDSZ8   DS    CL19    14   21   19  A  P N             T        Y              
BLDADQH  DS    CL8                                                              
BLDADQ   DS    CL17    14   41   17  A  P N             T        Y              
BLDSZQH  DS    CL8                                                              
BLDSZQ   DS    CL19    14   59   19  A  P N             T        Y              
BLDAD9H  DS    CL8                                                              
BLDAD9   DS    CL17    15    2   17  A  P N             T        Y              
BLDSZ9H  DS    CL8                                                              
BLDSZ9   DS    CL19    15   21   19  A  P N             T        Y              
BLDADRH  DS    CL8                                                              
BLDADR   DS    CL17    15   41   17  A  P N             T        Y              
BLDSZRH  DS    CL8                                                              
BLDSZR   DS    CL19    15   59   19  A  P N             T        Y              
BLDADBH  DS    CL8                                                              
BLDADB   DS    CL17    16    2   17  A  P N             T        Y              
BLDSZBH  DS    CL8                                                              
BLDSZB   DS    CL19    16   21   19  A  P N             T        Y              
BLDADTH  DS    CL8                                                              
BLDADT   DS    CL17    16   41   17  A  P N             T        Y              
BLDSZTH  DS    CL8                                                              
BLDSZT   DS    CL19    16   59   19  A  P N             T        Y              
BLDADCH  DS    CL8                                                              
BLDADC   DS    CL17    17    2   17  A  P N             T        Y              
BLDSZCH  DS    CL8                                                              
BLDSZC   DS    CL19    17   21   19  A  P N             T        Y              
BLDSAFH  DS    CL8                                                              
BLDSAF   DS    CL17    17   41   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    17   59   19  A  P N             T        Y              
BLDADDH  DS    CL8                                                              
BLDADD   DS    CL17    18    2   17  A  P N             T        Y              
BLDSZDH  DS    CL8                                                              
BLDSZD   DS    CL19    18   21   19  A  P N             T        Y              
BLDFT1H  DS    CL8                                                              
BLDFT1   DS    CL17    18   41   17  A  P N             T        Y              
BLDFZ1H  DS    CL8                                                              
BLDFZ1   DS    CL19    18   59   19  A  P N             T        Y              
BLDADFH  DS    CL8                                                              
BLDADF   DS    CL17    19    2   17  A  P N             T        Y              
BLDSZFH  DS    CL8                                                              
BLDSZF   DS    CL19    19   21   19  A  P N             T        Y              
BLDFT2H  DS    CL8                                                              
BLDFT2   DS    CL17    19   41   17  A  P N             T        Y              
BLDFZ2H  DS    CL8                                                              
BLDFZ2   DS    CL19    19   59   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    20    2   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    20   21   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    20   41   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    20   59   19  A  P N             T        Y              
BLDADGH  DS    CL8                                                              
BLDADG   DS    CL17    21    2   17  A  P N             T        Y              
BLDSZGH  DS    CL8                                                              
BLDSZG   DS    CL19    21   21   19  A  P N             T        Y              
BLDFT3H  DS    CL8                                                              
BLDFT3   DS    CL17    21   41   17  A  P N             T        Y              
BLDFZ3H  DS    CL8                                                              
BLDFZ3   DS    CL19    21   59   19  A  P N             T        Y              
BLDADHH  DS    CL8                                                              
BLDADH   DS    CL17    22    2   17  A  P N             T        Y              
BLDSZHH  DS    CL8                                                              
BLDSZH   DS    CL19    22   21   19  A  P N             T        Y              
BLDFT4H  DS    CL8                                                              
BLDFT4   DS    CL17    22   41   17  A  P N             T        Y              
BLDFZ4H  DS    CL8                                                              
BLDFZ4   DS    CL19    22   59   19  A  P N             T        Y              
BLDADIH  DS    CL8                                                              
BLDADI   DS    CL17    23    2   17  A  P N             T        Y              
BLDSZIH  DS    CL8                                                              
BLDSZI   DS    CL19    23   21   19  A  P N             T        Y              
BLDFT5H  DS    CL8                                                              
BLDFT5   DS    CL17    23   41   17  A  P N             T        Y              
BLDFZ5H  DS    CL8                                                              
BLDFZ5   DS    CL19    23   59   19  A  P N             T        Y              
BLDMORLH DS    CL8                                                              
BLDMORL  DS    CL2     24    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL40    24    5   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   68    6  A  P N             T        Y              
BLDSCRLH DS    CL8                                                              
BLDSCRL  DS    CL5     24   75    5  L  U N             T        Y  190         
BLDSCRLX DS    CL8                                                              
BLDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BLDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2000 BYTES                            
