*          DATA SET PPADVCLTBL AT LEVEL 001 AS OF 09/28/90                      
*==================================================*                            
*             ADVERTISER LINK TO AOR               *                            
*==================================================*                            
PPADVTRC DS    0C                                                               
PPADSIGN DS    CL5                 ADVERTISER SIGN ON                           
PPADAPC  DS    CL2                 ADVERTISER POWER CODE                        
PPADAMED DS    CL1                 ADVERTISER MEDIA                             
PPADACLT DS    CL3                 ADVERTISER CLIENT                            
PPADAOPC DS    CL2                 AOR POWER CODE                               
PPADAOSO DS    CL5                 AOR SIGN ON                                  
PPADAOCL DS    CL3                 AOR CLIENT                                   
PPADPADD DS    CL4                 ADDRESS OF PUB CROSS REF                     
         DS    CL4                 SPARE                                        
PPADLENG DC    AL1(*-PPADVTRC)     LENGTH OF ENTRY                              
