*          DATA SET PPADSE0D   AT LEVEL 011 AS OF 12/22/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40BE0D      DATE 12/22/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
LSTTYPH  DS    CL8                                                              
LSTTYP   DS    CL2      5    7    2  A  U N             T        Y   10         
LSTTYPX  DS    CL8                                                              
LSTTYNH  DS    CL8                                                              
LSTTYN   DS    CL8      5   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   21    5  A  P N             T        Y              
LSTTITH  DS    CL8                                                              
LSTTIT   DS    CL50     5   27   50  A  U N             T        Y   20         
LSTTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
LSTDATAH DS    CL8                                                              
LSTDATA  DS    CL8      6    7    8  A  U N             T        Y   30         
LSTDATAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
LSTFLTH  DS    CL8                                                              
LSTFLT   DS    CL65     7   10   65  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     8   31   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
LSTSEL1H DS    CL8                                                              
LSTSEL1  DS    CL3     10    2    3  A  U N             T        Y    0         
LSTSEL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
LSTSEL2H DS    CL8                                                              
LSTSEL2  DS    CL3     11    2    3  A  U N             T        Y    0         
LSTSEL2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
LSTSELLH DS    CL8                                                              
LSTSELL  DS    CL3     23    2    3  A  U N             T        Y    0         
LSTSELLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    24    2   75  A  P N             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
