*          DATA SET PPADSD1D   AT LEVEL 008 AS OF 12/22/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40BD1D      DATE 12/22/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
ADSTYPH  DS    CL8                                                              
ADSTYP   DS    CL2      5    7    2  A  U N             T        Y   10         
ADSTYPX  DS    CL8                                                              
ADSTYNH  DS    CL8                                                              
ADSTYN   DS    CL8      5   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   21    5  A  P N             T        Y              
ADSTITH  DS    CL8                                                              
ADSTIT   DS    CL50     5   27   50  A  U N             T        Y   20         
ADSTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
ADSDATAH DS    CL8                                                              
ADSDATA  DS    CL8      6    7    8  A  U N             T        Y   30         
ADSDATAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
ADSTRMH  DS    CL8                                                              
ADSTRM   DS    CL20     7   14   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
ADSMOR1H DS    CL8                                                              
ADSMOR1  DS    CL2      8   18    2  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     8   41   14  A  P N             T        Y              
ADSAD1H  DS    CL8                                                              
ADSAD1   DS    CL17     9    2   17  A  P N             T        Y              
ADSSZ1H  DS    CL8                                                              
ADSSZ1   DS    CL19     9   21   19  A  P N             T        Y              
ADSADIH  DS    CL8                                                              
ADSADI   DS    CL17     9   41   17  A  P N             T        Y              
ADSSZIH  DS    CL8                                                              
ADSSZI   DS    CL19     9   59   19  A  P N             T        Y              
ADSAD2H  DS    CL8                                                              
ADSAD2   DS    CL17    10    2   17  A  P N             T        Y              
ADSSZ2H  DS    CL8                                                              
ADSSZ2   DS    CL19    10   21   19  A  P N             T        Y              
ADSADJH  DS    CL8                                                              
ADSADJ   DS    CL17    10   41   17  A  P N             T        Y              
ADSSZJH  DS    CL8                                                              
ADSSZJ   DS    CL19    10   59   19  A  P N             T        Y              
ADSAD4H  DS    CL8                                                              
ADSAD4   DS    CL17    11    2   17  A  P N             T        Y              
ADSSZ4H  DS    CL8                                                              
ADSSZ4   DS    CL19    11   21   19  A  P N             T        Y              
ADSADLH  DS    CL8                                                              
ADSADL   DS    CL17    11   41   17  A  P N             T        Y              
ADSSZLH  DS    CL8                                                              
ADSSZL   DS    CL19    11   59   19  A  P N             T        Y              
ADSAD5H  DS    CL8                                                              
ADSAD5   DS    CL17    12    2   17  A  P N             T        Y              
ADSSZ5H  DS    CL8                                                              
ADSSZ5   DS    CL19    12   21   19  A  P N             T        Y              
ADSADMH  DS    CL8                                                              
ADSADM   DS    CL17    12   41   17  A  P N             T        Y              
ADSSZMH  DS    CL8                                                              
ADSSZM   DS    CL19    12   59   19  A  P N             T        Y              
ADSAD6H  DS    CL8                                                              
ADSAD6   DS    CL17    13    2   17  A  P N             T        Y              
ADSSZ6H  DS    CL8                                                              
ADSSZ6   DS    CL19    13   21   19  A  P N             T        Y              
ADSADNH  DS    CL8                                                              
ADSADN   DS    CL17    13   41   17  A  P N             T        Y              
ADSSZNH  DS    CL8                                                              
ADSSZN   DS    CL19    13   59   19  A  P N             T        Y              
ADSAD7H  DS    CL8                                                              
ADSAD7   DS    CL17    14    2   17  A  P N             T        Y              
ADSSZ7H  DS    CL8                                                              
ADSSZ7   DS    CL19    14   21   19  A  P N             T        Y              
ADSADOH  DS    CL8                                                              
ADSADO   DS    CL17    14   41   17  A  P N             T        Y              
ADSSZOH  DS    CL8                                                              
ADSSZO   DS    CL19    14   59   19  A  P N             T        Y              
ADSAD8H  DS    CL8                                                              
ADSAD8   DS    CL17    15    2   17  A  P N             T        Y              
ADSSZ8H  DS    CL8                                                              
ADSSZ8   DS    CL19    15   21   19  A  P N             T        Y              
ADSADPH  DS    CL8                                                              
ADSADP   DS    CL17    15   41   17  A  P N             T        Y              
ADSSZPH  DS    CL8                                                              
ADSSZP   DS    CL19    15   59   19  A  P N             T        Y              
ADSAD9H  DS    CL8                                                              
ADSAD9   DS    CL17    16    2   17  A  P N             T        Y              
ADSSZ9H  DS    CL8                                                              
ADSSZ9   DS    CL19    16   21   19  A  P N             T        Y              
ADSADQH  DS    CL8                                                              
ADSADQ   DS    CL17    16   41   17  A  P N             T        Y              
ADSSZQH  DS    CL8                                                              
ADSSZQ   DS    CL19    16   59   19  A  P N             T        Y              
ADSADAH  DS    CL8                                                              
ADSADA   DS    CL17    17    2   17  A  P N             T        Y              
ADSSZAH  DS    CL8                                                              
ADSSZA   DS    CL19    17   21   19  A  P N             T        Y              
ADSADRH  DS    CL8                                                              
ADSADR   DS    CL17    17   41   17  A  P N             T        Y              
ADSSZRH  DS    CL8                                                              
ADSSZR   DS    CL19    17   59   19  A  P N             T        Y              
ADSADBH  DS    CL8                                                              
ADSADB   DS    CL17    18    2   17  A  P N             T        Y              
ADSSZBH  DS    CL8                                                              
ADSSZB   DS    CL19    18   21   19  A  P N             T        Y              
ADSADSH  DS    CL8                                                              
ADSADS   DS    CL17    18   41   17  A  P N             T        Y              
ADSSZSH  DS    CL8                                                              
ADSSZS   DS    CL19    18   59   19  A  P N             T        Y              
ADSADCH  DS    CL8                                                              
ADSADC   DS    CL17    19    2   17  A  P N             T        Y              
ADSSZCH  DS    CL8                                                              
ADSSZC   DS    CL19    19   21   19  A  P N             T        Y              
ADSADTH  DS    CL8                                                              
ADSADT   DS    CL17    19   41   17  A  P N             T        Y              
ADSSZTH  DS    CL8                                                              
ADSSZT   DS    CL19    19   59   19  A  P N             T        Y              
ADSADDH  DS    CL8                                                              
ADSADD   DS    CL17    20    2   17  A  P N             T        Y              
ADSSZDH  DS    CL8                                                              
ADSSZD   DS    CL19    20   21   19  A  P N             T        Y              
ADSADUH  DS    CL8                                                              
ADSADU   DS    CL17    20   41   17  A  P N             T        Y              
ADSSZUH  DS    CL8                                                              
ADSSZU   DS    CL19    20   59   19  A  P N             T        Y              
ADSADFH  DS    CL8                                                              
ADSADF   DS    CL17    21    2   17  A  P N             T        Y              
ADSSZFH  DS    CL8                                                              
ADSSZF   DS    CL19    21   21   19  A  P N             T        Y              
ADSADVH  DS    CL8                                                              
ADSADV   DS    CL17    21   41   17  A  P N             T        Y              
ADSSZVH  DS    CL8                                                              
ADSSZV   DS    CL19    21   59   19  A  P N             T        Y              
ADSADGH  DS    CL8                                                              
ADSADG   DS    CL17    22    2   17  A  P N             T        Y              
ADSSZGH  DS    CL8                                                              
ADSSZG   DS    CL19    22   21   19  A  P N             T        Y              
ADSADWH  DS    CL8                                                              
ADSADW   DS    CL17    22   41   17  A  P N             T        Y              
ADSSZWH  DS    CL8                                                              
ADSSZW   DS    CL19    22   59   19  A  P N             T        Y              
ADSADHH  DS    CL8                                                              
ADSADH   DS    CL17    23    2   17  A  P N             T        Y              
ADSSZHH  DS    CL8                                                              
ADSSZH   DS    CL19    23   21   19  A  P N             T        Y              
ADSADXH  DS    CL8                                                              
ADSADX   DS    CL17    23   41   17  A  P N             T        Y              
ADSSZXH  DS    CL8                                                              
ADSSZX   DS    CL19    23   59   19  A  P N             T        Y              
ADSMORLH DS    CL8                                                              
ADSMORL  DS    CL2     24    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL40    24    5   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   68    6  A  P N             T        Y              
ADSSCRLH DS    CL8                                                              
ADSSCRL  DS    CL5     24   75    5  L  U N             T        Y  190         
ADSSCRLX DS    CL8                                                              
ADSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ADSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
