*          DATA SET PPADSD3D   AT LEVEL 007 AS OF 12/22/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40BD3D      DATE 12/22/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
DIGTYPH  DS    CL8                                                              
DIGTYP   DS    CL2      5    7    2  A  U N             T        Y   10         
DIGTYPX  DS    CL8                                                              
DIGTYNH  DS    CL8                                                              
DIGTYN   DS    CL8      5   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   21    5  A  P N             T        Y              
DIGTITH  DS    CL8                                                              
DIGTIT   DS    CL50     5   27   50  A  U N             T        Y   20         
DIGTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
DIGDATAH DS    CL8                                                              
DIGDATA  DS    CL8      6    7    8  A  U N             T        Y   30         
DIGDATAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  U N             T        Y              
DIGMOR1H DS    CL8                                                              
DIGMOR1  DS    CL2      7    2    2  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL25     7   25   25  A  P N             T        Y              
DIGDL1H  DS    CL8                                                              
DIGDL1   DS    CL78     8    2   78  A  P N             T        Y              
DIGDL2H  DS    CL8                                                              
DIGDL2   DS    CL78     9    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
DIGDLXH  DS    CL8                                                              
DIGDLX   DS    CL78    23    2   78  A  P N             T        Y              
DIGMORLH DS    CL8                                                              
DIGMORL  DS    CL2     24    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL40    24    5   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   68    6  A  P N             T        Y              
DIGSCRLH DS    CL8                                                              
DIGSCRL  DS    CL5     24   75    5  L  U N             T        Y  190         
DIGSCRLX DS    CL8                                                              
DIGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DIGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1688 BYTES                            
