*          DATA SET PPADSD4D   AT LEVEL 009 AS OF 12/22/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40BD4D      DATE 12/22/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
MATTYPH  DS    CL8                                                              
MATTYP   DS    CL2      5    7    2  A  U N             T        Y   10         
MATTYPX  DS    CL8                                                              
MATTYNH  DS    CL8                                                              
MATTYN   DS    CL8      5   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   21    5  A  P N             T        Y              
MATTITH  DS    CL8                                                              
MATTIT   DS    CL50     5   27   50  A  U N             T        Y   20         
MATTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
MATDATAH DS    CL8                                                              
MATDATA  DS    CL8      6    7    8  A  U N             T        Y   30         
MATDATAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  U N             T        Y              
MATMOR1H DS    CL8                                                              
MATMOR1  DS    CL2      7    2    2  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL25     7   28   25  A  P N             T        Y              
MATMAT1H DS    CL8                                                              
MATMAT1  DS    CL78     8    2   78  A  P N             T        Y              
MATMAT2H DS    CL8                                                              
MATMAT2  DS    CL78     9    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
MATMATLH DS    CL8                                                              
MATMATL  DS    CL78    23    2   78  A  P N             T        Y              
MATMORLH DS    CL8                                                              
MATMORL  DS    CL2     24    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL40    24    5   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   68    6  A  P N             T        Y              
MATSCRLH DS    CL8                                                              
MATSCRL  DS    CL5     24   75    5  L  U N             T        Y  190         
MATSCRLX DS    CL8                                                              
MATLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1688 BYTES                            
