*          DATA SET PPAFMF1D   AT LEVEL 003 AS OF 06/17/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T407F1D      DATE 06/17/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
AGYNAMEH DS    XL8                                                              
AGYNAME  DS    CL33     8   22   33  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
AGYADRSH DS    XL8                                                              
AGYADRS  DS    CL33     9   22   33  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
AGYABBRH DS    XL8                                                              
AGYABBR  DS    CL7     10   22    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    11    2   18  A  P N             T        Y              
AGYEQUH  DS    XL8                                                              
AGYEQU   DS    CL2     11   22    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12    2   17  A  P N             T        Y              
AGYMDESH DS    XL8                                                              
AGYMDES  DS    CL10    12   22   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13    2   18  A  P N             T        Y              
AGYVDESH DS    XL8                                                              
AGYVDES  DS    CL20    13   22   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
AGYACCTH DS    XL8                                                              
AGYACCT  DS    CL10    14   22   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
AGYPROFH DS    XL8                                                              
AGYPROF  DS    CL30    15   22   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    16   22   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   22   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    18    2   18  A  P N             T        Y              
AGYNATIH DS    XL8                                                              
AGYNATI  DS    CL1     18   22    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19    2   15  A  P N             T        Y              
AGYACCH  DS    XL8                                                              
AGYACC   DS    CL12    19   22   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20    2    9  A  P N             T        Y              
AGYCTIH  DS    XL8                                                              
AGYCTI   DS    CL3     20   22    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    20   40   32  A  P N             T        Y              
AGYSKIPH DS    XL8                                                              
AGYSKIP  DS    CL1     20   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
AGYRFPIH DS    XL8                                                              
AGYRFPI  DS    CL10    21   22   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    21   40   32  A  P N             T        Y              
AGYPDTLH DS    XL8                                                              
AGYPDTL  DS    CL1     21   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    22    2   16  A  P N             T        Y              
AGYFXRPH DS    XL8                                                              
AGYFXRP  DS    CL5     22   22    5  A  U N             T        Y              
AGYFXNMH DS    XL8                                                              
AGYFXNM  DS    CL30    22   29   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   61    1  A  U N             T        Y              
AGYLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
AGYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
