*          DATA SET PPAORTAB   AT LEVEL 011 AS OF 11/14/90                      
*         *   POWER   *  SIGN *SE#                                              
*         *    CODE   *  ON   *                                                 
         DC    C'SJ',CL5'SJR',X'0'                                              
         DC    C'SJ',CL5'SJNY',X'0'                                             
         DC    C'T1',CL5'TCH1',X'0'                                             
         DC    4X'FF'                                                           
