*          DATA SET PPBUYECD   AT LEVEL 008 AS OF 06/08/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411ECD      DATE 06/08/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ACHHDH   DS    XL8                                                              
ACHHD    DS    CL42     9    1   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36     9   45   36  A  P N             T        Y              
ACHTRH   DS    XL8                                                              
ACHTR    DS    CL2     10    2    2  A  U N             T        Y              
ACHDTEH  DS    XL8                                                              
ACHDTE   DS    CL8     10    7    8  A  U N             T        Y              
ACH1STH  DS    XL8                                                              
ACH1ST   DS    CL4     13    1    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    13    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   31   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   46    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   52    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   61    3  A  P N             T        Y              
ACHCOD1H DS    XL8                                                              
ACHCOD1  DS    CL2     14    2    2  A  U N             T        Y              
ACHPRT1H DS    XL8                                                              
ACHPRT1  DS    CL1     14    5    1  A  P N             T        Y              
ACHDES1H DS    XL8                                                              
ACHDES1  DS    CL20    14    8   20  A  P N             T        Y              
ACHCHR1H DS    XL8                                                              
ACHCHR1  DS    CL12    14   31   12  A  U N             T        Y              
ACHCOM1H DS    XL8                                                              
ACHCOM1  DS    CL1     14   47    1  A  U N             T        Y              
ACHCMP1H DS    XL8                                                              
ACHCMP1  DS    CL6     14   52    6  A  U N             T        Y              
ACHCDS1H DS    XL8                                                              
ACHCDS1  DS    CL1     14   62    1  A  U N             T        Y              
ACHCOD2H DS    XL8                                                              
ACHCOD2  DS    CL2     15    2    2  A  U N             T        Y              
ACHPRT2H DS    XL8                                                              
ACHPRT2  DS    CL1     15    5    1  A  P N             T        Y              
ACHDES2H DS    XL8                                                              
ACHDES2  DS    CL20    15    8   20  A  P N             T        Y              
ACHCHR2H DS    XL8                                                              
ACHCHR2  DS    CL12    15   31   12  A  U N             T        Y              
ACHCOM2H DS    XL8                                                              
ACHCOM2  DS    CL1     15   47    1  A  U N             T        Y              
ACHCMP2H DS    XL8                                                              
ACHCMP2  DS    CL6     15   52    6  A  U N             T        Y              
ACHCDS2H DS    XL8                                                              
ACHCDS2  DS    CL1     15   62    1  A  U N             T        Y              
ACHCOD3H DS    XL8                                                              
ACHCOD3  DS    CL2     16    2    2  A  U N             T        Y              
ACHPRT3H DS    XL8                                                              
ACHPRT3  DS    CL1     16    5    1  A  P N             T        Y              
ACHDES3H DS    XL8                                                              
ACHDES3  DS    CL20    16    8   20  A  P N             T        Y              
ACHCHR3H DS    XL8                                                              
ACHCHR3  DS    CL12    16   31   12  A  U N             T        Y              
ACHCOM3H DS    XL8                                                              
ACHCOM3  DS    CL1     16   47    1  A  U N             T        Y              
ACHCMP3H DS    XL8                                                              
ACHCMP3  DS    CL6     16   52    6  A  U N             T        Y              
ACHCDS3H DS    XL8                                                              
ACHCDS3  DS    CL1     16   62    1  A  U N             T        Y              
ACHCOD4H DS    XL8                                                              
ACHCOD4  DS    CL2     17    2    2  A  U N             T        Y              
ACHPRT4H DS    XL8                                                              
ACHPRT4  DS    CL1     17    5    1  A  P N             T        Y              
ACHDES4H DS    XL8                                                              
ACHDES4  DS    CL20    17    8   20  A  P N             T        Y              
ACHCHR4H DS    XL8                                                              
ACHCHR4  DS    CL12    17   31   12  A  U N             T        Y              
ACHCOM4H DS    XL8                                                              
ACHCOM4  DS    CL1     17   47    1  A  U N             T        Y              
ACHCMP4H DS    XL8                                                              
ACHCMP4  DS    CL6     17   52    6  A  U N             T        Y              
ACHCDS4H DS    XL8                                                              
ACHCDS4  DS    CL1     17   62    1  A  U N             T        Y              
ACHCOD5H DS    XL8                                                              
ACHCOD5  DS    CL2     18    2    2  A  U N             T        Y              
ACHPRT5H DS    XL8                                                              
ACHPRT5  DS    CL1     18    5    1  A  P N             T        Y              
ACHDES5H DS    XL8                                                              
ACHDES5  DS    CL20    18    8   20  A  P N             T        Y              
ACHCHR5H DS    XL8                                                              
ACHCHR5  DS    CL12    18   31   12  A  U N             T        Y              
ACHCOM5H DS    XL8                                                              
ACHCOM5  DS    CL1     18   47    1  A  U N             T        Y              
ACHCMP5H DS    XL8                                                              
ACHCMP5  DS    CL6     18   52    6  A  U N             T        Y              
ACHCDS5H DS    XL8                                                              
ACHCDS5  DS    CL1     18   62    1  A  U N             T        Y              
ACHCOD6H DS    XL8                                                              
ACHCOD6  DS    CL2     19    2    2  A  U N             T        Y              
ACHPRT6H DS    XL8                                                              
ACHPRT6  DS    CL1     19    5    1  A  P N             T        Y              
ACHDES6H DS    XL8                                                              
ACHDES6  DS    CL20    19    8   20  A  P N             T        Y              
ACHCHR6H DS    XL8                                                              
ACHCHR6  DS    CL12    19   31   12  A  U N             T        Y              
ACHCOM6H DS    XL8                                                              
ACHCOM6  DS    CL1     19   47    1  A  U N             T        Y              
ACHCMP6H DS    XL8                                                              
ACHCMP6  DS    CL6     19   52    6  A  U N             T        Y              
ACHCDS6H DS    XL8                                                              
ACHCDS6  DS    CL1     19   62    1  A  U N             T        Y              
ACHCOD7H DS    XL8                                                              
ACHCOD7  DS    CL2     20    2    2  A  U N             T        Y              
ACHPRT7H DS    XL8                                                              
ACHPRT7  DS    CL1     20    5    1  A  P N             T        Y              
ACHDES7H DS    XL8                                                              
ACHDES7  DS    CL20    20    8   20  A  P N             T        Y              
ACHCHR7H DS    XL8                                                              
ACHCHR7  DS    CL12    20   31   12  A  U N             T        Y              
ACHCOM7H DS    XL8                                                              
ACHCOM7  DS    CL1     20   47    1  A  U N             T        Y              
ACHCMP7H DS    XL8                                                              
ACHCMP7  DS    CL6     20   52    6  A  U N             T        Y              
ACHCDS7H DS    XL8                                                              
ACHCDS7  DS    CL1     20   62    1  A  U N             T        Y              
ACHCOD8H DS    XL8                                                              
ACHCOD8  DS    CL2     21    2    2  A  U N             T        Y              
ACHPRT8H DS    XL8                                                              
ACHPRT8  DS    CL1     21    5    1  A  P N             T        Y              
ACHDES8H DS    XL8                                                              
ACHDES8  DS    CL20    21    8   20  A  P N             T        Y              
ACHCHR8H DS    XL8                                                              
ACHCHR8  DS    CL12    21   31   12  A  U N             T        Y              
ACHCOM8H DS    XL8                                                              
ACHCOM8  DS    CL1     21   47    1  A  U N             T        Y              
ACHCMP8H DS    XL8                                                              
ACHCMP8  DS    CL6     21   52    6  A  U N             T        Y              
ACHCDS8H DS    XL8                                                              
ACHCDS8  DS    CL1     21   62    1  A  U N             T        Y              
ACHCOD9H DS    XL8                                                              
ACHCOD9  DS    CL2     22    2    2  A  U N             T        Y              
ACHPRT9H DS    XL8                                                              
ACHPRT9  DS    CL1     22    5    1  A  P N             T        Y              
ACHDES9H DS    XL8                                                              
ACHDES9  DS    CL20    22    8   20  A  P N             T        Y              
ACHCHR9H DS    XL8                                                              
ACHCHR9  DS    CL12    22   31   12  A  U N             T        Y              
ACHCOM9H DS    XL8                                                              
ACHCOM9  DS    CL1     22   47    1  A  U N             T        Y              
ACHCMP9H DS    XL8                                                              
ACHCMP9  DS    CL6     22   52    6  A  U N             T        Y              
ACHCDS9H DS    XL8                                                              
ACHCDS9  DS    CL1     22   62    1  A  U N             T        Y              
ACHCODAH DS    XL8                                                              
ACHCODA  DS    CL2     23    2    2  A  U N             T        Y              
ACHPRTAH DS    XL8                                                              
ACHPRTA  DS    CL1     23    5    1  A  P N             T        Y              
ACHDESAH DS    XL8                                                              
ACHDESA  DS    CL20    23    8   20  A  P N             T        Y              
ACHCHRAH DS    XL8                                                              
ACHCHRA  DS    CL12    23   31   12  A  U N             T        Y              
ACHCOMAH DS    XL8                                                              
ACHCOMA  DS    CL1     23   47    1  A  U N             T        Y              
ACHCMPAH DS    XL8                                                              
ACHCMPA  DS    CL6     23   52    6  A  U N             T        Y              
ACHCDSAH DS    XL8                                                              
ACHCDSA  DS    CL1     23   62    1  A  U N             T        Y              
ACHTEXTH DS    XL8                                                              
ACHTEXT  DS    CL75    24    2   75  A  P N             T        Y              
ACHXOOXH DS    XL8                                                              
ACHXOOX  DS    CL1     24   78    1  A  U N             T        Y              
ACHLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
ACHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
