*          DATA SET PPBUYE8D   AT LEVEL 023 AS OF 03/26/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411E8D      DATE 03/26/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LSTHDH   DS    CL8                                                              
LSTHD    DS    CL57     9    1   57  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21     9   60   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   16   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    10   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL41    11    1   41  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    11   45   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   67    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    12   16   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    12   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL41    13    1   41  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    13   45   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   67    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   16   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL41    15    1   41  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    15   45   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   67    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    16   16   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL41    17    1   41  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    17   45   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   67    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   16   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL41    19    1   41  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    19   45   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   67    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   78    1  A  U N             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1264 BYTES                            
