*          DATA SET PPBUYF6D   AT LEVEL 012 AS OF 07/29/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411F6D      DATE 07/29/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ODRHDH   DS    CL8                                                              
ODRHD    DS    CL46     9    1   46  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     9   49   32  A  P N             T        Y              
ODRTR1H  DS    CL8                                                              
ODRTR1   DS    CL2     10    2    2  A  U N             T        Y              
ODRDT1H  DS    CL8                                                              
ODRDT1   DS    CL8     10    7    8  A  U N             T        Y              
ODRAD1H  DS    CL8                                                              
ODRAD1   DS    CL6     10   17    6  A  U N             T        Y              
ODRSH1H  DS    CL8                                                              
ODRSH1   DS    CL3     10   28    3  A  U N             T        Y              
ODRRG1H  DS    CL8                                                              
ODRRG1   DS    CL4     10   34    4  A  U N             T        Y              
ODRIL1H  DS    CL8                                                              
ODRIL1   DS    CL4     10   41    4  A  U N             T        Y              
ODRRT1H  DS    CL8                                                              
ODRRT1   DS    CL11    10   50   11  A  U N             T        Y              
ODRCL1H  DS    CL8                                                              
ODRCL1   DS    CL5     10   64    5  A  U N             T        Y              
ODRMC1H  DS    CL8                                                              
ODRMC1   DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    6   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL47    11   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    12   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    13   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    14   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    15   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
ODRLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
ODRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1296 BYTES                            
