*          DATA SET PPBUYF5D   AT LEVEL 004 AS OF 04/09/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411F5D      DATE 04/09/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CBSHDH   DS    CL8                                                              
CBSHD    DS    CL49     9    1   49  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL29     9   51   29  A  P N             T        Y              
CBSTRH   DS    CL8                                                              
CBSTR    DS    CL2     10    2    2  A  U N             T        Y              
CBSDTEH  DS    CL8                                                              
CBSDTE   DS    CL8     10    7    8  A  U N             T        Y              
CBSADCH  DS    CL8                                                              
CBSADC   DS    CL6     10   17    6  A  P N             T        Y              
CBSSPCH  DS    CL8                                                              
CBSSPC   DS    CL20    10   24   20  A  P N             T        Y              
CBSCOPYH DS    CL8                                                              
CBSCOPY  DS    CL17    10   46   17  A  P N             T        Y              
CBSMCLOH DS    CL8                                                              
CBSMCLO  DS    CL5     10   75    5  A  P N             T        Y              
CBSCAPAH DS    CL8                                                              
CBSCAPA  DS    CL5     11    2    5  A  P N             T        Y              
CBSCAP1H DS    CL8                                                              
CBSCAP1  DS    CL25    11    8   25  A  P N             T        Y              
CBSCAP2H DS    CL8                                                              
CBSCAP2  DS    CL25    11   34   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   60    8  A  P N             T        Y              
CBSTSPGH DS    CL8                                                              
CBSTSPG  DS    CL10    11   69   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   24    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   64    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL35    13    2   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL35    13   42   35  A  P N             T        Y              
CBSCP1H  DS    CL8                                                              
CBSCP1   DS    CL20    14    2   20  A  U N             T        Y              
CBSPG1H  DS    CL8                                                              
CBSPG1   DS    CL4     14   24    4  A  U N             T        Y              
CBSCOM1H DS    CL8                                                              
CBSCOM1  DS    CL10    14   30   10  A  U N             T        Y              
CBSCP2H  DS    CL8                                                              
CBSCP2   DS    CL20    14   42   20  A  U N             T        Y              
CBSPG2H  DS    CL8                                                              
CBSPG2   DS    CL4     14   64    4  A  U N             T        Y              
CBSCOM2H DS    CL8                                                              
CBSCOM2  DS    CL10    14   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    23    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    23   42   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A  U N             T        Y              
CBSLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
CBSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1600 BYTES                            
