*          DATA SET PPBUYEFD   AT LEVEL 007 AS OF 12/02/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411EFD      DATE 12/02/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CCLHDH   DS    XL8                                                              
CCLHD    DS    CL42     9    1   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36     9   45   36  A  P N             T        Y              
CCLTRH   DS    XL8                                                              
CCLTR    DS    CL2     10    2    2  A  U N             T        Y              
CCLDTEH  DS    XL8                                                              
CCLDTE   DS    CL8     10    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    12   16   60  A  P N             T        Y              
CCLCOD1H DS    XL8                                                              
CCLCOD1  DS    CL12    13    2   12  A  U N             T        Y              
CCLDTA1H DS    XL8                                                              
CCLDTA1  DS    CL60    13   16   60  A  U N             T        Y              
CCLCOD2H DS    XL8                                                              
CCLCOD2  DS    CL12    14    2   12  A  U N             T        Y              
CCLDTA2H DS    XL8                                                              
CCLDTA2  DS    CL60    14   16   60  A  U N             T        Y              
CCLCOD3H DS    XL8                                                              
CCLCOD3  DS    CL12    15    2   12  A  U N             T        Y              
CCLDTA3H DS    XL8                                                              
CCLDTA3  DS    CL60    15   16   60  A  U N             T        Y              
CCLCOD4H DS    XL8                                                              
CCLCOD4  DS    CL12    16    2   12  A  U N             T        Y              
CCLDTA4H DS    XL8                                                              
CCLDTA4  DS    CL60    16   16   60  A  U N             T        Y              
CCLCOD5H DS    XL8                                                              
CCLCOD5  DS    CL12    17    2   12  A  U N             T        Y              
CCLDTA5H DS    XL8                                                              
CCLDTA5  DS    CL60    17   16   60  A  U N             T        Y              
CCLCOD6H DS    XL8                                                              
CCLCOD6  DS    CL12    18    2   12  A  U N             T        Y              
CCLDTA6H DS    XL8                                                              
CCLDTA6  DS    CL60    18   16   60  A  U N             T        Y              
CCLCOD7H DS    XL8                                                              
CCLCOD7  DS    CL12    19    2   12  A  U N             T        Y              
CCLDTA7H DS    XL8                                                              
CCLDTA7  DS    CL60    19   16   60  A  U N             T        Y              
CCLCOD8H DS    XL8                                                              
CCLCOD8  DS    CL12    20    2   12  A  U N             T        Y              
CCLDTA8H DS    XL8                                                              
CCLDTA8  DS    CL60    20   16   60  A  U N             T        Y              
CCLCOD9H DS    XL8                                                              
CCLCOD9  DS    CL12    21    2   12  A  U N             T        Y              
CCLDTA9H DS    XL8                                                              
CCLDTA9  DS    CL60    21   16   60  A  U N             T        Y              
CCLCODAH DS    XL8                                                              
CCLCODA  DS    CL12    22    2   12  A  U N             T        Y              
CCLDTAAH DS    XL8                                                              
CCLDTAA  DS    CL60    22   16   60  A  U N             T        Y              
CCLTEXTH DS    XL8                                                              
CCLTEXT  DS    CL75    23    2   75  A  P N             T        Y              
CCLXOOXH DS    XL8                                                              
CCLXOOX  DS    CL1     23   78    1  A  U N             T        Y              
CCLLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
CCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1184 BYTES                            
