*          DATA SET PPBUYF3D   AT LEVEL 004 AS OF 03/26/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411F3D      DATE 03/26/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
IZZHDH   DS    CL8                                                              
IZZHD    DS    CL42     9    1   42  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL36     9   45   36  A  P N             T        Y              
IZZTR1H  DS    CL8                                                              
IZZTR1   DS    CL2     10    2    2  A  U N             T        Y              
IZZDT1H  DS    CL8                                                              
IZZDT1   DS    CL8     10    7    8  A  U N             T        Y              
IZZAD1H  DS    CL8                                                              
IZZAD1   DS    CL6     10   17    6  A  U N             T        Y              
IZZSP1H  DS    CL8                                                              
IZZSP1   DS    CL17    10   26   17  A  U N             T        Y              
IZZRT1H  DS    CL8                                                              
IZZRT1   DS    CL11    10   47   11  A  U N             T        Y              
IZZCL1H  DS    CL8                                                              
IZZCL1   DS    CL5     10   62    5  A  U N             T        Y              
IZZMC1H  DS    CL8                                                              
IZZMC1   DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    6   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL47    11   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    12   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    13   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    14   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    15   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    16    6   13  A  P N             T        Y              
IZZALL1H DS    CL8                                                              
IZZALL1  DS    CL47    16   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
IZZLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
IZZWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1280 BYTES                            
