*          DATA SET PPBUYEEBD  AT LEVEL 003 AS OF 02/25/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411EED      DATE 02/25/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
IMPHDH   DS    CL8                                                              
IMPHD    DS    CL47     9    1   47  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     9   48   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   19    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    10   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   51   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   66    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    11    7   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    11   42   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   61   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   19    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    12   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   51   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   66    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    13    7   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    13   42   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   61   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   19    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   51   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   66    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    15    7   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    15   42   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   61   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   19    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   51   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   66    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    17    7   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    17   42   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   61   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   19    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   51   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   66    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    19    7   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    19   42   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   61   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   19    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    20   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   51   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   66    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    21    7   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    21   42   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   61   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   78    1  A  U N             T        Y              
IMPMSG1H DS    CL8                                                              
IMPMSG1  DS    CL70    22    2   70  A  P N             T        Y              
IMPMSG2H DS    CL8                                                              
IMPMSG2  DS    CL70    23    2   70  A  P N             T        Y              
IMPMSG3H DS    CL8                                                              
IMPMSG3  DS    CL70    24    2   70  A  P N             T        Y              
IMPLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
IMPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
