*          DATA SET PPBUYFCD   AT LEVEL 010 AS OF 07/29/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411FCD      DATE 07/29/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MAGHDH   DS    CL8                                                              
MAGHD    DS    CL42     9    1   42  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL36     9   45   36  A  P N             T        Y              
MAGTR1H  DS    CL8                                                              
MAGTR1   DS    CL2     10    2    2  A  U N             T        Y              
MAGDT1H  DS    CL8                                                              
MAGDT1   DS    CL8     10    7    8  A  U N             T        Y              
MAGAD1H  DS    CL8                                                              
MAGAD1   DS    CL6     10   17    6  A  U N             T        Y              
MAGSP1H  DS    CL8                                                              
MAGSP1   DS    CL17    10   26   17  A  U N             T        Y              
MAGRT1H  DS    CL8                                                              
MAGRT1   DS    CL11    10   45   11  A  U N             T        Y              
MAGCL1H  DS    CL8                                                              
MAGCL1   DS    CL5     10   58    5  A  U N             T        Y              
MAGSL1H  DS    CL8                                                              
MAGSL1   DS    CL5     10   66    5  A  U N             T        Y              
MAGMC1H  DS    CL8                                                              
MAGMC1   DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    6   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL47    11   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    12   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    13   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    14   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    15   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
MAGLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
MAGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
