*          DATA SET PPBUYEEAD  AT LEVEL 004 AS OF 06/02/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411EED      DATE 06/02/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
IMPHDH   DS    CL8                                                              
IMPHD    DS    CL45     9    1   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL33     9   48   33  A  P N             T        Y              
IMPTRH   DS    CL8                                                              
IMPTR    DS    CL2     10    2    2  A  U N             T        Y              
IMPDTEH  DS    CL8                                                              
IMPDTE   DS    CL8     10    7    8  A  U N             T        Y              
IMPSPCH  DS    CL8                                                              
IMPSPC   DS    CL17    10   22   17  A  U N             T        Y              
IMPIMPH  DS    CL8                                                              
IMPIMP   DS    CL11    10   49   11  A  U N             T        Y              
IMPRATH  DS    CL8                                                              
IMPRAT   DS    CL11    10   62   11  A  U N             T        Y              
IMPMC1H  DS    CL8                                                              
IMPMC1   DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    6   13  A  P N             T        Y              
IMPOPTH  DS    CL8                                                              
IMPOPT   DS    CL47    11   20   47  A  U N             T        Y              
IMPOPTH  DS    CL8                                                              
IMPOPT   DS    CL47    12   20   47  A  U N             T        Y              
IMPOPTH  DS    CL8                                                              
IMPOPT   DS    CL47    13   20   47  A  U N             T        Y              
IMPOPTH  DS    CL8                                                              
IMPOPT   DS    CL47    14   20   47  A  U N             T        Y              
IMPOPTH  DS    CL8                                                              
IMPOPT   DS    CL47    15   20   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16    1   11  A  P N             T        Y              
IMPALCH  DS    CL8                                                              
IMPALC   DS    CL47    16   13   47  A  U N             T        Y              
IMPHD1H  DS    CL8                                                              
IMPHD1   DS    CL50    17    1   50  A  P N             T        Y              
IMPMTH1H DS    CL8                                                              
IMPMTH1  DS    CL5     18    2    5  A  U N             T        Y              
IMPAD1H  DS    CL8                                                              
IMPAD1   DS    CL6     18   10    6  A  U N             T        Y              
IMPCI1H  DS    CL8                                                              
IMPCI1   DS    CL10    18   19   10  A  U N             T        Y              
IMPAI1H  DS    CL8                                                              
IMPAI1   DS    CL10    18   32   10  A  U N             T        Y              
IMPCT1H  DS    CL8                                                              
IMPCT1   DS    CL11    18   44   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   19   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   32   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   44   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   19   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   32   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   44   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   19   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   32   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   44   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   19   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   32   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   44   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   19   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   32   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   44   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    24    1   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
IMPLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
IMPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1208 BYTES                            
