*          DATA SET PPBUYFED   AT LEVEL 015 AS OF 11/05/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411FED      DATE 11/05/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
WSJHDH   DS    CL8                                                              
WSJHD    DS    CL45     9    1   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL33     9   48   33  A  P N             T        Y              
WSJTRH   DS    CL8                                                              
WSJTR    DS    CL2     10    2    2  A  U N             T        Y              
WSJDTEH  DS    CL8                                                              
WSJDTE   DS    CL8     10    7    8  A  U N             T        Y              
WSJADCH  DS    CL8                                                              
WSJADC   DS    CL6     10   17    6  A  U N             T        Y              
WSJRTH   DS    CL8                                                              
WSJRT    DS    CL3     10   35    3  A  U N             T        Y              
WSJNRTH  DS    CL8                                                              
WSJNRT   DS    CL4     10   57    4  A  U N             T        Y              
WSJMC1H  DS    CL8                                                              
WSJMC1   DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    1    7  A  P N             T        Y              
WSJOPTH  DS    CL8                                                              
WSJOPT   DS    CL70    11    9   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12    1   11  A  P N             T        Y              
WSJALCH  DS    CL8                                                              
WSJALC   DS    CL47    12   13   47  A  U N             T        Y              
WSJHDH   DS    CL8                                                              
WSJHD    DS    CL27    13    1   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    1    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    8    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL50    14   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    1    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    8    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL50    15   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    1    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    8    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL50    16   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    1    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    8    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL50    17   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    1    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    8    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL50    18   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    1    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    8    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL50    19   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    1    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    8    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL50    20   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    1    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    8    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL50    21   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55    22    1   55  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55    23    1   55  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A  U N             T        Y              
WSJLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
WSJWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1368 BYTES                            
