*          DATA SET PPBUYF7D   AT LEVEL 011 AS OF 07/29/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411F7D      DATE 07/29/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
OZZHDH   DS    CL8                                                              
OZZHD    DS    CL46     9    1   46  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     9   49   32  A  P N             T        Y              
OZZTR1H  DS    CL8                                                              
OZZTR1   DS    CL2     10    2    2  A  U N             T        Y              
OZZDT1H  DS    CL8                                                              
OZZDT1   DS    CL8     10    7    8  A  U N             T        Y              
OZZAD1H  DS    CL8                                                              
OZZAD1   DS    CL6     10   17    6  A  U N             T        Y              
OZZSH1H  DS    CL8                                                              
OZZSH1   DS    CL3     10   28    3  A  U N             T        Y              
OZZRG1H  DS    CL8                                                              
OZZRG1   DS    CL4     10   34    4  A  U N             T        Y              
OZZIL1H  DS    CL8                                                              
OZZIL1   DS    CL4     10   41    4  A  U N             T        Y              
OZZRT1H  DS    CL8                                                              
OZZRT1   DS    CL11    10   50   11  A  U N             T        Y              
OZZCL1H  DS    CL8                                                              
OZZCL1   DS    CL5     10   64    5  A  U N             T        Y              
OZZMC1H  DS    CL8                                                              
OZZMC1   DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    6   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL47    11   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    12   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    13   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    14   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    15   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    16    6   13  A  P N             T        Y              
OZZALL1H DS    CL8                                                              
OZZALL1  DS    CL47    16   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
OZZLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
OZZWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1288 BYTES                            
