*          DATA SET PPBUYFAD   AT LEVEL 013 AS OF 07/29/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T411FAD      DATE 07/29/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
NWSHDH   DS    CL8                                                              
NWSHD    DS    CL50     9    1   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28     9   53   28  A  P N             T        Y              
NWSTR1H  DS    CL8                                                              
NWSTR1   DS    CL2     10    2    2  A  U N             T        Y              
NWSDT1H  DS    CL8                                                              
NWSDT1   DS    CL8     10    7    8  A  U N             T        Y              
NWSAD1H  DS    CL8                                                              
NWSAD1   DS    CL6     10   17    6  A  U N             T        Y              
NWSLN1H  DS    CL8                                                              
NWSLN1   DS    CL8     10   28    8  A  U N             T        Y              
NWSRT1H  DS    CL8                                                              
NWSRT1   DS    CL10    10   41   10  A  U N             T        Y              
NWSPR1H  DS    CL8                                                              
NWSPR1   DS    CL11    10   56   11  A  U N             T        Y              
NWSMC1H  DS    CL8                                                              
NWSMC1   DS    CL5     10   75    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    6   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL47    11   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    12   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    13   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    14   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL47    15   21   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
NWSLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
NWSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1288 BYTES                            
