*          DATA SET PPCCOLELM  AT LEVEL 019 AS OF 11/24/03                      
*                                                                               
CCOLELM  DS    0X                  **PRINTPAK CUSTOM COLUMN ELEM**              
CCOLELID DS    XL1                 ELEMENT ID                                   
CCOLIDQ  EQU   X'CC'               ELEM CODE                                    
CCOLLEN  DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
CCOLCCID DS    XL2                 CUSTOM COLUMN UNIQUE ID                      
*                                                                               
CCOLHDLQ EQU   *-CCOLELM           ELEMENT HEADER LENGTH                        
*                                                                               
CCOLDATA DS    0X                  START OF CUSTOM COLUMN DATA                  
*                                                                               
