*          DATA SET PPCONFADS  AT LEVEL 003 AS OF 01/05/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40DFAD      DATE 01/05/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    1   11  A  P H             T        Y              
CPYTOCNH DS    CL8                                                              
CPYTOCN  DS    CL3      6   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7    1   16  A  P N             T        Y              
CPYSPRH  DS    CL8                                                              
CPYSPR   DS    CL1      7   18    1  A  U N             T        Y              
CPYLDTH  DS    CL8                                                              
CPYLDT   DS    CL20     7   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    1    8  A  P H             T        Y              
CPYSDTH  DS    CL8                                                              
CPYSDT   DS    CL8      8   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   41    8  A  P H             T        Y              
CPYEDTH  DS    CL8                                                              
CPYEDT   DS    CL8      8   50    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   61    4  A  P N             T        Y              
CPYREQH  DS    CL8                                                              
CPYREQ   DS    CL12     8   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    1    8  A  P N             T        Y              
CPYREVH  DS    CL8                                                              
CPYREV   DS    CL8      9   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   20    8  A  P N             T        Y              
CPYCONH  DS    CL8                                                              
CPYCON   DS    CL8      9   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   41    4  A  P N             T        Y              
CPYTYPH  DS    CL8                                                              
CPYTYP   DS    CL1      9   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     9   51   20  A  P N             T        Y              
CPYMIZEH DS    CL8                                                              
CPYMIZE  DS    CL4      9   72    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    1    7  A  P N             T        Y              
CPYATTNH DS    CL8                                                              
CPYATTN  DS    CL30    10    9   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    10   41   14  A  P N             T        Y              
CPYCDPH  DS    CL8                                                              
CPYCDP   DS    CL4     10   56    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   62    9  A  P N             T        Y              
CPYMAXH  DS    CL8                                                              
CPYMAX   DS    CL4     10   72    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12    1   11  A  P H             T        Y              
CPYCPYRH DS    CL8                                                              
CPYCPYR  DS    CL1     12   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL42    12   18   42  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    1    7  A  P N             T        Y              
CPYSTDH  DS    CL8                                                              
CPYSTD   DS    CL68    14   10   68  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    1    8  A  P N             T        Y              
CPYCM1H  DS    CL8                                                              
CPYCM1   DS    CL68    15   10   68  A  U N             T        N              
CPYCM2H  DS    CL8                                                              
CPYCM2   DS    CL68    16   10   68  A  U N             T        N              
CPYCM3H  DS    CL8                                                              
CPYCM3   DS    CL68    17   10   68  A  U N             T        N              
CPYCM4H  DS    CL8                                                              
CPYCM4   DS    CL68    18   10   68  A  U N             T        N              
CPYCM5H  DS    CL8                                                              
CPYCM5   DS    CL68    19   10   68  A  U N             T        N              
CPYCM6H  DS    CL8                                                              
CPYCM6   DS    CL68    20   10   68  A  U N             T        N              
CPYCM7H  DS    CL8                                                              
CPYCM7   DS    CL68    21   10   68  A  U N             T        N              
CPYCM8H  DS    CL8                                                              
CPYCM8   DS    CL68    22   10   68  A  U N             T        N              
CPYLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
CPYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1224 BYTES                            
