*          DATA SET PPCONFCD   AT LEVEL 009 AS OF 06/26/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40DFCD      DATE 06/26/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RATDESCH DS    CL8                                                              
RATDESC  DS    CL75     6    1   75  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7    1    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   10    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7   21    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   29    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   48   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   68    8  A  P N             T        Y              
RATLI1H  DS    CL8                                                              
RATLI1   DS    CL1      8    4    1  A  U N             T        Y              
RATLV1H  DS    CL8                                                              
RATLV1   DS    CL8      8   10    8  A  U N             T        Y              
RATPC1H  DS    CL8                                                              
RATPC1   DS    CL5      8   21    5  A  U N             T        Y              
RATRT1H  DS    CL8                                                              
RATRT1   DS    CL17     8   29   17  A  U N             T        Y              
RATDS1H  DS    CL8                                                              
RATDS1   DS    CL18     8   48   18  A  U N             T        Y              
RATED1H  DS    CL8                                                              
RATED1   DS    CL12     8   68   12  A  U N             T        Y              
RATLI2H  DS    CL8                                                              
RATLI2   DS    CL1      9    4    1  A  U N             T        Y              
RATLV2H  DS    CL8                                                              
RATLV2   DS    CL8      9   10    8  A  U N             T        Y              
RATPC2H  DS    CL8                                                              
RATPC2   DS    CL5      9   21    5  A  U N             T        Y              
RATRT2H  DS    CL8                                                              
RATRT2   DS    CL17     9   29   17  A  U N             T        Y              
RATDS2H  DS    CL8                                                              
RATDS2   DS    CL18     9   48   18  A  U N             T        Y              
RATED2H  DS    CL8                                                              
RATED2   DS    CL12     9   68   12  A  U N             T        Y              
RATLI3H  DS    CL8                                                              
RATLI3   DS    CL1     10    4    1  A  U N             T        Y              
RATLV3H  DS    CL8                                                              
RATLV3   DS    CL8     10   10    8  A  U N             T        Y              
RATPC3H  DS    CL8                                                              
RATPC3   DS    CL5     10   21    5  A  U N             T        Y              
RATRT3H  DS    CL8                                                              
RATRT3   DS    CL17    10   29   17  A  U N             T        Y              
RATDS3H  DS    CL8                                                              
RATDS3   DS    CL18    10   48   18  A  U N             T        Y              
RATED3H  DS    CL8                                                              
RATED3   DS    CL12    10   68   12  A  U N             T        Y              
RATLI4H  DS    CL8                                                              
RATLI4   DS    CL1     11    4    1  A  U N             T        Y              
RATLV4H  DS    CL8                                                              
RATLV4   DS    CL8     11   10    8  A  U N             T        Y              
RATPC4H  DS    CL8                                                              
RATPC4   DS    CL5     11   21    5  A  U N             T        Y              
RATRT4H  DS    CL8                                                              
RATRT4   DS    CL17    11   29   17  A  U N             T        Y              
RATDS4H  DS    CL8                                                              
RATDS4   DS    CL18    11   48   18  A  U N             T        Y              
RATED4H  DS    CL8                                                              
RATED4   DS    CL12    11   68   12  A  U N             T        Y              
RATLI5H  DS    CL8                                                              
RATLI5   DS    CL1     12    4    1  A  U N             T        Y              
RATLV5H  DS    CL8                                                              
RATLV5   DS    CL8     12   10    8  A  U N             T        Y              
RATPC5H  DS    CL8                                                              
RATPC5   DS    CL5     12   21    5  A  U N             T        Y              
RATRT5H  DS    CL8                                                              
RATRT5   DS    CL17    12   29   17  A  U N             T        Y              
RATDS5H  DS    CL8                                                              
RATDS5   DS    CL18    12   48   18  A  U N             T        Y              
RATED5H  DS    CL8                                                              
RATED5   DS    CL12    12   68   12  A  U N             T        Y              
RATLI6H  DS    CL8                                                              
RATLI6   DS    CL1     13    4    1  A  U N             T        Y              
RATLV6H  DS    CL8                                                              
RATLV6   DS    CL8     13   10    8  A  U N             T        Y              
RATPC6H  DS    CL8                                                              
RATPC6   DS    CL5     13   21    5  A  U N             T        Y              
RATRT6H  DS    CL8                                                              
RATRT6   DS    CL17    13   29   17  A  U N             T        Y              
RATDS6H  DS    CL8                                                              
RATDS6   DS    CL18    13   48   18  A  U N             T        Y              
RATED6H  DS    CL8                                                              
RATED6   DS    CL12    13   68   12  A  U N             T        Y              
RATLI7H  DS    CL8                                                              
RATLI7   DS    CL1     14    4    1  A  U N             T        Y              
RATLV7H  DS    CL8                                                              
RATLV7   DS    CL8     14   10    8  A  U N             T        Y              
RATPC7H  DS    CL8                                                              
RATPC7   DS    CL5     14   21    5  A  U N             T        Y              
RATRT7H  DS    CL8                                                              
RATRT7   DS    CL17    14   29   17  A  U N             T        Y              
RATDS7H  DS    CL8                                                              
RATDS7   DS    CL18    14   48   18  A  U N             T        Y              
RATED7H  DS    CL8                                                              
RATED7   DS    CL12    14   68   12  A  U N             T        Y              
RATLI8H  DS    CL8                                                              
RATLI8   DS    CL1     15    4    1  A  U N             T        Y              
RATLV8H  DS    CL8                                                              
RATLV8   DS    CL8     15   10    8  A  U N             T        Y              
RATPC8H  DS    CL8                                                              
RATPC8   DS    CL5     15   21    5  A  U N             T        Y              
RATRT8H  DS    CL8                                                              
RATRT8   DS    CL17    15   29   17  A  U N             T        Y              
RATDS8H  DS    CL8                                                              
RATDS8   DS    CL18    15   48   18  A  U N             T        Y              
RATED8H  DS    CL8                                                              
RATED8   DS    CL12    15   68   12  A  U N             T        Y              
RATLI9H  DS    CL8                                                              
RATLI9   DS    CL1     16    4    1  A  U N             T        Y              
RATLV9H  DS    CL8                                                              
RATLV9   DS    CL8     16   10    8  A  U N             T        Y              
RATPC9H  DS    CL8                                                              
RATPC9   DS    CL5     16   21    5  A  U N             T        Y              
RATRT9H  DS    CL8                                                              
RATRT9   DS    CL17    16   29   17  A  U N             T        Y              
RATDS9H  DS    CL8                                                              
RATDS9   DS    CL18    16   48   18  A  U N             T        Y              
RATED9H  DS    CL8                                                              
RATED9   DS    CL12    16   68   12  A  U N             T        Y              
RATLIAH  DS    CL8                                                              
RATLIA   DS    CL1     17    4    1  A  U N             T        Y              
RATLVAH  DS    CL8                                                              
RATLVA   DS    CL8     17   10    8  A  U N             T        Y              
RATPCAH  DS    CL8                                                              
RATPCA   DS    CL5     17   21    5  A  U N             T        Y              
RATRTAH  DS    CL8                                                              
RATRTA   DS    CL17    17   29   17  A  U N             T        Y              
RATDSAH  DS    CL8                                                              
RATDSA   DS    CL18    17   48   18  A  U N             T        Y              
RATEDAH  DS    CL8                                                              
RATEDA   DS    CL12    17   68   12  A  U N             T        Y              
RATLIBH  DS    CL8                                                              
RATLIB   DS    CL1     18    4    1  A  U N             T        Y              
RATLVBH  DS    CL8                                                              
RATLVB   DS    CL8     18   10    8  A  U N             T        Y              
RATPCBH  DS    CL8                                                              
RATPCB   DS    CL5     18   21    5  A  U N             T        Y              
RATRTBH  DS    CL8                                                              
RATRTB   DS    CL17    18   29   17  A  U N             T        Y              
RATDSBH  DS    CL8                                                              
RATDSB   DS    CL18    18   48   18  A  U N             T        Y              
RATEDBH  DS    CL8                                                              
RATEDB   DS    CL12    18   68   12  A  U N             T        Y              
RATLICH  DS    CL8                                                              
RATLIC   DS    CL1     19    4    1  A  U N             T        Y              
RATLVCH  DS    CL8                                                              
RATLVC   DS    CL8     19   10    8  A  U N             T        Y              
RATPCCH  DS    CL8                                                              
RATPCC   DS    CL5     19   21    5  A  U N             T        Y              
RATRTCH  DS    CL8                                                              
RATRTC   DS    CL17    19   29   17  A  U N             T        Y              
RATDSCH  DS    CL8                                                              
RATDSC   DS    CL18    19   48   18  A  U N             T        Y              
RATEDCH  DS    CL8                                                              
RATEDC   DS    CL12    19   68   12  A  U N             T        Y              
RATLIDH  DS    CL8                                                              
RATLID   DS    CL1     20    4    1  A  U N             T        Y              
RATLVDH  DS    CL8                                                              
RATLVD   DS    CL8     20   10    8  A  U N             T        Y              
RATPCDH  DS    CL8                                                              
RATPCD   DS    CL5     20   21    5  A  U N             T        Y              
RATRTDH  DS    CL8                                                              
RATRTD   DS    CL17    20   29   17  A  U N             T        Y              
RATDSDH  DS    CL8                                                              
RATDSD   DS    CL18    20   48   18  A  U N             T        Y              
RATEDDH  DS    CL8                                                              
RATEDD   DS    CL12    20   68   12  A  U N             T        Y              
RATLIEH  DS    CL8                                                              
RATLIE   DS    CL1     21    4    1  A  U N             T        Y              
RATLVEH  DS    CL8                                                              
RATLVE   DS    CL8     21   10    8  A  U N             T        Y              
RATPCEH  DS    CL8                                                              
RATPCE   DS    CL5     21   21    5  A  U N             T        Y              
RATRTEH  DS    CL8                                                              
RATRTE   DS    CL17    21   29   17  A  U N             T        Y              
RATDSEH  DS    CL8                                                              
RATDSE   DS    CL18    21   48   18  A  U N             T        Y              
RATEDEH  DS    CL8                                                              
RATEDE   DS    CL12    21   68   12  A  U N             T        Y              
RATLIFH  DS    CL8                                                              
RATLIF   DS    CL1     22    4    1  A  U N             T        Y              
RATLVFH  DS    CL8                                                              
RATLVF   DS    CL8     22   10    8  A  U N             T        Y              
RATPCFH  DS    CL8                                                              
RATPCF   DS    CL5     22   21    5  A  U N             T        Y              
RATRTFH  DS    CL8                                                              
RATRTF   DS    CL17    22   29   17  A  U N             T        Y              
RATDSFH  DS    CL8                                                              
RATDSF   DS    CL18    22   48   18  A  U N             T        Y              
RATEDFH  DS    CL8                                                              
RATEDF   DS    CL12    22   68   12  A  U N             T        Y              
RATLIGH  DS    CL8                                                              
RATLIG   DS    CL1     23    4    1  A  U N             T        Y              
RATLVGH  DS    CL8                                                              
RATLVG   DS    CL8     23   10    8  A  U N             T        Y              
RATPCGH  DS    CL8                                                              
RATPCG   DS    CL5     23   21    5  A  U N             T        Y              
RATRTGH  DS    CL8                                                              
RATRTG   DS    CL17    23   29   17  A  U N             T        Y              
RATDSGH  DS    CL8                                                              
RATDSG   DS    CL18    23   48   18  A  U N             T        Y              
RATEDGH  DS    CL8                                                              
RATEDG   DS    CL12    23   68   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24    4    1  A  U N             T        Y              
RATLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
RATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
