*          DATA SET PPCONFBD   AT LEVEL 004 AS OF 08/18/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40DFBD      DATE 08/18/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RTSMOR1H DS    CL8                                                              
RTSMOR1  DS    CL2      7    2    2  L  P H             T        Y              
RTSDESCH DS    CL8                                                              
RTSDESC  DS    CL75     7    5   75  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   10    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   21    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   29    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   48   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   68    8  A  P N             T        Y              
RTSLI1H  DS    CL8                                                              
RTSLI1   DS    CL1     10    4    1  A  U N             T        Y              
RTSLV1H  DS    CL8                                                              
RTSLV1   DS    CL8     10   10    8  A  U N             T        Y              
RTSPC1H  DS    CL8                                                              
RTSPC1   DS    CL5     10   21    5  A  U N             T        Y              
RTSRT1H  DS    CL8                                                              
RTSRT1   DS    CL17    10   29   17  A  U N             T        Y              
RTSDS1H  DS    CL8                                                              
RTSDS1   DS    CL18    10   48   18  A  U N             T        Y              
RTSED1H  DS    CL8                                                              
RTSED1   DS    CL12    10   68   12  A  U N             T        Y              
RTSLI2H  DS    CL8                                                              
RTSLI2   DS    CL1     11    4    1  A  U N             T        Y              
RTSLV2H  DS    CL8                                                              
RTSLV2   DS    CL8     11   10    8  A  U N             T        Y              
RTSPC2H  DS    CL8                                                              
RTSPC2   DS    CL5     11   21    5  A  U N             T        Y              
RTSRT2H  DS    CL8                                                              
RTSRT2   DS    CL17    11   29   17  A  U N             T        Y              
RTSDS2H  DS    CL8                                                              
RTSDS2   DS    CL18    11   48   18  A  U N             T        Y              
RTSED2H  DS    CL8                                                              
RTSED2   DS    CL12    11   68   12  A  U N             T        Y              
RTSLI3H  DS    CL8                                                              
RTSLI3   DS    CL1     12    4    1  A  U N             T        Y              
RTSLV3H  DS    CL8                                                              
RTSLV3   DS    CL8     12   10    8  A  U N             T        Y              
RTSPC3H  DS    CL8                                                              
RTSPC3   DS    CL5     12   21    5  A  U N             T        Y              
RTSRT3H  DS    CL8                                                              
RTSRT3   DS    CL17    12   29   17  A  U N             T        Y              
RTSDS3H  DS    CL8                                                              
RTSDS3   DS    CL18    12   48   18  A  U N             T        Y              
RTSED3H  DS    CL8                                                              
RTSED3   DS    CL12    12   68   12  A  U N             T        Y              
RTSLI4H  DS    CL8                                                              
RTSLI4   DS    CL1     13    4    1  A  U N             T        Y              
RTSLV4H  DS    CL8                                                              
RTSLV4   DS    CL8     13   10    8  A  U N             T        Y              
RTSPC4H  DS    CL8                                                              
RTSPC4   DS    CL5     13   21    5  A  U N             T        Y              
RTSRT4H  DS    CL8                                                              
RTSRT4   DS    CL17    13   29   17  A  U N             T        Y              
RTSDS4H  DS    CL8                                                              
RTSDS4   DS    CL18    13   48   18  A  U N             T        Y              
RTSED4H  DS    CL8                                                              
RTSED4   DS    CL12    13   68   12  A  U N             T        Y              
RTSLI5H  DS    CL8                                                              
RTSLI5   DS    CL1     14    4    1  A  U N             T        Y              
RTSLV5H  DS    CL8                                                              
RTSLV5   DS    CL8     14   10    8  A  U N             T        Y              
RTSPC5H  DS    CL8                                                              
RTSPC5   DS    CL5     14   21    5  A  U N             T        Y              
RTSRT5H  DS    CL8                                                              
RTSRT5   DS    CL17    14   29   17  A  U N             T        Y              
RTSDS5H  DS    CL8                                                              
RTSDS5   DS    CL18    14   48   18  A  U N             T        Y              
RTSED5H  DS    CL8                                                              
RTSED5   DS    CL12    14   68   12  A  U N             T        Y              
RTSLI6H  DS    CL8                                                              
RTSLI6   DS    CL1     15    4    1  A  U N             T        Y              
RTSLV6H  DS    CL8                                                              
RTSLV6   DS    CL8     15   10    8  A  U N             T        Y              
RTSPC6H  DS    CL8                                                              
RTSPC6   DS    CL5     15   21    5  A  U N             T        Y              
RTSRT6H  DS    CL8                                                              
RTSRT6   DS    CL17    15   29   17  A  U N             T        Y              
RTSDS6H  DS    CL8                                                              
RTSDS6   DS    CL18    15   48   18  A  U N             T        Y              
RTSED6H  DS    CL8                                                              
RTSED6   DS    CL12    15   68   12  A  U N             T        Y              
RTSLI7H  DS    CL8                                                              
RTSLI7   DS    CL1     16    4    1  A  U N             T        Y              
RTSLV7H  DS    CL8                                                              
RTSLV7   DS    CL8     16   10    8  A  U N             T        Y              
RTSPC7H  DS    CL8                                                              
RTSPC7   DS    CL5     16   21    5  A  U N             T        Y              
RTSRT7H  DS    CL8                                                              
RTSRT7   DS    CL17    16   29   17  A  U N             T        Y              
RTSDS7H  DS    CL8                                                              
RTSDS7   DS    CL18    16   48   18  A  U N             T        Y              
RTSED7H  DS    CL8                                                              
RTSED7   DS    CL12    16   68   12  A  U N             T        Y              
RTSLI8H  DS    CL8                                                              
RTSLI8   DS    CL1     17    4    1  A  U N             T        Y              
RTSLV8H  DS    CL8                                                              
RTSLV8   DS    CL8     17   10    8  A  U N             T        Y              
RTSPC8H  DS    CL8                                                              
RTSPC8   DS    CL5     17   21    5  A  U N             T        Y              
RTSRT8H  DS    CL8                                                              
RTSRT8   DS    CL17    17   29   17  A  U N             T        Y              
RTSDS8H  DS    CL8                                                              
RTSDS8   DS    CL18    17   48   18  A  U N             T        Y              
RTSED8H  DS    CL8                                                              
RTSED8   DS    CL12    17   68   12  A  U N             T        Y              
RTSLI9H  DS    CL8                                                              
RTSLI9   DS    CL1     18    4    1  A  U N             T        Y              
RTSLV9H  DS    CL8                                                              
RTSLV9   DS    CL8     18   10    8  A  U N             T        Y              
RTSPC9H  DS    CL8                                                              
RTSPC9   DS    CL5     18   21    5  A  U N             T        Y              
RTSRT9H  DS    CL8                                                              
RTSRT9   DS    CL17    18   29   17  A  U N             T        Y              
RTSDS9H  DS    CL8                                                              
RTSDS9   DS    CL18    18   48   18  A  U N             T        Y              
RTSED9H  DS    CL8                                                              
RTSED9   DS    CL12    18   68   12  A  U N             T        Y              
RTSLIAH  DS    CL8                                                              
RTSLIA   DS    CL1     19    4    1  A  U N             T        Y              
RTSLVAH  DS    CL8                                                              
RTSLVA   DS    CL8     19   10    8  A  U N             T        Y              
RTSPCAH  DS    CL8                                                              
RTSPCA   DS    CL5     19   21    5  A  U N             T        Y              
RTSRTAH  DS    CL8                                                              
RTSRTA   DS    CL17    19   29   17  A  U N             T        Y              
RTSDSAH  DS    CL8                                                              
RTSDSA   DS    CL18    19   48   18  A  U N             T        Y              
RTSEDAH  DS    CL8                                                              
RTSEDA   DS    CL12    19   68   12  A  U N             T        Y              
RTSLIBH  DS    CL8                                                              
RTSLIB   DS    CL1     20    4    1  A  U N             T        Y              
RTSLVBH  DS    CL8                                                              
RTSLVB   DS    CL8     20   10    8  A  U N             T        Y              
RTSPCBH  DS    CL8                                                              
RTSPCB   DS    CL5     20   21    5  A  U N             T        Y              
RTSRTBH  DS    CL8                                                              
RTSRTB   DS    CL17    20   29   17  A  U N             T        Y              
RTSDSBH  DS    CL8                                                              
RTSDSB   DS    CL18    20   48   18  A  U N             T        Y              
RTSEDBH  DS    CL8                                                              
RTSEDB   DS    CL12    20   68   12  A  U N             T        Y              
RTSLICH  DS    CL8                                                              
RTSLIC   DS    CL1     21    4    1  A  U N             T        Y              
RTSLVCH  DS    CL8                                                              
RTSLVC   DS    CL8     21   10    8  A  U N             T        Y              
RTSPCCH  DS    CL8                                                              
RTSPCC   DS    CL5     21   21    5  A  U N             T        Y              
RTSRTCH  DS    CL8                                                              
RTSRTC   DS    CL17    21   29   17  A  U N             T        Y              
RTSDSCH  DS    CL8                                                              
RTSDSC   DS    CL18    21   48   18  A  U N             T        Y              
RTSEDCH  DS    CL8                                                              
RTSEDC   DS    CL12    21   68   12  A  U N             T        Y              
RTSLIDH  DS    CL8                                                              
RTSLID   DS    CL1     22    4    1  A  U N             T        Y              
RTSLVDH  DS    CL8                                                              
RTSLVD   DS    CL8     22   10    8  A  U N             T        Y              
RTSPCDH  DS    CL8                                                              
RTSPCD   DS    CL5     22   21    5  A  U N             T        Y              
RTSRTDH  DS    CL8                                                              
RTSRTD   DS    CL17    22   29   17  A  U N             T        Y              
RTSDSDH  DS    CL8                                                              
RTSDSD   DS    CL18    22   48   18  A  U N             T        Y              
RTSEDDH  DS    CL8                                                              
RTSEDD   DS    CL12    22   68   12  A  U N             T        Y              
RTSLILH  DS    CL8                                                              
RTSLIL   DS    CL1     23    4    1  A  U N             T        Y              
RTSLVLH  DS    CL8                                                              
RTSLVL   DS    CL8     23   10    8  A  U N             T        Y              
RTSPCLH  DS    CL8                                                              
RTSPCL   DS    CL5     23   21    5  A  U N             T        Y              
RTSRTLH  DS    CL8                                                              
RTSRTL   DS    CL17    23   29   17  A  U N             T        Y              
RTSDSLH  DS    CL8                                                              
RTSDSL   DS    CL18    23   48   18  A  U N             T        Y              
RTSEDLH  DS    CL8                                                              
RTSEDL   DS    CL12    23   68   12  A  U N             T        Y              
RTSMORLH DS    CL8                                                              
RTSMORL  DS    CL2     24    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL58    24    5   58  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   65    6  L  P N             T        Y              
RTSSCRLH DS    CL8                                                              
RTSSCRL  DS    CL5     24   72    5  L  U N             T        Y  190         
RTSSCRLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     24   79    1  A  U N             T        Y              
RTSLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
RTSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
