*          DATA SET PPCONFDD   AT LEVEL 002 AS OF 07/14/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40DFDD      DATE 07/14/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MULINFOH DS    XL8                                                              
MULINFO  DS    CL79     7    1   79  A  P N             T        Y              
MULHDLNH DS    XL8                                                              
MULHDLN  DS    CL79     8    1   79  A  P N             T        Y              
MULSEL1H DS    XL8                                                              
MULSEL1  DS    CL2     10    2    2  A  U N             T        Y              
MULLIN1H DS    XL8                                                              
MULLIN1  DS    CL75    10    5   75  A  P N             T        Y              
MULSEL2H DS    XL8                                                              
MULSEL2  DS    CL2     11    2    2  A  U N             T        Y              
MULLIN2H DS    XL8                                                              
MULLIN2  DS    CL75    11    5   75  A  P N             T        Y              
MULSEL3H DS    XL8                                                              
MULSEL3  DS    CL2     12    2    2  A  U N             T        Y              
MULLIN3H DS    XL8                                                              
MULLIN3  DS    CL75    12    5   75  A  P N             T        Y              
MULSEL4H DS    XL8                                                              
MULSEL4  DS    CL2     13    2    2  A  U N             T        Y              
MULLIN4H DS    XL8                                                              
MULLIN4  DS    CL75    13    5   75  A  P N             T        Y              
MULSEL5H DS    XL8                                                              
MULSEL5  DS    CL2     14    2    2  A  U N             T        Y              
MULLIN5H DS    XL8                                                              
MULLIN5  DS    CL75    14    5   75  A  P N             T        Y              
MULSEL6H DS    XL8                                                              
MULSEL6  DS    CL2     15    2    2  A  U N             T        Y              
MULLIN6H DS    XL8                                                              
MULLIN6  DS    CL75    15    5   75  A  P N             T        Y              
MULSEL7H DS    XL8                                                              
MULSEL7  DS    CL2     16    2    2  A  U N             T        Y              
MULLIN7H DS    XL8                                                              
MULLIN7  DS    CL75    16    5   75  A  P N             T        Y              
MULSEL8H DS    XL8                                                              
MULSEL8  DS    CL2     17    2    2  A  U N             T        Y              
MULLIN8H DS    XL8                                                              
MULLIN8  DS    CL75    17    5   75  A  P N             T        Y              
MULSEL9H DS    XL8                                                              
MULSEL9  DS    CL2     18    2    2  A  U N             T        Y              
MULLIN9H DS    XL8                                                              
MULLIN9  DS    CL75    18    5   75  A  P N             T        Y              
MULSELAH DS    XL8                                                              
MULSELA  DS    CL2     19    2    2  A  U N             T        Y              
MULLINAH DS    XL8                                                              
MULLINA  DS    CL75    19    5   75  A  P N             T        Y              
MULSELBH DS    XL8                                                              
MULSELB  DS    CL2     20    2    2  A  U N             T        Y              
MULLINBH DS    XL8                                                              
MULLINB  DS    CL75    20    5   75  A  P N             T        Y              
MULSELCH DS    XL8                                                              
MULSELC  DS    CL2     21    2    2  A  U N             T        Y              
MULLINCH DS    XL8                                                              
MULLINC  DS    CL75    21    5   75  A  P N             T        Y              
MULSELDH DS    XL8                                                              
MULSELD  DS    CL2     22    2    2  A  U N             T        Y              
MULLINDH DS    XL8                                                              
MULLIND  DS    CL75    22    5   75  A  P N             T        Y              
MULSELEH DS    XL8                                                              
MULSELE  DS    CL2     23    2    2  A  U N             T        Y              
MULLINEH DS    XL8                                                              
MULLINE  DS    CL75    23    5   75  A  P N             T        Y              
MULSELFH DS    XL8                                                              
MULSELF  DS    CL2     24    2    2  A  P N             T        Y              
MULLINFH DS    XL8                                                              
MULLINF  DS    CL75    24    5   75  A  P N             T        Y              
MULLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
MULWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1576 BYTES                            
