*          DATA SET PPDRDF3D   AT LEVEL 002 AS OF 10/06/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T409F3D      DATE 10/06/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13    11    2   13   A    P    N         T         Y           
DSTNAMEH DS    CL8                                                              
DSTNAME  DS    CL20    11   22   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     11   57    1   A    U    N         T         Y           
DSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
DSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 61   BYTES                            
