*          DATA SET PPDRDFFD   AT LEVEL 005 AS OF 11/28/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T409FFD      DATE 11/28/00                 
         SPACE 1                                                                
T409FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
HDRMSGH  DS    XL8                                                              
HDRMSG   DS    CL60     1    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40     4    3   40  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL34     4   43   34  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
HDRRECH  DS    XL8                                                              
HDRREC   DS    CL8      6    9    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   27    6  A  P N             T        Y              
HDRACTH  DS    XL8                                                              
HDRACT   DS    CL7      6   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
HDRMEDH  DS    XL8                                                              
HDRMED   DS    CL1      8   19    1  A  P N             T        Y              
HDRMEDNH DS    XL8                                                              
HDRMEDN  DS    CL10     8   26   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   10    6  A  P N             T        Y              
HDRCLTH  DS    XL8                                                              
HDRCLT   DS    CL3      9   19    3  A  P N             T        Y              
HDRCLTNH DS    XL8                                                              
HDRCLTN  DS    CL20     9   26   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   10    8  A  P N             T        Y              
HDRDIVH  DS    XL8                                                              
HDRDIV   DS    CL4     10   19    4  A  P N             T        Y              
HDRDIVNH DS    XL8                                                              
HDRDIVN  DS    CL20    10   26   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   10    6  A  P N             T        Y              
HDRREGH  DS    XL8                                                              
HDRREG   DS    CL4     11   19    4  A  P N             T        Y              
HDRREGNH DS    XL8                                                              
HDRREGN  DS    CL20    11   26   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   10    8  A  P N             T        Y              
HDRDSTH  DS    XL8                                                              
HDRDST   DS    CL4     12   19    4  A  P N             T        Y              
HDRDSTNH DS    XL8                                                              
HDRDSTN  DS    CL20    12   26   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   57    1  A  P N             T        Y              
HDRLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
HDRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 592  BYTES                            
