*          DATA SET PPDRDF2D   AT LEVEL 002 AS OF 10/06/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T409F2D      DATE 10/06/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11    11    2   11   A    P    N         T         Y           
REGNAMEH DS    CL8                                                              
REGNAME  DS    CL20    11   22   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     11   57    1   A    U    N         T         Y           
REGLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
REGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 59   BYTES                            
