*          DATA SET PPEDRPUBPP AT LEVEL 013 AS OF 09/13/93                      
*=======================================================*                       
*                                                                               
*           EDR-PUB PASSIVE POINTER                                             
*           RESIDES ON PRTDIR AND IS A DIRECTORY ONLY POINTER                   
*                                                                               
*=======================================================*                       
*                                                                               
PEDPKEY  DS    0CL25                                                            
PEDPKAGY DS    CL2                 AGENCY CODE                                  
PEDPKMED DS    CL1                 MEDIA                                        
PEDPKRCD DS    XL1'E1'             RECORD ID                                    
PEDPKIDQ EQU   X'E1'               PUB-EDR POINTER ID                           
PEDPKEDR DS    CL9                 EDR CODE                                     
PEDPKPUB DS    XL6                 PUB                                          
         DS    CL6                 SPARE                                        
*        *     *                   *                                            
*              ---                                                              
**              25                 KEY LENGTH                                   
*              ===                                                              
PEDPCNTL DS    XL2'00FF'           CONTROL BYTES - DIRECTORY ONLY               
PEDPDISK DS    XL4'00000000'       DISK ADDRESS                                 
