*          DATA SET PPESRFDD   AT LEVEL 002 AS OF 05/30/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T420FDD      DATE 05/30/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
HDRTTLH  DS    XL8                                                              
HDRTTL   DS    CL33     5   23   33  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
HDRMEDH  DS    XL8                                                              
HDRMED   DS    CL2      7   12    2  A  U N             T        Y    5         
HDRMEDX  DS    XL8                                                              
HDRMEDNH DS    XL8                                                              
HDRMEDN  DS    CL15     7   15   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   42    6  A  P H             T        Y              
HDRCLTH  DS    XL8                                                              
HDRCLT   DS    CL4      7   52    4  A  U N             T        Y   10         
HDRCLTX  DS    XL8                                                              
HDRCLTNH DS    XL8                                                              
HDRCLTN  DS    CL20     7   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
HDRPUBH  DS    XL8                                                              
HDRPUB   DS    CL16     8   12   16  A  U N             T        Y   20         
HDRPUBX  DS    XL8                                                              
HDRPUBNH DS    XL8                                                              
HDRPUBN  DS    CL40     8   30   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P H             T        Y              
HDRSR#H  DS    XL8                                                              
HDRSR#   DS    CL20     9   12   20  A  U N             T        Y   50         
HDRSR#X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   42    6  A  P H             T        Y              
HDRREV#H DS    XL8                                                              
HDRREV#  DS    CL4      9   52    4  A  U N             T        Y   55         
HDRREV#X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P H             T        Y              
HDRPERH  DS    XL8                                                              
HDRPER   DS    CL20    10   12   20  A  U N             T        Y   60         
HDRPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     12    2    9  A  P H             T        Y              
HDRDTEH  DS    XL8                                                              
HDRDTE   DS    CL10    12   12   10  A  U N             T        Y   67         
HDRDTEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12   42    7  A  P H             T        Y              
HDRSTEWH DS    XL8                                                              
HDRSTEW  DS    CL4     12   52    4  A  U N             T        Y   55         
HDRSTEWX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P H             T        Y              
HDRPRDH  DS    XL8                                                              
HDRPRD   DS    CL4     13   12    4  A  U N             T        Y   15         
HDRPRDX  DS    XL8                                                              
HDRPRDNH DS    XL8                                                              
HDRPRDN  DS    CL20    13   17   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   42    9  A  P N             T        Y              
HDRESTH  DS    XL8                                                              
HDREST   DS    CL4     13   52    4  A  U N             T        Y   20         
HDRESTX  DS    XL8                                                              
HDRESTNH DS    XL8                                                              
HDRESTN  DS    CL20    13   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
HDRSTAH  DS    XL8                                                              
HDRSTA   DS    CL15    14   15   15  A  P N             T        Y   25         
HDRSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
HDRSR#NH DS    XL8                                                              
HDRSR#N  DS    CL23    15   15   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
HDRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
HDRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 792  BYTES                            
