*          DATA SET PPEZFE8D   AT LEVEL 016 AS OF 06/02/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T430E8D      DATE 06/02/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
LINMEDH  DS    CL8                                                              
LINMED   DS    CL3      5   10    3  A  U N             T        Y   10         
LINMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
LINPUBH  DS    CL8                                                              
LINPUB   DS    CL18     5   28   18  A  U N             T        Y   20         
LINPUBX  DS    CL8                                                              
LINPUBNH DS    CL8                                                              
LINPUBN  DS    CL20     5   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  A  P N             T        Y              
LINBDTH  DS    CL8                                                              
LINBDT   DS    CL9      6   14    9  A  U N             T        Y   30         
LINBDTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     6   30   10  A  P N             T        Y              
LINBSQH  DS    CL8                                                              
LINBSQ   DS    CL6      6   42    6  A  U N             T        Y   40         
LINBSQX  DS    CL8                                                              
LINZONEH DS    CL8                                                              
LINZONE  DS    CL20     6   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
LINFTRH  DS    CL8                                                              
LINFTR   DS    CL66     7   10   66  A  U N             T        Y   50         
LINFTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
LINTLH   DS    CL8                                                              
LINTL    DS    CL30     8   40   30  A  P N             T        Y              
LINLT2H  DS    CL8                                                              
LINLT2   DS    CL79     9    2   79  A  P H             T        Y              
LINLT3H  DS    CL8                                                              
LINLT3   DS    CL79    10    2   79  A  P H             T        Y              
LINSELH  DS    CL8                                                              
LINSEL   DS    CL3     11    2    3  A  U N             T        Y  200         
LINSELX  DS    CL8                                                              
LINLN1H  DS    CL8                                                              
LINLN1   DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
LINLNLH  DS    CL8                                                              
LINLNL   DS    CL75    24    6   75  A  P N             T        Y              
LINLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1872 BYTES                            
