*          DATA SET PPEZFF8D   AT LEVEL 014 AS OF 06/02/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T430F8D      DATE 06/02/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
DIVMEDH  DS    CL8                                                              
DIVMED   DS    CL3      5   10    3  A  U N             T        Y   10         
DIVMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
DIVPUBH  DS    CL8                                                              
DIVPUB   DS    CL18     5   28   18  A  U N             T        Y   20         
DIVPUBX  DS    CL8                                                              
DIVPUBNH DS    CL8                                                              
DIVPUBN  DS    CL20     5   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  A  P N             T        Y              
DIVBDTH  DS    CL8                                                              
DIVBDT   DS    CL9      6   14    9  A  U N             T        Y   30         
DIVBDTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     6   30   10  A  P N             T        Y              
DIVBSQH  DS    CL8                                                              
DIVBSQ   DS    CL6      6   42    6  A  U N             T        Y   40         
DIVBSQX  DS    CL8                                                              
DIVZONEH DS    CL8                                                              
DIVZONE  DS    CL20     6   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
DIVFTRH  DS    CL8                                                              
DIVFTR   DS    CL68     7   10   68  A  U N             T        Y   50         
DIVFTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
DIVTDH   DS    CL8                                                              
DIVTD    DS    CL30     8   29   30  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P H             T        Y              
DIVCDEH  DS    CL8                                                              
DIVCDE   DS    CL3      9   12    3  A  P N             T        Y              
DIVCNMH  DS    CL8                                                              
DIVCNM   DS    CL25     9   16   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10    5    4  A  P H             T        Y              
DIVCCDH  DS    CL8                                                              
DIVCCD   DS    CL3     10   12    3  A  U N             T        Y   60         
DIVCCDX  DS    CL8                                                              
DIVCNMDH DS    CL8                                                              
DIVCNMD  DS    CL20    10   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A  P H             T        Y              
DIVPPEH  DS    CL8                                                              
DIVPPE   DS    CL3     11   12    3  A  P N             T        Y              
DIVPNMH  DS    CL8                                                              
DIVPNM   DS    CL25    11   16   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12    5    4  A  P H             T        Y              
DIVPCDH  DS    CL8                                                              
DIVPCD   DS    CL3     12   12    3  A  U N             T        Y   70         
DIVPCDX  DS    CL8                                                              
DIVPNMDH DS    CL8                                                              
DIVPNMD  DS    CL20    12   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P H             T        Y              
DIVESTH  DS    CL8                                                              
DIVEST   DS    CL10    13   12   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    5    4  A  P H             T        Y              
DIVECDH  DS    CL8                                                              
DIVECD   DS    CL3     14   12    3  A  U N             T        Y   80         
DIVECDX  DS    CL8                                                              
DIVENMDH DS    CL8                                                              
DIVENMD  DS    CL20    14   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    16    2   14  A  P H             T        Y              
DIVINOH  DS    CL8                                                              
DIVINO   DS    CL20    16   20   20  A  P N             T        Y              
DIVREVH  DS    CL8                                                              
DIVREV   DS    CL25    16   45   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17    2   16  A  P H             T        Y              
DIVMOSH  DS    CL8                                                              
DIVMOS   DS    CL5     17   20    5  A  P N             T        Y              
DIVMOSEH DS    CL8                                                              
DIVMOSE  DS    CL7     17   30    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18    2   12  A  P H             T        Y              
DIVSPTSH DS    CL8                                                              
DIVSPTS  DS    CL5     18   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  P H             T        Y              
DIVORDRH DS    CL8                                                              
DIVORDR  DS    CL13    19   20   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   40    5  A  P H             T        Y              
DIVGRSSH DS    CL8                                                              
DIVGRSS  DS    CL13    19   50   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P H             T        Y              
DIVSRCEH DS    CL8                                                              
DIVSRCE  DS    CL4     20   20    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    21    2   16  A  P H             T        Y              
DIVCSTH  DS    CL8                                                              
DIVCST   DS    CL10    21   20   10  A  U N             T        Y   90         
DIVCSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    21   40   12  A  P H             T        Y              
DIVACTDH DS    CL8                                                              
DIVACTD  DS    CL10    21   54   10  A  P N             T        Y              
DIVCSTSH DS    CL8                                                              
DIVCSTS  DS    CL9     22   30    9  A  P N             T        Y              
DIVCDH   DS    CL8                                                              
DIVCD    DS    CL50    23   20   50  A  P N             T        Y              
DIVFLGH  DS    CL8                                                              
DIVFLG   DS    CL1     23   79    1  A  U N             T        Y              
DIVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DIVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1144 BYTES                            
