*          DATA SET PPEZFF7D   AT LEVEL 001 AS OF 12/16/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T430F7D      DATE 12/16/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
DVDSTAH  DS    CL8                                                              
DVDSTA   DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     5   20   10  A  P N             T        Y              
DVDBDTH  DS    CL8                                                              
DVDBDT   DS    CL9      5   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      5   42    9  A  P N             T        Y              
DVDBSQH  DS    CL8                                                              
DVDBSQ   DS    CL6      5   54    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DVDFTRH  DS    CL8                                                              
DVDFTR   DS    CL40     6   10   40  A  U N             T        Y              
DVDTDH   DS    CL8                                                              
DVDTD    DS    CL30     7   40   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
DVDCDEH  DS    CL8                                                              
DVDCDE   DS    CL3      8   12    3  A  P N             T        Y              
DVDCNMH  DS    CL8                                                              
DVDCNM   DS    CL25     8   16   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    5    4  A  P N             T        Y              
DVDCCDH  DS    CL8                                                              
DVDCCD   DS    CL3      9   12    3  A  U N             T        Y              
DVDCNMDH DS    CL8                                                              
DVDCNMD  DS    CL20     9   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
DVDPPEH  DS    CL8                                                              
DVDPPE   DS    CL3     10   12    3  A  P N             T        Y              
DVDPNMH  DS    CL8                                                              
DVDPNM   DS    CL25    10   16   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     11    5    4  A  P N             T        Y              
DVDPCDH  DS    CL8                                                              
DVDPCD   DS    CL3     11   12    3  A  U N             T        Y              
DVDPNMDH DS    CL8                                                              
DVDPNMD  DS    CL20    11   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
DVDESTH  DS    CL8                                                              
DVDEST   DS    CL10    12   12   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13    5    4  A  P N             T        Y              
DVDECDH  DS    CL8                                                              
DVDECD   DS    CL3     13   12    3  A  U N             T        Y              
DVDENMDH DS    CL8                                                              
DVDENMD  DS    CL20    13   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
DVDINOH  DS    CL8                                                              
DVDINO   DS    CL20    15   22   20  A  P N             T        Y              
DVDREVH  DS    CL8                                                              
DVDREV   DS    CL25    15   45   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
DVDMOSH  DS    CL8                                                              
DVDMOS   DS    CL5     16   22    5  A  P N             T        Y              
DVDMOSEH DS    CL8                                                              
DVDMOSE  DS    CL7     16   30    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
DVDORDRH DS    CL8                                                              
DVDORDR  DS    CL13    17   22   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   40    5  A  P N             T        Y              
DVDGRSSH DS    CL8                                                              
DVDGRSS  DS    CL13    17   50   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   77    1  A  P Z             T        Y              
DVDOVRTH DS    CL8                                                              
DVDOVRT  DS    CL1     17   79    1  A  P N             T        Y              
DVDSGRTH DS    CL8                                                              
DVDSGRT  DS    CL5     18   37    5  A  P Z             T        Y              
DVDSGRSH DS    CL8                                                              
DVDSGRS  DS    CL13    18   43   13  A  P Z             T        Y              
DVDSNTTH DS    CL8                                                              
DVDSNTT  DS    CL3     18   63    3  A  P Z             T        Y              
DVDSNETH DS    CL8                                                              
DVDSNET  DS    CL13    18   67   13  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
DVDSRCEH DS    CL8                                                              
DVDSRCE  DS    CL4     19   22    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    20    2   16  A  P N             T        Y              
DVDCSTH  DS    CL8                                                              
DVDCST   DS    CL10    20   22   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21    2   12  A  P N             T        Y              
DVDACTDH DS    CL8                                                              
DVDACTD  DS    CL10    21   22   10  A  P N             T        Y              
DVDCSTSH DS    CL8                                                              
DVDCSTS  DS    CL9     22   30    9  A  P N             T        Y              
DVDCDH   DS    CL8                                                              
DVDCD    DS    CL50    23   22   50  A  P N             T        Y              
DVDFLGH  DS    CL8                                                              
DVDFLG   DS    CL1     23   79    1  A  U N             T        Y              
DVDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DVDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1008 BYTES                            
