*          DATA SET PPFISFFD   AT LEVEL 003 AS OF 11/28/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41BFFD      DATE 11/28/05                 
         SPACE 1                                                                
T41BFFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
FISEMSGH DS    XL8                                                              
FISEMSG  DS    CL60     1    2   60  A  P N             T        Y              
FISIDH   DS    XL8                                                              
FISID    DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      2    1    6  A  P N             T        Y              
FISMDIAH DS    XL8                                                              
FISMDIA  DS    CL1      2   13    1  A  U N             T    I   Y              
FISMDESH DS    XL8                                                              
FISMDES  DS    CL10     2   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      2   43    6  A  P N             T        Y              
FISCLTH  DS    XL8                                                              
FISCLT   DS    CL7      2   52    7  A  U N             T        Y              
FISCLTNH DS    XL8                                                              
FISCLTN  DS    CL20     2   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      3    1    8  A  P N             T        Y              
FISPRDH  DS    XL8                                                              
FISPRD   DS    CL3      3   13    3  A  U N             T        Y              
FISPRDNH DS    XL8                                                              
FISPRDN  DS    CL20     3   22   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      3   43    8  A  P N             T        Y              
FISESTH  DS    XL8                                                              
FISEST   DS    CL4      3   52    4  A  U N             T        Y              
FISESTNH DS    XL8                                                              
FISESTN  DS    CL20     3   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     4    1   11  A  P N             T        Y              
FISSTDEH DS    XL8                                                              
FISSTDE  DS    CL8      4   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      4   43    8  A  P N             T        Y              
FISEDDEH DS    XL8                                                              
FISEDDE  DS    CL8      4   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     5    1   11  A  P N             T        Y              
FISPUBH  DS    XL8                                                              
FISPUB   DS    CL18     5   13   18  A  U N             T        Y              
FISPUBNH DS    XL8                                                              
FISPUBN  DS    CL20     5   33   20  A  P N             T        Y              
FISPUBCH DS    XL8                                                              
FISPUBC  DS    CL16     5   54   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    1    7  A  P N             T        Y              
FISOPTH  DS    XL8                                                              
FISOPT   DS    CL51     6   13   51  A  U N             T        Y              
FISETSTH DS    XL8                                                              
FISETST  DS    CL6      6   66    6  A  P N             T        Y              
FISEND1H DS    XL8                                                              
FISEND1  DS    CL1      6   78    1  A  U N             T        Y              
FISHD1H  DS    XL8                                                              
FISHD1   DS    CL4      7    2    4  A  P N             T        Y              
FISHD2H  DS    XL8                                                              
FISHD2   DS    CL80     8    1   80  A  P N             T        Y              
FISOT01H DS    XL8                                                              
FISOT01  DS    CL80    10    1   80  A  P N             N        Y              
FISOT02H DS    XL8                                                              
FISOT02  DS    CL80    11    1   80  A  P N             N        Y              
FISOT03H DS    XL8                                                              
FISOT03  DS    CL80    12    1   80  A  P N             N        Y              
FISOT04H DS    XL8                                                              
FISOT04  DS    CL80    13    1   80  A  P N             N        Y              
FISOT05H DS    XL8                                                              
FISOT05  DS    CL80    14    1   80  A  P N             N        Y              
FISOT06H DS    XL8                                                              
FISOT06  DS    CL80    15    1   80  A  P N             N        Y              
FISOT07H DS    XL8                                                              
FISOT07  DS    CL80    16    1   80  A  P N             N        Y              
FISOT08H DS    XL8                                                              
FISOT08  DS    CL80    17    1   80  A  P N             N        Y              
FISOT09H DS    XL8                                                              
FISOT09  DS    CL80    18    1   80  A  P N             N        Y              
FISOT10H DS    XL8                                                              
FISOT10  DS    CL80    19    1   80  A  P N             N        Y              
FISOT11H DS    XL8                                                              
FISOT11  DS    CL80    20    1   80  A  P N             N        Y              
FISOT12H DS    XL8                                                              
FISOT12  DS    CL80    21    1   80  A  P N             N        Y              
FISOT13H DS    XL8                                                              
FISOT13  DS    CL80    22    1   80  A  P N             N        Y              
FISOT14H DS    XL8                                                              
FISOT14  DS    CL80    23    1   80  A  P N             N        Y              
FISLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
FISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1968 BYTES                            
