*          DATA SET PPFRGTBD   AT LEVEL 012 AS OF 02/14/94                      
*                                                                               
***********************************************************************         
*   DSECT FOR PPFRGTAB TABLE                                                    
*                                                                               
*   TABLE ENTRIES ARE FRAGMENTS OF SPACE DESCRIPTIONS.                          
*                                                                               
***********************************************************************         
         SPACE 1                                                                
PPFRGTBD DSECT                                                                  
*                                                                               
PPFRFRAG DS    CL12                FRAGMENT                                     
PPFRMINL DS    XL1                 MINIMUM INPUT LENGTH (-1)                    
PPFRTYPE DS    CL1                 TYPE                                         
*                                    U=UNIT OF MEASURE                          
*                                    C=COLOR                                    
*                                    N=NUMERIC EQUIV                            
PPFRVAL1 DS    XL1                 1ST VALUE                                    
PPFRVAL2 DS    XL1                 2ND VALUE                                    
PPFRNUMQ DS    XL4                 NUMERIC EQUIV, FOR TYPE N                    
PPFRGTBL EQU   *-PPFRGTBD          DSECT LENGTH                                 
*                                                                               
*        EQUATES FOR CERTAIN VALUES                                             
PPFRXQ   EQU   59                  X                                            
PPFRSLQ  EQU   58                  SLASH                                        
PPFRCLRQ EQU   10                  COLOR                                        
PPFRCLMQ EQU   2                   COLUMN                                       
PPFRCCQ  EQU   53                  CLR/CLM - AMBIGUOUS ENTRY                    
