*          DATA SET PPGENAOR   AT LEVEL 008 AS OF 04/16/91                      
PAORRECD DSECT           PRINTPAK AGENCY OF RECORD CONTROL RECORD               
*                                                                               
PAORKEY  DS    0XL25                                                            
PAORKAGY DS    CL2                 AGENCY                                       
PAORKMED DS    CL1                 MEDIA                                        
PAORKRCD DS    XL1'19'             RECORD TYPE                                  
PAORKCLT DS    CL3                 CLIENT                                       
PAORKPRD DS    CL3                 PRODUCT                                      
PAORKCLS DS    CL3                 CLASS                                        
         DS    XL12                SPARE                                        
*                                                                               
PAORLEN  DS    XL2                                                              
PAORCNTL DS    XL2                                                              
         DS    XL4                                                              
         SPACE 2                                                                
PAORELS  DS    0X                                                               
PAORADEL DS    XL1'02'             AOR BILLING ADDRESS                          
         DS    AL1(130)                                                         
         DS    XL8                 SPARE                                        
PAORLIN1 DS    CL30                ADDRESS LINE 1                               
PAORLIN2 DS    CL30                ADDRESS LINE 2                               
PAORLIN3 DS    CL30                ADDRESS LINE 3                               
PAORLIN4 DS    CL30                ADDRESS LINE 4                               
*                                                                               
PAORELEM DS    XL1'03'             AOR INFO ELEM                                
         DS    AL1(60)                                                          
PAORPCT  DS    XL4                 AOR COMMISSION PCT                           
PAOREFF  DS    XL2                 EFFECTIVE DATE - YYMM                        
PAORKILL DS    XL2                 KILLDATE - YYMM (MOS)                        
PAORGSTC DS    CL1                 GST CODE                                     
         DS    XL3                 SPARE                                        
PAORRCVB DS    CL14                AOR RECEIVABLE ACCOUNT CODE                  
PAORCOMM DS    CL14                AOR COMMISSION ACCOUNT CODE                  
         DS    CL18                SPARE                                        
