*          DATA SET PPGENBYPP  AT LEVEL 006 AS OF 05/01/07                      
***********************************************************************         
*                                                                     *         
*        PBYPPSVS GENERIC DATE PASSIVE POINTER FOR BUY                *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
PBYPPSVD DSECT                                                                  
*                                                                               
PBYPKEY  DS    0CL25               DATE PASSIVE KEY                             
PBYPAGY  DS    CL2                 AGENCY                                       
PBYPMED  DS    CL1                 MEDIA                                        
PBYPRCD  DS    XL1                 PASSIVE RECORD CODE                          
PBYPRIDQ EQU   X'A8'               DATE PASSIVE POINTER ID                      
PBYPDTYP DS    XL1                 DATE TYPE                                    
PBYPMCLQ EQU   X'01'                  MATERIAL CLOSING DATE                     
PBYPCLSQ EQU   X'02'                  SPACE    CLOSING DATE                     
PBYPBLBQ EQU   X'03'                  BILLABLE DATE                             
PBYPPAYQ EQU   X'04'                  PAYABLE  DATE                             
PBYPCLT  DS    CL3                 CLIENT                                       
PBYPPRD  DS    CL3                 PRODUCT                                      
PBYPEST  DS    XL2                 ESTIMATE                                     
         DS    XL5                                                              
PBYPDTE  DS    CL3                 DATE                                         
PBYPDADR DS    XL4                 DISK ADDRESS FOR UNIQUENESS                  
*                                                                               
PBYPCNTL DS    XL2                 CONTROL BYTES                                
PBYPDISK DS    XL4                 DISK ADDRESS                                 
