*          DATA SET PPGENPBMAT AT LEVEL 002 AS OF 09/08/03                      
***********************************************************************         
*                                                                     *         
*        PBMATELM - BUY ELEMENT GIVING MATCH STATUS                   *         
*                                                                     *         
***********************************************************************         
*                                                                               
PBMATELD DSECT                     BUY/INVOICE DETAIL POINTER                   
PBMATELM DS    XL1                 ELEMENT CODE                                 
PBMATELQ EQU   X'52'                 ELEMENT IDENTIFIER                         
PBMATLEN DS    XL1                 ELEMENT LENGTH                               
PBMTSTAT DS    XL1                 MATCHING STATUS                              
PBMTSNIQ EQU   0                     NO INVOICE                                 
PBMTSPDQ EQU   C'P'                  PENDING                                    
PBMTSMTQ EQU   C'M'                  MATCHED                                    
PBMTSDSQ EQU   C'D'                  DISCREPANT                                 
PBMTDSTA DS    XL1                 DISCREPANCY STATUS                           
PBMTDNAQ EQU   0                     NOT APPLICABLE                             
PBMTDNRQ EQU   C'N'                  NEEDS REVIEW                               
PBMTDRVQ EQU   C'V'                  REVIEWING                                  
PBMTDRSQ EQU   C'R'                  RESOLVED                                   
         DS    XL3                 SPARE                                        
PBMTLENQ EQU   *-PBMATELM                                                       
*                                                                               
