*          DATA SET PPGENPUB   AT LEVEL 023 AS OF 10/18/84                      
*                                                                               
*        PRINTPAK PUBLICATION AND REP RECORDS                                   
*        ------------------------------------                                   
*                                                                               
*        RECORD                                                                 
*         CODE     DESCRIPTION                                                  
*        ------    -----------                                                  
*          50      CIRC DATA BANK FILE DESC RECORD                              
*                                                                               
*          60/01   BASE RECORD                                                  
*          60/02   RATE RECORD (OLD)                                            
*          60/03   ADDRESS RECORD                                               
*          60/04   REG/DIST ASSIGN RECORD                                       
*          60/05   CIRC DATA BANK PUB MASTER                                    
*          60/06   RATE CARD RECORD                                             
*                                                                               
*          61      ALPHA CODE PASSIVE POINTER TO PUB BASE RECORD                
*          63      PUBLIST RECORD                                               
*          64      PUBLIST ASSIGN. REC (DIRECTORY ONLY)                         
*                                                                               
*          71      REP RECORD                                                   
*                                                                               
*        NOTE-DSET RECORDS ARE USED TO CARRY THE COUNTY CIRCULATION,            
*             POP, AND HH DATA.                                                 
*             SEE MPGENFILE FOR FULLER EXPLANATION.                             
*                                                                               
*          40/21   CIRCULATION DSET DEFINITION                                  
*          44      DATA ITEM- DSET HIGH                                         
*          45      DATA ITEM- AREA HIGH                                         
*                                                                               
*        CONTROL BYTE USAGE-  X'80' = RECORD DELETED                            
*                             X'08' = DIRECTORY ONLY (NOT A POINTER)            
*                             X'01' = PASSIVE POINTER                           
*                                                                               
*                                  PUBLICATION BASE RECORD                      
*                                  -----------------------                      
PUBREC   DSECT                                                                  
PUBKEY   DS    0XL32                                                            
PUBKAGY  DS    CL2                 AGENCY                                       
PUBKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
PUBKRCD  DS    XL1'60'             RECORD CODE                                  
PUBKMED  DS    CL1                 MEDIA                                        
         DS    XL15                FILLER                                       
PUBKPUB  DS    XL4                 PUB CODE (PWOS)                              
PUBKZON  DS    XL1                 ZONE CODE (PWOS)                             
PUBKED   DS    CL1                 EDITION CODE                                 
PUBKRSC  DS    XL1'01'             RECORD SUB-CODE                              
         DS    XL5                 SPARE                                        
*                                                                               
         ORG   PUBKEY              PASSIVE POINTER                              
*                                  ---------------                              
*                                                                               
PUBPAGY  DS    CL2                 AGENCY                                       
PUBPSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
PUBPRCD  DS    XL1'61'             RECORD CODE                                  
PUBPMED  DS    CL1                 MEDIA                                        
         DS    XL9                 FILLER                                       
PUBPALC  DS    CL10                ALTERNATE CODE                               
PUBPPUB  DS    XL4                 PUB CODE (PWOS)                              
PUBPZON  DS    XL1                 ZONE CODE (PWOS)                             
PUBPED   DS    CL1                 EDITION CODE                                 
*                                                                               
         DS    XL2                 RECORD LENGTH                                
PUBCNTL  DS    XL1                 CONTROL                                      
PUBCNTL2 DS    XL1                 ALT CODE CNTL (SEE PUBALCTL)                 
         DS    XL4                 DISK ADDR                                    
         SPACE 2                                                                
PUBELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
PUBNAMEL DS    X'10'               NAME ELEMENT                                 
         DS    AL1(100)            ELEMENT LENGTH                               
PUBNAME  DS    CL20                NAME LINE 1                                  
PUBNAM2  DS    CL20                NAME LINE 2                                  
PUBZNAME EQU   PUBNAM2                                                          
PUBCITY  DS    CL20                CITY                                         
PUBSTATE DS    CL2                 STATE                                        
PUBCNTRY DS    CL1                 COUNTRY  U=US,C=CAN                          
PUBKILL  DS    XL3                 KILL DATE - YMD                              
PUBCLASS DS    CL4                 CLASSIFICATION                               
PUBPUBL  DS    CL4                 PUBLISHER                                    
PUBEDTS  DS    CL15                LIST OF EDITION CODES                        
         DS    CL9                 SPARE                                        
         SPACE 2                                                                
PUBCHDEL DS    X'11'               COLUMN HEADING ELEMENT                       
         DS    AL1(30)                                                          
         DS    XL4                 SPARE                                        
PUBCHD1  DS    CL8                 COLUMN HEADING LINE 1                        
PUBBHD2  DS    CL8                 COLUMN HEADING LINE 2                        
PUBCHD3  DS    CL8                 COLUMN HEADING LINE 3                        
         SPACE 2                                                                
PUBSHNEL DS    X'12'               SHORT NAME ELEM                              
         DS    AL1(22)                                                          
PUBSHNAM DS    CL20                SHORT NAME                                   
         SPACE 2                                                                
PUBGENEL DS    X'20'               GENERAL INFORMATION ELEM                     
         DS    AL1(60)             ELEMENT LENGTH                               
PUBCD    DS    PL2                 CASH DISCOUNT - N.N                          
PUBCDDAS DS    PL2                 CASH DISC. DAYS (FROM INVOICE DATE)          
PUBCDDAT DS    XL3                 EFFECTIVE DATE FOR CD                        
PUBAC    DS    PL3                 AGENCY COMISSION  - NN.NNN                   
*                                                                               
PUBFREQ  DS    CL2                 FREQUENCY                                    
PUBFD    DS    PL3                 FULL COLUMN DEPTH- INCHES NN.NN              
PUBCONR  DS    CL1                 CONTRACTS REQUIRED (Y,N)                     
*                                                                               
PUBOSMO  DS    PL2                 ON SALE DATE   - REL. MO.                    
PUBOSDA  DS    PL2                                - DAY                         
PUBPAYMO DS    PL2                 PAYMENT DATE   - REL. MONTH                  
PUBPAYDA DS    PL2                                - DAY                         
PUBCLMO  DS    PL2                 CLOSING DATE   - REL. MONTH                  
PUBCLDA  DS    PL2                                - DAY                         
PUBMCMO  DS    PL2                 MATERIAL CLOSE - REL. MONTH                  
PUBCMDA  DS    PL2                                - DAY                         
*                                                                               
PUBCPP   DS    PL2                 COLUMNS PER PAGE                             
PUBLPC   DS    PL2                 LINES PER COLUMN                             
PUBLDT   DS    PL3                 LINES DOUBLE TRUCK                           
PUBLCFC  DS    PL2                 LINES CHARGED FULL COLUMN                    
PUBCOLWD DS    PL3                 COLUMN WIDTTH IN INCHES - NN.NNNN            
PUBMDROP DS    CL1                 MINIMUM DEPTH ROP (IN INCHES)                
*                                  C = AS MANY INCHES AS COLS.                  
PUBFMT   DS    CL1                 FORMAT (T=TABLOID)                           
PUBPRESS DS    CL1                 TYPE OF PRESS                                
*                                  O = OFFSET                                   
*                                  R = ROTARY LETTERPRESS                       
*                                  F = FLATBED                                  
*                                  P= PHOTOCOMP                                 
PUBEXCL  DS    CL1                 EXCLUSIONS                                   
*                                  X'80' = LIQUOR                               
*                                  X'40' = TOBACCO                              
*                                  X'20' = BEER                                 
*                                  X'10' = WINE                                 
*                                  X'08' = CIGARETTES                           
PUBBFDS  DS    CL1                 BEST FOOD DAYS                               
*                                  X'40' = MON, X'20' = TUES,ETC.               
         DS    CL9                 SPARE                                        
         SPACE 2                                                                
PUBCIREL DS    X'30'               CIRCULATION ELEMENT                          
         DS    AL1(18)             ELEMENT LENGTH                               
PUBCIRC  DS    PL5                 CIRCULATION                                  
PUBCDAT  DS    XL3                 CIRC DATE - YMD                              
PUBCSRC  DS    CL4                 CIRCULATION SOURCE                           
PUBCEDIT DS    CL1                 EDITION CODE (NOT ZONE)                      
PUBCTYP  DS    XL1                 CIRC TYPE - 00=TOTAL CIRC                    
         DS    CL2                 SPARE                                        
         SPACE 2                                                                
PUBALCEL DS    X'19'               ALTERNATE CODE ELEMENT                       
*                                  (GENERATES PASSIVE POINTERS)                 
         DS    AL1(14)             LENGTH                                       
PUBALCTL DS    XL1                 CONTROL-(2ND CTL BYTE OF POINTER)            
*                                  X'80'= PRIMARY ABBREVIATION                  
*                                  X'40'= DDS CODE POINTER                      
*                                  X'20'= DONT DISPLAY                          
         DS    XL1                 SPARE                                        
PUBALCD  DS    CL10                CODE                                         
*                                  ALPHA CODE, OR                               
*                                  DDS PUB CODE (CTL=X'40')                     
         EJECT                                                                  
*                                  PUBLICATION RATE RECORD (OLD)                
*                                  -----------------------------                
PURREC   DSECT                                                                  
PURKEY   DS    0XL32                                                            
PURKAGY  DS    CL2                 AGENCY                                       
PURKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
PURKRCD  DS    XL1'60'             RECORD CODE                                  
PURKMED  DS    CL1                 MEDIA                                        
         DS    XL15                FILLER                                       
PURKPUB  DS    XL4                 PUB CODE (PWOS)                              
PURKZON  DS    XL1                 ZONE CODE (PWOS)                             
PURKED   DS    CL1                 EDITION CODE                                 
PURKRSC  DS    XL1'02'             RECORD SUB-CODE                              
         DS    XL5                 SPARE                                        
*                                                                               
         DS    XL2                 RECORD LENGTH                                
PURCNTL  DS    XL2                 CONTROL                                      
         DS    XL4                 DISK ADDR                                    
         SPACE 2                                                                
PURELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
PUBRATEL DS    X'50'               RATE ELEM                                    
         DS    AL1(30)             ELEMENT LENGTH                               
PUBRSTRT DS    XL3                 EFFECTIVE DATE                               
PUBRTYP  DS    XL1                 SPACE TYPE                                   
*                                  X'80' = LINE                                 
*                                  X'40' = AGATE LINE                           
*                                  X'20' = INCHES                               
*                                  X'00' = TOTAL SPACE RATE                     
PUBRATE  DS    PL5                 LINE RATE - NN.NNNNN                         
*                                  OR TOTAL SPACE RATE - NNN.NN                 
PUBDLTYP DS    CL1                 DISCOUNT LEVEL TYPE                          
*                                  L = LINES                                    
*                                  P = PAGES                                    
*                                  X = TIMES                                    
*                                  $ = DOLLARS                                  
*                                  I = INCHES                                   
PUBDRTYP DS    XL1                 DISCOUNT TYPE                                
*                                  X'80' =  REPLACEMENT RATE                    
*                                  X'40' =  PCT DISCOUNT                        
PUBRSPCE DS    0CL17               SPACE DESCRIPTION                            
         DS    CL1                 X'FF'=SPECIAL OUTDOOR FIELDS FOLLOW          
PUBRSHOW DS    PL3                 OUTDOOR - SIZE SHOWING                       
PUBRREG  DS    PL3                          REGULAR DISPLAYS                    
PUBRILLM DS    PL3                          ILLUM. DISPLAYS                     
         DS    CL7                          SPARE                               
         SPACE 2                                                                
PUBDSCEL DS    X'51'               DISCOUNT TABLE ELEM                          
         DS    AL1(14)             ELEMENT LENGTH                               
PUBDSCLV DS    PL5                 DISCOUNT LEVEL                               
PUBDSCRT DS    PL5                 DISCOUNT RATE -NN.NNNNN                      
         DS    CL2                 SPARE                                        
         SPACE 2                                                                
PUBPRMEL DS    X'60'               PREMIUM (COLOR) ELEMENT                      
         DS    AL1(40)             ELEMENT LENGTH                               
PUBPCOD  DS    CL3                 PREMIUM TYPE CODE                            
*                                  '1C ' = 1 COLOR, ETC                         
PUBPSTRT DS    XL3                 EFFECTIVE DATE                               
PUBPDAYS DS    XL1                 DAYS AVAILABLE                               
*                                  X'40' = MON, X'20' = TUES ETC                
PUBPMINS DS    PL4                 MINIMUM SIZE                                 
PUBPMINC DS    PL5                 MINIMUM CHARGE ($)                           
         DS    CL4                 SPARE                                        
PUBPTYPC DS    XL1                 TYPE OF CHARGE                               
*                                  X'80' = FLAT                                 
*                                  X'40' = B/W + FLAT                           
*                                  X'20' = B/W + PCT.                           
*                                  X'10' = B/W + LINE                           
*                                  X'08' = B/W + INCH                           
         DS    CL17                SPARE                                        
PUBPTBEL DS    X'61'               PREM CHARGE ELEM                             
         DS    AL1(14)             ELEMENT LENGTH                               
PUBPTBLN DS    PL5                 LINEAGE - MAX AD SIZE FOR WHICH              
*                                            THIS RATE APPLIES                  
PUBPTBCH DS    PL5                 CHARGE FOR THIS AD SIZE - NN.NNNNN           
         DS    CL2                 SPARE                                        
         SPACE 2                                                                
PUBLEQEL DS    X'40'               LINE EQUIVALENCE ELEMENT                     
         DS    AL1(10)             ELEM LENGTH                                  
*                                                                               
PUBLESPC DS    CL6                 SPACE (S.A.U.) CODE                          
PUBLELNS DS    XL2                 LINE EQUIVALENT                              
         EJECT                                                                  
*                                  PUBLICATION ADDRESS RECORD                   
*                                  --------------------------                   
PUAREC   DSECT                                                                  
PUAKEY   DS    0XL32                                                            
PUAKAGY  DS    CL2                 AGENCY                                       
PUAKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
PUAKRCD  DS    XL1'60'             RECORD CODE                                  
PUAKMED  DS    CL1                 MEDIA                                        
         DS    XL15                FILLER                                       
PUAKPUB  DS    XL4                 PUB CODE (PWOS)                              
PUAKZON  DS    XL1                 ZONE CODE (PWOS)                             
PUAKED   DS    CL1                 EDITION CODE                                 
PUAKRSC  DS    XL1'03'             RECORD SUB-CODE                              
         DS    XL5                 SPARE                                        
*                                                                               
         DS    XL2                 RECORD LENGTH                                
PUACNTL  DS    XL2                 CONTROL                                      
         DS    XL4                 DISK ADDR                                    
         SPACE 2                                                                
PUAELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
PUBADREL DS    X'0B'               PUB ADDRESS ELEMENT                          
         DS    AL1(0)              LENGTH - 14 FOR REP, 216 FOR ADDR            
PUBAUSE  DS    XL1                 ADDRESS USE                                  
*                                  X'80'=PAY,X'40'=CON,X'20'=TRA                
PUBAOFF  DS    XL3                 3X'FF' = AGENCY                              
*                                  X'FF' + X + BLANK = OFFICE X                 
*                                  ELSE CLIENT                                  
         DS    CL3                 SPARE                                        
PUBATYP  DS    CL1                 R=REP (CODE FOLLOWS)                         
*                                  A=ADDRESS                                    
PUBAREP  DS    CL4                 REP CODE                                     
         ORG   PUBAREP                                                          
PUBANAM  DS    CL36                NAME                                         
PUBALIN1 DS    CL30                LINE 1                                       
PUBALIN2 DS    CL30                LINE 2                                       
PUBALIN3 DS    CL30                LINE 3                                       
PUBALIN4 DS    CL30                LINE 4                                       
PUBACON  DS    CL30                CONTACT                                      
PUBATEL  DS    CL12                TELEPHONE                                    
PUBAEXT  DS    CL8                 EXTENSION                                    
*                                                                               
         EJECT                                                                  
*                                  PUBLICATION REG/DST MAP RECORD               
*                                  ------------------------------               
PUMREC   DSECT                                                                  
PUMKEY   DS    0XL32                                                            
PUMKAGY  DS    CL2                 AGENCY                                       
PUMKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
PUMKRCD  DS    XL1'60'             RECORD CODE                                  
PUMKMED  DS    CL1                 MEDIA                                        
         DS    XL15                FILLER                                       
PUMKPUB  DS    XL4                 PUB CODE (PWOS)                              
PUMKZON  DS    XL1                 ZONE CODE (PWOS)                             
PUMKED   DS    CL1                 EDITION CODE                                 
PUMKRSC  DS    XL1'04'             RECORD SUB-CODE                              
         DS    XL5                 SPARE                                        
*                                                                               
         DS    XL2                 RECORD LENGTH                                
PUMCNTL  DS    XL2                 CONTROL                                      
         DS    XL4                 DISK ADDR                                    
         SPACE 2                                                                
PUMELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
PUMAPEL  DS    X'71'               REG/DIST MAP ELEM                            
         DS    AL1(18)             ELEMENT LENGTH                               
*                                                                               
PUMCLT   DS    CL3                 CLIENT                                       
PUMDIV   DS    CL3                 DIVISION                                     
PUMREG   DS    CL3                 REGION                                       
PUMDST   DS    CL3                 DISTRICT                                     
PUMSHR   DS    XL2                 REG/DST SHARE PCT. -NN.NN                    
         DS    CL2                 SPARE                                        
*                                                                               
         EJECT                                                                  
*                                  CIRCULATION DATA BANK                        
*                                  FILE DEFINITION RECORD                       
*                                  ----------------------                       
CFDREC   DSECT                                                                  
CFDKEY   DS    0XL32                                                            
CFDKAGY  DS    XL2                 AGENCY (X'00')                               
CFDKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
CFDKRCD  DS    XL1'50'             RECORD CODE                                  
         DS    XL20                FILLER                                       
CFDKFCD  DS    CL8                 FILE CODE                                    
*                                                                               
         DS    XL4                 CONTROL                                      
         DS    XL2                 RECORD LENGTH                                
CFDELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
*        TEXT ELEMENT USAGE                                                     
*                                           MAX                                 
*        CODE   USAGE              NUMBER  LENGTH                               
*        ----   -----              ------  ------                               
*        X'10'  HEADLINE NOTE         2      25                                 
*        X'20'  FOOTNOTE              2      70                                 
         SPACE 2                                                                
CFDCTEL  DS    X'21'               CONTROL ELEM                                 
         DS    AL1(20)                                                          
CFDCICD  DS    XL2                 INTERNAL FILE (SOURCE) CODE                  
CFDCDAT  DS    XL3                 DATE OF FILE                                 
         DS    XL13                SPARE                                        
         SPACE 2                                                                
CFDZNEL  DS    X'31'               ZONE DEFINITION ELEMENT                      
         DS    AL1(10)             SEE BELOW FOR EXPLANATIONS                   
CFDZNCD  DS    XL1                 CODE                                         
CFDZNAB  DS    CL4                 ABBREVIATION                                 
         DS    CL3                 SPARE                                        
         SPACE 2                                                                
CFDDDEL  DS    X'31'               DATA DEFINITION ELEMENT                      
         DS    AL1(15)             SEE BELOW FOR EXPLANATIONS                   
CFDEDCD  DS    XL1                 CODE                                         
CFDEDAB  DS    CL4                 ABBREVIATION                                 
CFDDDPR  DS    XL1                 DATA PRECISION                               
*                                  (2=100'S, -2=.00, ETC)                       
CFDDNPR  DS    XL1                 NORMAL DISPLAY PRECISION                     
         DS    CL6                 SPARE                                        
*                                                                               
*                      ABBR CODE   DESCRIPTION                                  
*                      ---- ----   -----------                                  
*        ZONES         TPD  X'01'  TOTAL PAID                                   
*                      CTZ  X'02'  CITY ZONE                                    
*                      RTZ  X'03'  RETAIL TRADING ZONE                          
*                      PMA  X'04'  PRIMARY MARKET AREA                          
*                      CITY X'05'  CITY OF PUBLICATION                          
*                      PMA  X'06'  ANOTHER PMA (FOR SUNDAY?) ??                 
*                                                                               
*                      THE FOLLOWING ZONES ARE OFTEN NOT PRESENT                
*                      AND MAY OR MAY NOT BE USED IN THE SYSTEM                 
*                                                                               
*                      PMA  X'11'  YET ANOTHER PMA??                            
*                      OTH  X'12'  ALL OTHER??                                  
*                      TRA  X'13'  TRANS. TERMINAL                              
*                      MKT  X'14'  SMSA/CMA/COUNTY                              
*                      ADI  X'15'  ADI                                          
*                      DIF  X'16'  DIFFERENCE                                   
*                      BAL  X'17'  BALANCE IN COUNTY                            
*                                                                               
*        DATA TYPES    HH   X'01'  HOUSEHOLDS                                   
*                      CHH  X'02'  CENSUS HH                                    
*                      POP  X'03'  POPULATION                                   
*                      CPOP X'04'  CENSUS POP                                   
*                                                                               
*                      MOR  X'11'  MORNING CIRC                                 
*                      EVE  X'12'  EVENING CIRC                                 
*                      DAY  X'13'  ALL DAY CIRC                                 
*                      SUN  X'14'  SUNDAY CIRC                                  
*                      CIRC X'15'  TOTAL CIRC (MAGAZINES AND WEEKLIES)          
*                                                                               
*        THIS DATA DICTIONARY DESCRIBES THE DATA ELEMENTS FOUND                 
*        IN THE CIRCULATION MASTER RECORDS.                                     
*                                                                               
*        EACH ELEMENT IS IDENTIFIED BY ZONE AND DATA TYPE.                      
*                                                                               
*        FOR MAGAZINES (AND WEEKLIES?) THE ONLY DATA PRESENT IS TOTAL           
*        PAID CIRCULATION (TPD,CIRC).                                           
*                                                                               
*        FOR NEWSPAPERS-                                                        
*          HH AND POP ARE NORMALLY PRESENT FOR CTZ,RTZ,CITY, AND PMA.           
*          CIRCS MAY BE THERE FOR ALL ZONES.                                    
*          DAY CIRC IS FOR PAPERS PUBLISHED ALL DAY LONG. IT WOULD NOT          
*          EXIST ALONG WITH MOR OR EVE.                                         
         EJECT                                                                  
*                                                                               
*                                  CIRCULATION MASTER                           
*                                  ------------------                           
UCMREC   DSECT                                                                  
UCMKEY   DS    0XL32                                                            
UCMKAGY  DS    CL2                 AGENCY (FILE INTERNAL CODE)                  
UCMKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
UCMKRCD  DS    XL1'60'             RECORD CODE                                  
         DS    XL17                FILLER                                       
UCMKPUB  DS    XL6                 PUB CODE (PWOS)                              
UCMKSRC  DS    XL1'05'             RECORD SUB-CODE                              
         DS    XL3                 SPARE                                        
UCMKAUD  DS    XL2                 AUDIT YYMM (COMPLEMENTED)                    
*                                                                               
         DS    XL4                 CONTROL                                      
         DS    XL2                 RECORD LENGTH                                
         SPACE 2                                                                
UCMELS   DS    0X                  START OF FIRST ELEMENT                       
         SPACE 2                                                                
UCMGIEL  DS    XL1'15'             GENERAL INFORMATION ELEMENT                  
         DS    AL1(20)                                                          
UCMGHST  DS    CL2                 HOME STATE                                   
UCMGHCOU DS    CL4                 HOME COUNTY                                  
UCMGHCIT DS    CL4                 HOME CITY                                    
UCMMORN  DS    CL1                 M=MORNING                                    
UCMEVE   DS    CL1                 E=EVENING                                    
UCMDAY   DS    CL1                 D=ALL DAY                                    
UCMSUN   DS    CL1                 S=SUNDAY                                     
         DS    CL4                 SPARE                                        
         SPACE 2                                                                
UCMDEL   DS    XL1'31'             DATA/CIRC ELEM                               
         DS    AL1(12)                                                          
UCMDVAL  DS    PL6                 NUMERIC VALUE                                
UCMDZON  DS    XL1                 ZONE      **                                 
UCMDTYP  DS    XL1                 DATA TYPE **                                 
         DS    CL2                 SPARE                                        
*                                                                               
*        ** ZONE, AND DATA TYPE ARE DEFINED IN THE DATA                         
*           DICTIONARY ELEMENTS OF THE FILE DEFINITION RECORD.                  
*                                                                               
*           THIS RECORD CONTAINS PUBLICATION TOTAL DATA, NOT                    
*           COUNTY DATA.                                                        
*                                                                               
         EJECT                                                                  
*                                                                               
*                                  CIRCULATION DATA SET DEFINITION              
*                                  -------------------------------              
UCDREC   DSECT                                                                  
UCDKEY   DS    0XL32                                                            
UCDKAGY  DS    CL2                 AGENCY OR SOURCE                             
UCDKSYS  DS    CL1'F'              SUB-SYSTEM CODE - FILE                       
UCDKRCD  DS    XL1'40'             RECORD CODE                                  
UCDKCLS  DS    XL1'21'             DSET CLASS                                   
         DS    XL19                                                             
UCDKPUB  DS    XL4                 PUB CODE (PWOS)                              
UCDKZN   DS    XL1                 ZONE (PWOS)                                  
UCDKED   DS    CL1                 EDITION (M,E,D,S)                            
UCDKNOD  DS    XL2                 NODE                                         
*                                                                               
*                                                                               
         DS    XL2                 RECORD LENGTH                                
*                                                                               
         DS    XL1                 CONTROL                                      
         DS    XL3                 SPARE                                        
*                                                                               
         DS    XL4                 DISK ADDR                                    
         SPACE 2                                                                
*        COUNTY DATA (CIRCULATION, POP, HH) FOR THE CIRCULATION                 
*        ANALYSIS SYSTEM WILL BE KEPT IN THESE DSETS.                           
*                                                                               
*        THE SOURCE CODE IS THE INTERNAL FILE CODE.                             
*                                                                               
*        POPULATION DATA IS KEPT UNDER PUB 00000000, ZONE 01                    
*        HOUSEHOLD  DATA IS KEPT UNDER PUB 00000000, ZONE 02                    
*                                                                               
*        THE DATA SETS ARE DEFINED FOR COUNTIES, AND WILL BE                    
*        'ROLLED UP' FOR ADI'S, DMA'S, STATES, AND SMSA'S, AT                   
*        LEAST.                                                                 
*                                                                               
*        SEE MPGENFILE FOR FULLER DETAIL ON DSET RECORDS.                       
*                                                                               
         SPACE 2                                                                
         EJECT                                                                  
*                                  PUBLIST RECORD                               
*                                  --------------                               
*                                                                               
UPLREC   DSECT                                                                  
UPLKEY   DS    0XL32                                                            
UPLKAGY  DS    CL2                 AGENCY                                       
UPLKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
UPLKRCD  DS    XL1'68'             RECORD CODE                                  
         DS    XL20                FILLER                                       
UPLKLIST DS    CL8                 LIST CODE                                    
*                                                                               
         DS    XL2                 RECORD LENGTH                                
*                                                                               
         DS    XL1                 CONTROL                                      
         DS    XL3                 SPARE                                        
*                                                                               
         DS    XL4                 DISK ADDR                                    
         SPACE 2                                                                
UPLELS   DS    0X                  START OF FIRST ELEMENT                       
*        TEXT ELEMENT USAGE                                                     
*                                           MAX                                 
*        CODE   USAGE              NUMBER  LENGTH                               
*        ----   -----              ------  ------                               
*        X'10'  NAME OF PUB LIST      1      30                                 
         EJECT                                                                  
*                                                                               
*                                  PUBLIST ASSIGNMENT RECORD                    
*                                  -------------------------                    
*                                  (DIRECTORY ONLY)                             
ULAREC   DSECT                                                                  
ULAKEY   DS    0XL32                                                            
ULAKAGY  DS    CL2                 AGENCY                                       
ULAKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
ULAKRCD  DS    XL1'69'             RECORD CODE                                  
         DS    XL14                FILLER                                       
ULAKLIST DS    CL8                 LIST CODE                                    
ULAKPUB  DS    XL4                 PUB CODE (PWOS)                              
ULAKZN   DS    XL1                 ZONE CODE (PWOS)                             
ULAKED   DS    CL1                 EDITION CODE                                 
*                                                                               
ULACNTL  DS    XL1                 CONTROL                                      
ULAINS   DS    XL1                 NUMBER OF INSERTIONS                         
ULAFILT  DS    XL1                 FILTER                                       
         DS    XL5                 SPARE                                        
*                                                                               
         EJECT                                                                  
*                                  SCHEDULE HEADER RECORD                       
*                                  ----------------------                       
*                                                                               
USCREC   DSECT                                                                  
USCKEY   DS    0XL32                                                            
USCKAGY  DS    CL2                 AGENCY                                       
USCKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
USCKRCD  DS    XL1'70'             RECORD CODE                                  
         DS    XL20                FILLER                                       
USCKSCH  DS    CL8                 LIST CODE                                    
*                                                                               
         DS    XL2                 RECORD LENGTH                                
*                                                                               
         DS    XL1                 CONTROL                                      
         DS    XL3                 SPARE                                        
*                                                                               
         DS    XL4                 DISK ADDR                                    
         SPACE 2                                                                
USCELS   DS    0X                  START OF FIRST ELEMENT                       
*        TEXT ELEMENT USAGE                                                     
*                                           MAX                                 
*        CODE   USAGE              NUMBER  LENGTH                               
*        ----   -----              ------  ------                               
*        X'10'  NAME OF SCHEDULE      1      30                                 
         EJECT                                                                  
*                                  SCHEDULE DETAIL RECORD                       
*                                  ----------------------                       
*                                                                               
USDREC   DSECT                                                                  
USDKEY   DS    0XL32                                                            
USDKAGY  DS    CL2                 AGENCY                                       
USDKSYS  DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
USDKRCD  DS    XL1'71'             RECORD CODE                                  
         DS    XL13                FILLER                                       
USDKSCH  DS    CL8                 LIST CODE                                    
USDKPUB  DS    XL4                 PUB CODE (PWOS)                              
USDKZON  DS    XL1                 ZONE CODE (PWOS)                             
USDKLIN  DS    XL2                 LINE NUMBER                                  
*                                                                               
         DS    XL2                 RECORD LENGTH                                
*                                                                               
         DS    XL1                 CONTROL                                      
         DS    XL3                 SPARE                                        
*                                                                               
         DS    XL4                 DISK ADDR                                    
         SPACE 2                                                                
USDELS   DS    0X                  START OF FIRST ELEMENT                       
*                                                                               
USDSEL   DS    X'20'               SCHEDULE DETAIL ELEM                         
         DS    AL1(50)                                                          
USDIDAT  DS    XL2                 INSERTION DATE                               
USDSCDAT DS    XL2                 SPACE CLOSING DATE                           
USDMCDAT DS    XL2                 MAT. CLOSING DATE                            
USDOSDAT DS    XL2                 ON-SALE CLOSING DATE                         
USDSIZE  DS    CL12                AD SIZE                                      
USDCOL   DS    XL1                 COLORATION                                   
USDBLD   DS    CL1                 BLEED                                        
USDPOS   DS    CL1                 POSITION                                     
USDCTYP  DS    XL1                 COST TYPE (UNIT OR TOTAL)                    
USDCOST  DS    XL4                 COST                                         
USDCD    DS    XL2                 CD PERCENT                                   
USDAC    DS    XL2                 AC PERCENT                                   
         EJECT                                                                  
*                                  REP RECORD                                   
*                                  ----------                                   
PREPREC  DSECT                                                                  
PREPKEY  DS    0XL32                                                            
PREPKAGY DS    CL2                 AGENCY CODE                                  
PREPKSYS DS    CL1'U'              SUB-SYSTEM CODE - PUBLICATION                
PREPKRCD DS    X'71'               RECORD CODE                                  
PREPKMED DS    CL1                 MEDIA CODE                                   
         DS    XL22                SPARE                                        
PREPKREP DS    CL4                 REP CODE                                     
PREPKSFX DS    CL1                 SUFFIX                                       
*                                                                               
PREPLEN  DS    XL2                 RECORD LENGTH                                
*                                                                               
PREPCTRL DS    XL2                 CONTROL BYTES                                
         DS    XL4                 DISK ADDRESS                                 
*                                                                               
PREPELEM DS    X'11'               REP ELEMENT                                  
         DS    AL1(216)            ELEMENT LENGTH                               
         DS    CL8                 SPARE                                        
PREPNAME DS    CL36                REP NAME                                     
PREPLIN1 DS    CL30                ADDRESS - LINE 1                             
PREPLIN2 DS    CL30                ADDRESS - LINE 2                             
PREPLIN3 DS    CL30                ADDRESS - LINE 3                             
PREPLIN4 DS    CL30                ADDRESS - LINE 4                             
PREPCON  DS    CL30                CONTACT                                      
PREPTEL  DS    CL12                TELEPHONE NO.                                
PREPEXT  DS    CL8                 EXTENSION                                    
         SPACE 2                                                                
PREPCEL  DS    XL1'13'             COUNTRY ELEMENT                              
         DS    AL1(5)                                                           
PREPCTRY DS    CL1                 COUNTRY (U=US, C=CAN)                        
         DS    CL2                 SPARE                                        
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'023PPGENPUB  10/18/84'                                      
         END                                                                    
