*          DATA SET PPGENBYMV  AT LEVEL 003 AS OF 03/09/06                      
*                                                                               
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
* PRINTPAK - BUY MOVE ELEMENT                                                   
*                                                                               
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
PBYMELMD DSECT                                                                  
PBYMELEM DS    0X                                                               
PBYMELCO DS    XL1                 ELEM CODE                                    
PBYMELCQ EQU   X'A8'                                                            
PBYMELLN DS    XL1                 ELEM LENGTH                                  
*                                                                               
PBYMSTAT DS    X                   BUY MOVE STATUS                              
PBYMFROQ EQU   X'80'               INSERTION MOVED "FROM"                       
PBYMTO_Q EQU   X'40'               INSERTION MOVED "TO"                         
*                                                                               
PBYMSER# DS    PL5                 INSERTION SERIAL#                            
*                                                                               
         DS    XL2                 SPARE                                        
*                                                                               
PBYMELLQ EQU   *-PBYMELEM                                                       
*                                                                               
