*          DATA SET PPGENBYCC  AT LEVEL 002 AS OF 08/18/11                      
***********************************************************************         
*                                                                     *         
*        BYCCELM BUY CUSTON COLUMN ELEMENT                            *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
BYCCELD  DSECT                                                                  
BYCCELM  DS    CL1                 CUSTOM COLUMN ELEMENT                        
BYCCIDQ  EQU   X'CC'               CUSTOM COLUMN ELEMENT ID                     
BYCCLEN  DS    XL1                 ELEMENT LENGTH                               
BYCCSQN  DS    XL2                 CUSTOM COLUMN SEQUENCE NUMBER                
BYCCSWS  DS    XL1                 SWITCHES                                     
BYCCTRKQ EQU   X'80'                 TRACK CHANGES FOR IDESK                    
         DS    XL1                 SPARE                                        
BYCCHDRL EQU   *-BYCCELD           HEADER LENGTH                                
*                                                                               
BYCCDATA DS    0X                  START OF CUSTOM COLUMN DATA                  
*                                                                               
