*          DATA SET PPGENBYIH  AT LEVEL 004 AS OF 04/07/06                      
*                                                                               
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
* PRINTPAK - BUY INVOICE HISTORY ELEMENT                                        
*                                                                               
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
PBYIELMD DSECT                                                                  
PBYIELEM DS    0X                                                               
PBYIELCO DS    XL1                 ELEM CODE                                    
PBYIELCQ EQU   X'53'                                                            
PBYIELLN DS    XL1                 ELEM LENGTH                                  
*                                                                               
PBYIDATE DS    XL3                 DATE                                         
PBYI_PID DS    XL2                 PID                                          
*                                                                               
PBYISTAT DS    X                   INVOICE MATCHING STATUS                      
PBYINIVQ EQU   0                   NO INVOICE                                   
PBYIPENQ EQU   C'P'                PENDING                                      
PBYIMATQ EQU   C'M'                MATCHED                                      
PBYIDISQ EQU   C'D'                DISCREPANT                                   
*                                                                               
         DS    XL4                 SPARE                                        
*                                                                               
PBYIELLQ EQU   *-PBYIELEM                                                       
*                                                                               
