*          DATA SET PPINSFFD   AT LEVEL 003 AS OF 09/29/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41FFFD      DATE 09/29/04                 
         SPACE 1                                                                
T41FFFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PRQMSGH  DS    XL8                                                              
PRQMSG   DS    CL60     1    2   60  A  P N             T        Y              
PRQSRVH  DS    XL8                                                              
PRQSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17     4    2   17  A  P N             T        Y              
PRQUIDH  DS    XL8                                                              
PRQUID   DS    CL3      4   20    3  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL10     6    2   10  A  P N             T        Y              
PRQMEDH  DS    XL8                                                              
PRQMED   DS    CL1      6   20    1  A  U N             T        Y              
PRQMEDNH DS    XL8                                                              
PRQMEDN  DS    CL10     6   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
PRQCLTH  DS    XL8                                                              
PRQCLT   DS    CL3      7   20    3  A  U N             T        Y              
PRQCLTNH DS    XL8                                                              
PRQCLTN  DS    CL20     7   40   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
PRQPRDH  DS    XL8                                                              
PRQPRD   DS    CL3      8   20    3  A  U N             T        Y              
PRQPRDNH DS    XL8                                                              
PRQPRDN  DS    CL20     8   40   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
PRQESTH  DS    XL8                                                              
PRQEST   DS    CL3      9   20    3  A  U N             T        Y              
PRQESTNH DS    XL8                                                              
PRQESTN  DS    CL20     9   40   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PRQJOBH  DS    XL8                                                              
PRQJOB   DS    CL6     10   20    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
PRQPUBH  DS    XL8                                                              
PRQPUB   DS    CL17    11   20   17  A  U N             T        Y              
PRQPUBNH DS    XL8                                                              
PRQPUBN  DS    CL20    11   40   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    12    2   15  A  P N             T        Y              
PRQPERH  DS    XL8                                                              
PRQPER   DS    CL17    12   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
PRQCDTH  DS    XL8                                                              
PRQCDT   DS    CL8     13   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
PRQRUNH  DS    XL8                                                              
PRQRUN   DS    CL1     14   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
PRQNEEDH DS    XL8                                                              
PRQNEED  DS    CL1     15   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    16    2   18  A  P N             T        Y              
PRQFAX2H DS    XL8                                                              
PRQFAX2  DS    CL12    16   37   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    17    2   33  A  P N             T        Y              
PRQSCOSH DS    XL8                                                              
PRQSCOS  DS    CL1     17   37    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18    2    9  A  P N             T        Y              
PRQCOM1H DS    XL8                                                              
PRQCOM1  DS    CL50    18   20   50  A  U N             T        Y              
PRQCOM2H DS    XL8                                                              
PRQCOM2  DS    CL50    19   20   50  A  U N             T        Y              
PRQCOM3H DS    XL8                                                              
PRQCOM3  DS    CL50    20   20   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   20    1  A  U N             T        Y              
PRQLN1H  DS    XL8                                                              
PRQLN1   DS    CL30    22    2   30  A  P N             T        Y              
PRQLN2H  DS    XL8                                                              
PRQLN2   DS    CL30    23    2   30  A  P N             T        Y              
PRQLN3H  DS    XL8                                                              
PRQLN3   DS    CL70    24    2   70  A  P N             T        Y              
PRQLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
PRQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1112 BYTES                            
