*          DATA SET PPJOBFCD   AT LEVEL 007 AS OF 08/22/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40FFCD      DATE 08/22/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
JOBMOR1H DS    XL8                                                              
JOBMOR1  DS    CL2      7    2    2  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL9      7    6    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     7   28   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   45    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      7   50    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   61    7  A  P N             T        Y              
JOBLNM1H DS    XL8                                                              
JOBLNM1  DS    CL20     8    6   20  A  U N             T        Y              
JOBFNM1H DS    XL8                                                              
JOBFNM1  DS    CL15     8   28   15  A  U N             T        Y              
JOBTPY1H DS    XL8                                                              
JOBTPY1  DS    CL1      8   46    1  A  U N             T        Y              
JOBLPD1H DS    XL8                                                              
JOBLPD1  DS    CL8      8   50    8  A  U N             T        Y              
JOBEXD1H DS    XL8                                                              
JOBEXD1  DS    CL8      8   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   13    5  A  P N             T        Y              
JOBNT11H DS    XL8                                                              
JOBNT11  DS    CL50     9   19   50  A  U N             T        Y              
JOBNT12H DS    XL8                                                              
JOBNT12  DS    CL50    10   19   50  A  U N             T        Y              
JOBLNM2H DS    XL8                                                              
JOBLNM2  DS    CL20    11    6   20  A  U N             T        Y              
JOBFNM2H DS    XL8                                                              
JOBFNM2  DS    CL15    11   28   15  A  U N             T        Y              
JOBTPY2H DS    XL8                                                              
JOBTPY2  DS    CL1     11   46    1  A  U N             T        Y              
JOBLPD2H DS    XL8                                                              
JOBLPD2  DS    CL8     11   50    8  A  U N             T        Y              
JOBEXD2H DS    XL8                                                              
JOBEXD2  DS    CL8     11   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   13    5  A  P N             T        Y              
JOBNT21H DS    XL8                                                              
JOBNT21  DS    CL50    12   19   50  A  U N             T        Y              
JOBNT22H DS    XL8                                                              
JOBNT22  DS    CL50    13   19   50  A  U N             T        Y              
JOBLNM3H DS    XL8                                                              
JOBLNM3  DS    CL20    14    6   20  A  U N             T        Y              
JOBFNM3H DS    XL8                                                              
JOBFNM3  DS    CL15    14   28   15  A  U N             T        Y              
JOBTPY3H DS    XL8                                                              
JOBTPY3  DS    CL1     14   46    1  A  U N             T        Y              
JOBLPD3H DS    XL8                                                              
JOBLPD3  DS    CL8     14   50    8  A  U N             T        Y              
JOBEXD3H DS    XL8                                                              
JOBEXD3  DS    CL8     14   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   13    5  A  P N             T        Y              
JOBNT31H DS    XL8                                                              
JOBNT31  DS    CL50    15   19   50  A  U N             T        Y              
JOBNT32H DS    XL8                                                              
JOBNT32  DS    CL50    16   19   50  A  U N             T        Y              
JOBLNM4H DS    XL8                                                              
JOBLNM4  DS    CL20    17    6   20  A  U N             T        Y              
JOBFNM4H DS    XL8                                                              
JOBFNM4  DS    CL15    17   28   15  A  U N             T        Y              
JOBTPY4H DS    XL8                                                              
JOBTPY4  DS    CL1     17   46    1  A  U N             T        Y              
JOBLPD4H DS    XL8                                                              
JOBLPD4  DS    CL8     17   50    8  A  U N             T        Y              
JOBEXD4H DS    XL8                                                              
JOBEXD4  DS    CL8     17   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   13    5  A  P N             T        Y              
JOBNT41H DS    XL8                                                              
JOBNT41  DS    CL50    18   19   50  A  U N             T        Y              
JOBNT42H DS    XL8                                                              
JOBNT42  DS    CL50    19   19   50  A  U N             T        Y              
JOBLNM5H DS    XL8                                                              
JOBLNM5  DS    CL20    20    6   20  A  U N             T        Y              
JOBFNM5H DS    XL8                                                              
JOBFNM5  DS    CL15    20   28   15  A  U N             T        Y              
JOBTPY5H DS    XL8                                                              
JOBTPY5  DS    CL1     20   46    1  A  U N             T        Y              
JOBLPD5H DS    XL8                                                              
JOBLPD5  DS    CL8     20   50    8  A  U N             T        Y              
JOBEXD5H DS    XL8                                                              
JOBEXD5  DS    CL8     20   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   13    5  A  P N             T        Y              
JOBNT51H DS    XL8                                                              
JOBNT51  DS    CL50    21   19   50  A  U N             T        Y              
JOBNT52H DS    XL8                                                              
JOBNT52  DS    CL50    22   19   50  A  U N             T        Y              
JOBMORLH DS    XL8                                                              
JOBMORL  DS    CL2     23    2    2  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL58    23    5   58  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   65    6  L  P N             T        Y              
JOBSCRLH DS    XL8                                                              
JOBSCRL  DS    CL5     23   72    5  L  U N             T        Y  190         
JOBSCRLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    24    2   42  A  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
