*          DATA SET PPJOBFDD   AT LEVEL 007 AS OF 09/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40FFDD      DATE 09/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
JOBPUBH  DS    CL8                                                              
JOBPUB   DS    CL17     6   15   17  A  U N             T        Y              
JOBPUBNH DS    CL8                                                              
JOBPUBN  DS    CL20     6   41   20  A  P N             T        Y              
JOBPUBZH DS    CL8                                                              
JOBPUBZ  DS    CL20     7   41   20  A  P N             T        Y              
JOBINS1H DS    CL8                                                              
JOBINS1  DS    CL65     8   10   65  A  U N             T        N              
JOBINS2H DS    CL8                                                              
JOBINS2  DS    CL65     9   10   65  A  U N             T        N              
JOBINS3H DS    CL8                                                              
JOBINS3  DS    CL65    10   10   65  A  U N             T        N              
JOBINS4H DS    CL8                                                              
JOBINS4  DS    CL65    11   10   65  A  U N             T        N              
JOBINS5H DS    CL8                                                              
JOBINS5  DS    CL65    12   10   65  A  U N             T        N              
JOBINS6H DS    CL8                                                              
JOBINS6  DS    CL65    13   10   65  A  U N             T        N              
JOBINS7H DS    CL8                                                              
JOBINS7  DS    CL65    14   10   65  A  U N             T        N              
JOBINS8H DS    CL8                                                              
JOBINS8  DS    CL65    15   10   65  A  U N             T        N              
JOBINS9H DS    CL8                                                              
JOBINS9  DS    CL65    16   10   65  A  U N             T        N              
JOBINSAH DS    CL8                                                              
JOBINSA  DS    CL65    17   10   65  A  U N             T        N              
JOBINSBH DS    CL8                                                              
JOBINSB  DS    CL65    18   10   65  A  U N             T        N              
JOBINSCH DS    CL8                                                              
JOBINSC  DS    CL65    19   10   65  A  U N             T        N              
JOBINSDH DS    CL8                                                              
JOBINSD  DS    CL65    20   10   65  A  U N             T        N              
JOBINSEH DS    CL8                                                              
JOBINSE  DS    CL65    21   10   65  A  U N             T        N              
JOBINSFH DS    CL8                                                              
JOBINSF  DS    CL65    22   10   65  A  U N             T        N              
JOBINSLH DS    CL8                                                              
JOBINSL  DS    CL65    23   10   65  A  U N             T        N              
         DS    CL8                                                              
         DS    CL70    24    2   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   74    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
