*          DATA SET PPJOBFBD   AT LEVEL 001 AS OF 06/17/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40FFBD      DATE 06/17/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL13     7    2   13  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   18    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   18    7  A  P N             T        Y              
JOBCOD1H DS    XL8                                                              
JOBCOD1  DS    CL13     9    2   13  A  U N             T        Y              
JOBPCT1H DS    XL8                                                              
JOBPCT1  DS    CL7      9   18    7  A  U N             T        Y              
JOBCOD2H DS    XL8                                                              
JOBCOD2  DS    CL13    10    2   13  A  U N             T        Y              
JOBPCT2H DS    XL8                                                              
JOBPCT2  DS    CL7     10   18    7  A  U N             T        Y              
JOBCOD3H DS    XL8                                                              
JOBCOD3  DS    CL13    11    2   13  A  U N             T        Y              
JOBPCT3H DS    XL8                                                              
JOBPCT3  DS    CL7     11   18    7  A  U N             T        Y              
JOBCOD4H DS    XL8                                                              
JOBCOD4  DS    CL13    12    2   13  A  U N             T        Y              
JOBPCT4H DS    XL8                                                              
JOBPCT4  DS    CL7     12   18    7  A  U N             T        Y              
JOBCOD5H DS    XL8                                                              
JOBCOD5  DS    CL13    13    2   13  A  U N             T        Y              
JOBPCT5H DS    XL8                                                              
JOBPCT5  DS    CL7     13   18    7  A  U N             T        Y              
JOBCOD6H DS    XL8                                                              
JOBCOD6  DS    CL13    14    2   13  A  U N             T        Y              
JOBPCT6H DS    XL8                                                              
JOBPCT6  DS    CL7     14   18    7  A  U N             T        Y              
JOBCOD7H DS    XL8                                                              
JOBCOD7  DS    CL13    15    2   13  A  U N             T        Y              
JOBPCT7H DS    XL8                                                              
JOBPCT7  DS    CL7     15   18    7  A  U N             T        Y              
JOBCOD8H DS    XL8                                                              
JOBCOD8  DS    CL13    16    2   13  A  U N             T        Y              
JOBPCT8H DS    XL8                                                              
JOBPCT8  DS    CL7     16   18    7  A  U N             T        Y              
JOBCOD9H DS    XL8                                                              
JOBCOD9  DS    CL13    17    2   13  A  U N             T        Y              
JOBPCT9H DS    XL8                                                              
JOBPCT9  DS    CL7     17   18    7  A  U N             T        Y              
JOBCODAH DS    XL8                                                              
JOBCODA  DS    CL13    18    2   13  A  U N             T        Y              
JOBPCTAH DS    XL8                                                              
JOBPCTA  DS    CL7     18   18    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   74    1  A  P N             T        Y              
JOBLUPDH DS    XL8                                                              
JOBLUPD  DS    CL13    24    2   13  L  P N             T        Y              
JOBDTEUH DS    XL8                                                              
JOBDTEU  DS    CL8     24   16    8  A  P N             T        Y              
JOBPIDUH DS    XL8                                                              
JOBPIDU  DS    CL8     24   26    8  A  P N             T        Y              
JOBNAMUH DS    XL8                                                              
JOBNAMU  DS    CL40    24   36   40  A  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 552  BYTES                            
