*          DATA SET PPLFMF5D   AT LEVEL 003 AS OF 09/19/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F5D      DATE 09/19/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     9    2   12  A   P    N         T        Y              
ESTPRD1H DS    CL8                                                              
ESTPRD1  DS    CL3      9   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   23    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   29    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   35    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   41    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   47    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   53    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   59    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   65    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   71    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   77    1  A   U    N         T        Y              
ESTDSPH  DS    CL8                                                              
ESTDSP   DS    CL80    10    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    11    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    12    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    13    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    14    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    15    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    16    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    17    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    18    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    19    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    20    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    21    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    22    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    23    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    24    1   80  A   P    N         T        Y              
ESTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1464 BYTES                            
