*          DATA SET PPLFMF6D   AT LEVEL 002 AS OF 01/04/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F6D      DATE 01/04/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL29    11    7   29   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL29    11   44   29   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL29    12    7   29   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL29    12   44   29   A    P    N         T         Y           
SHRF1H   DS    CL8                                                              
SHRF1    DS    CL25    14    2   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   29    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    14   40   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   67    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    15    2   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15   29    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    15   40   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15   67    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    16    2   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     16   29    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    16   40   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     16   67    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    17    2   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     17   29    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    17   40   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     17   67    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    18    2   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     18   29    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    18   40   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     18   67    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    19    2   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     19   29    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    19   40   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     19   67    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    20    2   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20   29    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL25    20   40   25   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20   67    7   A    U    N         T         Y           
SHRTABH  DS    CL8                                                              
SHRTAB   DS    CL1     21    2    1   A    P    N         T         Y           
SHRTOTH  DS    CL8                                                              
SHRTOT   DS    CL13    22    2   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     22   16    9   A    P    N         T         Y           
SHRLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SHRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 870  BYTES                            
