*          DATA SET PPLFMF3D   AT LEVEL 006 AS OF 12/22/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F3D      DATE 12/22/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL20    10    2   20  A  P N             T        Y              
ESTESTNH DS    XL8                                                              
ESTESTN  DS    CL20    10   23   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   49   11  A  P N             T        Y              
ESTBREPH DS    XL8                                                              
ESTBREP  DS    CL5     10   61    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11    2   20  A  P N             T        Y              
ESTNAM2H DS    XL8                                                              
ESTNAM2  DS    CL20    11   23   20  A  U N             T        Y              
ESTBRPNH DS    XL8                                                              
ESTBRPN  DS    CL30    11   49   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19    12    2   19  A  P N             T        Y              
ESTSTH   DS    XL8                                                              
ESTST    DS    CL9     12   23    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   49   17  A  P N             T        Y              
ESTENDH  DS    XL8                                                              
ESTEND   DS    CL9     12   67    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
ESTPROFH DS    XL8                                                              
ESTPROF  DS    CL32    13   23   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    14   23   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    15   23   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
ESTFLTRH DS    XL8                                                              
ESTFLTR  DS    CL3     17   23    3  A  U N             T        N              
         DS    XL8                                                              
         DS    CL13    17   31   13  A  P N             T        Y              
ESTRSCHH DS    XL8                                                              
ESTRSCH  DS    CL3     17   49    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   55    9  A  P N             T        Y              
ESTRTYPH DS    XL8                                                              
ESTRTYP  DS    CL2     17   67    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
ESTSTATH DS    XL8                                                              
ESTSTAT  DS    CL5     18   23    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL37    18   31   37  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     19    2    9  A  P N             T        Y              
ESTADH   DS    XL8                                                              
ESTAD    DS    CL6     19   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   31   17  A  P N             T        Y              
ESTCOMH  DS    XL8                                                              
ESTCOM   DS    CL13    19   49   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20    2   15  A  P N             T        Y              
ESTREVH  DS    XL8                                                              
ESTREV   DS    CL3     20   23    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   31   11  A  P N             T        Y              
ESTREPH  DS    XL8                                                              
ESTREP   DS    CL5     20   43    5  A  U N             T        Y              
ESTREPNH DS    XL8                                                              
ESTREPN  DS    CL30    20   49   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    2   11  A  P N             T        Y              
ESTALLOH DS    XL8                                                              
ESTALLO  DS    CL47    21   23   47  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    22    2   16  A  P N             T        Y              
ESTOPTSH DS    XL8                                                              
ESTOPTS  DS    CL55    22   23   55  A  U N             T        Y              
ESTDEF1H DS    XL8                                                              
ESTDEF1  DS    CL20    23    2   20  A  P N             T        Y              
ESTDSC1H DS    XL8                                                              
ESTDSC1  DS    CL32    23   23   32  A  P N             T        Y              
ESTDEF2H DS    XL8                                                              
ESTDEF2  DS    CL20    24    2   20  A  P N             T        Y              
ESTDSC2H DS    XL8                                                              
ESTDSC2  DS    CL16    24   23   16  A  P N             T        Y              
ESTLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1040 BYTES                            
