*          DATA SET PPLFMFFD   AT LEVEL 009 AS OF 10/07/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404FFD      DATE 10/07/97                 
         SPACE 1                                                                
T404FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
HDRMSGH  DS    CL8                                                              
HDRMSG   DS    CL60     1    2   60  A  P N             T        Y              
HDRSRVH  DS    CL8                                                              
HDRSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  A  P N             T        Y              
HDRRECH  DS    CL8                                                              
HDRREC   DS    CL8      3    9    8  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      3   27    6  A  P N             T        Y              
HDRACTH  DS    CL8                                                              
HDRACT   DS    CL7      3   34    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      5    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   10    5  A  P N             T        Y              
HDRMEDH  DS    CL8                                                              
HDRMED   DS    CL1      5   19    1  A  U N             T        Y              
HDRMEDNH DS    CL8                                                              
HDRMEDN  DS    CL10     5   26   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   10    6  A  P N             T        Y              
HDRCLTH  DS    CL8                                                              
HDRCLT   DS    CL3      6   19    3  A  U N             T        Y              
HDRCLTNH DS    CL8                                                              
HDRCLTN  DS    CL20     6   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   10    7  A  P N             T        Y              
HDRPRDH  DS    CL8                                                              
HDRPRD   DS    CL3      7   19    3  A  U N             T        Y              
HDRPRDNH DS    CL8                                                              
HDRPRDN  DS    CL50     7   26   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   10    8  A  P N             T        Y              
HDRESTH  DS    CL8                                                              
HDREST   DS    CL4      8   19    4  A  U N             T        Y              
HDRESTNH DS    CL8                                                              
HDRESTN  DS    CL20     8   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   57    1  A  U N             T        Y              
HDRLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
HDRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 472  BYTES                            
