*          DATA SET PPLFMF4D   AT LEVEL 002 AS OF 07/12/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F4D      DATE 07/12/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL18    11    2   18  A  P N             T        Y              
BSCBASAH DS    XL8                                                              
BSCBASA  DS    CL5     11   27    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    11   39   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   16    8  A  P N             T        Y              
BSCADJH  DS    XL8                                                              
BSCADJ   DS    CL9     12   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   16    2  A  P N             T        Y              
BSCBASBH DS    XL8                                                              
BSCBASB  DS    CL5     13   27    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   39   17  A  P N             T        Y              
BSCPADJH DS    XL8                                                              
BSCPADJ  DS    CL9     13   58    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   68    7  A  P N             T        Y              
BSCPBASH DS    XL8                                                              
BSCPBAS  DS    CL5     13   76    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   16    8  A  P N             T        Y              
BSCADATH DS    XL8                                                              
BSCADAT  DS    CL6     14   27    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   39   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    16    2   24  A  P N             T        Y              
BSCDETSH DS    XL8                                                              
BSCDETS  DS    CL1     16   27    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    16   39   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22    18    2   22  A  P N             T        Y              
BSCCOM1H DS    XL8                                                              
BSCCOM1  DS    CL6     18   27    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   35    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   39   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   62    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   68   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   27    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   35    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   62    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   27    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   35    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   62    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    21    1   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22    21   34   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   77    1  A  U N             T        Y              
BSCLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BSCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 592  BYTES                            
