*          DATA SET PPLFMF8D   AT LEVEL 003 AS OF 01/23/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F8D      DATE 01/23/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL19    10    2   19  A  P N             T        Y              
GFEDBCH  DS    XL8                                                              
GFEDBC   DS    CL2     10   22    2  A  U N             T        Y   10         
GFEDBCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
GFEPRCH  DS    XL8                                                              
GFEPRC   DS    CL4     11   22    4  A  U N             T        Y   20         
GFEPRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
GFEGFNH  DS    XL8                                                              
GFEGFN   DS    CL3     12   22    3  A  U N             T        Y   30         
GFEGFNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
GFEGFSH  DS    XL8                                                              
GFEGFS   DS    CL3     13   22    3  A  U N             T        Y   40         
GFEGFSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    14    2   18  A  P N             T        Y              
GFEBAGH  DS    XL8                                                              
GFEBAG   DS    CL8     14   22    8  A  U N             T        Y   50         
GFEBAGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    15    2   18  A  P N             T        Y              
GFEXPTH  DS    XL8                                                              
GFEXPT   DS    CL6     15   22    6  A  U N             T        Y   60         
GFEXPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    16    2   19  A  P N             T        Y              
GFEPIDH  DS    XL8                                                              
GFEPID   DS    CL10    16   22   10  A  U N             T        Y   70         
GFEPIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    17    2   18  A  P N             T        Y              
GFECAGH  DS    XL8                                                              
GFECAG   DS    CL8     17   22    8  A  U N             T        Y   80         
GFECAGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    18    2   18  A  P N             T        Y              
GFESAGH  DS    XL8                                                              
GFESAG   DS    CL8     18   22    8  A  U N             T        Y   90         
GFESAGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    19    2   18  A  P N             T        Y              
GFETMKH  DS    XL8                                                              
GFETMK   DS    CL1     19   22    1  A  U N             T        Y  100         
GFETMKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    20    2   19  A  P N             T        Y              
GFEDGVH  DS    XL8                                                              
GFEDGV   DS    CL10    20   22   10  A  U N             T        Y  110         
GFEDGVX  DS    XL8                                                              
GFETAGH  DS    XL8                                                              
GFETAG   DS    CL1     22   22    1  A  U N             T        Y              
GFELAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
GFEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 528  BYTES                            
