*          DATA SET PPLFMF1DS  AT LEVEL 035 AS OF 02/23/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F1D      DATE 02/23/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
CLTCLTNH DS    CL8                                                              
CLTCLTN  DS    CL20    10   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    11    2   17  A  P N             T        Y              
CLTBRNH  DS    CL8                                                              
CLTBRN   DS    CL20    11   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
CLTAL1H  DS    CL8                                                              
CLTAL1   DS    CL30    12   20   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
CLTAL2H  DS    CL8                                                              
CLTAL2   DS    CL30    13   20   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
CLTATTNH DS    CL8                                                              
CLTATTN  DS    CL24    14   20   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
CLTOFFH  DS    CL8                                                              
CLTOFF   DS    CL1     15   20    1  A  U N             T        Y              
CLTOFFXH DS    CL8                                                              
CLTOFFX  DS    CL2     15   23    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   37   15  A  P N             T        Y              
CLTAOFFH DS    CL8                                                              
CLTAOFF  DS    CL5     15   54    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
CLTNUMH  DS    CL8                                                              
CLTNUM   DS    CL5     16   20    5  A  U N             T        Y              
CLTGSTAH DS    CL8                                                              
CLTGSTA  DS    CL10    16   40   10  A  P N             T        Y              
CLTGSTH  DS    CL8                                                              
CLTGST   DS    CL1     16   52    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    17    2   14  A  P N             T        Y              
CLTPROFH DS    CL8                                                              
CLTPROF  DS    CL32    17   20   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   20   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   20   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    20    2   16  A  P N             T        Y              
CLTCSCH  DS    CL8                                                              
CLTCSC   DS    CL7     20   20    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21    2   11  A  P N             T        Y              
CLTISCH  DS    CL8                                                              
CLTISC   DS    CL7     21   20    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   40   11  A  P N             T        Y              
CLTISC2H DS    CL8                                                              
CLTISC2  DS    CL7     21   53    7  A  U N             T        Y              
CLTFINLH DS    CL8                                                              
CLTFINL  DS    CL9     22    2    9  A  P N             T        Y              
CLTFINH  DS    CL8                                                              
CLTFIN   DS    CL1     22   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    22   40   19  A  P N             T        Y              
CLTDRDH  DS    CL8                                                              
CLTDRD   DS    CL3     22   61    3  A  U N             T        Y              
CLTBILGH DS    CL8                                                              
CLTBILG  DS    CL13    23    2   13  A  P N             T        Y              
CLTBILH  DS    CL8                                                              
CLTBIL   DS    CL1     23   20    1  A  U N             T        Y              
CLTPSTAH DS    CL8                                                              
CLTPSTA  DS    CL3     23   25    3  A  P N             T        Y              
CLTPSTH  DS    CL8                                                              
CLTPST   DS    CL49    23   29   49  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    24    2   14  A  P N             T        Y              
CLTOPTSH DS    CL8                                                              
CLTOPTS  DS    CL38    24   20   38  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   59    1  A  P N             T        Y              
CLTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
CLTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 904  BYTES                            
