*          DATA SET PPLFMFAD   AT LEVEL 002 AS OF 12/17/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404FAD      DATE 12/17/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
CLAAORH  DS    XL8                                                              
CLAAOR   DS    CL2     10   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   35    3  A  P N             T        Y              
CLAADVH  DS    XL8                                                              
CLAADV   DS    CL3     10   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   50   12  A  P N             T        Y              
CLAADVCH DS    XL8                                                              
CLAADVC  DS    CL3     10   64    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
CLADATEH DS    XL8                                                              
CLADATE  DS    CL20    11   26   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12    2   17  A  P N             T        Y              
CLAAORSH DS    XL8                                                              
CLAAORS  DS    CL2     12   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   31   10  A  P N             T        Y              
CLAASE2H DS    XL8                                                              
CLAASE2  DS    CL2     12   45    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   40    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   40    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    16    2   17  A  P N             T        Y              
CLAPLRH  DS    XL8                                                              
CLAPLR   DS    CL1     16   35    1  A  U N             T        Y              
CLAPLR2H DS    XL8                                                              
CLAPLR2  DS    CL1     16   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28    17    2   28  A  P N             T        Y              
CLACRLCH DS    XL8                                                              
CLACRLC  DS    CL1     17   35    1  A  U N             T        Y              
CLACRL2H DS    XL8                                                              
CLACRL2  DS    CL1     17   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL29    18    2   29  A  P N             T        Y              
CLACLLCH DS    XL8                                                              
CLACLLC  DS    CL1     18   35    1  A  U N             T        Y              
CLACLL2H DS    XL8                                                              
CLACLL2  DS    CL1     18   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28    19    2   28  A  P N             T        Y              
CLACRLBH DS    XL8                                                              
CLACRLB  DS    CL1     19   35    1  A  U N             T        Y              
CLACLB2H DS    XL8                                                              
CLACLB2  DS    CL1     19   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21    20    2   21  A  P N             T        Y              
CLAASCH  DS    XL8                                                              
CLAASC   DS    CL1     20   35    1  A  U N             T        Y              
CLAASC2H DS    XL8                                                              
CLAASC2  DS    CL1     20   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    21    2   14  A  P N             T        Y              
CLANACH  DS    XL8                                                              
CLANAC   DS    CL1     21   35    1  A  U N             T        Y              
CLANAC2H DS    XL8                                                              
CLANAC2  DS    CL1     21   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19    22    2   19  A  P N             T        Y              
CLAACLH  DS    XL8                                                              
CLAACL   DS    CL1     22   35    1  A  U N             T        Y              
CLAACL2H DS    XL8                                                              
CLAACL2  DS    CL1     22   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    23    2   23  A  P N             T        Y              
CLAAIDH  DS    XL8                                                              
CLAAID   DS    CL1     23   35    1  A  U N             T        Y              
CLAAID2H DS    XL8                                                              
CLAAID2  DS    CL1     23   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    24    2   24  A  P N             T        Y              
CLAACAH  DS    XL8                                                              
CLAACA   DS    CL1     24   35    1  A  U N             T        Y              
CLAACA2H DS    XL8                                                              
CLAACA2  DS    CL1     24   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   60    1  A  U N             T        Y              
CLALAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CLAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 720  BYTES                            
