*          DATA SET PPLFMF7D   AT LEVEL 005 AS OF 03/29/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F7D      DATE 03/29/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL13    11    2   13  A  P N             T        Y              
PGECHRH  DS    XL8                                                              
PGECHR   DS    CL3     11   17    3  A  U N             T        Y   10         
PGECHRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
PGEACCH  DS    XL8                                                              
PGEACC   DS    CL6     12   17    6  A  U N             T        Y   20         
PGEACCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
PGEBRNH  DS    XL8                                                              
PGEBRN   DS    CL4     13   17    4  A  U N             T        Y   30         
PGEBRNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
PGEESTH  DS    XL8                                                              
PGEEST   DS    CL4     14   17    4  A  U N             T        Y   40         
PGEESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
PGEEVTH  DS    XL8                                                              
PGEEVT   DS    CL6     15   17    6  A  U N             T        Y   50         
PGEEVTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16    2   11  A  P N             T        Y              
PGEMBFH  DS    XL8                                                              
PGEMBF   DS    CL1     16   17    1  A  U N             T        Y   60         
PGEMBFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
PGENOBH  DS    XL8                                                              
PGENOB   DS    CL1     17   17    1  A  U N             T        Y   70         
PGENOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
PGEBRSH  DS    XL8                                                              
PGEBRS   DS    CL2     18   17    2  A  U N             T        Y   80         
PGEBRSX  DS    XL8                                                              
PGETAGH  DS    XL8                                                              
PGETAG   DS    CL1     20   17    1  A  U N             T        Y              
PGELAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PGEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 312  BYTES                            
