*          DATA SET PPLFMF1D   AT LEVEL 002 AS OF 03/21/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F1D      DATE 03/21/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
CLTCLTNH DS    XL8                                                              
CLTCLTN  DS    CL20    10   20   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11    2   17  A  P N             T        Y              
CLTBRNH  DS    XL8                                                              
CLTBRN   DS    CL20    11   20   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
CLTAL1H  DS    XL8                                                              
CLTAL1   DS    CL30    12   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
CLTAL2H  DS    XL8                                                              
CLTAL2   DS    CL30    13   20   30  A  U N             T        Y              
CLTPASNH DS    XL8                                                              
CLTPASN  DS    CL20    13   54   20  A  P N             T        Y              
CLTPASDH DS    XL8                                                              
CLTPASD  DS    CL1     13   76    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
CLTATTNH DS    XL8                                                              
CLTATTN  DS    CL24    14   20   24  A  U N             T        Y              
CLTTONMH DS    XL8                                                              
CLTTONM  DS    CL19    14   54   19  A  P N             T        Y              
CLTTOFFH DS    XL8                                                              
CLTTOFF  DS    CL1     14   76    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
CLTOFFH  DS    XL8                                                              
CLTOFF   DS    CL1     15   20    1  A  U N             T        Y              
CLTOFFXH DS    XL8                                                              
CLTOFFX  DS    CL2     15   23    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   29   15  A  P N             T        Y              
CLTAOFFH DS    XL8                                                              
CLTAOFF  DS    CL5     15   46    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    15   54   16  A  P N             T        Y              
CLTNUMH  DS    XL8                                                              
CLTNUM   DS    CL5     15   73    5  A  U N             T        Y              
CLTGSTAH DS    XL8                                                              
CLTGSTA  DS    CL8     16    2    8  A  P N             T        Y              
CLTGSTH  DS    XL8                                                              
CLTGST   DS    CL1     16   20    1  A  U N             T        Y              
CLTPSTAH DS    XL8                                                              
CLTPSTA  DS    CL3     16   25    3  A  P N             T        Y              
CLTPSTH  DS    XL8                                                              
CLTPST   DS    CL49    16   29   49  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    17    2   14  A  P N             T        Y              
CLTPROFH DS    XL8                                                              
CLTPROF  DS    CL32    17   20   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    18   20   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    19   20   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    20    2   16  A  P N             T        Y              
CLTCSCH  DS    XL8                                                              
CLTCSC   DS    CL7     20   20    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   32   11  A  P N             T        Y              
CLTISCH  DS    XL8                                                              
CLTISC   DS    CL7     20   45    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   56   11  A  P N             T        Y              
CLTISC2H DS    XL8                                                              
CLTISC2  DS    CL7     20   69    7  A  U N             T        Y              
CLTBILGH DS    XL8                                                              
CLTBILG  DS    CL13    21    2   13  A  P N             T        Y              
CLTBILH  DS    XL8                                                              
CLTBIL   DS    CL1     21   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    21   24   19  A  P N             T        Y              
CLTDRDH  DS    XL8                                                              
CLTDRD   DS    CL3     21   45    3  A  U N             T        Y              
CLTFINLH DS    XL8                                                              
CLTFINL  DS    CL9     21   58    9  A  P N             T        Y              
CLTFINH  DS    XL8                                                              
CLTFIN   DS    CL1     21   69    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    22    2   14  A  P N             T        Y              
CLTOPTSH DS    XL8                                                              
CLTOPTS  DS    CL58    22   20   58  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   79    1  A  P N             T        Y              
CLTLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CLTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1000 BYTES                            
