*          DATA SET PPLFMF2D   AT LEVEL 021 AS OF 10/29/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T404F2D      DATE 10/29/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PRDFRSTH DS    XL8                                                              
PRDFRST  DS    CL12    10    2   12  A  P N             T        Y              
PRDPRDNH DS    XL8                                                              
PRDPRDN  DS    CL20    10   28   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   50    8  A  P N             T        Y              
PRDNOTRH DS    XL8                                                              
PRDNOTR  DS    CL1     10   63    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11    2   17  A  P N             T        Y              
PRDBRNH  DS    XL8                                                              
PRDBRN   DS    CL20    11   28   20  A  U N             T        Y              
PRDGSTAH DS    XL8                                                              
PRDGSTA  DS    CL8     11   50    8  A  P N             T        Y              
PRDGSTH  DS    XL8                                                              
PRDGST   DS    CL1     11   63    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    12    2   25  A  P N             T        Y              
PRDBRN2H DS    XL8                                                              
PRDBRN2  DS    CL20    12   28   20  A  U N             T        Y              
PRDLWTH  DS    XL8                                                              
PRDLWT   DS    CL11    12   50   11  A  P N             T        Y              
PRDLWROH DS    XL8                                                              
PRDLWRO  DS    CL11    12   63   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
PRDAL1H  DS    XL8                                                              
PRDAL1   DS    CL30    13   28   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
PRDAL2H  DS    XL8                                                              
PRDAL2   DS    CL30    14   28   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
PRDATTNH DS    XL8                                                              
PRDATTN  DS    CL24    15   28   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   56   15  A  P N             T        Y              
PRDAOCDH DS    XL8                                                              
PRDAOCD  DS    CL5     15   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    16    2   14  A  P N             T        Y              
PRDACCTH DS    XL8                                                              
PRDACCT  DS    CL5     16   28    5  A  U N             T        Y              
PRDOFFTH DS    XL8                                                              
PRDOFFT  DS    CL6     16   39    6  A  P N             T        Y              
PRDOFFH  DS    XL8                                                              
PRDOFF   DS    CL1     16   46    1  A  P N             T        Y              
PRDOFFXH DS    XL8                                                              
PRDOFFX  DS    CL2     16   48    2  A  P N             T        Y              
PRDTRATH DS    XL8                                                              
PRDTRAT  DS    CL7     16   56    7  A  P N             T        Y              
PRDTRAH  DS    XL8                                                              
PRDTRA   DS    CL1     16   64    1  A  P N             T        Y              
PRDTRAXH DS    XL8                                                              
PRDTRAX  DS    CL2     16   66    2  A  P N             T        Y              
PRDDIVAH DS    XL8                                                              
PRDDIVA  DS    CL15    17    2   15  A  P N             T        Y              
PRDDIVH  DS    XL8                                                              
PRDDIV   DS    CL3     17   28    3  N  U N             T        Y              
PRDDIVNH DS    XL8                                                              
PRDDIVN  DS    CL20    17   34   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   56   14  A  P N             T        Y              
PRDINFCH DS    XL8                                                              
PRDINFC  DS    CL5     17   72    5  A  U N             T        Y              
PRDOADH  DS    XL8                                                              
PRDOAD   DS    CL17    18    2   17  A  P N             T        Y              
PRDOANH  DS    XL8                                                              
PRDOAN   DS    CL2     18   28    2  A  U N             T        Y              
PRDOANNH DS    XL8                                                              
PRDOANN  DS    CL33    18   34   33  A  P N             T        Y              
PRDDEF1H DS    XL8                                                              
PRDDEF1  DS    CL20    19    2   20  A  P N             T        Y              
PRDDSC1H DS    XL8                                                              
PRDDSC1  DS    CL32    19   28   32  A  P N             T        Y              
PRDDEF2H DS    XL8                                                              
PRDDEF2  DS    CL20    20    2   20  A  P N             T        Y              
PRDDSC2H DS    XL8                                                              
PRDDSC2  DS    CL16    20   28   16  A  P N             T        Y              
PRDPSTAH DS    XL8                                                              
PRDPSTA  DS    CL3     21    2    3  A  P N             T        Y              
PRDPSTH  DS    XL8                                                              
PRDPST   DS    CL50    21   28   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22    2   15  A  P N             T        Y              
PRDADJSH DS    XL8                                                              
PRDADJS  DS    CL4     22   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    23    2   15  A  P N             T        Y              
PRDEXCLH DS    XL8                                                              
PRDEXCL  DS    CL9     23   28    9  A  U N             T        Y              
PRDENDXH DS    XL8                                                              
PRDENDX  DS    CL38    23   39   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   79    1  A  U N             T        Y              
PRDLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1056 BYTES                            
