*          DATA SET PPMATEBD   AT LEVEL 025 AS OF 11/12/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T402EBD      DATE 11/12/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CK1COLSH DS    CL8                                                              
CK1COLS  DS    CL51    10    2   51  A  P H             T        Y              
CK1GROSH DS    CL8                                                              
CK1GROS  DS    CL11    10   54   11  A  P H             T        Y              
CK1NETH  DS    CL8                                                              
CK1NET   DS    CL11    10   66   11  A  P H             T        Y              
CK1ESTMH DS    CL8                                                              
CK1ESTM  DS    CL3     10   78    3  A  P H             T        Y              
CK1SEL1H DS    CL8                                                              
CK1SEL1  DS    CL2     11    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    5    1  A  P N             T        Y              
CK1DTE1H DS    CL8                                                              
CK1DTE1  DS    CL8     11    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   78    3  A  U N             T        Y              
CK1SEL2H DS    CL8                                                              
CK1SEL2  DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   78    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   78    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   78    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   78    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   78    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   78    3  A  U N             T        Y              
CK1SEL9H DS    CL8                                                              
CK1SEL9  DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   78    3  A  U N             T        Y              
CK1ITEMH DS    CL8                                                              
CK1ITEM  DS    CL79    19    2   79  A  P H             T        Y              
CK1SEL0H DS    CL8                                                              
CK1SEL0  DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   78    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   78    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   78    3  A  U N             T        Y              
CK1LSTLH DS    CL8                                                              
CK1LSTL  DS    CL2     23    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   25   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   48    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   78    3  A  U N             T        Y              
CK1PFLNH DS    CL8                                                              
CK1PFLN  DS    CL79    24    2   79  A  P H             T        Y              
CK1LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CK1WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2088 BYTES                            
