*          DATA SET PPMATCCD   AT LEVEL 022 AS OF 06/11/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T402CCD      DATE 06/11/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13    10    6   13  A   P    N         T        Y              
TOTITOTH DS    CL8                                                              
TOTITOT  DS    CL15    10   20   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    10   40   16  A   P    N         T        Y              
TOTDTOTH DS    CL8                                                              
TOTDTOT  DS    CL15    10   57   15  A   P    N         T        Y              
TOTDNUMH DS    CL8                                                              
TOTDNUM  DS    CL3     11   46    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   23   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   39    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   53    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   12    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   24    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   39    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   53    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13    14   64   13  A   P    N         T        Y              
TOTMNUMH DS    CL8                                                              
TOTMNUM  DS    CL3     15   14    3  A   P    N         T        Y              
TOTCNUMH DS    CL8                                                              
TOTCNUM  DS    CL3     15   26    3  A   P    N         T        Y              
TOTONUMH DS    CL8                                                              
TOTONUM  DS    CL3     15   41    3  A   P    N         T        Y              
TOTRNUMH DS    CL8                                                              
TOTRNUM  DS    CL3     15   55    3  A   P    N         T        Y              
TOTTNUMH DS    CL8                                                              
TOTTNUM  DS    CL3     15   68    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    16    2   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35    16   42   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    3    1  A   P    N         T        Y              
TOTGMATH DS    CL8                                                              
TOTGMAT  DS    CL13    17    8   13  A   P    N         T        Y              
TOTGDISH DS    CL8                                                              
TOTGDIS  DS    CL13    17   22   13  A   P    N         T        Y              
TOTGORDH DS    CL8                                                              
TOTGORD  DS    CL13    17   36   13  A   P    N         T        Y              
TOTGNOTH DS    CL8                                                              
TOTGNOT  DS    CL13    17   50   13  A   P    N         T        Y              
TOTGTOTH DS    CL8                                                              
TOTGTOT  DS    CL13    17   64   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    3    1  A   P    N         T        Y              
TOTNMATH DS    CL8                                                              
TOTNMAT  DS    CL13    18    8   13  A   P    N         T        Y              
TOTNDISH DS    CL8                                                              
TOTNDIS  DS    CL13    18   22   13  A   P    N         T        Y              
TOTNORDH DS    CL8                                                              
TOTNORD  DS    CL13    18   36   13  A   P    N         T        Y              
TOTNNOTH DS    CL8                                                              
TOTNNOT  DS    CL13    18   50   13  A   P    N         T        Y              
TOTNTOTH DS    CL8                                                              
TOTNTOT  DS    CL13    18   64   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19    3    4  A   P    N         T        Y              
TOTBMATH DS    CL8                                                              
TOTBMAT  DS    CL13    19    8   13  A   P    N         T        Y              
TOTBDISH DS    CL8                                                              
TOTBDIS  DS    CL13    19   22   13  A   P    N         T        Y              
TOTBORDH DS    CL8                                                              
TOTBORD  DS    CL13    19   36   13  A   P    N         T        Y              
TOTBNOTH DS    CL8                                                              
TOTBNOT  DS    CL13    19   50   13  A   P    N         T        Y              
TOTBTOTH DS    CL8                                                              
TOTBTOT  DS    CL13    19   64   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20    3    4  A   P    N         T        Y              
TOTAMATH DS    CL8                                                              
TOTAMAT  DS    CL13    20    8   13  A   P    N         T        Y              
TOTADISH DS    CL8                                                              
TOTADIS  DS    CL13    20   22   13  A   P    N         T        Y              
TOTAORDH DS    CL8                                                              
TOTAORD  DS    CL13    20   36   13  A   P    N         T        Y              
TOTANOTH DS    CL8                                                              
TOTANOT  DS    CL13    20   50   13  A   P    N         T        Y              
TOTATOTH DS    CL8                                                              
TOTATOT  DS    CL13    20   64   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21    3    2  A   P    N         T        Y              
TOTCMATH DS    CL8                                                              
TOTCMAT  DS    CL13    21    8   13  A   P    N         T        Y              
TOTCDISH DS    CL8                                                              
TOTCDIS  DS    CL13    21   22   13  A   P    N         T        Y              
TOTCORDH DS    CL8                                                              
TOTCORD  DS    CL13    21   36   13  A   P    N         T        Y              
TOTCNOTH DS    CL8                                                              
TOTCNOT  DS    CL13    21   50   13  A   P    N         T        Y              
TOTCTOTH DS    CL8                                                              
TOTCTOT  DS    CL13    21   64   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    3    3  A   P    N         T        Y              
TOTTMATH DS    CL8                                                              
TOTTMAT  DS    CL13    22    8   13  A   P    N         T        Y              
TOTTDISH DS    CL8                                                              
TOTTDIS  DS    CL13    22   22   13  A   P    N         T        Y              
TOTTORDH DS    CL8                                                              
TOTTORD  DS    CL13    22   36   13  A   P    N         T        Y              
TOTTNOTH DS    CL8                                                              
TOTTNOT  DS    CL13    22   50   13  A   P    N         T        Y              
TOTTTOTH DS    CL8                                                              
TOTTTOT  DS    CL13    22   64   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    3    3  A   P    N         T        Y              
TOTSMATH DS    CL8                                                              
TOTSMAT  DS    CL13    23    8   13  A   P    N         T        Y              
TOTSDISH DS    CL8                                                              
TOTSDIS  DS    CL13    23   22   13  A   P    N         T        Y              
TOTSORDH DS    CL8                                                              
TOTSORD  DS    CL13    23   36   13  A   P    N         T        Y              
TOTSNOTH DS    CL8                                                              
TOTSNOT  DS    CL13    23   50   13  A   P    N         T        Y              
TOTSTOTH DS    CL8                                                              
TOTSTOT  DS    CL13    23   64   13  A   P    N         T        Y              
TOTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TOTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1192 BYTES                            
