*          DATA SET PPMATDBD   AT LEVEL 031 AS OF 11/14/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T402DBD      DATE 11/14/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CK2COLSH DS    CL8                                                              
CK2COLS  DS    CL40    10    2   40  A  P H             T        Y              
CK2GROSH DS    CL8                                                              
CK2GROS  DS    CL11    10   43   11  A  P H             T        Y              
CK2NETH  DS    CL8                                                              
CK2NET   DS    CL11    10   56   11  A  P H             T        Y              
CK2ESTMH DS    CL8                                                              
CK2ESTM  DS    CL3     10   69    3  A  P H             T        Y              
CK2SEL1H DS    CL8                                                              
CK2SEL1  DS    CL2     11    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    5    1  A  P N             T        Y              
CK2DTE1H DS    CL8                                                              
CK2DTE1  DS    CL8     11    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    11   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   69    3  A  U N             T        Y              
CK2SEL2H DS    CL8                                                              
CK2SEL2  DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    12   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   69    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    13   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   69    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   69    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    15   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   69    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   69    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    17   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   69    3  A  U N             T        Y              
CK2SEL9H DS    CL8                                                              
CK2SEL9  DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   69    3  A  P N             T        Y              
CK2ITEMH DS    CL8                                                              
CK2ITEM  DS    CL79    19    2   79  A  P H             T        Y              
CK2SEL0H DS    CL8                                                              
CK2SEL0  DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    20   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   69    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    21   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   69    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    22   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   69    3  A  U N             T        Y              
CK2LSTLH DS    CL8                                                              
CK2LSTL  DS    CL2     23    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    5    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    23   17   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   36    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   43   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   69    3  A  U N             T        Y              
CK2PFLNH DS    CL8                                                              
CK2PFLN  DS    CL79    24    2   79  A  P H             T        Y              
CK2LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CK2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
