*          DATA SET PPMATFBD   AT LEVEL 052 AS OF 08/29/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T402FBD      DATE 08/29/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CHKMEDH  DS    CL8                                                              
CHKMED   DS    CL1      5    8    1  A  U N             T        Y              
CHKCLTH  DS    CL8                                                              
CHKCLT   DS    CL3      5   10    3  A  U H             T        Y              
CHKCLXPH DS    CL8                                                              
CHKCLXP  DS    CL20     5   14   20  A  P N             T        Y              
CHKPRDH  DS    CL8                                                              
CHKPRD   DS    CL3      5   35    3  A  U H             T        Y              
CHKPDXPH DS    CL8                                                              
CHKPDXP  DS    CL20     5   39   20  A  P N             T        Y              
CHKESTMH DS    CL8                                                              
CHKESTM  DS    CL3      5   60    3  A  U H             T        Y              
CHKESXPH DS    CL8                                                              
CHKESXP  DS    CL17     5   64   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
CHKPERH  DS    CL8                                                              
CHKPER   DS    CL17     6    7   17  A  U N             T        Y              
CHKPUBH  DS    CL8                                                              
CHKPUB   DS    CL17     6   25   17  A  U H             T        Y              
CHKPBXPH DS    CL8                                                              
CHKPBXP  DS    CL19     6   43   19  A  P N             T        Y              
CHKYEARH DS    CL8                                                              
CHKYEAR  DS    CL1      6   63    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      6   65    4  A  P H             T        Y              
CHKINVNH DS    CL8                                                              
CHKINVN  DS    CL11     6   70   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
CHKBGRSH DS    CL8                                                              
CHKBGRS  DS    CL13     7    8   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   22    5  A  P H             T        Y              
CHKDGRSH DS    CL8                                                              
CHKDGRS  DS    CL14     7   28   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   43    4  A  P H             T        Y              
CHKREPNH DS    CL8                                                              
CHKREPN  DS    CL4      7   48    4  A  U N             T        Y              
CHKREPXH DS    CL8                                                              
CHKREPX  DS    CL28     7   53   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
CHKINITH DS    CL8                                                              
CHKINIT  DS    CL3      8   11    3  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL7      8   16    7  A  P H             T        Y              
CHKOPTNH DS    CL8                                                              
CHKOPTN  DS    CL55     8   24   55  A  U N             T        Y              
CHKTAGH  DS    CL8                                                              
CHKTAG   DS    CL1      9    2    1  A  P N             T        Y              
CHKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CHKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 512  BYTES                            
