*          DATA SET PPMATFED   AT LEVEL 056 AS OF 12/11/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T402FED      DATE 12/11/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    4    5  A  P H             T        Y              
LSTPAYRH DS    CL8                                                              
LSTPAYR  DS    CL3      5   15    3  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL7      6    4    7  A  P H             T        Y              
LSTMEDH  DS    CL8                                                              
LSTMED   DS    CL10     6   15   10  A  U N             T        Y              
LSTMDXPH DS    CL8                                                              
LSTMDXP  DS    CL10     6   35   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    4    7  A  P H             T        Y              
LSTCLTH  DS    CL8                                                              
LSTCLT   DS    CL10     7   15   10  A  U N             T        Y              
LSTCLXPH DS    CL8                                                              
LSTCLXP  DS    CL20     7   35   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    4    7  A  P H             T        Y              
LSTPRDH  DS    CL8                                                              
LSTPRD   DS    CL10     8   15   10  A  U N             T        Y              
LSTPDXPH DS    CL8                                                              
LSTPDXP  DS    CL20     8   35   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    4    7  A  P H             T        Y              
LSTPUBH  DS    CL8                                                              
LSTPUB   DS    CL17     9   15   17  A  U N             T        Y              
LSTP1XPH DS    CL8                                                              
LSTP1XP  DS    CL40     9   35   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    4   10  A  P N             T        Y              
LSTYEARH DS    CL8                                                              
LSTYEAR  DS    CL1     10   15    1  A  U N             T        Y              
LSTREPTH DS    CL8                                                              
LSTREPT  DS    CL10    10   19   10  A  P N             T        Y              
LSTPREPH DS    CL8                                                              
LSTPREP  DS    CL4     10   30    4  A  P N             T        Y              
LSTPRPXH DS    CL8                                                              
LSTPRPX  DS    CL46    10   35   46  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    4    7  A  P N             T        Y              
LSTPERH  DS    CL8                                                              
LSTPER   DS    CL10    11   15   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   30    7  A  P N             T        Y              
LSTOPTH  DS    CL8                                                              
LSTOPT   DS    CL40    11   40   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
LSTSEL1H DS    CL8                                                              
LSTSEL1  DS    CL3     14    2    3  A  U N             T        Y              
LSTIDT1H DS    CL8                                                              
LSTIDT1  DS    CL8     14    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   71    4  A  U N             T        Y              
LSTSEL2H DS    CL8                                                              
LSTSEL2  DS    CL3     15    2    3  A  U N             T        Y              
LSTIDT2H DS    CL8                                                              
LSTIDT2  DS    CL8     15    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    15   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   71    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   71    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    17   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   71    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   71    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    19   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   71    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    20   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   71    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    21   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   71    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    22   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   71    4  A  U N             T        Y              
LSTLSTFH DS    CL8                                                              
LSTLSTF  DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    23   30   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   71    4  A  U N             T        Y              
LSTPFLNH DS    CL8                                                              
LSTPFLN  DS    CL78    24    2   78  A  P H             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1992 BYTES                            
