*          DATA SET PPMBCFFD   AT LEVEL 023 AS OF 11/14/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T418FFD      DATE 11/14/96                 
         SPACE 1                                                                
T418FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MBCEMSGH DS    CL8                                                              
MBCEMSG  DS    CL60     1    2   60  A  P N             T        Y              
MBCIDH   DS    CL8                                                              
MBCID    DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    1    6  A  P N             T        Y              
MBCMDIAH DS    CL8                                                              
MBCMDIA  DS    CL1      2   13    1  A  U N             T    I   Y              
MBCMDESH DS    CL8                                                              
MBCMDES  DS    CL10     2   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      2   46    6  A  P N             T        Y              
MBCCLTH  DS    CL8                                                              
MBCCLT   DS    CL3      2   56    3  A  U N             T        Y              
MBCCLTNH DS    CL8                                                              
MBCCLTN  DS    CL20     2   60   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      3    1    8  A  P N             T        Y              
MBCPRDH  DS    CL8                                                              
MBCPRD   DS    CL3      3   13    3  A  U N             T        Y              
MBCPRDNH DS    CL8                                                              
MBCPRDN  DS    CL20     3   22   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      3   46    9  A  P N             T        Y              
MBCESTH  DS    CL8                                                              
MBCEST   DS    CL3      3   56    3  A  U N             T        Y              
MBCESTNH DS    CL8                                                              
MBCESTN  DS    CL20     3   60   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     4    1   11  A  P N             T        Y              
MBCSTDEH DS    CL8                                                              
MBCSTDE  DS    CL10     4   13   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      4   46    9  A  P N             T        Y              
MBCEDDEH DS    CL8                                                              
MBCEDDE  DS    CL10     4   56   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     5    1   11  A  P N             T        Y              
MBCPUBH  DS    CL8                                                              
MBCPUB   DS    CL18     5   13   18  A  U N             T        Y              
MBCPUBNH DS    CL8                                                              
MBCPUBN  DS    CL48     5   32   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6    1    4  A  P N             T        Y              
MBCDATH  DS    CL8                                                              
MBCDAT   DS    CL47     6    6   47  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   55    6  A  P N             T        Y              
MBCACTH  DS    CL8                                                              
MBCACT   DS    CL8      6   62    8  A  U N             T        Y              
MBCHD1H  DS    CL8                                                              
MBCHD1   DS    CL67     7    1   67  A  P N             T        Y              
MBCDAN1H DS    CL8                                                              
MBCDAN1  DS    CL11     7   69   11  A  P N             T        Y              
MBCHD2H  DS    CL8                                                              
MBCHD2   DS    CL67     8    1   67  A  P N             T        Y              
MBCDAN2H DS    CL8                                                              
MBCDAN2  DS    CL11     8   69   11  A  P N             T        Y              
MBCOT01H DS    CL8                                                              
MBCOT01  DS    CL67     9    1   67  A  P N             N        Y              
MBCDT01H DS    CL8                                                              
MBCDT01  DS    CL11     9   69   11  A  U N             T        Y              
MBCOT02H DS    CL8                                                              
MBCOT02  DS    CL67    10    1   67  A  P N             N        Y              
MBCDT02H DS    CL8                                                              
MBCDT02  DS    CL11    10   69   11  A  U N             T        Y              
MBCOT03H DS    CL8                                                              
MBCOT03  DS    CL67    11    1   67  A  P N             N        Y              
MBCDT03H DS    CL8                                                              
MBCDT03  DS    CL11    11   69   11  A  U N             T        Y              
MBCOT04H DS    CL8                                                              
MBCOT04  DS    CL67    12    1   67  A  P N             N        Y              
MBCDT04H DS    CL8                                                              
MBCDT04  DS    CL11    12   69   11  A  U N             T        Y              
MBCOT05H DS    CL8                                                              
MBCOT05  DS    CL67    13    1   67  A  P N             N        Y              
MBCDT05H DS    CL8                                                              
MBCDT05  DS    CL11    13   69   11  A  U N             T        Y              
MBCOT06H DS    CL8                                                              
MBCOT06  DS    CL67    14    1   67  A  P N             N        Y              
MBCDT06H DS    CL8                                                              
MBCDT06  DS    CL11    14   69   11  A  U N             T        Y              
MBCOT07H DS    CL8                                                              
MBCOT07  DS    CL67    15    1   67  A  P N             N        Y              
MBCDT07H DS    CL8                                                              
MBCDT07  DS    CL11    15   69   11  A  U N             T        Y              
MBCOT08H DS    CL8                                                              
MBCOT08  DS    CL67    16    1   67  A  P N             N        Y              
MBCDT08H DS    CL8                                                              
MBCDT08  DS    CL11    16   69   11  A  U N             T        Y              
MBCOT09H DS    CL8                                                              
MBCOT09  DS    CL67    17    1   67  A  P N             N        Y              
MBCDT09H DS    CL8                                                              
MBCDT09  DS    CL11    17   69   11  A  U N             T        Y              
MBCOT10H DS    CL8                                                              
MBCOT10  DS    CL67    18    1   67  A  P N             N        Y              
MBCDT10H DS    CL8                                                              
MBCDT10  DS    CL11    18   69   11  A  U N             T        Y              
MBCOT11H DS    CL8                                                              
MBCOT11  DS    CL67    19    1   67  A  P N             N        Y              
MBCDT11H DS    CL8                                                              
MBCDT11  DS    CL11    19   69   11  A  U N             T        Y              
MBCOT12H DS    CL8                                                              
MBCOT12  DS    CL67    20    1   67  A  P N             N        Y              
MBCDT12H DS    CL8                                                              
MBCDT12  DS    CL11    20   69   11  A  U N             T        Y              
MBCOT13H DS    CL8                                                              
MBCOT13  DS    CL67    21    1   67  A  P N             N        Y              
MBCDT13H DS    CL8                                                              
MBCDT13  DS    CL11    21   69   11  A  U N             T        Y              
MBCOT14H DS    CL8                                                              
MBCOT14  DS    CL67    22    1   67  A  P N             N        Y              
MBCDT14H DS    CL8                                                              
MBCDT14  DS    CL11    22   69   11  A  U N             T        Y              
MBCOT15H DS    CL8                                                              
MBCOT15  DS    CL67    23    1   67  A  P N             N        Y              
MBCDT15H DS    CL8                                                              
MBCDT15  DS    CL11    23   69   11  A  U N             T        Y              
MBCOT16H DS    CL8                                                              
MBCOT16  DS    CL67    24    1   67  A  P N             N        Y              
MBCDT16H DS    CL8                                                              
MBCDT16  DS    CL11    24   69   11  A  U N             T        Y              
MBCLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
MBCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2328 BYTES                            
