*          DATA SET PPPAYFFD   AT LEVEL 008 AS OF 06/30/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T403FFD      DATE 06/30/08                 
         SPACE 1                                                                
T403FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PAYMSGH  DS    XL8                                                              
PAYMSG   DS    CL60     1    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
PAYMSG1H DS    XL8                                                              
PAYMSG1  DS    CL60     2    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      3    2    5  A  P N             T        Y              
PAYMDH   DS    XL8                                                              
PAYMD    DS    CL19     3   16   19  A  U N             T    I   Y              
PAYMDNMH DS    XL8                                                              
PAYMDNM  DS    CL10     3   38   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      4    2    9  A  P N             T        Y              
PAYRQH   DS    XL8                                                              
PAYRQ    DS    CL19     4   16   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P N             T        Y              
PAYOPH   DS    XL8                                                              
PAYOP    DS    CL26     4   47   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
PAYCLH   DS    XL8                                                              
PAYCL    DS    CL19     5   16   19  A  U N             T        Y              
PAYCLNMH DS    XL8                                                              
PAYCLNM  DS    CL20     5   38   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PAYPRH   DS    XL8                                                              
PAYPR    DS    CL19     6   16   19  A  U N             T        Y              
PAYPRNMH DS    XL8                                                              
PAYPRNM  DS    CL20     6   38   20  A  P N             T        Y              
PAYESNMH DS    XL8                                                              
PAYESNM  DS    CL20     6   59   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
PAYDTH   DS    XL8                                                              
PAYDT    DS    CL19     7   16   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
PAYPBH   DS    XL8                                                              
PAYPB    DS    CL19     8   16   19  A  U N             T        Y              
PAYPBNMH DS    XL8                                                              
PAYPBNM  DS    CL43     8   38   43  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
PAYEEH   DS    XL8                                                              
PAYEE    DS    CL19     9   16   19  A  U N             T        Y              
PAYEENMH DS    XL8                                                              
PAYEENM  DS    CL30     9   38   30  A  P N             T        Y              
PAYADD1H DS    XL8                                                              
PAYADD1  DS    CL30    10   38   30  A  P N             T        Y              
PAYADD2H DS    XL8                                                              
PAYADD2  DS    CL30    11   38   30  A  P N             T        Y              
PAYCKD1H DS    XL8                                                              
PAYCKD1  DS    CL13    12    2   13  A  P N             T        Y              
PAYCKH   DS    XL8                                                              
PAYCK    DS    CL19    12   16   19  A  U N             T        Y              
PAYINVAH DS    XL8                                                              
PAYINVA  DS    CL13    12   38   13  A  P N             T        Y              
PAYINVDH DS    XL8                                                              
PAYINVD  DS    CL19    12   52   19  A  U N             T        Y              
PAYXLINH DS    XL8                                                              
PAYXLIN  DS    CL77    13    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL38    14    3   38  A  P N             T        Y              
PAYINV1H DS    XL8                                                              
PAYINV1  DS    CL11    16    3   11  A  U N             T        Y              
PAYAMT1H DS    XL8                                                              
PAYAMT1  DS    CL12    16   17   12  A  U N             T        Y              
PAYCMT1H DS    XL8                                                              
PAYCMT1  DS    CL40    16   33   40  A  U N             T        Y              
PAYINV2H DS    XL8                                                              
PAYINV2  DS    CL11    17    3   11  A  U N             T        Y              
PAYAMT2H DS    XL8                                                              
PAYAMT2  DS    CL12    17   17   12  A  U N             T        Y              
PAYCMT2H DS    XL8                                                              
PAYCMT2  DS    CL40    17   33   40  A  U N             T        Y              
PAYINV3H DS    XL8                                                              
PAYINV3  DS    CL11    18    3   11  A  U N             T        Y              
PAYAMT3H DS    XL8                                                              
PAYAMT3  DS    CL12    18   17   12  A  U N             T        Y              
PAYCMT3H DS    XL8                                                              
PAYCMT3  DS    CL40    18   33   40  A  U N             T        Y              
PAYINV4H DS    XL8                                                              
PAYINV4  DS    CL11    19    3   11  A  U N             T        Y              
PAYAMT4H DS    XL8                                                              
PAYAMT4  DS    CL12    19   17   12  A  U N             T        Y              
PAYCMT4H DS    XL8                                                              
PAYCMT4  DS    CL40    19   33   40  A  U N             T        Y              
PAYINV5H DS    XL8                                                              
PAYINV5  DS    CL11    20    3   11  A  U N             T        Y              
PAYAMT5H DS    XL8                                                              
PAYAMT5  DS    CL12    20   17   12  A  U N             T        Y              
PAYCMT5H DS    XL8                                                              
PAYCMT5  DS    CL40    20   33   40  A  U N             T        Y              
PAYTSTH  DS    XL8                                                              
PAYTST   DS    CL78    21    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
PAYLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
PAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1848 BYTES                            
