*          DATA SET PPPISNMEL  AT LEVEL 003 AS OF 02/05/03                      
*                          **PRINTPAK - BUY RECORD                              
*                          ISSUE NAME                                           
PISNMELD DSECT                                                                  
PISNMELQ EQU   X'A6'               ELEMENT ID                                   
PISNMELM DS    X'A6'               ELEM CODE                                    
PISNMELL DS    AL1(13)             ELEM LEN                                     
PISNAME  DS    CL11                ISSUE NAME (CL11)                            
