*          DATA SET PPPNVFAD   AT LEVEL 003 AS OF 10/20/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41DFAD      DATE 10/20/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LSTTTLH  DS    XL8                                                              
LSTTTL   DS    CL14     5   33   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
LSTMEDH  DS    XL8                                                              
LSTMED   DS    CL2      7   12    2  A  U N             T        Y    5         
LSTMEDX  DS    XL8                                                              
LSTMEDNH DS    XL8                                                              
LSTMEDN  DS    CL15     7   15   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   40    6  A  P H             T        Y              
LSTCLTH  DS    XL8                                                              
LSTCLT   DS    CL4      7   50    4  A  U N             T        Y   10         
LSTCLTX  DS    XL8                                                              
LSTCLTNH DS    XL8                                                              
LSTCLTN  DS    CL20     7   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
LSTPUBH  DS    XL8                                                              
LSTPUB   DS    CL16     8   12   16  A  U N             T        Y   20         
LSTPUBX  DS    XL8                                                              
LSTPUBNH DS    XL8                                                              
LSTPUBN  DS    CL20     8   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P H             T        Y              
LSTINVH  DS    XL8                                                              
LSTINV   DS    CL20     9   12   20  A  U N             T        Y   30         
LSTINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9   40    9  A  P N             T        Y              
LSTSER#H DS    XL8                                                              
LSTSER#  DS    CL20     9   50   20  A  P N             T        Y   40         
LSTSER#X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
LSTRPERH DS    XL8                                                              
LSTRPER  DS    CL17    10   12   17  A  U N             T        Y   65         
LSTRPERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10   40    9  A  P N             T        Y              
LSTPERH  DS    XL8                                                              
LSTPER   DS    CL20    10   50   20  A  P N             T        Y   60         
LSTPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   79    1  A  P N             T        Y              
LSTTL1H  DS    XL8                                                              
LSTTL1   DS    CL3     12    2    3  A  P H             T        Y              
LSTTL2H  DS    XL8                                                              
LSTTL2   DS    CL74    12    7   74  A  P H             T        Y              
LSTUL1H  DS    XL8                                                              
LSTUL1   DS    CL3     13    2    3  A  P H             T        Y              
LSTUL2H  DS    XL8                                                              
LSTUL2   DS    CL74    13    7   74  A  P H             T        Y              
LSTSEL1H DS    XL8                                                              
LSTSEL1  DS    CL3     14    2    3  A  U N             T        Y   85         
LSTSEL1X DS    XL8                                                              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL74    14    7   74  A  P N             T        Y              
LSTSEL2H DS    XL8                                                              
LSTSEL2  DS    CL3     15    2    3  A  U N             T        Y   85         
LSTSEL2X DS    XL8                                                              
LSTLIN2H DS    XL8                                                              
LSTLIN2  DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   85         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   85         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   85         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   85         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   85         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   85         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   85         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
LSTSELLH DS    XL8                                                              
LSTSELL  DS    CL3     23    2    3  A  U N             T        Y   85         
LSTSELLX DS    XL8                                                              
LSTLINLH DS    XL8                                                              
LSTLINL  DS    CL74    23    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
