*          DATA SET PPPNVFED   AT LEVEL 006 AS OF 10/28/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41DFED      DATE 10/28/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
HDLMEDH  DS    XL8                                                              
HDLMED   DS    CL2      5   10    2  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
HDLCLTH  DS    XL8                                                              
HDLCLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   38    3  A  P N             T        Y              
HDLPUBH  DS    XL8                                                              
HDLPUB   DS    CL9      5   46    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   56    6  A  P N             T        Y              
HDLPERH  DS    XL8                                                              
HDLPER   DS    CL17     5   63   17  A  U N             T        Y              
HDLMEDNH DS    XL8                                                              
HDLMEDN  DS    CL10     6    8   10  A  P N             T        Y              
HDLCLTNH DS    XL8                                                              
HDLCLTN  DS    CL14     6   23   14  A  P N             T        Y              
HDLPUBNH DS    XL8                                                              
HDLPUBN  DS    CL20     6   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
HDLSER#H DS    XL8                                                              
HDLSER#  DS    CL10     7   10   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     9    2   32  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30     9   47   30  A  P H             T        Y              
HDLSELH  DS    XL8                                                              
HDLSEL   DS    CL3     10    2    3  A  U N             T        Y  225         
HDLSELX  DS    XL8                                                              
HDLLIN1H DS    XL8                                                              
HDLLIN1  DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
HDLLIN2H DS    XL8                                                              
HDLLIN2  DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
HDLSELLH DS    XL8                                                              
HDLSELL  DS    CL3     23    2    3  A  U N             T        Y  225         
HDLSELLX DS    XL8                                                              
HDLLINLH DS    XL8                                                              
HDLLINL  DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
HDLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
HDLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1808 BYTES                            
