*          DATA SET PPPNVF8D   AT LEVEL 002 AS OF 09/18/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41DF8D      DATE 09/18/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
HDATTLH  DS    XL8                                                              
HDATTL   DS    CL23     5   33   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
HDAMEDH  DS    XL8                                                              
HDAMED   DS    CL2      7   12    2  A  U N             T        Y    5         
HDAMEDX  DS    XL8                                                              
HDAMEDNH DS    XL8                                                              
HDAMEDN  DS    CL15     7   15   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   40    6  A  P H             T        Y              
HDACLTH  DS    XL8                                                              
HDACLT   DS    CL4      7   50    4  A  U N             T        Y   10         
HDACLTX  DS    XL8                                                              
HDACLTNH DS    XL8                                                              
HDACLTN  DS    CL20     7   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
HDAPUBH  DS    XL8                                                              
HDAPUB   DS    CL16     8   12   16  A  U N             T        Y   20         
HDAPUBX  DS    XL8                                                              
HDAPUBNH DS    XL8                                                              
HDAPUBN  DS    CL40     8   30   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P H             T        Y              
HDAINVH  DS    XL8                                                              
HDAINV   DS    CL20     9   12   20  A  U N             T        Y   30         
HDAINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9   40    9  A  P N             T        Y              
HDASER#H DS    XL8                                                              
HDASER#  DS    CL20     9   50   20  A  P N             T        Y   40         
HDASER#X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P H             T        Y              
HDADETH  DS    XL8                                                              
HDADET   DS    CL6     10   12    6  A  U N             T        Y   50         
HDADETX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P H             T        Y              
HDAGROH  DS    XL8                                                              
HDAGRO   DS    CL6     11   12    6  A  U N             T        Y   60         
HDAGROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    2   11  A  P H             T        Y              
HDAPIDH  DS    XL8                                                              
HDAPID   DS    CL23    14   14   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   40   15  A  P H             T        Y              
HDADTEH  DS    XL8                                                              
HDADTE   DS    CL8     14   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    15    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    15   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    15   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    15   56   16  A  P N             T        Y              
HDACHG1H DS    XL8                                                              
HDACHG1  DS    CL16    16    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    16   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    16   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    16   56   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    17    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    17   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    17   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    17   56   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    18    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    18   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    18   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    18   56   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    19    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    19   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    19   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    19   56   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    20    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    20   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    20   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    20   56   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    21   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    21   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    21   56   16  A  P N             T        Y              
HDAMESH  DS    XL8                                                              
HDAMES   DS    CL35    22   26   35  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
HDALAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
HDAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1328 BYTES                            
