*          DATA SET PPPUBFAD   AT LEVEL 007 AS OF 01/03/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T406FAD      DATE 01/03/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL21     8    2   21  A  P N             T        Y              
CLIPREPH DS    XL8                                                              
CLIPREP  DS    CL20     8   26   20  A  U N             T        Y              
CLIPRNH  DS    XL8                                                              
CLIPRN   DS    CL30     8   48   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   17    7  A  P N             T        Y              
CLITREPH DS    XL8                                                              
CLITREP  DS    CL20     9   26   20  A  U N             T        Y              
CLITRNH  DS    XL8                                                              
CLITRN   DS    CL30     9   48   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   17    8  A  P N             T        Y              
CLICREPH DS    XL8                                                              
CLICREP  DS    CL20    10   26   20  A  U N             T        Y              
CLICRNH  DS    XL8                                                              
CLICRN   DS    CL30    10   48   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    11    3   20  A  P N             T        Y              
CLIDESH  DS    XL8                                                              
CLIDES   DS    CL15    11   26   15  A  U N             T        Y              
CLIPUBNH DS    XL8                                                              
CLIPUBN  DS    CL30    11   48   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12    3   13  A  P N             T        Y              
CLISUBMH DS    XL8                                                              
CLISUBM  DS    CL3     12   17    3  A  U N             T        Y              
CLISMDSH DS    XL8                                                              
CLISMDS  DS    CL20    12   23   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22    13    3   22  A  P N             T        Y              
CLICOM1H DS    XL8                                                              
CLICOM1  DS    CL6     13   27    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   34   10  A  P N             T        Y              
CLIWHR1H DS    XL8                                                              
CLIWHR1  DS    CL1     13   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    14    3   22  A  P N             T        Y              
CLICOM2H DS    XL8                                                              
CLICOM2  DS    CL6     14   27    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   34   10  A  P N             T        Y              
CLIWHR2H DS    XL8                                                              
CLIWHR2  DS    CL1     14   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL38    16    3   38  A  P N             T        Y              
CLIPOCAH DS    XL8                                                              
CLIPOCA  DS    CL26    18    3   26  A  P N             T        Y              
CLIPOCRH DS    XL8                                                              
CLIPOCR  DS    CL4     18   31    4  A  U N             T        Y              
CLIPO1AH DS    XL8                                                              
CLIPO1A  DS    CL31    19    3   31  A  P N             T        Y              
CLIPO1H  DS    XL8                                                              
CLIPO1   DS    CL4     19   36    4  A  U N             T        Y              
CLIPO2AH DS    XL8                                                              
CLIPO2A  DS    CL11    20    3   11  A  P N             T        Y              
CLIPO2H  DS    XL8                                                              
CLIPO2   DS    CL1     20   18    1  A  U N             T        Y              
CLIPO2BH DS    XL8                                                              
CLIPO2B  DS    CL42    20   20   42  A  P N             T        Y              
CLIPO3AH DS    XL8                                                              
CLIPO3A  DS    CL13    21    3   13  A  P N             T        Y              
CLIPO3H  DS    XL8                                                              
CLIPO3   DS    CL1     21   18    1  A  U N             T        Y              
CLIPO3BH DS    XL8                                                              
CLIPO3B  DS    CL55    21   20   55  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL29    22    3   29  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   33    3  A  P N             T        Y              
CLIINCDH DS    XL8                                                              
CLIINCD  DS    CL4     22   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   47    2  A  P N             T        Y              
CLIICDH  DS    XL8                                                              
CLIICD   DS    CL4     22   51    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   31    1  A  U N             T        Y              
CLILAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
CLIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 960  BYTES                            
