*          DATA SET PPPUBEDRPP AT LEVEL 011 AS OF 09/13/93                      
*=======================================================*                       
*                                                                               
*           PUB-EDR PASSIVE POINTER                                             
*           RESIDES ON PRTDIR AND IS A DIRECTORY ONLY POINTER                   
*                                                                               
*=======================================================*                       
*                                                                               
PPEDKEY  DS    0CL25                                                            
PPEDKAGY DS    CL2                 AGENCY CODE                                  
PPEDKMED DS    CL1                 MEDIA                                        
PPEDKRCD DS    XL1'E0'             RECORD ID                                    
PPEDKIDQ EQU   X'E0'               PUB-EDR POINTER ID                           
PPEDKPUB DS    XL6                 PUB                                          
PPEDKEDR DS    CL9                 EDR CODE                                     
         DS    CL6                 SPARE                                        
*        *     *                   *                                            
*              ---                                                              
**              25                 KEY LENGTH                                   
*              ===                                                              
PPEDCNTL DS    XL2'00FF'           CONTROL BYTES - DIRECTORY ONLY               
PPEDDISK DS    XL4'00000000'       DISK ADDRESS                                 
