*          DATA SET PPPUBED2PP AT LEVEL 015 AS OF 02/23/94                      
*=====================================================================*         
*                                                                     *         
*           PUB-EDR PASSIVE POINTER                                   *         
*           RESIDES ON PRTDIR AND IS A DIRECTORY ONLY POINTER         *         
*           FOR EDR VERSION 2                                         *         
*                                                                     *         
*=====================================================================*         
*                                                                               
PPE2KEY  DS    0CL25                                                            
PPE2KAGY DS    CL2                 AGENCY CODE                                  
PPE2KMED DS    CL1                 MEDIA - ALWAYS C'Z'                          
PPE2KRCD DS    XL1'E2'             RECORD ID                                    
PPE2KIDQ EQU   X'E2'               PUB-EDR POINTER ID                           
PPE2KPMD DS    XL1                 MEDIA FOR PRINTPAK PUB                       
PPE2KPUB DS    XL6                 PUB                                          
PPE2KPCL DS    CL3                 CLIENT CODE FOR EXCEPTIONS                   
*                                  X'000000' FOR DEFAULT                        
PPE2KEDR DS    CL8                 EDR CODE                                     
         DS    CL3                 SPARE                                        
*        *     *                   *                                            
*              ---                                                              
**              25                 KEY LENGTH                                   
*              ===                                                              
PPE2CNTL DS    XL2'00FF'           CONTROL BYTES - DIRECTORY ONLY               
PPE2DISK DS    XL4'00000000'       DISK ADDRESS                                 
