*          DATA SET PPPUBE3D   AT LEVEL 002 AS OF 10/06/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T406E3D      DATE 10/06/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      8    4    9   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      8   31    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4      9    7    4   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6      9   17    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11     9   28   11   A    P    N         T         Y           
CIRDTE1H DS    CL8                                                              
CIRDTE1  DS    CL8     10    5    8   A    U    N         T         Y           
CIRSRC1H DS    CL8                                                              
CIRSRC1  DS    CL4     10   18    4   A    U    N         T         Y           
CIRCIR1H DS    CL8                                                              
CIRCIR1  DS    CL11    10   28   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11    5    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     11   18    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    11   28   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12    5    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     12   18    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    12   28   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     14    5    1   A    U    N         T         Y           
CIRLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
CIRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 228  BYTES                            
