*          DATA SET PPPUBE5D   AT LEVEL 007 AS OF 11/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T406E5D      DATE 11/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TAXHD1H  DS    CL8                                                              
TAXHD1   DS    CL9      8   28    9  A  P N             T        Y              
TAXHD2H  DS    CL8                                                              
TAXHD2   DS    CL8      9   16    8  A  P N             T        Y              
TAXHD3H  DS    CL8                                                              
TAXHD3   DS    CL4      9   30    4  A  P N             T        Y              
TAXRTE1H DS    CL8                                                              
TAXRTE1  DS    CL7     10   16    7  A  U N             T        Y              
TAXDTE1H DS    CL8                                                              
TAXDTE1  DS    CL8     10   28    8  A  U N             T        Y              
TAXRTE2H DS    CL8                                                              
TAXRTE2  DS    CL7     11   16    7  A  U N             T        Y              
TAXDTE2H DS    CL8                                                              
TAXDTE2  DS    CL8     11   28    8  A  U N             T        Y              
TAXRTE3H DS    CL8                                                              
TAXRTE3  DS    CL7     12   16    7  A  U N             T        Y              
TAXDTE3H DS    CL8                                                              
TAXDTE3  DS    CL8     12   28    8  A  U N             T        Y              
TAXENDH  DS    CL8                                                              
TAXEND   DS    CL1     12   71    1  A  U N             T        Y              
TAXLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
TAXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 152  BYTES                            
