*          DATA SET PPPUBE1D   AT LEVEL 004 AS OF 11/19/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T406E1D      DATE 11/19/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL15     8    3   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   27   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   51   15  A  P N             T        Y              
CLESP1H  DS    CL8                                                              
CLESP1   DS    CL6      9    2    6  A  U N             T        Y              
CLELN1H  DS    CL8                                                              
CLELN1   DS    CL6      9   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   77    1  A  U N             T        Y              
CLELAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
CLEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1344 BYTES                            
