*          DATA SET PPPUBF6D   AT LEVEL 003 AS OF 10/20/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T406F6D      DATE 10/20/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     8    3   14  A  P N             T        Y              
PREEFFDH DS    CL8                                                              
PREEFFD  DS    CL8      8   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14     9    3   14  A  P N             T        Y              
PREDAYSH DS    CL8                                                              
PREDAYS  DS    CL20     9   24   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     9   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    10    3   20  A  P N             T        Y              
PREMINSH DS    CL8                                                              
PREMINS  DS    CL7     10   24    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    3   14  A  P N             T        Y              
PREMINCH DS    CL8                                                              
PREMINC  DS    CL9     11   24    9  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    12    3   14  A  P N             T        Y              
PRETOFCH DS    CL8                                                              
PRETOFC  DS    CL1     12   24    1  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    12   43   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    3   12  A  P N             T        Y              
PRECLMOH DS    CL8                                                              
PRECLMO  DS    CL3     13   24    3  A  U N             T        Y              
PRECLDAH DS    CL8                                                              
PRECLDA  DS    CL3     13   29    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    13   43   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
PRECH1H  DS    CL8                                                              
PRECH1   DS    CL10    15   10   10  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL41    15   22   41  A  P N             T        Y              
PREMX1H  DS    CL8                                                              
PREMX1   DS    CL9     15   65    9  A  U N             T        Y              
PRECH2H  DS    CL8                                                              
PRECH2   DS    CL10    16   10   10  N  U N             T        Y              
PREMX2H  DS    CL8                                                              
PREMX2   DS    CL9     16   65    9  A  U N             T        Y              
PRECH3H  DS    CL8                                                              
PRECH3   DS    CL10    17   10   10  N  U N             T        Y              
PREMX3H  DS    CL8                                                              
PREMX3   DS    CL9     17   65    9  A  U N             T        Y              
PRECH4H  DS    CL8                                                              
PRECH4   DS    CL10    18   10   10  N  U N             T        Y              
PREMX4H  DS    CL8                                                              
PREMX4   DS    CL9     18   65    9  A  U N             T        Y              
PRECH5H  DS    CL8                                                              
PRECH5   DS    CL10    19   10   10  N  U N             T        Y              
PREMX5H  DS    CL8                                                              
PREMX5   DS    CL9     19   65    9  A  U N             T        Y              
PRECH6H  DS    CL8                                                              
PRECH6   DS    CL10    20   10   10  N  U N             T        Y              
PREMX6H  DS    CL8                                                              
PREMX6   DS    CL9     20   65    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   77    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL23    21    2   23  A  P N             T        Y              
PREDTSH  DS    CL8                                                              
PREDTS   DS    CL53    21   26   53  A  P N             T        Y              
PRELAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
PREWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 720  BYTES                            
