*          DATA SET PPPUBF4D   AT LEVEL 016 AS OF 09/16/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T406F4D      DATE 09/16/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     8    2   17  A  P N             T        Y              
ADSTRWDH DS    CL8                                                              
ADSTRWD  DS    CL8      8   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   40    5  A  P N             T        Y              
ADSTRDPH DS    CL8                                                              
ADSTRDP  DS    CL8      8   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    10    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   29    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   40    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   58    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   67    5  A  P N             T        Y              
ADSSPFSH DS    CL8                                                              
ADSSPFS  DS    CL17    13    2   17  A  U N             T        Y              
ADSWDFSH DS    CL8                                                              
ADSWDFS  DS    CL8     13   20    8  A  U N             T        Y              
ADSDPFSH DS    CL8                                                              
ADSDPFS  DS    CL8     13   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    13   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    15    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    15   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    17    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    17   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    19    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    19   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    20    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    20   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    21    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   29    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    21   40   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    22    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   29    8  A  U N             T        Y              
ADSSPLSH DS    CL8                                                              
ADSSPLS  DS    CL17    22   40   17  A  U N             T        Y              
ADSWDLSH DS    CL8                                                              
ADSWDLS  DS    CL8     22   58    8  A  U N             T        Y              
ADSDPLSH DS    CL8                                                              
ADSDPLS  DS    CL8     22   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL38    23    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   41   11  A  P N             T        Y              
ADSLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
ADSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1400 BYTES                            
