*          DATA SET PPPUBFED   AT LEVEL 002 AS OF 10/06/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T406FED      DATE 10/06/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     8    3   14   A    P    N         T         Y           
RATEFFDH DS    CL8                                                              
RATEFFD  DS    CL8      8   23    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     9    3   11   A    P    N         T         Y           
RATDESCH DS    CL8                                                              
RATDESC  DS    CL17     9   23   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     10    3    4   A    P    N         T         Y           
RATBRATH DS    CL8                                                              
RATBRAT  DS    CL10    10   23   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     11    3    9   A    P    N         T         Y           
RATDLTYH DS    CL8                                                              
RATDLTY  DS    CL1     11   23    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     11   41    9   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13    12    3   13   A    P    N         T         Y           
RATDRTYH DS    CL8                                                              
RATDRTY  DS    CL2     12   23    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     12   61    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL76    13    2   76   A    P    N         T         Y           
RATDES1H DS    CL8                                                              
RATDES1  DS    CL17    14    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    14   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    14   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    14   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    15    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    15   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    15   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    15   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    16    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    16   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    16   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    16   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    17    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    17   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     17   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    17   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    17   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     17   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    18    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    18   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     18   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    18   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    18   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     18   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    19    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    19   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     19   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    19   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    19   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     19   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    20    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    20   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     20   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    20   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    20   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     20   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    21    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    21   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     21   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    21   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    21   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     21   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    22    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    22   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     22   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    22   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    22   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     22   70    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    23    2   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    23   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     23   31    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17    23   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    23   59   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     23   70    8   A    P    N         T         Y           
RATLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
RATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1462 BYTES                            
