*          DATA SET PPPUBADVPP AT LEVEL 009 AS OF 10/31/91                      
*=======================================================*                       
*           PUB ADV PASSIVE POINTER                                             
*           BUILT FROM ADV ELEM IN AGENCY'S PUBREC                              
*           SO $PUB CAN CHECK FOR DUPLICATE LINKAGE                             
*                                                                               
*=======================================================*                       
PUBAID   DS    XL1'FE'             RECORD ID                                    
PUBAMED  DS    CL1                 MEDIA                                        
PUBAAGY  DS    CL2                 AGENCY                                       
PUBAADV  DS    CL3                 ADVERTISER CODE                              
PUBAAOR  DS    CL2                 AOR CODE                                     
PUBAAPUB DS    CL6                 AGENCY PUB NUMBER                            
PUBAVPUB DS    CL6                 ADVERTISER PUB NUMBER                        
         DS    CL4                 SPARE                                        
*              ---                                                              
**              25                 KEY LENGTH                                   
*              ===                                                              
         DS    CL2                 RECORD LENGTH                                
         DS    CL2                 CONTROL BYTES                                
         DS    CL4                 DISK ADDRESS                                 
