*          DATA SET PPRFMFFD   AT LEVEL 002 AS OF 08/27/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T40CFFD      DATE 08/27/14                 
         SPACE 1                                                                
T40CFFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
REPMSGH  DS    XL8                                                              
REPMSG   DS    CL60     1    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      2    2    5  A  P N             T        Y              
REPMEDH  DS    XL8                                                              
REPMED   DS    CL1      2    9    1  A  U N             T    I   Y              
REPMEDNH DS    XL8                                                              
REPMEDN  DS    CL10     2   13   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      3    2    3  A  P N             T        Y              
REPCODEH DS    XL8                                                              
REPCODE  DS    CL20     3    9   20  A  U N             T        Y              
REPSTNDH DS    XL8                                                              
REPSTND  DS    CL10     3   31   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P N             T        Y              
REPACTH  DS    XL8                                                              
REPACT   DS    CL7      4    9    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
REPNAMEH DS    XL8                                                              
REPNAME  DS    CL30     6   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPLIN1H DS    XL8                                                              
REPLIN1  DS    CL30     7   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
REPLIN2H DS    XL8                                                              
REPLIN2  DS    CL30     8   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
REPATTNH DS    XL8                                                              
REPATTN  DS    CL20     9   20   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
REPTELEH DS    XL8                                                              
REPTELE  DS    CL12    10   20   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
REPFAXNH DS    XL8                                                              
REPFAXN  DS    CL12    11   20   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12    2   17  A  P N             T        Y              
REPBKCDH DS    XL8                                                              
REPBKCD  DS    CL2     12   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
REPPUBLH DS    XL8                                                              
REPPUBL  DS    CL3     13   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    13   26   25  A  P N             T        Y              
REPIORH  DS    XL8                                                              
REPIOR   DS    CL3     13   53    3  A  U N             T        Y              
REPSTTLH DS    XL8                                                              
REPSTTL  DS    CL10    14    2   10  A  P N             T        Y              
REPSAPH  DS    XL8                                                              
REPSAP   DS    CL10    14   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   61    1  A  U N             T        Y              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 736  BYTES                            
