*          DATA SET PPSERPP    AT LEVEL 003 AS OF 01/17/01                      
*                                                                               
*       PRINTPAK SERIAL NUMBER PASSIVE POINTER                                  
*                                                                               
PSERKEY  DS    0CL25                                                            
PSERKAGY DS    CL2                 AGENCY CODE                                  
PSERKMED DS    CL1                 MEDIA                                        
PSERKRCD DS    XL1'99'                                                          
PSERKIDQ EQU   X'99'               SERIAL # PP RECORD ID                        
PSERKCLT DS    CL3                 CLIENT CODE                                  
PSERKNUM DS    CL5                 9'S COMPLEMENT OF SERIAL #                   
*                                  PACKED (LAST BYTE X'?C'                      
         DS    CL13                SPARE                                        
*                                                                               
PSERCNTL DS    XL2                                                              
PSERDISK DS    XL4                 DISK ADDRESS (PBUYREC)                       
