*          DATA SET PPSFMFFD   AT LEVEL 002 AS OF 10/06/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T407FFD      DATE 10/06/83                 
         SPACE 1                                                                
T407FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
HDRMSGH  DS    CL8                                                              
HDRMSG   DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      3    2    6   A    P    N         T         Y           
HDRRECH  DS    CL8                                                              
HDRREC   DS    CL8      3    9    8   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL6      3   27    6   A    P    N         T         Y           
HDRACTH  DS    CL8                                                              
HDRACT   DS    CL7      3   34    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      5    2    6   A    P    N         T         Y           
HDRAGYH  DS    CL8                                                              
HDRAGY   DS    CL2      5   22    2   A    U    N         T         Y           
HDRAGYNH DS    CL8                                                              
HDRAGYN  DS    CL33     5   26   33   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      6    2    5   A    P    N         T         Y           
HDRMEDH  DS    CL8                                                              
HDRMED   DS    CL2      6   22    2   A    U    N         T         Y           
HDRMEDNH DS    CL8                                                              
HDRMEDN  DS    CL10     6   26   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1      6   57    1   A    U    N         T         Y           
HDRLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
HDRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 270  BYTES                            
