*          DATA SET PPSRCHPARM AT LEVEL 002 AS OF 08/13/91                      
* PRINTPAK PARAMETER STRING FOR NAME-SEARCH CALL (SRCHCALL P4)                  
*                                                                               
DSPARM   DS    0C                                                               
DSMEDCOD DS    CL1                 MEDIA CODE                                   
DSMEDNAM DS    CL10                MEDIA NAME                                   
DSCLICOD DS    CL3                 CLIENT CODE FROM CLIENT RECORD               
DSLIOFF  DS    CL1                 OFFICE CODE                                  
DSPRDCOD DS    CL3                 PRODUCT CODE                                 
DSPARML  EQU   *-DSPARM                                                         
