*          DATA SET PPWIOFED   AT LEVEL 003 AS OF 12/17/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41EFED      DATE 12/17/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
HDLTLH   DS    XL8                                                              
HDLTL    DS    CL16     5   30   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
HDLMEDH  DS    XL8                                                              
HDLMED   DS    CL2      7   10    2  A  U N             T    I   Y   10         
HDLMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   16    6  A  P N             T        Y              
HDLCLTH  DS    XL8                                                              
HDLCLT   DS    CL4      7   26    4  A  U N             T        Y   20         
HDLCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   38    3  A  P N             T        Y              
HDLPUBH  DS    XL8                                                              
HDLPUB   DS    CL16     7   42   16  A  U N             T        Y   30         
HDLPUBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   60    7  A  P N             T        Y              
HDLPRDH  DS    XL8                                                              
HDLPRD   DS    CL4      7   70    4  A  U N             T        Y   40         
HDLPRDX  DS    XL8                                                              
HDLMEDNH DS    XL8                                                              
HDLMEDN  DS    CL12     8    2   12  A  P N             T        Y              
HDLCLTNH DS    XL8                                                              
HDLCLTN  DS    CL20     8   16   20  A  P N             T        Y              
HDLPUBNH DS    XL8                                                              
HDLPUBN  DS    CL20     8   38   20  A  P N             T        Y              
HDLPRDNH DS    XL8                                                              
HDLPRDN  DS    CL20     8   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
HDLPERH  DS    XL8                                                              
HDLPER   DS    CL17     9   13   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   38    8  A  P N             T        Y              
HDLESTH  DS    XL8                                                              
HDLEST   DS    CL5      9   48    5  A  U N             T        Y   50         
HDLESTX  DS    XL8                                                              
HDLESTNH DS    XL8                                                              
HDLESTN  DS    CL20     9   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
HDLIO#H  DS    XL8                                                              
HDLIO#   DS    CL10    10   13   10  A  U N             T        Y   60         
HDLIO#X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL38    12    2   38  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL35    12   41   35  A  P H             T        Y              
HDLSELH  DS    XL8                                                              
HDLSEL   DS    CL3     13    2    3  A  U N             T        Y  225         
HDLSELX  DS    XL8                                                              
HDLLIN1H DS    XL8                                                              
HDLLIN1  DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
HDLLIN2H DS    XL8                                                              
HDLLIN2  DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
HDLSELLH DS    XL8                                                              
HDLSELL  DS    CL3     23    2    3  A  U N             T        Y  225         
HDLSELLX DS    XL8                                                              
HDLLINLH DS    XL8                                                              
HDLLINL  DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
HDLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
HDLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
