*          DATA SET PPWIOFAD   AT LEVEL 001 AS OF 09/19/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41EFAD      DATE 09/19/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LFXTTLH  DS    XL8                                                              
LFXTTL   DS    CL21     5   31   21  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
LFXMEDH  DS    XL8                                                              
LFXMED   DS    CL2      7   12    2  A  U N             T        Y    5         
LFXMEDX  DS    XL8                                                              
LFXMEDNH DS    XL8                                                              
LFXMEDN  DS    CL15     7   15   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   42    6  A  P H             T        Y              
LFXCLTH  DS    XL8                                                              
LFXCLT   DS    CL4      7   52    4  A  U N             T        Y   10         
LFXCLTX  DS    XL8                                                              
LFXCLTNH DS    XL8                                                              
LFXCLTN  DS    CL20     7   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
LFXPUBH  DS    XL8                                                              
LFXPUB   DS    CL16     8   12   16  A  U N             T        Y   20         
LFXPUBX  DS    XL8                                                              
LFXPUBNH DS    XL8                                                              
LFXPUBN  DS    CL40     8   30   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P H             T        Y              
LFXIO#H  DS    XL8                                                              
LFXIO#   DS    CL20     9   12   20  A  U N             T        Y   50         
LFXIO#X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   42    6  A  P N             T        Y              
LFXREV#H DS    XL8                                                              
LFXREV#  DS    CL4      9   52    4  A  U N             T        Y   55         
LFXREV#X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P H             T        Y              
LFXPERH  DS    XL8                                                              
LFXPER   DS    CL20    10   12   20  A  U N             T        Y   56         
LFXPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    12    2   34  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL35    12   38   35  A  P H             T        Y              
LFXSELH  DS    XL8                                                              
LFXSEL   DS    CL3     13    2    3  A  U N             T        Y  225         
LFXSELX  DS    XL8                                                              
LFXLIN1H DS    XL8                                                              
LFXLIN1  DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
LFXLIN2H DS    XL8                                                              
LFXLIN2  DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
LFXSELLH DS    XL8                                                              
LFXSELL  DS    CL3     23    2    3  A  U N             T        Y  225         
LFXSELLX DS    XL8                                                              
LFXLINLH DS    XL8                                                              
LFXLINL  DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
LFXLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
LFXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
