*          DATA SET PPWIOF0D   AT LEVEL 007 AS OF 09/28/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41EF0D      DATE 09/28/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LSTTTLH  DS    XL8                                                              
LSTTTL   DS    CL21     5   31   21  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
LSTMEDH  DS    XL8                                                              
LSTMED   DS    CL2      7   12    2  A  U N             T        Y    5         
LSTMEDX  DS    XL8                                                              
LSTMEDNH DS    XL8                                                              
LSTMEDN  DS    CL15     7   15   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   42    6  A  P H             T        Y              
LSTCLTH  DS    XL8                                                              
LSTCLT   DS    CL4      7   52    4  A  U N             T        Y   10         
LSTCLTX  DS    XL8                                                              
LSTCLTNH DS    XL8                                                              
LSTCLTN  DS    CL20     7   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
LSTPUBH  DS    XL8                                                              
LSTPUB   DS    CL16     8   12   16  A  U N             T        Y   20         
LSTPUBX  DS    XL8                                                              
LSTPUBNH DS    XL8                                                              
LSTPUBN  DS    CL40     8   30   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P H             T        Y              
LSTIO#H  DS    XL8                                                              
LSTIO#   DS    CL20     9   12   20  A  U N             T        Y   50         
LSTIO#X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   42    6  A  P N             T        Y              
LSTREV#H DS    XL8                                                              
LSTREV#  DS    CL4      9   52    4  A  U N             T        Y   55         
LSTREV#X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P H             T        Y              
LSTPERH  DS    XL8                                                              
LSTPER   DS    CL20    10   12   20  A  U N             T        Y   56         
LSTPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12    2    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    12    6   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     12   48    5  A  P H             T        Y              
LSTSELH  DS    XL8                                                              
LSTSEL   DS    CL3     13    2    3  A  U N             T        Y  225         
LSTSELX  DS    XL8                                                              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
LSTLIN2H DS    XL8                                                              
LSTLIN2  DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y  225         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
LSTSELLH DS    XL8                                                              
LSTSELL  DS    CL3     23    2    3  A  U N             T        Y  225         
LSTSELLX DS    XL8                                                              
LSTLINLH DS    XL8                                                              
LSTLINL  DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1656 BYTES                            
