*          DATA SET PPWIOFFD   AT LEVEL 005 AS OF 09/28/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41EFFD      DATE 09/28/04                 
         SPACE 1                                                                
T41EFFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CONHEADH DS    XL8                                                              
CONHEAD  DS    CL60     1    2   60  A  P N             T        Y              
CONSERVH DS    XL8                                                              
CONSERV  DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      3    2    7  A  P H             T        Y              
CONRECH  DS    XL8                                                              
CONREC   DS    CL8      3   10    8  A  U N             T    I   Y    1         
CONRECX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      3   20    7  A  P H             T        Y              
CONACTH  DS    XL8                                                              
CONACT   DS    CL8      3   28    8  A  U N             T        Y    2         
CONACTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      3   38    7  A  P N             T        Y              
CONKEYH  DS    XL8                                                              
CONKEY   DS    CL34     3   46   34  A  U N             T        Y    3         
CONKEYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
CONWHENH DS    XL8                                                              
CONWHEN  DS    CL8      4   10    8  A  U N             T        Y    4         
CONWHENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P N             T        Y              
CONOUTH  DS    XL8                                                              
CONOUT   DS    CL8      4   28    8  A  U N             T        Y    5         
CONOUTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P N             T        Y              
CONDESTH DS    XL8                                                              
CONDEST  DS    CL8      4   46    8  A  U N             T        Y    6         
CONDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   56    7  A  P N             T        Y              
CONOTHH  DS    XL8                                                              
CONOTH   DS    CL16     4   64   16  A  U N             T        Y    7         
CONOTHX  DS    XL8                                                              
CONTAGH  DS    XL8                                                              
CONTAG   DS    CL1      5    2    1  A  P N             T        Y              
CONLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
