*          DATA SET PPWWREC    AT LEVEL 027 AS OF 07/08/94                      
PPWWREC  DSECT                     ** WESTERN PUB FILE ***                      
PWJGNKCD DS    CL6             OPS ABC CODE                  001-006            
PWNEAAD# DS    PL5    8.0      OPS JDE AGENCY ADDRESS#       007-011            
PWNEBAD1 DS    CL45            OPS NEWSPAPER BILL.ADDR 1     012-056            
PWNEBAD2 DS    CL45            OPS NEWSPAPER BILL.ADDR 2     057-101            
PWNEBCTY DS    CL30            OPS BILLING CITY              102-131            
PWNEBST  DS    CL2             OPS BILLING STATE             132-133            
PWNEBZP1 DS    PL3    5.0      OPS BILLING ZIP #1            134-136            
PWNEBZP2 DS    PL3    4.0      OPS BILLING ZIP #2            137-139            
PWNEBCON DS    CL3             OPS BILLING COUNTRY           140-142            
PWNECOMI DS    PL3    4.2      OPS COMMISSION                143-145            
PWNETAX  DS    PL3    5.3      OPS TAX                       146-148            
PWNEINPG DS    PL4    7.3      OPS INCHES PER PAGE           149-152            
PWNEMAD1 DS    CL45            OPS NEWSPAPER MAIL.ADDR 1     153-197            
PWNEMAD2 DS    CL45            OPS NEWSPAPER MAIL.ADDR 2     198-242            
PWNEMCTY DS    CL30            OPS MAILING CITY              243-272            
PWNEMST  DS    CL2             OPS MAILING STATE             273-274            
PWNEMZP1 DS    PL3    5.0      OPS MAILING ZIP #1            275-277            
PWNEMZP2 DS    PL3    4.0      OPS MAILING ZIP #2            278-280            
PWNEMCON DS    CL3             OPS MAILING COUNTRY           281-283            
PWNENAD# DS    PL5    8.0      OPS JDE NEWSPAPER ADDR#       284-288            
PWNENAME DS    CL45            OPS NEWSPAPER NAME            289-333            
PWNENEW# DS    PL4    7.0      OPS NEWSPAPER NUMBER          334-337            
PWNENTYP DS    CL2             OPS NEWSPAPER TYPE CODE       338-339            
PWNEPRFX DS    CL15            OPS NEWSPAPER NAME PREFIX     340-354            
PWNEPUBL DS    CL45            OPS PUBLISHER                 355-399            
PWNEREP  DS    CL6             OPS REP CODE                  400-405            
PWNEST   DS    CL2             OPS STATE                     406-407            
PWNECOUN DS    CL3             OPS COUNTRY                   408-410            
PWJGMVCD DS    CL5             OPS NEW SP MV ID              411-415            
PWJGMWCD DS    CL5             OPS NEW MATCH SP MV ID        416-420            
PWJGPKSF DS    CL1             OPS CONVERSION STATUS         421-421            
PWJGBBTX DS    CL35            SP MEDIA VENDOR LONG NAME     422-456            
PWJGBCTX DS    CL15            SP MEDIA VENDOR SHORT NME     457-471            
PWJGBBST DS    CL1             SP MEDIA VENDOR TYPE          472-472            
PWJGBCST DS    CL1             SP MEDIA VENDOR GROUP Y/N     473-473            
PWJGBDST DS    CL1             SP MEDIA VENDOR STATUS        474-474            
PWJGAGDT DS    PL3    4.0      SP MV ESTABLISHED DATE        475-477            
PWJGAHDT DS    PL4    7.0      SP MV ACTIVE DATE             478-481            
PWJGAIDT DS    PL4    7.0      SP MV INACTIVE DATA           482-485            
PWJGAJDT DS    PL4    7.0      SP MV ON HOLD DATE            486-489            
PWJGAKDT DS    PL4    7.0      SP MV REACTIVATION DATE       490-493            
PWJGC3CD DS    CL15            SP MV ACCT# FOR WIMC          494-508            
PWJGJ6ST DS    CL1             SP MV VEHICLE TYPE            509-509            
PWJGSCTX DS    CL21            SP MV CITY NAME               510-530            
PWJGXHST DS    CL1             SP MV COMMENTS Y/N            531-531            
PWJGMNNB DS    PL1    1.0      SP MV ARTWORK COPIES NBR      532-532            
PWJGMONB DS    PL1    1.0      SP MV INSERTION ORDER CPY     533-533            
PWJGACCD DS    CL3             COUNTRY CODE                  534-536            
PWJGAGCD DS    CL2             STATE CODE                    537-538            
PWJGB2NB DS    PL4    7.0      CITY CODE                     539-542            
PWJGB4NB DS    PL3    5.0      COUNTRY CODE                  543-545            
PWJGDVNB DS    PL2    3.0      CONT. FORMULA SEQ#            546-547            
PWJGC7CD DS    CL4             PUBLICATION FREQUENCY ID      548-551            
