*          DATA SET PREGREC    AT LEVEL 009 AS OF 02/17/10                      
PREGREC  DS    0C .                *** PRINTPAK - REGION RECORD ***             
*                                                                               
*                                                                               
PREGKEY  DS    0CL25                                                            
PREGKAGY DS    CL2 .     A         AGENCY CODE                                  
PREGKMED DS    CL1 .     A         PRINT MEDIA CODE                             
PREGKRCD DS    X'04' .   B         RECORD CODE                                  
PREGKCLT DS    CL3 .     A         CLIENT CODE                                  
PREGKDIV DS    CL3 .     N         DIVISION (000=ALL DIVISIONS)                 
PREGKREG DS    CL3 .     N         REGION CODE                                  
         DS    12X'00'                                                          
*                                                                               
PREGLEN  DS    CL2 .     B         RECORD LENGTH                                
*                                                                               
PREGCNTL DS    CL2 .     B         CONTROL BYTES                                
         DS    CL4 .     B         DISK ADDRESS FOR LINKED RECORDS              
*                                                                               
PREGELEM DS    0C                                                               
         DS    X'04' .   B         ELEMENT CODE                                 
         DS    CL1 .     B         ELEMENT LENGTH                               
PREGNAME DS    CL20 .    AN        REGION NAME                                  
         DS    CL10 .              SPARE                                        
PREGREP  DS    CL4 .               BILLING REP                                  
         DS    CL104 .             SPARE                                        
