*          DATA SET PRINTSES   AT LEVEL 012 AS OF 02/14/13                      
*                                  TABLE OF PRINT                               
*                                  FILE NUMS AND SE'S                           
PRINTSES DS    0X                                                               
         DC    C'1',X'04'                                                       
         DC    C'2',X'14'                                                       
         DC    C'3',X'24'                                                       
         DC    C'4',X'34'                                                       
         DC    C'5',X'44'        ADDED 3/15/88                                  
         DC    C'6',X'54'        ADDED 1/17/90   BAP                            
         DC    C'7',X'64'        ADDED 2/02/93   BAP                            
         DC    C'8',X'74'        ADDED 4/13/94   BAP                            
         DC    C'9',X'84'        ADDED DEC/96    BAP                            
         DC    C'T',X'94'        ADDED MAY/01 REFRESHABLE TEST FILE             
         DC    C'Z',X'C4'        ADDED FEB/13                                   
         DC    X'FFFF'                                                          
         DC    XL2'00'                                                          
*                                                                               
