*          DATA SET PRMEDSCRND AT LEVEL 004 AS OF 05/01/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CF3D      DATE 05/01/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
PRTMEDH  DS    CL8                                                              
PRTMED   DS    CL3      5   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
PRTCLTH  DS    CL8                                                              
PRTCLT   DS    CL3      6   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PRTPRDH  DS    CL8                                                              
PRTPRD   DS    CL3      7   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
PRTESTH  DS    CL8                                                              
PRTEST   DS    CL3      8   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A   P    N         T        Y              
PRTPUBH  DS    CL8                                                              
PRTPUB   DS    CL8      9   15    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    N         T        Y              
PRTDIVH  DS    CL8                                                              
PRTDIV   DS    CL3     10   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    N         T        Y              
PRTREGH  DS    CL8                                                              
PRTREG   DS    CL3     11   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    N         T        Y              
PRTDSTH  DS    CL8                                                              
PRTDST   DS    CL3     12   15    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A   P    N         T        Y              
PRTSTRTH DS    CL8                                                              
PRTSTRT  DS    CL8     13   15    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
PRTENDH  DS    CL8                                                              
PRTEND   DS    CL8     14   15    8  A   U    N         T        Y              
PRTTAGH  DS    CL8                                                              
PRTTAG   DS    CL1     15    2    1  A   P    N         T        Y              
PRTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 295  BYTES                            
