*          DATA SET PROFELEM   AT LEVEL 004 AS OF 05/14/75                      
PROFELEM DS    0C                  *** FILM PROFILE ELEMENT ***                 
PRCODE   DS    X'20'               ELEMENT CODE                                 
PRLEN    DS    CL1 . B             ELEMENT LENGTH                               
PRSTART  DS    CL3 . B             RELEASE DATE                                 
PREND    DS    CL3 . B             RECALL DATE                                  
PRSTYPE  DS    CL1 . A             STATION TYPE                                 
PRPBCDE  DS    CL1 . A             PIGGYBACK CONTROL                            
*                                     S=SOLO                                    
*                                     P=PIGGYBACK ONLY                          
*                                     BLANK = NO RESTICTIONS                    
PRTITLE  DS    CL15 . A            FILM TITLE                                   
PRSIM    DS    CL8 . A/N           CANNISTER NUMBER                             
PRMED    DS    CL1 . A             TRANSMISSION MEDIUM                          
*                                     T = VIDEO TAPE                            
*                                     F = FILM                                  
PRCOMP   DS    CL1 . A             COMPOSITION                                  
*                                    C = COLOR                                  
*                                     B = BLACK AND WHITE                       
PRAOR    DS    CL3 . A             AGENCY OF RECORD                             
PRTYPE   DS    CL2                 TYPE                                         
*                                   16=16MM FILM                                
*                                   35=35MM FILM                                
*                                   HB=HIGH BAND TAPE                           
*                                   LB=LOW BAND TAPE                            
PRDISP   DS    CL1                 DISPOSITION                                  
*                                   H =HOLD FOR FUTURE USE                      
*                                   R =RESHIP                                   
*                                   D =DESTROY                                  
PRTYPE1  DS    CL3                 TRANSMISSION MEDIUM (NEW)                    
         DS    CL10                                                             
PRACTION DS    CL1                 ACTIVITY CODE                                
*                                   X'01' = ADD                                 
*                                   X'02' = CHANGE                              
PRADTE   DS    CL3                 ACTIVITY DATE                                
