*          DATA SET PROFCOM    AT LEVEL 001 AS OF 05/14/75                      
PROFCOM  DS    X'21'               ***FILM PROFILE COMMENT ELEMENT***           
PRCLEN   DS    CL1 . B             ELEMENT LENGTH                               
PRCOMNO  DS    CL1 . B             COMMENT NUMBER                               
PRCOMENT DS    CL1 . A/N           COMMENT                                      
