*          DATA SET PRREQFFD   AT LEVEL 006 AS OF 01/05/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T412FFD      DATE 01/05/00                 
         SPACE 1                                                                
T412FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BVRHDRH  DS    CL8                                                              
BVRHDR   DS    CL60     1    2   60  A  P N             T        Y              
BVRSRVH  DS    CL8                                                              
BVRSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      3    2    9  A  P N             T        Y              
BVRNAMEH DS    CL8                                                              
BVRNAME  DS    CL30     3   15   30  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL10     4    2   10  A  P N             T        Y              
BVRNUMH  DS    CL8                                                              
BVRNUM   DS    CL10     4   15   10  A  U N             T        Y              
BVRRNAMH DS    CL8                                                              
BVRRNAM  DS    CL22     4   32   22  A  P N             N        Y              
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
BVRMEDH  DS    CL8                                                              
BVRMED   DS    CL2      5   15    2  A  U N             T        Y              
BVRMEDNH DS    CL8                                                              
BVRMEDN  DS    CL10     5   19   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     5   31   11  A  P N             T        Y              
BVRDESTH DS    CL8                                                              
BVRDEST  DS    CL8      5   44    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     5   54   11  A  P N             T        Y              
BVROUTH  DS    CL8                                                              
BVROUT   DS    CL8      5   66    8  A  U N             T        Y              
BVRFRSTH DS    CL8                                                              
BVRFRST  DS    CL1      5   77    1  A  U N             T        Y              
BVRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BVRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 408  BYTES                            
