*          DATA SET PRREQFDD   AT LEVEL 005 AS OF 04/15/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T412FDD      DATE 04/15/96                 
         SPACE 1                                                                
T412FDD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL67     7    2   67  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL67     8    2   67  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  A  P N             T        Y              
CRDDATAH DS    CL8                                                              
CRDDATA  DS    CL78    10    2   78  A  U N             T        N              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y              
CRDLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 576  BYTES                            
