*          DATA SET PRSFMFED   AT LEVEL 008 AS OF 09/16/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CFED      DATE 09/16/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SUSMEDH  DS    CL8                                                              
SUSMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SUSPUBH  DS    CL8                                                              
SUSPUB   DS    CL15     5   28   15  A  U N             T        Y              
SUSPUBNH DS    CL8                                                              
SUSPUBN  DS    CL20     5   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     7    2   17  A  P N             T        Y              
SUSEDR1H DS    CL8                                                              
SUSEDR1  DS    CL10     7   20   10  A  U N             T        Y              
SUSEDR2H DS    CL8                                                              
SUSEDR2  DS    CL10     7   32   10  A  U N             T        Y              
SUSEDR3H DS    CL8                                                              
SUSEDR3  DS    CL10     7   44   10  A  U N             T        Y              
SUSEDR4H DS    CL8                                                              
SUSEDR4  DS    CL10     7   56   10  A  U N             T        Y              
SUSEDR6H DS    CL8                                                              
SUSEDR6  DS    CL12     7   68   12  A  U N             T        Y              
SUSEDR7H DS    CL8                                                              
SUSEDR7  DS    CL10     8   20   10  A  U N             T        Y              
SUSEDR8H DS    CL8                                                              
SUSEDR8  DS    CL10     8   32   10  A  U N             T        Y              
SUSEDR9H DS    CL8                                                              
SUSEDR9  DS    CL10     8   44   10  A  U N             T        Y              
SUSEDRAH DS    CL8                                                              
SUSEDRA  DS    CL10     8   56   10  A  U N             T        Y              
SUSEDRBH DS    CL8                                                              
SUSEDRB  DS    CL12     8   68   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    10   34   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    6   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   34    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   38   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   49    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   53   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   64    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   68   10  A  P N             T        Y              
SUSAC11H DS    CL8                                                              
SUSAC11  DS    CL3     13    2    3  A  U N             T        Y              
SUSEX11H DS    CL8                                                              
SUSEX11  DS    CL10    13    6   10  A  U N             T        Y              
SUSAC12H DS    CL8                                                              
SUSAC12  DS    CL3     13   18    3  A  U N             T        Y              
SUSEX12H DS    CL8                                                              
SUSEX12  DS    CL10    13   22   10  A  U N             T        Y              
SUSAC13H DS    CL8                                                              
SUSAC13  DS    CL3     13   34    3  A  U N             T        Y              
SUSEX13H DS    CL8                                                              
SUSEX13  DS    CL10    13   38   10  A  U N             T        Y              
SUSAC14H DS    CL8                                                              
SUSAC14  DS    CL3     13   49    3  A  U N             T        Y              
SUSEX14H DS    CL8                                                              
SUSEX14  DS    CL10    13   53   10  A  U N             T        Y              
SUSAC15H DS    CL8                                                              
SUSAC15  DS    CL3     13   64    3  A  U N             T        Y              
SUSEX15H DS    CL8                                                              
SUSEX15  DS    CL10    13   68   10  A  U N             T        Y              
SUSAC21H DS    CL8                                                              
SUSAC21  DS    CL3     14    2    3  A  U N             T        Y              
SUSEX21H DS    CL8                                                              
SUSEX21  DS    CL10    14    6   10  A  U N             T        Y              
SUSAC22H DS    CL8                                                              
SUSAC22  DS    CL3     14   18    3  A  U N             T        Y              
SUSEX22H DS    CL8                                                              
SUSEX22  DS    CL10    14   22   10  A  U N             T        Y              
SUSAC23H DS    CL8                                                              
SUSAC23  DS    CL3     14   34    3  A  U N             T        Y              
SUSEX23H DS    CL8                                                              
SUSEX23  DS    CL10    14   38   10  A  U N             T        Y              
SUSAC24H DS    CL8                                                              
SUSAC24  DS    CL3     14   49    3  A  U N             T        Y              
SUSEX24H DS    CL8                                                              
SUSEX24  DS    CL10    14   53   10  A  U N             T        Y              
SUSAC25H DS    CL8                                                              
SUSAC25  DS    CL3     14   64    3  A  U N             T        Y              
SUSEX25H DS    CL8                                                              
SUSEX25  DS    CL10    14   68   10  A  U N             T        Y              
SUSAC31H DS    CL8                                                              
SUSAC31  DS    CL3     15    2    3  A  U N             T        Y              
SUSEX31H DS    CL8                                                              
SUSEX31  DS    CL10    15    6   10  A  U N             T        Y              
SUSAC32H DS    CL8                                                              
SUSAC32  DS    CL3     15   18    3  A  U N             T        Y              
SUSEX32H DS    CL8                                                              
SUSEX32  DS    CL10    15   22   10  A  U N             T        Y              
SUSAC33H DS    CL8                                                              
SUSAC33  DS    CL3     15   34    3  A  U N             T        Y              
SUSEX33H DS    CL8                                                              
SUSEX33  DS    CL10    15   38   10  A  U N             T        Y              
SUSAC34H DS    CL8                                                              
SUSAC34  DS    CL3     15   49    3  A  U N             T        Y              
SUSEX34H DS    CL8                                                              
SUSEX34  DS    CL10    15   53   10  A  U N             T        Y              
SUSAC35H DS    CL8                                                              
SUSAC35  DS    CL3     15   64    3  A  U N             T        Y              
SUSEX35H DS    CL8                                                              
SUSEX35  DS    CL10    15   68   10  A  U N             T        Y              
SUSAC41H DS    CL8                                                              
SUSAC41  DS    CL3     16    2    3  A  U N             T        Y              
SUSEX41H DS    CL8                                                              
SUSEX41  DS    CL10    16    6   10  A  U N             T        Y              
SUSAC42H DS    CL8                                                              
SUSAC42  DS    CL3     16   18    3  A  U N             T        Y              
SUSEX42H DS    CL8                                                              
SUSEX42  DS    CL10    16   22   10  A  U N             T        Y              
SUSAC43H DS    CL8                                                              
SUSAC43  DS    CL3     16   34    3  A  U N             T        Y              
SUSEX43H DS    CL8                                                              
SUSEX43  DS    CL10    16   38   10  A  U N             T        Y              
SUSAC44H DS    CL8                                                              
SUSAC44  DS    CL3     16   49    3  A  U N             T        Y              
SUSEX44H DS    CL8                                                              
SUSEX44  DS    CL10    16   53   10  A  U N             T        Y              
SUSAC45H DS    CL8                                                              
SUSAC45  DS    CL3     16   64    3  A  U N             T        Y              
SUSEX45H DS    CL8                                                              
SUSEX45  DS    CL10    16   68   10  A  U N             T        Y              
SUSAC51H DS    CL8                                                              
SUSAC51  DS    CL3     17    2    3  A  U N             T        Y              
SUSEX51H DS    CL8                                                              
SUSEX51  DS    CL10    17    6   10  A  U N             T        Y              
SUSAC52H DS    CL8                                                              
SUSAC52  DS    CL3     17   18    3  A  U N             T        Y              
SUSEX52H DS    CL8                                                              
SUSEX52  DS    CL10    17   22   10  A  U N             T        Y              
SUSAC53H DS    CL8                                                              
SUSAC53  DS    CL3     17   34    3  A  U N             T        Y              
SUSEX53H DS    CL8                                                              
SUSEX53  DS    CL10    17   38   10  A  U N             T        Y              
SUSAC54H DS    CL8                                                              
SUSAC54  DS    CL3     17   49    3  A  U N             T        Y              
SUSEX54H DS    CL8                                                              
SUSEX54  DS    CL10    17   53   10  A  U N             T        Y              
SUSAC55H DS    CL8                                                              
SUSAC55  DS    CL3     17   64    3  A  U N             T        Y              
SUSEX55H DS    CL8                                                              
SUSEX55  DS    CL10    17   68   10  A  U N             T        Y              
SUSAC61H DS    CL8                                                              
SUSAC61  DS    CL3     18    2    3  A  U N             T        Y              
SUSEX61H DS    CL8                                                              
SUSEX61  DS    CL10    18    6   10  A  U N             T        Y              
SUSAC62H DS    CL8                                                              
SUSAC62  DS    CL3     18   18    3  A  U N             T        Y              
SUSEX62H DS    CL8                                                              
SUSEX62  DS    CL10    18   22   10  A  U N             T        Y              
SUSAC63H DS    CL8                                                              
SUSAC63  DS    CL3     18   34    3  A  U N             T        Y              
SUSEX63H DS    CL8                                                              
SUSEX63  DS    CL10    18   38   10  A  U N             T        Y              
SUSAC64H DS    CL8                                                              
SUSAC64  DS    CL3     18   49    3  A  U N             T        Y              
SUSEX64H DS    CL8                                                              
SUSEX64  DS    CL10    18   53   10  A  U N             T        Y              
SUSAC65H DS    CL8                                                              
SUSAC65  DS    CL3     18   64    3  A  U N             T        Y              
SUSEX65H DS    CL8                                                              
SUSEX65  DS    CL10    18   68   10  A  U N             T        Y              
SUSAC71H DS    CL8                                                              
SUSAC71  DS    CL3     19    2    3  A  U N             T        Y              
SUSEX71H DS    CL8                                                              
SUSEX71  DS    CL10    19    6   10  A  U N             T        Y              
SUSAC72H DS    CL8                                                              
SUSAC72  DS    CL3     19   18    3  A  U N             T        Y              
SUSEX72H DS    CL8                                                              
SUSEX72  DS    CL10    19   22   10  A  U N             T        Y              
SUSAC73H DS    CL8                                                              
SUSAC73  DS    CL3     19   34    3  A  U N             T        Y              
SUSEX73H DS    CL8                                                              
SUSEX73  DS    CL10    19   38   10  A  U N             T        Y              
SUSAC74H DS    CL8                                                              
SUSAC74  DS    CL3     19   49    3  A  U N             T        Y              
SUSEX74H DS    CL8                                                              
SUSEX74  DS    CL10    19   53   10  A  U N             T        Y              
SUSAC75H DS    CL8                                                              
SUSAC75  DS    CL3     19   64    3  A  U N             T        Y              
SUSEX75H DS    CL8                                                              
SUSEX75  DS    CL10    19   68   10  A  U N             T        Y              
SUSAC81H DS    CL8                                                              
SUSAC81  DS    CL3     20    2    3  A  U N             T        Y              
SUSEX81H DS    CL8                                                              
SUSEX81  DS    CL10    20    6   10  A  U N             T        Y              
SUSAC82H DS    CL8                                                              
SUSAC82  DS    CL3     20   18    3  A  U N             T        Y              
SUSEX82H DS    CL8                                                              
SUSEX82  DS    CL10    20   22   10  A  U N             T        Y              
SUSAC83H DS    CL8                                                              
SUSAC83  DS    CL3     20   34    3  A  U N             T        Y              
SUSEX83H DS    CL8                                                              
SUSEX83  DS    CL10    20   38   10  A  U N             T        Y              
SUSAC84H DS    CL8                                                              
SUSAC84  DS    CL3     20   49    3  A  U N             T        Y              
SUSEX84H DS    CL8                                                              
SUSEX84  DS    CL10    20   53   10  A  U N             T        Y              
SUSAC85H DS    CL8                                                              
SUSAC85  DS    CL3     20   64    3  A  U N             T        Y              
SUSEX85H DS    CL8                                                              
SUSEX85  DS    CL10    20   68   10  A  U N             T        Y              
SUSAC91H DS    CL8                                                              
SUSAC91  DS    CL3     21    2    3  A  U N             T        Y              
SUSEX91H DS    CL8                                                              
SUSEX91  DS    CL10    21    6   10  A  U N             T        Y              
SUSAC92H DS    CL8                                                              
SUSAC92  DS    CL3     21   18    3  A  U N             T        Y              
SUSEX92H DS    CL8                                                              
SUSEX92  DS    CL10    21   22   10  A  U N             T        Y              
SUSAC93H DS    CL8                                                              
SUSAC93  DS    CL3     21   34    3  A  U N             T        Y              
SUSEX93H DS    CL8                                                              
SUSEX93  DS    CL10    21   38   10  A  U N             T        Y              
SUSAC94H DS    CL8                                                              
SUSAC94  DS    CL3     21   49    3  A  U N             T        Y              
SUSEX94H DS    CL8                                                              
SUSEX94  DS    CL10    21   53   10  A  U N             T        Y              
SUSAC95H DS    CL8                                                              
SUSAC95  DS    CL3     21   64    3  A  U N             T        Y              
SUSEX95H DS    CL8                                                              
SUSEX95  DS    CL10    21   68   10  A  U N             T        Y              
SUSACL1H DS    CL8                                                              
SUSACL1  DS    CL3     22    2    3  A  U N             T        Y              
SUSEXL1H DS    CL8                                                              
SUSEXL1  DS    CL10    22    6   10  A  U N             T        Y              
SUSACL2H DS    CL8                                                              
SUSACL2  DS    CL3     22   18    3  A  U N             T        Y              
SUSEXL2H DS    CL8                                                              
SUSEXL2  DS    CL10    22   22   10  A  U N             T        Y              
SUSACL3H DS    CL8                                                              
SUSACL3  DS    CL3     22   34    3  A  U N             T        Y              
SUSEXL3H DS    CL8                                                              
SUSEXL3  DS    CL10    22   38   10  A  U N             T        Y              
SUSACL4H DS    CL8                                                              
SUSACL4  DS    CL3     22   49    3  A  U N             T        Y              
SUSEXL4H DS    CL8                                                              
SUSEXL4  DS    CL10    22   53   10  A  U N             T        Y              
SUSACL5H DS    CL8                                                              
SUSACL5  DS    CL3     22   64    3  A  U N             T        Y              
SUSEXL5H DS    CL8                                                              
SUSEXL5  DS    CL10    22   68   10  A  U N             T        Y              
SUSLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SUSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
