*          DATA SET PRSFMC7D   AT LEVEL 005 AS OF 02/12/19                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CC7D      DATE 02/12/19                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
CL2MEDH  DS    XL8                                                              
CL2MED   DS    CL1      6   10    1  A  U N             T        Y   10         
CL2MEDX  DS    XL8                                                              
CL2MEDNH DS    XL8                                                              
CL2MEDN  DS    CL10     6   15   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   36    6  A  P H             T        Y              
CL2CLTH  DS    XL8                                                              
CL2CLT   DS    CL3      6   45    3  A  U N             T        Y   15         
CL2CLTX  DS    XL8                                                              
CL2CLTNH DS    XL8                                                              
CL2CLTN  DS    CL20     6   50   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     7    2   15  A  P N             T        Y              
CL2CEXNH DS    XL8                                                              
CL2CEXN  DS    CL50     7   20   50  A  U N             T        Y   25         
CL2CEXNX DS    XL8                                                              
CL2CDTLH DS    XL8                                                              
CL2CDTL  DS    CL16     8    2   16  A  P N             T        Y              
CL2CDIVH DS    XL8                                                              
CL2CDIV  DS    CL1      8   29    1  A  U N             T        Y   30         
CL2CDIVX DS    XL8                                                              
CL2MNTLH DS    XL8                                                              
CL2MNTL  DS    CL19     8   36   19  A  P N             T        Y              
CL2MNOVH DS    XL8                                                              
CL2MNOV  DS    CL10     8   64   10  A  U N             T        Y   32         
CL2MNOVX DS    XL8                                                              
CL2BDTLH DS    XL8                                                              
CL2BDTL  DS    CL25     9    2   25  A  P N             T        Y              
CL2BDCOH DS    XL8                                                              
CL2BDCO  DS    CL1      9   29    1  A  U N             T        Y   35         
CL2BDCOX DS    XL8                                                              
CL2SFTLH DS    XL8                                                              
CL2SFTL  DS    CL26     9   36   26  A  P N             T        Y              
CL2SFHH  DS    XL8                                                              
CL2SFH   DS    CL1      9   64    1  A  U N             T        Y   32         
CL2SFHX  DS    XL8                                                              
CL2BATLH DS    XL8                                                              
CL2BATL  DS    CL23    10    2   23  A  P N             T        Y              
CL2BDBDH DS    XL8                                                              
CL2BDBD  DS    CL1     10   29    1  A  U N             T        Y   40         
CL2BDBDX DS    XL8                                                              
CL2FOTLH DS    XL8                                                              
CL2FOTL  DS    CL14    10   36   14  A  P N             T        Y              
CL2FROPH DS    XL8                                                              
CL2FROP  DS    CL10    10   64   10  A  U N             T        Y   32         
CL2FROPX DS    XL8                                                              
CL2DATLH DS    XL8                                                              
CL2DATL  DS    CL23    11    2   23  A  P N             T        Y              
CL2BDDAH DS    XL8                                                              
CL2BDDA  DS    CL1     11   29    1  A  U N             T        Y   45         
CL2BDDAX DS    XL8                                                              
CL2RGTLH DS    XL8                                                              
CL2RGTL  DS    CL9     11   36    9  A  P N             T        Y              
CL2RLPGH DS    XL8                                                              
CL2RLPG  DS    CL10    11   64   10  A  U N             T        Y   32         
CL2RLPGX DS    XL8                                                              
CL2NNTLH DS    XL8                                                              
CL2NNTL  DS    CL24    12    2   24  A  P N             T        Y              
CL2NNADH DS    XL8                                                              
CL2NNAD  DS    CL1     12   29    1  A  U N             T        Y   50         
CL2NNADX DS    XL8                                                              
CL2C2TLH DS    XL8                                                              
CL2C2TL  DS    CL6     12   36    6  A  P N             T        Y              
CL2COS2H DS    XL8                                                              
CL2COS2  DS    CL10    12   64   10  A  U N             T        Y   32         
CL2COS2X DS    XL8                                                              
CL2CTTLH DS    XL8                                                              
CL2CTTL  DS    CL11    13    2   11  A  P N             T        Y              
CL2CLTYH DS    XL8                                                              
CL2CLTY  DS    CL1     13   29    1  A  U N             T        Y   55         
CL2CLTYX DS    XL8                                                              
CL2UCTLH DS    XL8                                                              
CL2UCTL  DS    CL18    13   36   18  A  P N             T        Y              
CL2UCBCH DS    XL8                                                              
CL2UCBC  DS    CL1     13   64    1  A  U N             T        Y   32         
CL2UCBCX DS    XL8                                                              
CL2MCTLH DS    XL8                                                              
CL2MCTL  DS    CL21    14    2   21  A  P N             T        Y              
CL2MASCH DS    XL8                                                              
CL2MASC  DS    CL3     14   29    3  A  U N             T        Y   65         
CL2MASCX DS    XL8                                                              
CL2MITLH DS    XL8                                                              
CL2MITL  DS    CL12    14   36   12  A  P N             T        Y              
CL2MIDCH DS    XL8                                                              
CL2MIDC  DS    CL1     14   64    1  A  U N             T        Y   32         
CL2MIDCX DS    XL8                                                              
CL2BFTLH DS    XL8                                                              
CL2BFTL  DS    CL24    15    2   24  A  P N             T        Y              
CL2PEBFH DS    XL8                                                              
CL2PEBF  DS    CL1     15   29    1  A  U N             T        Y   80         
CL2PEBFX DS    XL8                                                              
CL2BPTLH DS    XL8                                                              
CL2BPTL  DS    CL23    15   36   23  A  P N             T        Y              
CL2BPO#H DS    XL8                                                              
CL2BPO#  DS    CL1     15   64    1  A  U N             T        Y              
CL2CRTLH DS    XL8                                                              
CL2CRTL  DS    CL18    16    2   18  A  P N             T        Y              
CL2CORQH DS    XL8                                                              
CL2CORQ  DS    CL1     16   29    1  A  U N             T        Y  110         
CL2CORQX DS    XL8                                                              
CL2EDTLH DS    XL8                                                              
CL2EDTL  DS    CL16    16   36   16  A  P N             T        Y              
CL2PEDTH DS    XL8                                                              
CL2PEDT  DS    CL10    16   64   10  A  U N             T        Y              
CL2BTTLH DS    XL8                                                              
CL2BTTL  DS    CL13    17    2   13  A  P N             T        Y              
CL2BDTYH DS    XL8                                                              
CL2BDTY  DS    CL1     17   29    1  A  U N             T        Y  125         
CL2BDTYX DS    XL8                                                              
CL2LVTLH DS    XL8                                                              
CL2LVTL  DS    CL20    17   36   20  A  P N             T        Y              
CL2POLVH DS    XL8                                                              
CL2POLV  DS    CL1     17   64    1  A  U N             T        Y              
CL2ERTLH DS    XL8                                                              
CL2ERTL  DS    CL17    18    2   17  A  P N             T        Y  135         
CL2ERTLX DS    XL8                                                              
CL2ESRDH DS    XL8                                                              
CL2ESRD  DS    CL1     18   29    1  A  U N             T        Y  140         
CL2ESRDX DS    XL8                                                              
CL2LOTLH DS    XL8                                                              
CL2LOTL  DS    CL17    18   36   17  A  P N             T        Y              
CL2LBOVH DS    XL8                                                              
CL2LBOV  DS    CL12    18   64   12  A  U N             T        Y              
CL2STTLH DS    XL8                                                              
CL2STTL  DS    CL13    19    2   13  A  P N             T        Y              
CL2SAPH  DS    XL8                                                              
CL2SAP   DS    CL10    19   20   10  A  U N             T        Y              
CL2SRPLH DS    XL8                                                              
CL2SRPL  DS    CL16    20    2   16  A  P N             T        Y  145         
CL2SRPLX DS    XL8                                                              
CL2SREPH DS    XL8                                                              
CL2SREP  DS    CL4     20   20    4  A  U N             T        Y  146         
CL2SREPX DS    XL8                                                              
CL2SRNMH DS    XL8                                                              
CL2SRNM  DS    CL30    20   26   30  A  P N             T        Y  147         
CL2SRNMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
CL2BOTLH DS    XL8                                                              
CL2BOTL  DS    CL79    24    2   79  A  P N             T        Y              
CL2LAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CL2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1440 BYTES                            
