*          DATA SET PRSFMFBD   AT LEVEL 012 AS OF 09/29/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CFBD      DATE 09/29/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SUSMEDH  DS    CL8                                                              
SUSMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SUSCLTH  DS    CL8                                                              
SUSCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
SUSP1H   DS    CL8                                                              
SUSP1    DS    CL20     7   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
SUSP1RQH DS    CL8                                                              
SUSP1RQ  DS    CL1      8   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      8   28    9  A  P N             T        Y              
SUSP1EDH DS    CL8                                                              
SUSP1ED  DS    CL1      8   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   48    7  A  P N             T        Y              
SUSP1LNH DS    CL8                                                              
SUSP1LN  DS    CL2      8   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   60   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     9    2   14  A  P N             T        Y              
SUSP1S1H DS    CL8                                                              
SUSP1S1  DS    CL1      9   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   28    3  A  P N             T        Y              
SUSP152H DS    CL8                                                              
SUSP152  DS    CL1      9   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   48    3  A  P N             T        Y              
SUSP1ECH DS    CL8                                                              
SUSP1EC  DS    CL1      9   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   68    4  A  P N             T        Y              
SUSP1MBH DS    CL8                                                              
SUSP1MB  DS    CL1      9   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
SUSP2H   DS    CL8                                                              
SUSP2    DS    CL20    11   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
SUSP2RQH DS    CL8                                                              
SUSP2RQ  DS    CL1     12   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   28    9  A  P N             T        Y              
SUSP2EDH DS    CL8                                                              
SUSP2ED  DS    CL1     12   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   48    7  A  P N             T        Y              
SUSP2LNH DS    CL8                                                              
SUSP2LN  DS    CL2     12   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   60   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
SUSP2S1H DS    CL8                                                              
SUSP2S1  DS    CL1     13   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   28    3  A  P N             T        Y              
SUSP252H DS    CL8                                                              
SUSP252  DS    CL1     13   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   48    3  A  P N             T        Y              
SUSP2ECH DS    CL8                                                              
SUSP2EC  DS    CL1     13   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   68    4  A  P N             T        Y              
SUSP2MBH DS    CL8                                                              
SUSP2MB  DS    CL1     13   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15    2   15  A  P N             T        Y              
SUSE1H   DS    CL8                                                              
SUSE1    DS    CL20    15   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A  P N             T        Y              
SUSE1RQH DS    CL8                                                              
SUSE1RQ  DS    CL1     16   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   28    9  A  P N             T        Y              
SUSE1EDH DS    CL8                                                              
SUSE1ED  DS    CL1     16   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   48    7  A  P N             T        Y              
SUSE1LNH DS    CL8                                                              
SUSE1LN  DS    CL2     16   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   60   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    17    2   14  A  P N             T        Y              
SUSE1S1H DS    CL8                                                              
SUSE1S1  DS    CL1     17   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   28    3  A  P N             T        Y              
SUSE152H DS    CL8                                                              
SUSE152  DS    CL1     17   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   48    3  A  P N             T        Y              
SUSE1ECH DS    CL8                                                              
SUSE1EC  DS    CL1     17   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   68    4  A  P N             T        Y              
SUSE1MBH DS    CL8                                                              
SUSE1MB  DS    CL1     17   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19    2   15  A  P N             T        Y              
SUSE2H   DS    CL8                                                              
SUSE2    DS    CL20    19   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20    2    9  A  P N             T        Y              
SUSE2RQH DS    CL8                                                              
SUSE2RQ  DS    CL1     20   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   28    9  A  P N             T        Y              
SUSE2EDH DS    CL8                                                              
SUSE2ED  DS    CL1     20   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   48    7  A  P N             T        Y              
SUSE2LNH DS    CL8                                                              
SUSE2LN  DS    CL2     20   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   60   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    21    2   14  A  P N             T        Y              
SUSE2S1H DS    CL8                                                              
SUSE2S1  DS    CL1     21   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   28    3  A  P N             T        Y              
SUSE252H DS    CL8                                                              
SUSE252  DS    CL1     21   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   48    3  A  P N             T        Y              
SUSE2ECH DS    CL8                                                              
SUSE2EC  DS    CL1     21   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   68    4  A  P N             T        Y              
SUSE2MBH DS    CL8                                                              
SUSE2MB  DS    CL1     21   76    1  A  U N             T        Y              
SUSLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SUSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1016 BYTES                            
