*          DATA SET PRSFMB7D   AT LEVEL 003 AS OF 01/10/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CB7D      DATE 01/10/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFSMEDH  DS    XL8                                                              
SFSMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFSMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   20    3  A  P H             T        Y              
SFSPUBH  DS    XL8                                                              
SFSPUB   DS    CL17     5   25   17  A  U H             T        Y    0         
SFSPUBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   47    8  A  P N             T        Y              
SFSSIDH  DS    XL8                                                              
SFSSID   DS    CL2      5   56    2  A  U H             T        Y    0         
SFSSIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      7    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    5    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   11    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   25    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   47    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   61    6  A  P N             T        Y              
SFSLINH  DS    XL8                                                              
SFSLIN   DS    CL79     8    2   79  A  P N             T        Y    0         
SFSLINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y    0         
         DS    XL8                                                              
SFSLSTH  DS    XL8                                                              
SFSLST   DS    CL79    23    2   79  A  P N             T        Y    0         
SFSLSTX  DS    XL8                                                              
SFSFILLH DS    XL8                                                              
SFSFILL  DS    CL79    24    2   79  A  P N             T        Y    0         
SFSFILLX DS    XL8                                                              
SFSLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SFSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1816 BYTES                            
