*          DATA SET PRSFMF4D   AT LEVEL 010 AS OF 02/04/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CF4D      DATE 02/04/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CLRMEDH  DS    XL8                                                              
CLRMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
CLRCLTH  DS    XL8                                                              
CLRCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   38    3  A  P H             T        Y              
CLRPUBH  DS    XL8                                                              
CLRPUB   DS    CL18     5   46   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
CLRDATEH DS    XL8                                                              
CLRDATE  DS    CL17     6   10   17  A  U N             T        Y              
CLRPUBNH DS    XL8                                                              
CLRPUBN  DS    CL20     6   46   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
CLRPAYH  DS    XL8                                                              
CLRPAY   DS    CL5      7   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
CLROPTH  DS    XL8                                                              
CLROPT   DS    CL20     7   28   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   11    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   16    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   25    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   29    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   33   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   45    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   64    6  A  P N             T        Y              
CLRHDAH  DS    XL8                                                              
CLRHDA   DS    CL8     10   73    8  A  P N             T        Y              
CLRLST1H DS    XL8                                                              
CLRLST1  DS    CL79    11    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
CLRTAGH  DS    XL8                                                              
CLRTAG   DS    CL1     24    2    1  A  P N             T        Y              
CLRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CLRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1536 BYTES                            
