*          DATA SET PRSFMDAD   AT LEVEL 010 AS OF 09/21/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CDAD      DATE 09/21/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     5    2   11  A  P H             T        Y              
COLCODEH DS    XL8                                                              
COLCODE  DS    CL12     5   15   12  A  U N             T        Y   10         
COLCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   35    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
COLSEQH  DS    XL8                                                              
COLSEQ   DS    CL5      5   46    5  A  P N             T        Y   20         
COLSEQX  DS    XL8                                                              
COLMSGH  DS    XL8                                                              
COLMSG   DS    CL60     6   15   60  A  P H             T        Y   30         
COLMSGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
COLDESCH DS    XL8                                                              
COLDESC  DS    CL25     7   26   25  A  U N             T        Y   40         
COLDESCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
COLHDR1H DS    XL8                                                              
COLHDR1  DS    CL12     8   26   12  A  U N             T        Y   50         
COLHDR1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
COLHDR2H DS    XL8                                                              
COLHDR2  DS    CL12     9   26   12  A  U N             T        Y   60         
COLHDR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P H             T        Y              
COLTYPH  DS    XL8                                                              
COLTYP   DS    CL1     10   26    1  A  U N             T        Y   70         
COLTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
COLTOTH  DS    XL8                                                              
COLTOT   DS    CL1     11   26    1  A  U N             T        Y   80         
COLTOTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    12    2   18  A  P N             T        Y              
COLDECH  DS    XL8                                                              
COLDEC   DS    CL1     12   26    1  A  U N             T        Y   90         
COLDECX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    12   38   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
COLMAXH  DS    XL8                                                              
COLMAX   DS    CL3     13   26    3  A  U N             T        Y  100         
COLMAXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    13   38   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
COLMEDH  DS    XL8                                                              
COLMED   DS    CL9     14   26    9  A  U N             T        Y  110         
COLMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL32    14   38   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL33    15   38   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    16    2   23  A  P N             T        Y              
COLINSH  DS    XL8                                                              
COLINS   DS    CL1     16   26    1  A  U N             T        Y  120         
COLINSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   38    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    17    2   23  A  P N             T        Y              
COLFCONH DS    XL8                                                              
COLFCON  DS    CL3     17   26    3  A  U N             T        Y  130         
COLFCONX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL40    17   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    18    2   23  A  P N             T        Y              
COLCHGSH DS    XL8                                                              
COLCHGS  DS    CL3     18   26    3  A  U N             T        Y  140         
COLCHGSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   38    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    19    2   23  A  P N             T        Y              
COLRDWRH DS    XL8                                                              
COLRDWR  DS    CL3     19   26    3  A  U N             T        Y  150         
COLRDWRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   38    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    20    2   23  A  P N             T        Y              
COLMENUH DS    XL8                                                              
COLMENU  DS    CL3     20   26    3  A  U N             T        Y  150         
COLMENUX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   38    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   70    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL76    22    2   76  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL34    23    2   34  A  P H             T        Y              
COLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
COLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1128 BYTES                            
