*          DATA SET PRSFMC9D   AT LEVEL 006 AS OF 07/23/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CC9D      DATE 07/23/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SELMEDH  DS    XL8                                                              
SELMED   DS    CL2      5   11    2  A  U N             T        Y              
SELMEDNH DS    XL8                                                              
SELMEDN  DS    CL10     5   16   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SELCLIH  DS    XL8                                                              
SELCLI   DS    CL3      5   47    3  A  U N             T        Y              
SELCLINH DS    XL8                                                              
SELCLIN  DS    CL20     5   52   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SELPROH  DS    XL8                                                              
SELPRO   DS    CL3      6   11    3  A  U N             T        Y              
SELPRONH DS    XL8                                                              
SELPRON  DS    CL20     6   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   38    8  A  P N             T        Y              
SELESTH  DS    XL8                                                              
SELEST   DS    CL3      6   47    3  A  U N             T        Y              
SELESTNH DS    XL8                                                              
SELESTN  DS    CL20     6   52   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
SELDIVH  DS    XL8                                                              
SELDIV   DS    CL3      7   11    3  A  U N             T        Y              
SELDIVNH DS    XL8                                                              
SELDIVN  DS    CL20     7   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   38    6  A  P N             T        Y              
SELREGH  DS    XL8                                                              
SELREG   DS    CL3      7   47    3  A  U N             T        Y              
SELREGNH DS    XL8                                                              
SELREGN  DS    CL20     7   52   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
SELDSTH  DS    XL8                                                              
SELDST   DS    CL3      8   11    3  A  U N             T        Y              
SELDSTNH DS    XL8                                                              
SELDSTN  DS    CL20     8   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
SELHEDH  DS    XL8                                                              
SELHED   DS    CL70     9   10   70  A  P N             T        Y              
SELSELH  DS    XL8                                                              
SELSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    10   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    11   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    12   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    13   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    14   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    15   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    16   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    17   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    18   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    19   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    20   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    21   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    22   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    23   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    24   10   70  A  P N             T        Y              
SELLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1808 BYTES                            
