*          DATA SET PRSFMBFD   AT LEVEL 001 AS OF 02/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CBFD      DATE 02/09/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
SFRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 16   BYTES                            
