*          DATA SET PRSFMCBD   AT LEVEL 009 AS OF 04/27/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CCBD      DATE 04/27/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
PGEMEDH  DS    XL8                                                              
PGEMED   DS    CL1      6   11    1  A  U N             T        Y   10         
PGEMEDX  DS    XL8                                                              
PGEMEDNH DS    XL8                                                              
PGEMEDN  DS    CL10     6   17   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   41    6  A  P H             T        Y              
PGECLTH  DS    XL8                                                              
PGECLT   DS    CL3      6   51    3  A  U N             T        Y   15         
PGECLTX  DS    XL8                                                              
PGECLTNH DS    XL8                                                              
PGECLTN  DS    CL20     6   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
PGEPRDH  DS    XL8                                                              
PGEPRD   DS    CL3      7   11    3  A  U N             T        Y   20         
PGEPRDX  DS    XL8                                                              
PGEPRDNH DS    XL8                                                              
PGEPRDN  DS    CL20     7   17   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   41    8  A  P H             T        Y              
PGEESTH  DS    XL8                                                              
PGEEST   DS    CL4      7   51    4  A  U N             T        Y   25         
PGEESTX  DS    XL8                                                              
PGEESTNH DS    XL8                                                              
PGEESTN  DS    CL20     7   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9    2   13  A  P N             T        Y              
PGECHRH  DS    XL8                                                              
PGECHR   DS    CL3      9   17    3  A  U N             T        Y   30         
PGECHRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PGEACCH  DS    XL8                                                              
PGEACC   DS    CL6     10   17    6  A  U N             T        Y   35         
PGEACCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
PGEBRNH  DS    XL8                                                              
PGEBRN   DS    CL4     11   17    4  A  U N             T        Y   40         
PGEBRNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
PGEPESH  DS    XL8                                                              
PGEPES   DS    CL4     12   17    4  A  U N             T        Y   45         
PGEPESX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
PGEEVTH  DS    XL8                                                              
PGEEVT   DS    CL6     13   17    6  A  U N             T        Y   50         
PGEEVTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
PGEMBFH  DS    XL8                                                              
PGEMBF   DS    CL1     14   17    1  A  U N             T        Y   55         
PGEMBFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
PGENOBH  DS    XL8                                                              
PGENOB   DS    CL1     15   17    1  A  U N             T        Y   60         
PGENOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
PGEBRSH  DS    XL8                                                              
PGEBRS   DS    CL2     16   17    2  A  U N             T        Y   65         
PGEBRSX  DS    XL8                                                              
PGELAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PGEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 544  BYTES                            
