*          DATA SET PRSFMD8D   AT LEVEL 001 AS OF 10/25/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CD8D      DATE 10/25/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PBLMEDH  DS    XL8                                                              
PBLMED   DS    CL1      5   10    1  A  U N             T        Y  200         
PBLMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PBLCLTH  DS    XL8                                                              
PBLCLT   DS    CL5      5   28    5  A  U N             T        Y  210         
PBLCLTX  DS    XL8                                                              
PBLCLTNH DS    XL8                                                              
PBLCLTN  DS    CL20     5   38   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL33     6    3   33  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL22     6   37   22  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
PBLPBLCH DS    XL8                                                              
PBLPBLC  DS    CL5      7   16    5  A  U N             T        Y  205         
PBLPBLCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P H             T        Y              
PBLPBLNH DS    XL8                                                              
PBLPBLN  DS    CL20     8   16   20  A  U N             T        Y  220         
PBLPBLNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20     8   38   20  A  P N             T        Y              
PBLSPUBH DS    XL8                                                              
PBLSPUB  DS    CL5      8   59    5  A  U N             T        Y  229         
PBLSPUBX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      8   65    2  A  P N             T        Y              
PBLTPUBH DS    XL8                                                              
PBLTPUB  DS    CL4      8   68    4  A  P N             T        Y              
PBLMOR1H DS    XL8                                                              
PBLMOR1  DS    CL2      9    2    2  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL15    10    2   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15    10   18   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15    10   39   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     10   60    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     10   76    2  A  P H             T        Y              
PBLPUB1H DS    XL8                                                              
PBLPUB1  DS    CL15    11    2   15  A  U N             T        Y  230         
PBLPUB1X DS    XL8                                                              
PBLPBN1H DS    XL8                                                              
PBLPBN1  DS    CL20    11   18   20  A  P N             T        Y  235         
PBLPBN1X DS    XL8                                                              
PBLPBZ1H DS    XL8                                                              
PBLPBZ1  DS    CL20    11   39   20  A  P N             T        Y  240         
PBLPBZ1X DS    XL8                                                              
PBLCTY1H DS    XL8                                                              
PBLCTY1  DS    CL15    11   60   15  A  P N             T        Y  245         
PBLCTY1X DS    XL8                                                              
PBLSTA1H DS    XL8                                                              
PBLSTA1  DS    CL2     11   76    2  A  P N             T        Y  250         
PBLSTA1X DS    XL8                                                              
PBLPUB2H DS    XL8                                                              
PBLPUB2  DS    CL15    12    2   15  A  U N             T        Y  230         
PBLPUB2X DS    XL8                                                              
PBLPBN2H DS    XL8                                                              
PBLPBN2  DS    CL20    12   18   20  A  P N             T        Y  235         
PBLPBN2X DS    XL8                                                              
PBLPBZ2H DS    XL8                                                              
PBLPBZ2  DS    CL20    12   39   20  A  P N             T        Y  240         
PBLPBZ2X DS    XL8                                                              
PBLCTY2H DS    XL8                                                              
PBLCTY2  DS    CL15    12   60   15  A  P N             T        Y  245         
PBLCTY2X DS    XL8                                                              
PBLSTA2H DS    XL8                                                              
PBLSTA2  DS    CL2     12   76    2  A  P N             T        Y  250         
PBLSTA2X DS    XL8                                                              
PBLPUB3H DS    XL8                                                              
PBLPUB3  DS    CL15    13    2   15  A  U N             T        Y  230         
PBLPUB3X DS    XL8                                                              
PBLPBN3H DS    XL8                                                              
PBLPBN3  DS    CL20    13   18   20  A  P N             T        Y  235         
PBLPBN3X DS    XL8                                                              
PBLPBZ3H DS    XL8                                                              
PBLPBZ3  DS    CL20    13   39   20  A  P N             T        Y  240         
PBLPBZ3X DS    XL8                                                              
PBLCTY3H DS    XL8                                                              
PBLCTY3  DS    CL15    13   60   15  A  P N             T        Y  245         
PBLCTY3X DS    XL8                                                              
PBLSTA3H DS    XL8                                                              
PBLSTA3  DS    CL2     13   76    2  A  P N             T        Y  250         
PBLSTA3X DS    XL8                                                              
PBLPUB4H DS    XL8                                                              
PBLPUB4  DS    CL15    14    2   15  A  U N             T        Y  230         
PBLPUB4X DS    XL8                                                              
PBLPBN4H DS    XL8                                                              
PBLPBN4  DS    CL20    14   18   20  A  P N             T        Y  235         
PBLPBN4X DS    XL8                                                              
PBLPBZ4H DS    XL8                                                              
PBLPBZ4  DS    CL20    14   39   20  A  P N             T        Y  240         
PBLPBZ4X DS    XL8                                                              
PBLCTY4H DS    XL8                                                              
PBLCTY4  DS    CL15    14   60   15  A  P N             T        Y  245         
PBLCTY4X DS    XL8                                                              
PBLSTA4H DS    XL8                                                              
PBLSTA4  DS    CL2     14   76    2  A  P N             T        Y  250         
PBLSTA4X DS    XL8                                                              
PBLPUB5H DS    XL8                                                              
PBLPUB5  DS    CL15    15    2   15  A  U N             T        Y  230         
PBLPUB5X DS    XL8                                                              
PBLPBN5H DS    XL8                                                              
PBLPBN5  DS    CL20    15   18   20  A  P N             T        Y  235         
PBLPBN5X DS    XL8                                                              
PBLPBZ5H DS    XL8                                                              
PBLPBZ5  DS    CL20    15   39   20  A  P N             T        Y  240         
PBLPBZ5X DS    XL8                                                              
PBLCTY5H DS    XL8                                                              
PBLCTY5  DS    CL15    15   60   15  A  P N             T        Y  245         
PBLCTY5X DS    XL8                                                              
PBLSTA5H DS    XL8                                                              
PBLSTA5  DS    CL2     15   76    2  A  P N             T        Y  250         
PBLSTA5X DS    XL8                                                              
PBLPUB6H DS    XL8                                                              
PBLPUB6  DS    CL15    16    2   15  A  U N             T        Y  230         
PBLPUB6X DS    XL8                                                              
PBLPBN6H DS    XL8                                                              
PBLPBN6  DS    CL20    16   18   20  A  P N             T        Y  235         
PBLPBN6X DS    XL8                                                              
PBLPBZ6H DS    XL8                                                              
PBLPBZ6  DS    CL20    16   39   20  A  P N             T        Y  240         
PBLPBZ6X DS    XL8                                                              
PBLCTY6H DS    XL8                                                              
PBLCTY6  DS    CL15    16   60   15  A  P N             T        Y  245         
PBLCTY6X DS    XL8                                                              
PBLSTA6H DS    XL8                                                              
PBLSTA6  DS    CL2     16   76    2  A  P N             T        Y  250         
PBLSTA6X DS    XL8                                                              
PBLPUB7H DS    XL8                                                              
PBLPUB7  DS    CL15    17    2   15  A  U N             T        Y  230         
PBLPUB7X DS    XL8                                                              
PBLPBN7H DS    XL8                                                              
PBLPBN7  DS    CL20    17   18   20  A  P N             T        Y  235         
PBLPBN7X DS    XL8                                                              
PBLPBZ7H DS    XL8                                                              
PBLPBZ7  DS    CL20    17   39   20  A  P N             T        Y  240         
PBLPBZ7X DS    XL8                                                              
PBLCTY7H DS    XL8                                                              
PBLCTY7  DS    CL15    17   60   15  A  P N             T        Y  245         
PBLCTY7X DS    XL8                                                              
PBLSTA7H DS    XL8                                                              
PBLSTA7  DS    CL2     17   76    2  A  P N             T        Y  250         
PBLSTA7X DS    XL8                                                              
PBLPUB8H DS    XL8                                                              
PBLPUB8  DS    CL15    18    2   15  A  U N             T        Y  230         
PBLPUB8X DS    XL8                                                              
PBLPBN8H DS    XL8                                                              
PBLPBN8  DS    CL20    18   18   20  A  P N             T        Y  235         
PBLPBN8X DS    XL8                                                              
PBLPBZ8H DS    XL8                                                              
PBLPBZ8  DS    CL20    18   39   20  A  P N             T        Y  240         
PBLPBZ8X DS    XL8                                                              
PBLCTY8H DS    XL8                                                              
PBLCTY8  DS    CL15    18   60   15  A  P N             T        Y  245         
PBLCTY8X DS    XL8                                                              
PBLSTA8H DS    XL8                                                              
PBLSTA8  DS    CL2     18   76    2  A  P N             T        Y  250         
PBLSTA8X DS    XL8                                                              
PBLPUB9H DS    XL8                                                              
PBLPUB9  DS    CL15    19    2   15  A  U N             T        Y  230         
PBLPUB9X DS    XL8                                                              
PBLPBN9H DS    XL8                                                              
PBLPBN9  DS    CL20    19   18   20  A  P N             T        Y  235         
PBLPBN9X DS    XL8                                                              
PBLPBZ9H DS    XL8                                                              
PBLPBZ9  DS    CL20    19   39   20  A  P N             T        Y  240         
PBLPBZ9X DS    XL8                                                              
PBLCTY9H DS    XL8                                                              
PBLCTY9  DS    CL15    19   60   15  A  P N             T        Y  245         
PBLCTY9X DS    XL8                                                              
PBLSTA9H DS    XL8                                                              
PBLSTA9  DS    CL2     19   76    2  A  P N             T        Y  250         
PBLSTA9X DS    XL8                                                              
PBLPUBAH DS    XL8                                                              
PBLPUBA  DS    CL15    20    2   15  A  U N             T        Y  230         
PBLPUBAX DS    XL8                                                              
PBLPBNAH DS    XL8                                                              
PBLPBNA  DS    CL20    20   18   20  A  P N             T        Y  235         
PBLPBNAX DS    XL8                                                              
PBLPBZAH DS    XL8                                                              
PBLPBZA  DS    CL20    20   39   20  A  P N             T        Y  240         
PBLPBZAX DS    XL8                                                              
PBLCTYAH DS    XL8                                                              
PBLCTYA  DS    CL15    20   60   15  A  P N             T        Y  245         
PBLCTYAX DS    XL8                                                              
PBLSTAAH DS    XL8                                                              
PBLSTAA  DS    CL2     20   76    2  A  P N             T        Y  250         
PBLSTAAX DS    XL8                                                              
PBLPUBBH DS    XL8                                                              
PBLPUBB  DS    CL15    21    2   15  A  U N             T        Y  230         
PBLPUBBX DS    XL8                                                              
PBLPBNBH DS    XL8                                                              
PBLPBNB  DS    CL20    21   18   20  A  P N             T        Y  235         
PBLPBNBX DS    XL8                                                              
PBLPBZBH DS    XL8                                                              
PBLPBZB  DS    CL20    21   39   20  A  P N             T        Y  240         
PBLPBZBX DS    XL8                                                              
PBLCTYBH DS    XL8                                                              
PBLCTYB  DS    CL15    21   60   15  A  P N             T        Y  245         
PBLCTYBX DS    XL8                                                              
PBLSTABH DS    XL8                                                              
PBLSTAB  DS    CL2     21   76    2  A  P N             T        Y  250         
PBLSTABX DS    XL8                                                              
PBLPUBCH DS    XL8                                                              
PBLPUBC  DS    CL15    22    2   15  A  U N             T        Y  230         
PBLPUBCX DS    XL8                                                              
PBLPBNCH DS    XL8                                                              
PBLPBNC  DS    CL20    22   18   20  A  P N             T        Y  235         
PBLPBNCX DS    XL8                                                              
PBLPBZCH DS    XL8                                                              
PBLPBZC  DS    CL20    22   39   20  A  P N             T        Y  240         
PBLPBZCX DS    XL8                                                              
PBLCTYCH DS    XL8                                                              
PBLCTYC  DS    CL15    22   60   15  A  P N             T        Y  245         
PBLCTYCX DS    XL8                                                              
PBLSTACH DS    XL8                                                              
PBLSTAC  DS    CL2     22   76    2  A  P N             T        Y  250         
PBLSTACX DS    XL8                                                              
PBLPUBLH DS    XL8                                                              
PBLPUBL  DS    CL15    23    2   15  A  U N             T        Y  230         
PBLPUBLX DS    XL8                                                              
PBLPBNLH DS    XL8                                                              
PBLPBNL  DS    CL20    23   18   20  A  P N             T        Y  235         
PBLPBNLX DS    XL8                                                              
PBLPBZLH DS    XL8                                                              
PBLPBZL  DS    CL20    23   39   20  A  P N             T        Y  240         
PBLPBZLX DS    XL8                                                              
PBLCTYLH DS    XL8                                                              
PBLCTYL  DS    CL15    23   60   15  A  P N             T        Y  245         
PBLCTYLX DS    XL8                                                              
PBLSTALH DS    XL8                                                              
PBLSTAL  DS    CL2     23   76    2  A  P N             T        Y  250         
PBLSTALX DS    XL8                                                              
PBLMORLH DS    XL8                                                              
PBLMORL  DS    CL2     23   79    2  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL39    24    5   39  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     24   45    9  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   65    6  L  P N             T        Y              
PBLSCRLH DS    XL8                                                              
PBLSCRL  DS    CL5     24   72    5  L  U N             T        Y  190         
PBLSCRLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     24   79    1  A  U N             T        Y              
PBLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PBLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2536 BYTES                            
