*          DATA SET PRSFMFCD   AT LEVEL 006 AS OF 08/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CFCD      DATE 08/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
FSIMEDH  DS    XL8                                                              
FSIMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
FSIPUBH  DS    XL8                                                              
FSIPUB   DS    CL18     5   28   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   48    6  A  P N             T        Y              
FSICLTH  DS    XL8                                                              
FSICLT   DS    CL3      5   58    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
FSIPUBNH DS    XL8                                                              
FSIPUBN  DS    CL20     6   28   20  A  P H             T        Y              
FSICLTNH DS    XL8                                                              
FSICLTN  DS    CL20     6   58   20  A  P H             T        Y              
FSIPUBZH DS    XL8                                                              
FSIPUBZ  DS    CL20     7   28   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36     8    4   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36     8   41   36  A  P H             T        Y              
FSIMOR1H DS    XL8                                                              
FSIMOR1  DS    CL2      9    2    2  L  P H             T        Y              
FSISP1H  DS    XL8                                                              
FSISP1   DS    CL17     9    5   17  A  U N             T        Y              
FSIXCU1H DS    XL8                                                              
FSIXCU1  DS    CL7      9   24    7  A  U N             T        Y              
FSIPCU1H DS    XL8                                                              
FSIPCU1  DS    CL7      9   33    7  A  U N             T        Y              
FSISP2H  DS    XL8                                                              
FSISP2   DS    CL17     9   42   17  A  U N             T        Y              
FSIXCU2H DS    XL8                                                              
FSIXCU2  DS    CL7      9   61    7  A  U N             T        Y              
FSIPCU2H DS    XL8                                                              
FSIPCU2  DS    CL7      9   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    10    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    10   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   42   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   61    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22    5   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   24    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   33    7  A  U N             T        Y              
FSISPLH  DS    XL8                                                              
FSISPL   DS    CL17    22   42   17  A  U N             T        Y              
FSIXCULH DS    XL8                                                              
FSIXCUL  DS    CL7     22   61    7  A  U N             T        Y              
FSIPCULH DS    XL8                                                              
FSIPCUL  DS    CL7     22   70    7  A  U N             T        Y              
FSIMORLH DS    XL8                                                              
FSIMORL  DS    CL2     22   79    2  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL27    23    4   27  A  P N             T        Y              
FSISLVH  DS    XL8                                                              
FSISLV   DS    CL1     23   33    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27    23   41   27  A  P N             T        Y              
FSIDLVH  DS    XL8                                                              
FSIDLV   DS    CL1     23   70    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL55    24    5   55  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   65    6  L  P N             T        Y              
FSISCRLH DS    XL8                                                              
FSISCRL  DS    CL5     24   72    5  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   79    1  A  U N             T        Y              
FSILAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
FSIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2016 BYTES                            
