*          DATA SET PRSFMA2D   AT LEVEL 010 AS OF 05/17/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CA2D      DATE 05/17/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
BSCMEDH  DS    XL8                                                              
BSCMED   DS    CL1      6   10    1  A  U N             T        Y   10         
BSCMEDX  DS    XL8                                                              
BSCMEDNH DS    XL8                                                              
BSCMEDN  DS    CL10     6   15   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   39    6  A  P H             T        Y              
BSCCLTH  DS    XL8                                                              
BSCCLT   DS    CL3      6   48    3  A  U N             T        Y   15         
BSCCLTX  DS    XL8                                                              
BSCCLTNH DS    XL8                                                              
BSCCLTN  DS    CL20     6   53   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
BSCPRDH  DS    XL8                                                              
BSCPRD   DS    CL3      7   10    3  A  U N             T        Y   20         
BSCPRDX  DS    XL8                                                              
BSCPRDNH DS    XL8                                                              
BSCPRDN  DS    CL20     7   15   20  A  P N             T        Y              
BSCESHDH DS    XL8                                                              
BSCESHD  DS    CL8      7   39    8  A  P H             T        Y              
BSCESTH  DS    XL8                                                              
BSCEST   DS    CL3      7   48    3  A  U N             T        Y   25         
BSCESTX  DS    XL8                                                              
BSCESTNH DS    XL8                                                              
BSCESTN  DS    CL20     7   53   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
BSCBFTLH DS    XL8                                                              
BSCBFTL  DS    CL18     9    2   18  A  P N             T        Y              
BSCBASAH DS    XL8                                                              
BSCBASA  DS    CL5      9   27    5  A  U N             T        Y   30         
BSCBASAX DS    XL8                                                              
BSCBXTLH DS    XL8                                                              
BSCBXTL  DS    CL16     9   39   16  A  P N             T        Y              
BSCPATLH DS    XL8                                                              
BSCPATL  DS    CL8     10   16    8  A  P N             T        Y              
BSCADJH  DS    XL8                                                              
BSCADJ   DS    CL9     10   27    9  A  U N             T        Y   35         
BSCADJX  DS    XL8                                                              
BSCOFTLH DS    XL8                                                              
BSCOFTL  DS    CL2     11   16    2  A  P N             T        Y              
BSCBASBH DS    XL8                                                              
BSCBASB  DS    CL5     11   27    5  A  U N             T        Y   40         
BSCBASBX DS    XL8                                                              
BSCACTLH DS    XL8                                                              
BSCACTL  DS    CL17    11   39   17  A  P N             T        Y              
BSCPADJH DS    XL8                                                              
BSCPADJ  DS    CL9     11   58    9  A  U N             T        Y   45         
BSCPADJX DS    XL8                                                              
BSCPOTLH DS    XL8                                                              
BSCPOTL  DS    CL7     11   68    7  A  P N             T        Y              
BSCPBASH DS    XL8                                                              
BSCPBAS  DS    CL5     11   76    5  A  U N             T        Y   50         
BSCPBASX DS    XL8                                                              
BSCEDTLH DS    XL8                                                              
BSCEDTL  DS    CL8     12   16    8  A  P N             T        Y              
BSCADATH DS    XL8                                                              
BSCADAT  DS    CL6     12   27    6  A  U N             T        Y   60         
BSCADATX DS    XL8                                                              
BSCBMTLH DS    XL8                                                              
BSCBMTL  DS    CL10    12   39   10  A  P N             T        Y              
BSCCPTLH DS    XL8                                                              
BSCCPTL  DS    CL24    14    2   24  A  P N             T        Y              
BSCDETSH DS    XL8                                                              
BSCDETS  DS    CL1     14   27    1  A  U N             T        Y   65         
BSCDETSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    14   39   31  A  P N             T        Y              
BSCCCTLH DS    XL8                                                              
BSCCCTL  DS    CL22    16    2   22  A  P N             T        Y              
BSCCOM1H DS    XL8                                                              
BSCCOM1  DS    CL6     16   27    6  A  U N             T        Y   70         
BSCCOM1X DS    XL8                                                              
BSCCON1H DS    XL8                                                              
BSCCON1  DS    CL3     16   35    3  A  U N             T        Y   75         
BSCCON1X DS    XL8                                                              
BSCCXTLH DS    XL8                                                              
BSCCXTL  DS    CL20    16   39   20  A  P N             T        Y              
BSCBTY1H DS    XL8                                                              
BSCBTY1  DS    CL4     16   62    4  A  U N             T        Y   85         
BSCBTY1X DS    XL8                                                              
BSCBTTLH DS    XL8                                                              
BSCBTTL  DS    CL10    16   68   10  A  P N             T        Y              
BSCCOM2H DS    XL8                                                              
BSCCOM2  DS    CL6     17   27    6  A  U N             T        Y   90         
BSCCOM2X DS    XL8                                                              
BSCCON2H DS    XL8                                                              
BSCCON2  DS    CL3     17   35    3  A  U N             T        Y   95         
BSCCON2X DS    XL8                                                              
BSCBTY2H DS    XL8                                                              
BSCBTY2  DS    CL4     17   62    4  A  U N             T        Y  100         
BSCBTY2X DS    XL8                                                              
BSCCOM3H DS    XL8                                                              
BSCCOM3  DS    CL6     18   27    6  A  U N             T        Y  105         
BSCCOM3X DS    XL8                                                              
BSCCON3H DS    XL8                                                              
BSCCON3  DS    CL3     18   35    3  A  U N             T        Y  110         
BSCCON3X DS    XL8                                                              
BSCBTY3H DS    XL8                                                              
BSCBTY3  DS    CL4     18   62    4  A  U N             T        Y  115         
BSCBTY3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
BSCBOTLH DS    XL8                                                              
BSCBOTL  DS    CL79    24    2   79  A  P N             T        Y              
BSCLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BSCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1016 BYTES                            
