*          DATA SET PRSFMB5D   AT LEVEL 011 AS OF 06/16/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CB5D      DATE 06/16/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFCMEDH  DS    CL8                                                              
SFCMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFCMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   17    6  A  P H             T        Y              
SFCCLIH  DS    CL8                                                              
SFCCLI   DS    CL3      5   25    3  A  U H             T        Y    0         
SFCCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   39    7  A  P H             T        Y              
SFCPRDH  DS    CL8                                                              
SFCPRD   DS    CL3      5   47    3  A  U H             T        Y    0         
SFCPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   58    8  A  P N             T        Y              
SFCSIDH  DS    CL8                                                              
SFCSID   DS    CL1      5   67    1  A  U H             T        Y    0         
SFCSIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      7    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    5    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   11    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   47    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   61    6  A  P N             T        Y              
SFCLINH  DS    CL8                                                              
SFCLIN   DS    CL79     8    2   79  A  P N             T        Y    0         
SFCLINX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79     9    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    10    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    11    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y    0         
         DS    CL8                                                              
SFCLSTH  DS    CL8                                                              
SFCLST   DS    CL79    23    2   79  A  P N             T        Y    0         
SFCLSTX  DS    CL8                                                              
SFCFILLH DS    CL8                                                              
SFCFILL  DS    CL79    24    2   79  A  P N             T        Y    0         
SFCFILLX DS    CL8                                                              
SFCLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SFCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
