*          DATA SET PRSFMEDD   AT LEVEL 005 AS OF 01/03/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CEDD      DATE 01/03/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
FSLMEDH  DS    CL8                                                              
FSLMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
FSLPUBH  DS    CL8                                                              
FSLPUB   DS    CL17     5   25   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   47    4  A  P N             T        Y              
FSLYRH   DS    CL8                                                              
FSLYR    DS    CL4      5   52    4  A  U N             T        Y              
FSLPUBNH DS    CL8                                                              
FSLPUBN  DS    CL20     6   25   20  A  P H             T        Y              
FSLPUBZH DS    CL8                                                              
FSLPUBZ  DS    CL20     6   47   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      6   69    4  A  P N             T        Y              
FSLFREQH DS    CL8                                                              
FSLFREQ  DS    CL2      6   74    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28     7    2   28  A  P H             T        Y              
FSLSELH  DS    CL8                                                              
FSLSEL   DS    CL3      8    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     8    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
FSLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
FSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
