*          DATA SET PRSFM99D   AT LEVEL 004 AS OF 06/15/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41C99D      DATE 06/15/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
CLFMEDH  DS    XL8                                                              
CLFMED   DS    CL2      6   15    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P H             T        Y              
CLFTESTH DS    XL8                                                              
CLFTEST  DS    CL1      7   15    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P H             T        Y              
CLFDATEH DS    XL8                                                              
CLFDATE  DS    CL8      8   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   21    1  A  U N             T        Y              
CLFLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CLFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 104  BYTES                            
