*          DATA SET PRSFM9ED   AT LEVEL 015 AS OF 11/10/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41C9ED      DATE 11/10/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL16     5    2   16  A  P H             T        Y              
SCRCODEH DS    XL8                                                              
SCRCODE  DS    CL11     5   20   11  A  U N             T        Y   11         
SCRCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   40    1  A  P N             T        Y              
SCRMSGH  DS    XL8                                                              
SCRMSG   DS    CL60     6   15   60  A  P H             T        Y   30         
SCRMSGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SCRMEDH  DS    XL8                                                              
SCRMED   DS    CL14     7   20   14  A  U N             T        Y  110         
SCRMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL32     7   38   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL33     8   38   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P H             T        Y              
SCRCTDTH DS    XL8                                                              
SCRCTDT  DS    CL9      9   20    9  A  U N             T        Y  105         
SCRCTDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    11    2   20  A  P H             T        Y              
SCRDCM1H DS    XL8                                                              
SCRDCM1  DS    CL78    12    2   78  A  U N             T        Y  120         
SCRDCM1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    14   13   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     14   44    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    14   53   10  A  P H             T        Y              
SCRACT1H DS    XL8                                                              
SCRACT1  DS    CL78    15    2   78  A  P N             T        Y              
SCRACT2H DS    XL8                                                              
SCRACT2  DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
SCRACTLH DS    XL8                                                              
SCRACTL  DS    CL78    24    2   78  A  P N             T        Y              
SCRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1368 BYTES                            
