*          DATA SET PRSFMB0D   AT LEVEL 005 AS OF 05/28/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CB0D      DATE 05/28/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
CLTMEDH  DS    XL8                                                              
CLTMED   DS    CL1      6    9    1  A  U N             T        Y   10         
CLTMEDX  DS    XL8                                                              
CLTMEDNH DS    XL8                                                              
CLTMEDN  DS    CL10     6   12   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   36    6  A  P H             T        Y              
CLTCLTH  DS    XL8                                                              
CLTCLT   DS    CL3      6   44    3  A  U N             T        Y   15         
CLTCLTX  DS    XL8                                                              
CLTCLTNH DS    XL8                                                              
CLTCLTN  DS    CL20     6   49   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
CLTCNTLH DS    XL8                                                              
CLTCNTL  DS    CL11     8    2   11  A  P N             T        Y              
CLTCNAMH DS    XL8                                                              
CLTCNAM  DS    CL20     8   21   20  A  U N             T        Y   30         
CLTCNAMX DS    XL8                                                              
CLTBRTLH DS    XL8                                                              
CLTBRTL  DS    CL17     9    2   17  A  P N             T        Y              
CLTBRNH  DS    XL8                                                              
CLTBRN   DS    CL20     9   21   20  A  U N             T        Y   35         
CLTBRNX  DS    XL8                                                              
CLTA1TLH DS    XL8                                                              
CLTA1TL  DS    CL14    10    2   14  A  P N             T        Y              
CLTAL1H  DS    XL8                                                              
CLTAL1   DS    CL30    10   21   30  A  U N             T        Y   40         
CLTAL1X  DS    XL8                                                              
CLTA2TLH DS    XL8                                                              
CLTA2TL  DS    CL14    11    2   14  A  P N             T        Y              
CLTAL2H  DS    XL8                                                              
CLTAL2   DS    CL30    11   21   30  A  U N             T        Y   45         
CLTAL2X  DS    XL8                                                              
CLTAOFTH DS    XL8                                                              
CLTAOFT  DS    CL12    12    2   12  A  P N             T        Y              
CLTATTNH DS    XL8                                                              
CLTATTN  DS    CL24    12   21   24  A  U N             T        Y   50         
CLTATTNX DS    XL8                                                              
CLTCOTLH DS    XL8                                                              
CLTCOTL  DS    CL13    13    2   13  A  P N             T        Y              
CLTOFFH  DS    XL8                                                              
CLTOFF   DS    CL3     13   21    3  A  U N             T        Y              
CLTOFNH  DS    XL8                                                              
CLTOFN   DS    CL8     13   25    8  A  P N             T        Y              
CLTAOTLH DS    XL8                                                              
CLTAOTL  DS    CL15    13   36   15  A  P N             T        Y              
CLTAOFFH DS    XL8                                                              
CLTAOFF  DS    CL5     13   57    5  A  U N             T        Y              
CLTPATLH DS    XL8                                                              
CLTPATL  DS    CL16    14    2   16  A  P N             T        Y              
CLTPASDH DS    XL8                                                              
CLTPASD  DS    CL1     14   21    1  A  U N             T        Y   65         
CLTPASDX DS    XL8                                                              
CLTTOTLH DS    XL8                                                              
CLTTOTL  DS    CL19    14   36   19  A  P N             T        Y              
CLTTOFFH DS    XL8                                                              
CLTTOFF  DS    CL3     14   57    3  A  U N             T        Y              
CLTTOFXH DS    XL8                                                              
CLTTOFX  DS    CL8     14   61    8  A  P N             T        Y              
CLTINTLH DS    XL8                                                              
CLTINTL  DS    CL16    15    2   16  A  P N             T        Y              
CLTNUMH  DS    XL8                                                              
CLTNUM   DS    CL5     15   21    5  A  U N             T        Y   70         
CLTNUMX  DS    XL8                                                              
CLTCSTLH DS    XL8                                                              
CLTCSTL  DS    CL16    15   36   16  A  P N             T        Y              
CLTCSCH  DS    XL8                                                              
CLTCSC   DS    CL7     15   57    7  A  U N             T        Y   80         
CLTCSCX  DS    XL8                                                              
CLTI1TLH DS    XL8                                                              
CLTI1TL  DS    CL13    16    2   13  A  P N             T        Y              
CLTISCH  DS    XL8                                                              
CLTISC   DS    CL7     16   21    7  A  U N             T        Y  110         
CLTISCX  DS    XL8                                                              
CLTT2TLH DS    XL8                                                              
CLTT2TL  DS    CL13    16   36   13  A  P N             T        Y              
CLTISC2H DS    XL8                                                              
CLTISC2  DS    CL7     16   57    7  A  U N             T        Y  115         
CLTISC2X DS    XL8                                                              
CLTBILGH DS    XL8                                                              
CLTBILG  DS    CL13    17    2   13  A  P N             T        Y  120         
CLTBILGX DS    XL8                                                              
CLTBILH  DS    XL8                                                              
CLTBIL   DS    CL1     17   21    1  A  U N             T        Y  125         
CLTBILX  DS    XL8                                                              
CLTDOTLH DS    XL8                                                              
CLTDOTL  DS    CL16    17   36   16  A  P N             T        Y              
CLTDRDH  DS    XL8                                                              
CLTDRD   DS    CL3     17   57    3  A  U N             T        Y  130         
CLTDRDX  DS    XL8                                                              
CLTFINLH DS    XL8                                                              
CLTFINL  DS    CL9     18    2    9  A  P N             T        Y  135         
CLTFINLX DS    XL8                                                              
CLTFINH  DS    XL8                                                              
CLTFIN   DS    CL1     18   21    1  A  U N             T        Y  140         
CLTFINX  DS    XL8                                                              
CLTGSTAH DS    XL8                                                              
CLTGSTA  DS    CL8     19    2    8  A  P N             T        Y   90         
CLTGSTAX DS    XL8                                                              
CLTGSTH  DS    XL8                                                              
CLTGST   DS    CL1     19   12    1  A  P N             T        Y   95         
CLTGSTX  DS    XL8                                                              
CLTPSTAH DS    XL8                                                              
CLTPSTA  DS    CL3     19   15    3  A  P N             T        Y  100         
CLTPSTAX DS    XL8                                                              
CLTPSTH  DS    XL8                                                              
CLTPST   DS    CL19    19   20   19  A  P N             T        Y  105         
CLTPSTX  DS    XL8                                                              
CLTMPSAH DS    XL8                                                              
CLTMPSA  DS    CL8     19   41    8  A  P N             T        Y  106         
CLTMPSAX DS    XL8                                                              
CLTMPSH  DS    XL8                                                              
CLTMPS   DS    CL5     19   51    5  A  P N             T        Y  107         
CLTMPSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
CLTBOTLH DS    XL8                                                              
CLTBOTL  DS    CL79    24    2   79  A  P N             T        Y              
CLTLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CLTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1192 BYTES                            
