*          DATA SET PRSFMF9D   AT LEVEL 004 AS OF 10/20/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CF9D      DATE 10/20/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DIVMEDH  DS    CL8                                                              
DIVMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   14    6  A  P H             T        Y              
DIVCLIH  DS    CL8                                                              
DIVCLI   DS    CL4      5   22    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  A  P H             T        Y              
DIVDIVH  DS    CL8                                                              
DIVDIV   DS    CL4      5   47    4  A  U N             T        Y              
DIVDIVNH DS    CL8                                                              
DIVDIVN  DS    CL20     5   52   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
DIVREGH  DS    CL8                                                              
DIVREG   DS    CL4      6   10    4  A  U N             T        Y              
DIVREGNH DS    CL8                                                              
DIVREGN  DS    CL20     6   15   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  A  P H             T        Y              
DIVDSTH  DS    CL8                                                              
DIVDST   DS    CL4      6   47    4  A  U N             T        Y              
DIVDSTNH DS    CL8                                                              
DIVDSTN  DS    CL20     6   52   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     8    2   13  A  P H             T        Y              
DIVDNAMH DS    CL8                                                              
DIVDNAM  DS    CL20     8   17   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   70    1  A  U N             T        Y              
DIVLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
DIVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 288  BYTES                            
