*          DATA SET PRSFMEAD   AT LEVEL 012 AS OF 09/17/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CEAD      DATE 09/17/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
PGLMEDH  DS    CL8                                                              
PGLMED   DS    CL1      5   10    1  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    H         T        Y              
PGLCLTH  DS    CL8                                                              
PGLCLT   DS    CL3      5   28    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL38     7    2   38  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL31     7   48   31  A   P    H         T        Y              
PGLSELH  DS    CL8                                                              
PGLSEL   DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     8    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    23    6   74  A   P    N         T        Y              
PGLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
PGLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
