*          DATA SET PRSFMD3ED  AT LEVEL 007 AS OF 03/28/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CD3D      DATE 03/28/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL25     6    2   25  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
EDRSPUBH DS    CL8                                                              
EDRSPUB  DS    CL30     7    9   30  A  U N             T        Y  200         
EDRSPUBX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   41    8  A  P H             T        Y              
EDRSEDNH DS    CL8                                                              
EDRSEDN  DS    CL30     7   50   30  A  U N             T        Y  205         
EDRSEDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22     9    2   22  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL36     9   41   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL19    10    4   19  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    10   25   14  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL35    10   41   35  A  P H             T        Y              
EDRENM1H DS    CL8                                                              
EDRENM1  DS    CL22    11    2   22  A  P N             T        Y              
EDRECT1H DS    CL8                                                              
EDRECT1  DS    CL14    11   25   14  A  P N             T        Y              
EDRPUB1H DS    CL8                                                              
EDRPUB1  DS    CL16    11   41   16  A  U N             T        Y  210         
EDRPUB1X DS    CL8                                                              
EDRMED1H DS    CL8                                                              
EDRMED1  DS    CL1     11   59    1  A  U N             T        Y  215         
EDRMED1X DS    CL8                                                              
EDRPBN1H DS    CL8                                                              
EDRPBN1  DS    CL19    11   62   19  A  P N             T        Y              
EDRENM2H DS    CL8                                                              
EDRENM2  DS    CL22    12    2   22  A  P N             T        Y              
EDRECT2H DS    CL8                                                              
EDRECT2  DS    CL14    12   25   14  A  P N             T        Y              
EDRPUB2H DS    CL8                                                              
EDRPUB2  DS    CL16    12   41   16  A  U N             T        Y  210         
EDRPUB2X DS    CL8                                                              
EDRMED2H DS    CL8                                                              
EDRMED2  DS    CL1     12   59    1  A  U N             T        Y  215         
EDRMED2X DS    CL8                                                              
EDRPBN2H DS    CL8                                                              
EDRPBN2  DS    CL19    12   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    13    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    13   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    13   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    14    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    14   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    14   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    15    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    15   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    15   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    16    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    16   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    16   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    17    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    17   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    17   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    18    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    18   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    18   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    19    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    19   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    19   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    20    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    20   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    20   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    21    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    21   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    21   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    21   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    22    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    22   25   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    22   41   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   59    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    22   62   19  A  P N             T        Y              
EDRENMLH DS    CL8                                                              
EDRENML  DS    CL22    23    2   22  A  P N             T        Y              
EDRECTLH DS    CL8                                                              
EDRECTL  DS    CL14    23   25   14  A  P N             T        Y              
EDRPUBLH DS    CL8                                                              
EDRPUBL  DS    CL16    23   41   16  A  U N             T        Y  210         
EDRPUBLX DS    CL8                                                              
EDRMEDLH DS    CL8                                                              
EDRMEDL  DS    CL1     23   59    1  A  U N             T        Y  215         
EDRMEDLX DS    CL8                                                              
EDRPBNLH DS    CL8                                                              
EDRPBNL  DS    CL19    23   62   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    24    2   76  A  P H             T        Y              
EDRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
EDRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2088 BYTES                            
