*          DATA SET PRSFMFAD   AT LEVEL 009 AS OF 09/16/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CFAD      DATE 09/16/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
PGCMEDH  DS    CL8                                                              
PGCMED   DS    CL1      5   10    1  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    H         T        Y              
PGCCLTH  DS    CL8                                                              
PGCCLT   DS    CL3      5   28    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      5   38    3  A   P    H         T        Y              
PGCPUBH  DS    CL8                                                              
PGCPUB   DS    CL18     5   46   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    H         T        Y              
PGCSPAH  DS    CL8                                                              
PGCSPA   DS    CL12     6   10   12  A   U    N         T        Y              
PGCPUBNH DS    CL8                                                              
PGCPUBN  DS    CL20     6   46   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30     8    2   30  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL9      8   38    9  A   P    H         T        Y              
PGCEDATH DS    CL8                                                              
PGCEDAT  DS    CL8      9    2    8  A   U    N         T        Y              
PGCAVGCH DS    CL8                                                              
PGCAVGC  DS    CL10     9   22   10  A   U    N         T        Y              
PGCOPENH DS    CL8                                                              
PGCOPEN  DS    CL10     9   37   10  A   U    N         T        Y              
PGCDEDTH DS    CL8                                                              
PGCDEDT  DS    CL8     10    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    20   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    20   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    21   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    21   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    22   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    22   37   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     23    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    23   22   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    23   37   10  A   U    N         T        Y              
PGCLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
PGCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 992  BYTES                            
