*          DATA SET PRSFM8DD   AT LEVEL 004 AS OF 02/26/19                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41C8DD      DATE 02/26/19                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
ADRMEDH  DS    XL8                                                              
ADRMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  L  P H             T        Y              
ADRCLTH  DS    XL8                                                              
ADRCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
ADRPRDH  DS    XL8                                                              
ADRPRD   DS    CL3      6   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     8    2   16  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73     9    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    10    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    11    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    12    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    13    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    14    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    15    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    16    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    17    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    18    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    19    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    20    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    21    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    22    6   73  A  P N             T        Y              
ADRSELH  DS    XL8                                                              
ADRSEL   DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    23    6   73  A  P N             T        Y              
ADRTAGH  DS    XL8                                                              
ADRTAG   DS    CL1     24   78    1  A  P N             T        Y              
ADRLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
ADRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1504 BYTES                            
