*          DATA SET PRSFMF2D   AT LEVEL 047 AS OF 01/26/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CF2D      DATE 01/26/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
PRTMEDH  DS    CL8                                                              
PRTMED   DS    CL3      5   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A   P    N         T        Y              
PRTCODEH DS    CL8                                                              
PRTCODE  DS    CL4      5   28    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     5   43   12  A   P    N         T        Y              
PRTSCM1H DS    CL8                                                              
PRTSCM1  DS    CL6      5   56    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      5   64    4  A   P    N         T        Y              
PRTSCM2H DS    CL8                                                              
PRTSCM2  DS    CL6      5   69    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
PRTTITLH DS    CL8                                                              
PRTTITL  DS    CL30     6    8   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     6   42   11  A   P    N         T        Y              
PRTLSPAH DS    CL8                                                              
PRTLSPA  DS    CL1      6   54    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL18     6   58   18  A   P    N         T        Y              
PRTSUPRH DS    CL8                                                              
PRTSUPR  DS    CL1      6   78    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A   P    N         T        Y              
PRTSEL1H DS    CL8                                                              
PRTSEL1  DS    CL60     7   12   60  A   U    N         T        Y              
PRTSEL2H DS    CL8                                                              
PRTSEL2  DS    CL60     8   12   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL76     9    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    10    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    11    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    12    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    13    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    14    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    15    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    16    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    17    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    18    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    19    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    20    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    21    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    22    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    23    2   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL76    24    2   76  A   P    N         T        Y              
PRTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1736 BYTES                            
