*          DATA SET PRSFMD4D   AT LEVEL 002 AS OF 02/24/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CD4D      DATE 02/24/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
EDRSPUBH DS    CL8                                                              
EDRSPUB  DS    CL30     7    9   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   41    8  A  P H             T        Y              
EDRSEDNH DS    CL8                                                              
EDRSEDN  DS    CL30     7   50   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25     9    2   25  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL36     9   45   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL23    10    4   23  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    10   28   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL35    10   45   35  A  P H             T        Y              
EDRENM1H DS    CL8                                                              
EDRENM1  DS    CL25    11    2   25  A  P N             T        Y              
EDRECT1H DS    CL8                                                              
EDRECT1  DS    CL15    11   28   15  A  P N             T        Y              
EDRPUB1H DS    CL8                                                              
EDRPUB1  DS    CL11    11   45   11  A  U N             T        Y              
EDRMED1H DS    CL8                                                              
EDRMED1  DS    CL1     11   58    1  A  U N             T        Y              
EDRPBN1H DS    CL8                                                              
EDRPBN1  DS    CL20    11   61   20  A  P N             T        Y              
EDRENM2H DS    CL8                                                              
EDRENM2  DS    CL25    12    2   25  A  P N             T        Y              
EDRECT2H DS    CL8                                                              
EDRECT2  DS    CL15    12   28   15  A  P N             T        Y              
EDRPUB2H DS    CL8                                                              
EDRPUB2  DS    CL11    12   45   11  A  U N             T        Y              
EDRMED2H DS    CL8                                                              
EDRMED2  DS    CL1     12   58    1  A  U N             T        Y              
EDRPBN2H DS    CL8                                                              
EDRPBN2  DS    CL20    12   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    13    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    13   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    14    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    15    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    16    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    16   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    17    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    17   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    18    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    19    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    20    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    21    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    21   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    22    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    22   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   61   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    23    2   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    23   28   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   45   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    23   61   20  A  P N             T        Y              
EDRENMLH DS    CL8                                                              
EDRENML  DS    CL25    24    2   25  A  P N             T        Y              
EDRECTLH DS    CL8                                                              
EDRECTL  DS    CL15    24   28   15  A  P N             T        Y              
EDRPUBLH DS    CL8                                                              
EDRPUBL  DS    CL11    24   45   11  A  U N             T        Y              
EDRMEDLH DS    CL8                                                              
EDRMEDL  DS    CL1     24   58    1  A  U N             T        Y              
EDRPBNLH DS    CL8                                                              
EDRPBNL  DS    CL20    24   61   20  A  P N             T        Y              
EDRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
EDRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1864 BYTES                            
