*          DATA SET PRSFMA9D   AT LEVEL 003 AS OF 09/29/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CA9D      DATE 09/29/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SCLMEDH  DS    XL8                                                              
SCLMED   DS    CL1      5   10    1  A  U N             T    I   Y   10         
SCLMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   16    6  A  P N             T        Y              
SCLCLTH  DS    XL8                                                              
SCLCLT   DS    CL3      5   26    3  A  U N             T        Y   30         
SCLCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
SCLPRDH  DS    XL8                                                              
SCLPRD   DS    CL3      5   48    3  A  U N             T        Y   35         
SCLPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   60    3  A  P N             T        Y              
SCLPUBH  DS    XL8                                                              
SCLPUB   DS    CL16     5   64   16  A  U N             T        Y   20         
SCLPUBX  DS    XL8                                                              
SCLMEDNH DS    XL8                                                              
SCLMEDN  DS    CL12     6    2   12  A  P N             T        Y              
SCLCLTNH DS    XL8                                                              
SCLCLTN  DS    CL20     6   16   20  A  P N             T        Y              
SCLPRDNH DS    XL8                                                              
SCLPRDN  DS    CL20     6   38   20  A  P N             T        Y              
SCLPUBNH DS    XL8                                                              
SCLPUBN  DS    CL20     6   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
SCLPUBZH DS    XL8                                                              
SCLPUBZ  DS    CL20     7   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     8    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25     8   25   25  A  P N             T        Y              
SCLSELH  DS    XL8                                                              
SCLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
SCLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
