*          DATA SET PRSFMD7D   AT LEVEL 006 AS OF 11/05/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CD7D      DATE 11/05/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BILMEDH  DS    XL8                                                              
BILMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
BILCLTH  DS    XL8                                                              
BILCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     7    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P H             T        Y              
BILPRDH  DS    XL8                                                              
BILPRD   DS    CL3      7   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   38    8  A  P H             T        Y              
BILESTH  DS    XL8                                                              
BILEST   DS    CL3      7   48    3  A  U N             T        Y              
BILESTDH DS    XL8                                                              
BILESTD  DS    CL17     7   52   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     9    2   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16     9   55   16  A  P H             T        Y              
BILPRD1H DS    XL8                                                              
BILPRD1  DS    CL3     10    2    3  A  U N             T        Y              
BILEST1H DS    XL8                                                              
BILEST1  DS    CL3     10    7    3  A  U N             T        Y              
BILMOS1H DS    XL8                                                              
BILMOS1  DS    CL7     10   13    7  A  U N             T        Y              
BILFML1H DS    XL8                                                              
BILFML1  DS    CL29    10   25   29  A  U N             T        Y              
BILACP1H DS    XL8                                                              
BILACP1  DS    CL10    10   55   10  A  U N             T        Y              
BILACO1H DS    XL8                                                              
BILACO1  DS    CL9     10   69    9  A  U N             T        Y              
BILPRD2H DS    XL8                                                              
BILPRD2  DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    11   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    12   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    13   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    14   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    15   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    16   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    17   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    18   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    19   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    20   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    21   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   69    9  A  U N             T        Y              
BILPRDLH DS    XL8                                                              
BILPRDL  DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   13    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    22   25   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   55   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   69    9  A  U N             T        Y              
BILLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BILWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1640 BYTES                            
