*          DATA SET PRSFMC8D   AT LEVEL 008 AS OF 10/20/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CC8D      DATE 10/20/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PLLMEDH  DS    CL8                                                              
PLLMED   DS    CL1      5   10    1  A  U N             T        Y  200         
PLLMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
PLLCLTH  DS    CL8                                                              
PLLCLT   DS    CL5      5   28    5  A  U N             T        Y  210         
PLLCLTX  DS    CL8                                                              
PLLCLTNH DS    CL8                                                              
PLLCLTN  DS    CL20     5   38   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
PLLPBLCH DS    CL8                                                              
PLLPBLC  DS    CL5      7   12    5  A  U N             T        Y  205         
PLLPBLCX DS    CL8                                                              
PLLPBLNH DS    CL8                                                              
PLLPBLN  DS    CL20     7   18   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   15    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   47    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    7    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   15    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     9   22   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   46    6  A  P N             T        Y              
PLLSEL1H DS    CL8                                                              
PLLSEL1  DS    CL3     10    2    3  A  U N             T        Y  225         
PLLSEL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
PLLSEL2H DS    CL8                                                              
PLLSEL2  DS    CL3     11    2    3  A  U N             T        Y  225         
PLLSEL2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
PLLSELLH DS    CL8                                                              
PLLSELL  DS    CL3     23    2    3  A  U N             T        Y  225         
PLLSELLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
PLLTAGH  DS    CL8                                                              
PLLTAG   DS    CL1     24    2    1  A  P N             T        Y              
PLLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
PLLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
