*          DATA SET PRSFMDBD   AT LEVEL 005 AS OF 05/05/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CDBD      DATE 05/05/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BFRMEDH  DS    XL8                                                              
BFRMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
BFRCLTH  DS    XL8                                                              
BFRCLT   DS    CL3      5   29    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
BFRPRDH  DS    XL8                                                              
BFRPRD   DS    CL3      7   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   20    8  A  P H             T        Y              
BFRESTH  DS    XL8                                                              
BFREST   DS    CL3      7   29    3  A  U N             T        Y              
BFRESTDH DS    XL8                                                              
BFRESTD  DS    CL17     7   35   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      9   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16     9   50   16  A  P H             T        Y              
BFRMOS1H DS    XL8                                                              
BFRMOS1  DS    CL10    10    2   10  A  U N             T        Y              
BFRFML1H DS    XL8                                                              
BFRFML1  DS    CL29    10   20   29  A  U N             T        Y              
BFRACP1H DS    XL8                                                              
BFRACP1  DS    CL10    10   50   10  A  U N             T        Y              
BFRACO1H DS    XL8                                                              
BFRACO1  DS    CL10    10   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    11   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    12   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    13   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    14   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    15   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    16   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    17   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    18   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    19   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   61   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    20   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   61   10  A  U N             T        Y              
BFRMOSLH DS    XL8                                                              
BFRMOSL  DS    CL10    21    2   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29    21   20   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   61   10  A  U N             T        Y              
BFRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1288 BYTES                            
