*          DATA SET PRSFMF7D   AT LEVEL 004 AS OF 08/11/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CF7D      DATE 08/11/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DIVMEDH  DS    XL8                                                              
DIVMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   14    6  A  P H             T        Y              
DIVCLIH  DS    XL8                                                              
DIVCLI   DS    CL4      5   22    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P H             T        Y              
DIVDIVH  DS    XL8                                                              
DIVDIV   DS    CL4      5   47    4  A  U N             T        Y              
DIVDIVNH DS    XL8                                                              
DIVDIVN  DS    CL20     5   52   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     7    2   13  A  P H             T        Y              
DIVDNAMH DS    XL8                                                              
DIVDNAM  DS    CL20     7   22   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
DIVREPH  DS    XL8                                                              
DIVREP   DS    CL4      8   22    4  A  U N             T        Y              
DIVREPNH DS    XL8                                                              
DIVREPN  DS    CL30     8   44   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   76    1  A  U N             T        Y              
DIVLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
DIVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 248  BYTES                            
