*          DATA SET PRSFMB6D   AT LEVEL 003 AS OF 09/06/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CB6D      DATE 09/06/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFSMEDH  DS    XL8                                                              
SFSMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFSMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   20    2  A  P H             T        Y              
SFSIDH   DS    XL8                                                              
SFSID    DS    CL2      5   24    2  A  U H             T        Y    0         
SFSIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   32    4  A  P H             T        Y              
SFSCODEH DS    XL8                                                              
SFSCODE  DS    CL4      5   38    4  A  U H             T        Y    0         
SFSCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   43    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     5   45   13  A  P N             T        Y              
SFSSTRTH DS    XL8                                                              
SFSSTRT  DS    CL17     5   60   17  A  U H             T        Y    0         
SFSSTRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SFSBK1H  DS    XL8                                                              
SFSBK1   DS    CL12     7   11   12  A  P N             T        Y              
SFSBK1LH DS    XL8                                                              
SFSBK1L  DS    CL3      7   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   32    4  A  P N             T        Y              
SFSNM1H  DS    XL8                                                              
SFSNM1   DS    CL24     7   38   24  A  U H             T        Y    0         
SFSNM1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SFSBK2H  DS    XL8                                                              
SFSBK2   DS    CL12     8   11   12  A  P N             T        Y              
SFSBK2LH DS    XL8                                                              
SFSBK2L  DS    CL3      8   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   32    4  A  P N             T        Y              
SFSNM2H  DS    XL8                                                              
SFSNM2   DS    CL24     8   38   24  A  U H             T        Y    0         
SFSNM2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
SFSNEWH  DS    XL8                                                              
SFSNEW   DS    CL17    10   21   17  A  U H             T        Y    0         
SFSNEWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    10   40   17  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    10   59   17  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11    2   17  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11   21   17  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11   40   17  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11   59   17  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
SFSLISTH DS    XL8                                                              
SFSLIST  DS    CL76    14    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    15    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    16    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    17    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    18    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    19    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    20    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    21    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    22    2   76  A  P N             T        Y              
SFSPFKH  DS    XL8                                                              
SFSPFK   DS    CL77    23    2   77  L  P H             T        Y              
SFSLUPDH DS    XL8                                                              
SFSLUPD  DS    CL13    24    2   13  L  P N             T        Y              
SFSDTEUH DS    XL8                                                              
SFSDTEU  DS    CL8     24   16    8  A  P N             T        Y              
SFSPIDUH DS    XL8                                                              
SFSPIDU  DS    CL8     24   26    8  A  P N             T        Y              
SFSNAMUH DS    XL8                                                              
SFSNAMU  DS    CL40    24   36   40  A  P N             T        Y              
SFSLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SFSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1584 BYTES                            
