*          DATA SET PRSFM9AD   AT LEVEL 006 AS OF 05/13/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41C9AD      DATE 05/13/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SCRMEDH  DS    XL8                                                              
SCRMED   DS    CL1      5   12    1  A  U N             T        Y              
SCRMEDNH DS    XL8                                                              
SCRMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
SCRCLTH  DS    XL8                                                              
SCRCLT   DS    CL3      5   46    3  A  U N             T        Y              
SCRCLTNH DS    XL8                                                              
SCRCLTN  DS    CL20     5   51   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P H             T        Y              
SCRDTEH  DS    XL8                                                              
SCRDTE   DS    CL8      6   12    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
SCRSNH   DS    XL8                                                              
SCRSN    DS    CL10     6   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SCRPRDH  DS    XL8                                                              
SCRPRD   DS    CL3      8   12    3  A  U N             T        Y              
SCRPRDNH DS    XL8                                                              
SCRPRDN  DS    CL20     8   17   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
SCRESTH  DS    XL8                                                              
SCREST   DS    CL3      9   12    3  A  U N             T        Y              
SCRESTNH DS    XL8                                                              
SCRESTN  DS    CL20     9   17   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
SCRDATH  DS    XL8                                                              
SCRDAT   DS    CL12    10   12   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
SCRPUBH  DS    XL8                                                              
SCRPUB   DS    CL15    11   12   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
SCRPAYEH DS    XL8                                                              
SCRPAYE  DS    CL4     12   12    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
SCRINVNH DS    XL8                                                              
SCRINVN  DS    CL12    13   12   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
SCRINVAH DS    XL8                                                              
SCRINVA  DS    CL12    14   12   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15    2    4  A  P N             T        Y              
SCRRATEH DS    XL8                                                              
SCRRATE  DS    CL12    15   12   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16    2    4  A  P N             T        Y              
SCRPAIDH DS    XL8                                                              
SCRPAID  DS    CL8     16   12    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
SCRMSGH  DS    XL8                                                              
SCRMSG   DS    CL60    17   12   60  A  U N             T        Y              
SCRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 592  BYTES                            
