*          DATA SET PRSFMC0D   AT LEVEL 008 AS OF 05/15/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CC0D      DATE 05/15/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CRLMEDH  DS    CL8                                                              
CRLMED   DS    CL1      5   10    1  A  U N             T        Y  200         
CRLMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
CRLPUBH  DS    CL8                                                              
CRLPUB   DS    CL15     5   28   15  A  U N             T        Y  205         
CRLPUBX  DS    CL8                                                              
CRLPUBNH DS    CL8                                                              
CRLPUBN  DS    CL20     5   50   20  A  P N             T        Y              
CRLPUBZH DS    CL8                                                              
CRLPUBZ  DS    CL20     6   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A  P N             T        Y              
CRLSRCH  DS    CL8                                                              
CRLSRC   DS    CL5      7   13    5  A  U N             T        Y  210         
CRLSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   23    4  A  P N             T        Y              
CRLPERH  DS    CL8                                                              
CRLPER   DS    CL5      7   28    5  A  U N             T        Y  215         
CRLPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   40    6  A  P N             T        Y              
CRLCLTH  DS    CL8                                                              
CRLCLT   DS    CL5      7   47    5  A  U N             T        Y  220         
CRLCLTX  DS    CL8                                                              
CRLCLTNH DS    CL8                                                              
CRLCLTN  DS    CL20     7   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     9    6   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     9   22   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      9   43    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      9   50    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      9   55    6  A  P H             T        Y              
CRLSEL1H DS    CL8                                                              
CRLSEL1  DS    CL3     10    2    3  A  U N             T        Y  225         
CRLSEL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
CRLSEL2H DS    CL8                                                              
CRLSEL2  DS    CL3     11    2    3  A  U N             T        Y  225         
CRLSEL2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y  225         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
CRLSELLH DS    CL8                                                              
CRLSELL  DS    CL3     23    2    3  A  U N             T        Y  225         
CRLSELLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
CRLTAGH  DS    CL8                                                              
CRLTAG   DS    CL1     24    2    1  A  P N             T        Y              
CRLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
CRLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1816 BYTES                            
