*          DATA SET PRSFMDDD   AT LEVEL 013 AS OF 07/08/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CDDD      DATE 07/08/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SCRMEDH  DS    XL8                                                              
SCRMED   DS    CL1      5   10    1  A  U N             T    I   Y   10         
SCRMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   15    6  A  P N             T        Y              
SCRCLTH  DS    XL8                                                              
SCRCLT   DS    CL3      5   25    3  A  U N             T        Y   30         
SCRCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   36    7  A  P N             T        Y              
SCRPRDH  DS    XL8                                                              
SCRPRD   DS    CL3      5   46    3  A  U N             T        Y   35         
SCRPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   57    8  A  P N             T        Y              
SCRESTH  DS    XL8                                                              
SCREST   DS    CL3      5   67    3  A  U N             T        Y   20         
SCRESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
SCRMEDNH DS    XL8                                                              
SCRMEDN  DS    CL12     6    2   12  A  P N             T        Y              
SCRCLTNH DS    XL8                                                              
SCRCLTN  DS    CL20     6   15   20  A  P N             T        Y              
SCRPRDNH DS    XL8                                                              
SCRPRDN  DS    CL20     6   36   20  A  P N             T        Y              
SCRESTNH DS    XL8                                                              
SCRESTN  DS    CL20     6   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
SCRPAGEH DS    XL8                                                              
SCRPAGE  DS    CL3      7   10    3  A  U N             T        Y   25         
SCRPAGEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
SCRPOTLH DS    XL8                                                              
SCRPOTL  DS    CL12     8    6   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   34   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   59    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   67    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   74    3  A  P N             T        Y              
SCRACT1H DS    XL8                                                              
SCRACT1  DS    CL3      9    2    3  A  U N             T        Y   50         
SCRACT1X DS    XL8                                                              
SCRPO#1H DS    XL8                                                              
SCRPO#1  DS    CL25     9    6   25  A  U N             T        Y   60         
SCRPO#1X DS    XL8                                                              
SCRDAT1H DS    XL8                                                              
SCRDAT1  DS    CL17     9   33   17  A  U N             T        Y   70         
SCRDAT1X DS    XL8                                                              
SCRAMT1H DS    XL8                                                              
SCRAMT1  DS    CL13     9   52   13  A  U N             T        Y   77         
SCRAMT1X DS    XL8                                                              
SCRSTA1H DS    XL8                                                              
SCRSTA1  DS    CL6      9   67    6  A  U N             T        Y   80         
SCRSTA1X DS    XL8                                                              
SCRBUY1H DS    XL8                                                              
SCRBUY1  DS    CL3      9   74    3  A  P N             T        Y              
SCRID1H  DS    XL8                                                              
SCRID1   DS    CL3      9   78    3  A  P Z             T        Y              
SCRACT2H DS    XL8                                                              
SCRACT2  DS    CL3     10    2    3  A  U N             T        Y   50         
SCRACT2X DS    XL8                                                              
SCRPO#2H DS    XL8                                                              
SCRPO#2  DS    CL25    10    6   25  A  U N             T        Y   60         
SCRPO#2X DS    XL8                                                              
SCRDAT2H DS    XL8                                                              
SCRDAT2  DS    CL17    10   33   17  A  U N             T        Y   70         
SCRDAT2X DS    XL8                                                              
SCRAMT2H DS    XL8                                                              
SCRAMT2  DS    CL13    10   52   13  A  U N             T        Y   77         
SCRAMT2X DS    XL8                                                              
SCRSTA2H DS    XL8                                                              
SCRSTA2  DS    CL6     10   67    6  A  U N             T        Y   80         
SCRSTA2X DS    XL8                                                              
SCRBUY2H DS    XL8                                                              
SCRBUY2  DS    CL3     10   74    3  A  P N             T        Y              
SCRID2H  DS    XL8                                                              
SCRID2   DS    CL3     10   78    3  A  P Z             T        Y              
SCRACT3H DS    XL8                                                              
SCRACT3  DS    CL3     11    2    3  A  U N             T        Y   50         
SCRACT3X DS    XL8                                                              
SCRPO#3H DS    XL8                                                              
SCRPO#3  DS    CL25    11    6   25  A  U N             T        Y   60         
SCRPO#3X DS    XL8                                                              
SCRDAT3H DS    XL8                                                              
SCRDAT3  DS    CL17    11   33   17  A  U N             T        Y   70         
SCRDAT3X DS    XL8                                                              
SCRAMT3H DS    XL8                                                              
SCRAMT3  DS    CL13    11   52   13  A  U N             T        Y   77         
SCRAMT3X DS    XL8                                                              
SCRSTA3H DS    XL8                                                              
SCRSTA3  DS    CL6     11   67    6  A  U N             T        Y   80         
SCRSTA3X DS    XL8                                                              
SCRBUY3H DS    XL8                                                              
SCRBUY3  DS    CL3     11   74    3  A  P N             T        Y              
SCRID3H  DS    XL8                                                              
SCRID3   DS    CL3     11   78    3  A  P Z             T        Y              
SCRACT4H DS    XL8                                                              
SCRACT4  DS    CL3     12    2    3  A  U N             T        Y   50         
SCRACT4X DS    XL8                                                              
SCRPO#4H DS    XL8                                                              
SCRPO#4  DS    CL25    12    6   25  A  U N             T        Y   60         
SCRPO#4X DS    XL8                                                              
SCRDAT4H DS    XL8                                                              
SCRDAT4  DS    CL17    12   33   17  A  U N             T        Y   70         
SCRDAT4X DS    XL8                                                              
SCRAMT4H DS    XL8                                                              
SCRAMT4  DS    CL13    12   52   13  A  U N             T        Y   77         
SCRAMT4X DS    XL8                                                              
SCRSTA4H DS    XL8                                                              
SCRSTA4  DS    CL6     12   67    6  A  U N             T        Y   80         
SCRSTA4X DS    XL8                                                              
SCRBUY4H DS    XL8                                                              
SCRBUY4  DS    CL3     12   74    3  A  P N             T        Y              
SCRID4H  DS    XL8                                                              
SCRID4   DS    CL3     12   78    3  A  P Z             T        Y              
SCRACT5H DS    XL8                                                              
SCRACT5  DS    CL3     13    2    3  A  U N             T        Y   50         
SCRACT5X DS    XL8                                                              
SCRPO#5H DS    XL8                                                              
SCRPO#5  DS    CL25    13    6   25  A  U N             T        Y   60         
SCRPO#5X DS    XL8                                                              
SCRDAT5H DS    XL8                                                              
SCRDAT5  DS    CL17    13   33   17  A  U N             T        Y   70         
SCRDAT5X DS    XL8                                                              
SCRAMT5H DS    XL8                                                              
SCRAMT5  DS    CL13    13   52   13  A  U N             T        Y   77         
SCRAMT5X DS    XL8                                                              
SCRSTA5H DS    XL8                                                              
SCRSTA5  DS    CL6     13   67    6  A  U N             T        Y   80         
SCRSTA5X DS    XL8                                                              
SCRBUY5H DS    XL8                                                              
SCRBUY5  DS    CL3     13   74    3  A  P N             T        Y              
SCRID5H  DS    XL8                                                              
SCRID5   DS    CL3     13   78    3  A  P Z             T        Y              
SCRACT6H DS    XL8                                                              
SCRACT6  DS    CL3     14    2    3  A  U N             T        Y   50         
SCRACT6X DS    XL8                                                              
SCRPO#6H DS    XL8                                                              
SCRPO#6  DS    CL25    14    6   25  A  U N             T        Y   60         
SCRPO#6X DS    XL8                                                              
SCRDAT6H DS    XL8                                                              
SCRDAT6  DS    CL17    14   33   17  A  U N             T        Y   70         
SCRDAT6X DS    XL8                                                              
SCRAMT6H DS    XL8                                                              
SCRAMT6  DS    CL13    14   52   13  A  U N             T        Y   77         
SCRAMT6X DS    XL8                                                              
SCRSTA6H DS    XL8                                                              
SCRSTA6  DS    CL6     14   67    6  A  U N             T        Y   80         
SCRSTA6X DS    XL8                                                              
SCRBUY6H DS    XL8                                                              
SCRBUY6  DS    CL3     14   74    3  A  P N             T        Y              
SCRID6H  DS    XL8                                                              
SCRID6   DS    CL3     14   78    3  A  P Z             T        Y              
SCRACT7H DS    XL8                                                              
SCRACT7  DS    CL3     15    2    3  A  U N             T        Y   50         
SCRACT7X DS    XL8                                                              
SCRPO#7H DS    XL8                                                              
SCRPO#7  DS    CL25    15    6   25  A  U N             T        Y   60         
SCRPO#7X DS    XL8                                                              
SCRDAT7H DS    XL8                                                              
SCRDAT7  DS    CL17    15   33   17  A  U N             T        Y   70         
SCRDAT7X DS    XL8                                                              
SCRAMT7H DS    XL8                                                              
SCRAMT7  DS    CL13    15   52   13  A  U N             T        Y   77         
SCRAMT7X DS    XL8                                                              
SCRSTA7H DS    XL8                                                              
SCRSTA7  DS    CL6     15   67    6  A  U N             T        Y   80         
SCRSTA7X DS    XL8                                                              
SCRBUY7H DS    XL8                                                              
SCRBUY7  DS    CL3     15   74    3  A  P N             T        Y              
SCRID7H  DS    XL8                                                              
SCRID7   DS    CL3     15   78    3  A  P Z             T        Y              
SCRACT8H DS    XL8                                                              
SCRACT8  DS    CL3     16    2    3  A  U N             T        Y   50         
SCRACT8X DS    XL8                                                              
SCRPO#8H DS    XL8                                                              
SCRPO#8  DS    CL25    16    6   25  A  U N             T        Y   60         
SCRPO#8X DS    XL8                                                              
SCRDAT8H DS    XL8                                                              
SCRDAT8  DS    CL17    16   33   17  A  U N             T        Y   70         
SCRDAT8X DS    XL8                                                              
SCRAMT8H DS    XL8                                                              
SCRAMT8  DS    CL13    16   52   13  A  U N             T        Y   77         
SCRAMT8X DS    XL8                                                              
SCRSTA8H DS    XL8                                                              
SCRSTA8  DS    CL6     16   67    6  A  U N             T        Y   80         
SCRSTA8X DS    XL8                                                              
SCRBUY8H DS    XL8                                                              
SCRBUY8  DS    CL3     16   74    3  A  P N             T        Y              
SCRID8H  DS    XL8                                                              
SCRID8   DS    CL3     16   78    3  A  P Z             T        Y              
SCRACT9H DS    XL8                                                              
SCRACT9  DS    CL3     17    2    3  A  U N             T        Y   50         
SCRACT9X DS    XL8                                                              
SCRPO#9H DS    XL8                                                              
SCRPO#9  DS    CL25    17    6   25  A  U N             T        Y   60         
SCRPO#9X DS    XL8                                                              
SCRDAT9H DS    XL8                                                              
SCRDAT9  DS    CL17    17   33   17  A  U N             T        Y   70         
SCRDAT9X DS    XL8                                                              
SCRAMT9H DS    XL8                                                              
SCRAMT9  DS    CL13    17   52   13  A  U N             T        Y   77         
SCRAMT9X DS    XL8                                                              
SCRSTA9H DS    XL8                                                              
SCRSTA9  DS    CL6     17   67    6  A  U N             T        Y   80         
SCRSTA9X DS    XL8                                                              
SCRBUY9H DS    XL8                                                              
SCRBUY9  DS    CL3     17   74    3  A  P N             T        Y              
SCRID9H  DS    XL8                                                              
SCRID9   DS    CL3     17   78    3  A  P Z             T        Y              
SCRACTAH DS    XL8                                                              
SCRACTA  DS    CL3     18    2    3  A  U N             T        Y   50         
SCRACTAX DS    XL8                                                              
SCRPO#AH DS    XL8                                                              
SCRPO#A  DS    CL25    18    6   25  A  U N             T        Y   60         
SCRPO#AX DS    XL8                                                              
SCRDATAH DS    XL8                                                              
SCRDATA  DS    CL17    18   33   17  A  U N             T        Y   70         
SCRDATAX DS    XL8                                                              
SCRAMTAH DS    XL8                                                              
SCRAMTA  DS    CL13    18   52   13  A  U N             T        Y   77         
SCRAMTAX DS    XL8                                                              
SCRSTAAH DS    XL8                                                              
SCRSTAA  DS    CL6     18   67    6  A  U N             T        Y   80         
SCRSTAAX DS    XL8                                                              
SCRBUYAH DS    XL8                                                              
SCRBUYA  DS    CL3     18   74    3  A  P N             T        Y              
SCRIDAH  DS    XL8                                                              
SCRIDA   DS    CL3     18   78    3  A  P Z             T        Y              
SCRACTBH DS    XL8                                                              
SCRACTB  DS    CL3     19    2    3  A  U N             T        Y   50         
SCRACTBX DS    XL8                                                              
SCRPO#BH DS    XL8                                                              
SCRPO#B  DS    CL25    19    6   25  A  U N             T        Y   60         
SCRPO#BX DS    XL8                                                              
SCRDATBH DS    XL8                                                              
SCRDATB  DS    CL17    19   33   17  A  U N             T        Y   70         
SCRDATBX DS    XL8                                                              
SCRAMTBH DS    XL8                                                              
SCRAMTB  DS    CL13    19   52   13  A  U N             T        Y   77         
SCRAMTBX DS    XL8                                                              
SCRSTABH DS    XL8                                                              
SCRSTAB  DS    CL6     19   67    6  A  U N             T        Y   80         
SCRSTABX DS    XL8                                                              
SCRBUYBH DS    XL8                                                              
SCRBUYB  DS    CL3     19   74    3  A  P N             T        Y              
SCRIDBH  DS    XL8                                                              
SCRIDB   DS    CL3     19   78    3  A  P Z             T        Y              
SCRACTCH DS    XL8                                                              
SCRACTC  DS    CL3     20    2    3  A  U N             T        Y   50         
SCRACTCX DS    XL8                                                              
SCRPO#CH DS    XL8                                                              
SCRPO#C  DS    CL25    20    6   25  A  U N             T        Y   60         
SCRPO#CX DS    XL8                                                              
SCRDATCH DS    XL8                                                              
SCRDATC  DS    CL17    20   33   17  A  U N             T        Y   70         
SCRDATCX DS    XL8                                                              
SCRAMTCH DS    XL8                                                              
SCRAMTC  DS    CL13    20   52   13  A  U N             T        Y   77         
SCRAMTCX DS    XL8                                                              
SCRSTACH DS    XL8                                                              
SCRSTAC  DS    CL6     20   67    6  A  U N             T        Y   80         
SCRSTACX DS    XL8                                                              
SCRBUYCH DS    XL8                                                              
SCRBUYC  DS    CL3     20   74    3  A  P N             T        Y              
SCRIDCH  DS    XL8                                                              
SCRIDC   DS    CL3     20   78    3  A  P Z             T        Y              
SCRACTDH DS    XL8                                                              
SCRACTD  DS    CL3     21    2    3  A  U N             T        Y   50         
SCRACTDX DS    XL8                                                              
SCRPO#DH DS    XL8                                                              
SCRPO#D  DS    CL25    21    6   25  A  U N             T        Y   60         
SCRPO#DX DS    XL8                                                              
SCRDATDH DS    XL8                                                              
SCRDATD  DS    CL17    21   33   17  A  U N             T        Y   70         
SCRDATDX DS    XL8                                                              
SCRAMTDH DS    XL8                                                              
SCRAMTD  DS    CL13    21   52   13  A  U N             T        Y   77         
SCRAMTDX DS    XL8                                                              
SCRSTADH DS    XL8                                                              
SCRSTAD  DS    CL6     21   67    6  A  U N             T        Y   80         
SCRSTADX DS    XL8                                                              
SCRBUYDH DS    XL8                                                              
SCRBUYD  DS    CL3     21   74    3  A  P N             T        Y              
SCRIDDH  DS    XL8                                                              
SCRIDD   DS    CL3     21   78    3  A  P Z             T        Y              
SCRACTLH DS    XL8                                                              
SCRACTL  DS    CL3     22    2    3  A  U N             T        Y   50         
SCRACTLX DS    XL8                                                              
SCRPO#LH DS    XL8                                                              
SCRPO#L  DS    CL25    22    6   25  A  U N             T        Y   60         
SCRPO#LX DS    XL8                                                              
SCRDATLH DS    XL8                                                              
SCRDATL  DS    CL17    22   33   17  A  U N             T        Y   70         
SCRDATLX DS    XL8                                                              
SCRAMTLH DS    XL8                                                              
SCRAMTL  DS    CL13    22   52   13  A  U N             T        Y   77         
SCRAMTLX DS    XL8                                                              
SCRSTALH DS    XL8                                                              
SCRSTAL  DS    CL6     22   67    6  A  U N             T        Y   80         
SCRSTALX DS    XL8                                                              
SCRBUYLH DS    XL8                                                              
SCRBUYL  DS    CL3     22   74    3  A  P N             T        Y              
SCRIDLH  DS    XL8                                                              
SCRIDL   DS    CL3     22   78    3  A  P Z             T        Y              
SCRLUPDH DS    XL8                                                              
SCRLUPD  DS    CL13    23    2   13  L  P N             T        Y              
SCRDTEUH DS    XL8                                                              
SCRDTEU  DS    CL8     23   16    8  A  P N             T        Y              
SCRPIDUH DS    XL8                                                              
SCRPIDU  DS    CL8     23   26    8  A  P N             T        Y              
SCRNAMUH DS    XL8                                                              
SCRNAMU  DS    CL40    23   36   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
SCRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2888 BYTES                            
