*          DATA SET PRSFMC2D   AT LEVEL 002 AS OF 09/12/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CC2D      DATE 09/12/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SCRMEDH  DS    XL8                                                              
SCRMED   DS    CL1      5   10    1  A  U N             T    I   Y   10         
SCRMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   16    3  A  P H             T        Y              
SCRPUBH  DS    XL8                                                              
SCRPUB   DS    CL16     5   20   16  A  U N             T        Y   20         
SCRPUBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SCRCLTH  DS    XL8                                                              
SCRCLT   DS    CL3      5   48    3  A  U N             T        Y   30         
SCRCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   60    7  A  P N             T        Y              
SCRPRDH  DS    XL8                                                              
SCRPRD   DS    CL3      5   70    3  A  U N             T        Y   35         
SCRPRDX  DS    XL8                                                              
SCRMEDNH DS    XL8                                                              
SCRMEDN  DS    CL12     6    2   12  A  P N             T        Y              
SCRPUBNH DS    XL8                                                              
SCRPUBN  DS    CL20     6   16   20  A  P N             T        Y              
SCRCLTNH DS    XL8                                                              
SCRCLTN  DS    CL20     6   38   20  A  P N             T        Y              
SCRPRDNH DS    XL8                                                              
SCRPRDN  DS    CL20     6   60   20  A  P N             T        Y              
SCRPUBZH DS    XL8                                                              
SCRPUBZ  DS    CL20     7   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P Z             T        Y              
SCRBYRH  DS    XL8                                                              
SCRBYR   DS    CL30     8   10   30  L  P Z             T        Y   40         
SCRBYRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
SCRBASH  DS    XL8                                                              
SCRBAS   DS    CL40     9   15   40  L  U N             T        Y   50         
SCRBASX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10    5    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   48    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   69    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   70    5  A  P N             T        Y              
SCRMOR1H DS    XL8                                                              
SCRMOR1  DS    CL2     12    2    2  L  P H             T        Y              
SCRNAM1H DS    XL8                                                              
SCRNAM1  DS    CL40    12    5   40  L  U N             T        Y   60         
SCRNAM1X DS    XL8                                                              
SCRTYP1H DS    XL8                                                              
SCRTYP1  DS    CL8     12   48    8  A  U N             T        Y   70         
SCRTYP1X DS    XL8                                                              
SCRFYI1H DS    XL8                                                              
SCRFYI1  DS    CL1     12   61    1  A  U N             T        Y   75         
SCRFYI1X DS    XL8                                                              
SCRSUP1H DS    XL8                                                              
SCRSUP1  DS    CL1     12   72    1  A  U N             T        Y   77         
SCRSUP1X DS    XL8                                                              
SCREM1H  DS    XL8                                                              
SCREM1   DS    CL79    13    2   79  L  U N             T        Y   80         
SCREM1X  DS    XL8                                                              
SCRNAM2H DS    XL8                                                              
SCRNAM2  DS    CL40    14    5   40  L  U N             T        Y   60         
SCRNAM2X DS    XL8                                                              
SCRTYP2H DS    XL8                                                              
SCRTYP2  DS    CL8     14   48    8  A  U N             T        Y   70         
SCRTYP2X DS    XL8                                                              
SCRFYI2H DS    XL8                                                              
SCRFYI2  DS    CL1     14   61    1  A  U N             T        Y   75         
SCRFYI2X DS    XL8                                                              
SCRSUP2H DS    XL8                                                              
SCRSUP2  DS    CL1     14   72    1  A  U N             T        Y   77         
SCRSUP2X DS    XL8                                                              
SCREM2H  DS    XL8                                                              
SCREM2   DS    CL79    15    2   79  L  U N             T        Y   80         
SCREM2X  DS    XL8                                                              
SCRNAM3H DS    XL8                                                              
SCRNAM3  DS    CL40    16    5   40  L  U N             T        Y   60         
SCRNAM3X DS    XL8                                                              
SCRTYP3H DS    XL8                                                              
SCRTYP3  DS    CL8     16   48    8  A  U N             T        Y   70         
SCRTYP3X DS    XL8                                                              
SCRFYI3H DS    XL8                                                              
SCRFYI3  DS    CL1     16   61    1  A  U N             T        Y   75         
SCRFYI3X DS    XL8                                                              
SCRSUP3H DS    XL8                                                              
SCRSUP3  DS    CL1     16   72    1  A  U N             T        Y   77         
SCRSUP3X DS    XL8                                                              
SCREM3H  DS    XL8                                                              
SCREM3   DS    CL79    17    2   79  L  U N             T        Y   80         
SCREM3X  DS    XL8                                                              
SCRNAM4H DS    XL8                                                              
SCRNAM4  DS    CL40    18    5   40  L  U N             T        Y   60         
SCRNAM4X DS    XL8                                                              
SCRTYP4H DS    XL8                                                              
SCRTYP4  DS    CL8     18   48    8  A  U N             T        Y   70         
SCRTYP4X DS    XL8                                                              
SCRFYI4H DS    XL8                                                              
SCRFYI4  DS    CL1     18   61    1  A  U N             T        Y   75         
SCRFYI4X DS    XL8                                                              
SCRSUP4H DS    XL8                                                              
SCRSUP4  DS    CL1     18   72    1  A  U N             T        Y   77         
SCRSUP4X DS    XL8                                                              
SCREM4H  DS    XL8                                                              
SCREM4   DS    CL79    19    2   79  L  U N             T        Y   80         
SCREM4X  DS    XL8                                                              
SCRNAMLH DS    XL8                                                              
SCRNAML  DS    CL40    20    5   40  L  U N             T        Y   60         
SCRNAMLX DS    XL8                                                              
SCRTYPLH DS    XL8                                                              
SCRTYPL  DS    CL8     20   48    8  A  U N             T        Y   70         
SCRTYPLX DS    XL8                                                              
SCRFYILH DS    XL8                                                              
SCRFYIL  DS    CL1     20   61    1  A  U N             T        Y   75         
SCRFYILX DS    XL8                                                              
SCRSUPLH DS    XL8                                                              
SCRSUPL  DS    CL1     20   72    1  A  U N             T        Y   77         
SCRSUPLX DS    XL8                                                              
SCREMLH  DS    XL8                                                              
SCREML   DS    CL79    21    2   79  L  U N             T        Y   80         
SCREMLX  DS    XL8                                                              
SCRMORLH DS    XL8                                                              
SCRMORL  DS    CL2     24    2    2  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    24    5   55  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   65    6  L  P N             T        Y              
SCRSCRLH DS    XL8                                                              
SCRSCRL  DS    CL5     24   72    5  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   79    1  A  U N             T        Y              
SCRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
