*          DATA SET PRSFMFDD   AT LEVEL 008 AS OF 09/16/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CFDD      DATE 09/16/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
FSIMEDH  DS    CL8                                                              
FSIMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
FSIPUBH  DS    CL8                                                              
FSIPUB   DS    CL17     5   25   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   47    4  A  P N             T        Y              
FSIYRH   DS    CL8                                                              
FSIYR    DS    CL4      5   52    4  A  U N             T        Y              
FSIPUBNH DS    CL8                                                              
FSIPUBN  DS    CL20     6   25   20  A  P H             T        Y              
FSIPUBZH DS    CL8                                                              
FSIPUBZ  DS    CL20     6   47   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      6   69    4  A  P N             T        Y              
FSIFREQH DS    CL8                                                              
FSIFREQ  DS    CL2      6   74    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
FSIOPTH  DS    CL8                                                              
FSIOPT   DS    CL60     7   10   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76     8    2   76  A  P H             T        Y              
FSIDT1H  DS    CL8                                                              
FSIDT1   DS    CL5      9    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    9    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   23    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   30    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   44    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   51    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   65    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A  U N             T        Y              
FSILAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
FSIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2304 BYTES                            
