*          DATA SET PRSFMD2D   AT LEVEL 002 AS OF 06/20/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CD2D      DATE 06/20/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SCIMEDH  DS    XL8                                                              
SCIMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23     6    5   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL23     6   42   23  A  P H             T        Y              
SCIMOR1H DS    XL8                                                              
SCIMOR1  DS    CL2      7    2    2  L  P H             T        Y              
SCICOD1H DS    XL8                                                              
SCICOD1  DS    CL2      7    6    2  A  U N             T        Y              
SCITYP1H DS    XL8                                                              
SCITYP1  DS    CL1      7   12    1  A  U N             T        Y              
SCIDES1H DS    XL8                                                              
SCIDES1  DS    CL20     7   17   20  A  U N             T        Y              
SCICOD2H DS    XL8                                                              
SCICOD2  DS    CL2      7   43    2  A  U N             T        Y              
SCITYP2H DS    XL8                                                              
SCITYP2  DS    CL1      7   49    1  A  U N             T        Y              
SCIDES2H DS    XL8                                                              
SCIDES2  DS    CL20     7   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      8    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     8   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      8   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     8   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     9   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     9   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   54   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   17   20  A  U N             T        Y              
SCICODLH DS    XL8                                                              
SCICODL  DS    CL2     20   43    2  A  U N             T        Y              
SCITYPLH DS    XL8                                                              
SCITYPL  DS    CL1     20   49    1  A  U N             T        Y              
SCIDESLH DS    XL8                                                              
SCIDESL  DS    CL20    20   54   20  A  U N             T        Y              
SCIMORLH DS    XL8                                                              
SCIMORL  DS    CL2     20   79    2  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL33    22    2   33  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   36    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    24    2   15  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     24   65    6  L  P H             T        Y              
SCISCRLH DS    XL8                                                              
SCISCRL  DS    CL5     24   72    5  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   79    1  A  U N             T        Y              
SCILAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SCIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1552 BYTES                            
