*          DATA SET PRSFMD3D   AT LEVEL 007 AS OF 02/01/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CD3D      DATE 02/01/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL25     6    2   25  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SRDSPUBH DS    CL8                                                              
SRDSPUB  DS    CL20     7    9   20  A  U N             T        Y  200         
SRDSPUBX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24     7   35   24  A  P H             T        Y              
SRDSTYPH DS    CL8                                                              
SRDSTYP  DS    CL1      7   62    1  A  U N             T        Y  205         
SRDSTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A  P H             T        Y              
SRDSTNMH DS    CL8                                                              
SRDSTNM  DS    CL10     9   16   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL39     9   35   39  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL39    10   35   39  A  P H             T        Y              
SRDSNM1H DS    CL8                                                              
SRDSNM1  DS    CL30    11    2   30  A  P N             T        Y              
SRDPUB1H DS    CL8                                                              
SRDPUB1  DS    CL16    11   35   16  A  U N             T        Y  210         
SRDPUB1X DS    CL8                                                              
SRDMED1H DS    CL8                                                              
SRDMED1  DS    CL1     11   53    1  A  U N             T        Y  215         
SRDMED1X DS    CL8                                                              
SRDPBN1H DS    CL8                                                              
SRDPBN1  DS    CL20    11   57   20  A  P N             T        Y              
SRDSNM2H DS    CL8                                                              
SRDSNM2  DS    CL30    12    2   30  A  P N             T        Y              
SRDPUB2H DS    CL8                                                              
SRDPUB2  DS    CL16    12   35   16  A  U N             T        Y  210         
SRDPUB2X DS    CL8                                                              
SRDMED2H DS    CL8                                                              
SRDMED2  DS    CL1     12   53    1  A  U N             T        Y  215         
SRDMED2X DS    CL8                                                              
SRDPBN2H DS    CL8                                                              
SRDPBN2  DS    CL20    12   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    13    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    13   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    13   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    14    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    14   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    15    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    15   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    16    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    16   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    17    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    17   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    18    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    18   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    19    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    19   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    20    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    20   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    21    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    21   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    21   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    22    2   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    22   35   16  A  U N             T        Y  210         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   53    1  A  U N             T        Y  215         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    22   57   20  A  P N             T        Y              
SRDSNMLH DS    CL8                                                              
SRDSNML  DS    CL30    23    2   30  A  P N             T        Y              
SRDPUBLH DS    CL8                                                              
SRDPUBL  DS    CL16    23   35   16  A  U N             T        Y  210         
SRDPUBLX DS    CL8                                                              
SRDMEDLH DS    CL8                                                              
SRDMEDL  DS    CL1     23   53    1  A  U N             T        Y  215         
SRDMEDLX DS    CL8                                                              
SRDPBNLH DS    CL8                                                              
SRDPBNL  DS    CL20    23   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    24    2   76  A  P H             T        Y              
SRDLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1856 BYTES                            
