*          DATA SET PRSFMD0D   AT LEVEL 022 AS OF 02/27/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CD0D      DATE 02/27/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CRCMEDH  DS    CL8                                                              
CRCMED   DS    CL1      5   10    1  A  U N             T        Y  200         
CRCMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
CRCPUBH  DS    CL8                                                              
CRCPUB   DS    CL15     5   28   15  A  U N             T        Y  205         
CRCPUBX  DS    CL8                                                              
CRCPUBNH DS    CL8                                                              
CRCPUBN  DS    CL20     5   50   20  A  P N             T        Y              
CRCPUBZH DS    CL8                                                              
CRCPUBZ  DS    CL20     6   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A  P H             T        Y              
CRCSRCH  DS    CL8                                                              
CRCSRC   DS    CL5      7   13    5  A  U N             T        Y  210         
CRCSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   23    4  A  P H             T        Y              
CRCPERH  DS    CL8                                                              
CRCPER   DS    CL5      7   28    5  A  U N             T        Y  215         
CRCPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   40    6  A  P N             T        Y              
CRCCLTH  DS    CL8                                                              
CRCCLT   DS    CL5      7   47    5  A  U N             T        Y  220         
CRCCLTX  DS    CL8                                                              
CRCCLTNH DS    CL8                                                              
CRCCLTN  DS    CL20     7   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P H             T        Y              
CRCFRQH  DS    CL8                                                              
CRCFRQ   DS    CL8      8   13    8  A  U N             T        Y  227         
CRCFRQX  DS    CL8                                                              
CRCFRQNH DS    CL8                                                              
CRCFRQN  DS    CL15     8   23   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   40   11  A  P H             T        Y              
CRCFISSH DS    CL8                                                              
CRCFISS  DS    CL10     8   53   10  A  U N             T        Y  225         
CRCFISSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
CRCSISSH DS    CL8                                                              
CRCSISS  DS    CL8      9   13    8  A  U N             T        Y  229         
CRCSISSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   14   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   31   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   48   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   65   15  A  P N             T        Y              
CRCMOR1H DS    CL8                                                              
CRCMOR1  DS    CL2     11    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    11   14   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    11   31   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    11   48   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    11   65   15  A  P N             T        Y              
CRCISS1H DS    CL8                                                              
CRCISS1  DS    CL10    12    2   10  A  U N             T        Y  230         
CRCISS1X DS    CL8                                                              
CRCTOT1H DS    CL8                                                              
CRCTOT1  DS    CL15    12   14   15  A  U N             T        Y  235         
CRCTOT1X DS    CL8                                                              
CRCRTB1H DS    CL8                                                              
CRCRTB1  DS    CL15    12   31   15  A  U N             T        Y  240         
CRCRTB1X DS    CL8                                                              
CRCPRE1H DS    CL8                                                              
CRCPRE1  DS    CL15    12   48   15  A  U N             T        Y  245         
CRCPRE1X DS    CL8                                                              
CRCFIN1H DS    CL8                                                              
CRCFIN1  DS    CL15    12   65   15  A  U N             T        Y  250         
CRCFIN1X DS    CL8                                                              
CRCISS2H DS    CL8                                                              
CRCISS2  DS    CL10    13    2   10  A  U N             T        Y  230         
CRCISS2X DS    CL8                                                              
CRCTOT2H DS    CL8                                                              
CRCTOT2  DS    CL15    13   14   15  A  U N             T        Y  235         
CRCTOT2X DS    CL8                                                              
CRCRTB2H DS    CL8                                                              
CRCRTB2  DS    CL15    13   31   15  A  U N             T        Y  240         
CRCRTB2X DS    CL8                                                              
CRCPRE2H DS    CL8                                                              
CRCPRE2  DS    CL15    13   48   15  A  U N             T        Y  245         
CRCPRE2X DS    CL8                                                              
CRCFIN2H DS    CL8                                                              
CRCFIN2  DS    CL15    13   65   15  A  U N             T        Y  250         
CRCFIN2X DS    CL8                                                              
CRCISS3H DS    CL8                                                              
CRCISS3  DS    CL10    14    2   10  A  U N             T        Y  230         
CRCISS3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    14   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    14   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    14   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    14   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISS4H DS    CL8                                                              
CRCISS4  DS    CL10    15    2   10  A  U N             T        Y  230         
CRCISS4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    15   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    15   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    15   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    15   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISS5H DS    CL8                                                              
CRCISS5  DS    CL10    16    2   10  A  U N             T        Y  230         
CRCISS5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISS6H DS    CL8                                                              
CRCISS6  DS    CL10    17    2   10  A  U N             T        Y  230         
CRCISS6X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    17   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    17   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    17   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    17   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISS7H DS    CL8                                                              
CRCISS7  DS    CL10    18    2   10  A  U N             T        Y  230         
CRCISS7X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    18   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    18   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    18   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    18   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISS8H DS    CL8                                                              
CRCISS8  DS    CL10    19    2   10  A  U N             T        Y  230         
CRCISS8X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    19   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    19   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    19   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    19   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISS9H DS    CL8                                                              
CRCISS9  DS    CL10    20    2   10  A  U N             T        Y  230         
CRCISS9X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    20   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    20   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    20   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    20   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISSAH DS    CL8                                                              
CRCISSA  DS    CL10    21    2   10  A  U N             T        Y  230         
CRCISSAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    21   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    21   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    21   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    21   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISSBH DS    CL8                                                              
CRCISSB  DS    CL10    22    2   10  A  U N             T        Y  230         
CRCISSBX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    22   14   15  A  U N             T        Y  235         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    22   31   15  A  U N             T        Y  240         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    22   48   15  A  U N             T        Y  245         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    22   65   15  A  U N             T        Y  250         
         DS    CL8                                                              
CRCISSLH DS    CL8                                                              
CRCISSL  DS    CL10    23    2   10  A  U N             T        Y  230         
CRCISSLX DS    CL8                                                              
CRCTOTLH DS    CL8                                                              
CRCTOTL  DS    CL15    23   14   15  A  U N             T        Y  235         
CRCTOTLX DS    CL8                                                              
CRCRTBLH DS    CL8                                                              
CRCRTBL  DS    CL15    23   31   15  A  U N             T        Y  240         
CRCRTBLX DS    CL8                                                              
CRCPRELH DS    CL8                                                              
CRCPREL  DS    CL15    23   48   15  A  U N             T        Y  245         
CRCPRELX DS    CL8                                                              
CRCFINLH DS    CL8                                                              
CRCFINL  DS    CL15    23   65   15  A  U N             T        Y  250         
CRCFINLX DS    CL8                                                              
CRCMORLH DS    CL8                                                              
CRCMORL  DS    CL2     24    2    2  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL58    24    5   58  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   65    6  L  P N             T        Y              
CRCSCRLH DS    CL8                                                              
CRCSCRL  DS    CL5     24   72    5  L  U N             T        Y  190         
CRCSCRLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     24   79    1  A  U N             T        Y              
CRCLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
CRCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2560 BYTES                            
