*          DATA SET PRSFMF1D   AT LEVEL 005 AS OF 05/21/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T41CF1D      DATE 05/21/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
AGRMEDH  DS    XL8                                                              
AGRMED   DS    CL8      5   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
AGRCLIH  DS    XL8                                                              
AGRCLI   DS    CL8      5   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
AGRPROH  DS    XL8                                                              
AGRPRO   DS    CL8      6   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   20    8  A  P H             T        Y              
AGRESTH  DS    XL8                                                              
AGREST   DS    CL4      6   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    9   11  A  P N             T        Y              
AGRLIN1H DS    XL8                                                              
AGRLIN1  DS    CL30     8   22   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   13    7  A  P N             T        Y              
AGRLIN2H DS    XL8                                                              
AGRLIN2  DS    CL30     9   22   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   13    7  A  P N             T        Y              
AGRLIN3H DS    XL8                                                              
AGRLIN3  DS    CL30    10   22   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   13    7  A  P N             T        Y              
AGRLIN4H DS    XL8                                                              
AGRLIN4  DS    CL30    11   22   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    8   12  A  P N             T        Y              
AGRPCTH  DS    XL8                                                              
AGRPCT   DS    CL10    13   22   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   16    4  A  P N             T        Y              
AGRBASH  DS    XL8                                                              
AGRBAS   DS    CL2     14   22    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27    14   26   27  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    15    6   14  A  P N             T        Y              
AGREFDH  DS    XL8                                                              
AGREFD   DS    CL6     15   22    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   11    9  A  P N             T        Y              
AGRKDTH  DS    XL8                                                              
AGRKDT   DS    CL6     16   22    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   12    8  A  P N             T        Y              
AGRGSTH  DS    XL8                                                              
AGRGST   DS    CL2     17   22    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   12    8  A  P N             T        Y              
AGRPSTH  DS    XL8                                                              
AGRPST   DS    CL50    18   22   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   12    8  A  P N             T        Y              
AGRMPSTH DS    XL8                                                              
AGRMPST  DS    CL5     19   22    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    20    2   18  A  P N             T        Y              
AGRRCAH  DS    XL8                                                              
AGRRCA   DS    CL14    20   22   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    21    6   14  A  P N             T        Y              
AGRCMAH  DS    XL8                                                              
AGRCMA   DS    CL14    21   22   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22    5   15  A  P N             T        Y              
AGRCMTH  DS    XL8                                                              
AGRCMT   DS    CL7     22   22    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   22    2  A  U N             T        Y              
AGRLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
AGRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 768  BYTES                            
