*          DATA SET PRWRIF1D   AT LEVEL 031 AS OF 08/04/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T405F1D      DATE 08/04/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
WRINAMH  DS    CL8                                                              
WRINAM   DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
WRIDESCH DS    CL8                                                              
WRIDESC  DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   58    7  A  P N             T        Y              
         DS    CL8                                               S= 200         
WRIRFLH  DS    CL8                                                              
WRIRFL   DS    CL4      5   66    4  A  U N             T        Y    8         
WRIRFLX  DS    CL8                                               S= 201         
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
WRIMEDH  DS    CL8                                                              
WRIMED   DS    CL1      7    8    1  A  U N             T        Y   10         
WRIMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   13    3  A  P H             T        Y              
WRICLTH  DS    CL8                                                              
WRICLT   DS    CL7      7   18    7  A  U N             T        Y   12         
WRICLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   27    4  A  P H             T        Y              
WRIPRDH  DS    CL8                                                              
WRIPRD   DS    CL7      7   33    7  A  U N             T        Y   14         
WRIPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   42    8  A  P H             T        Y              
WRIESTH  DS    CL8                                                              
WRIEST   DS    CL9      7   51    9  A  U N             T        Y   16         
WRIESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   61    3  A  P H             T        Y              
WRIPUBH  DS    CL8                                                              
WRIPUB   DS    CL14     7   66   14  A  U N             T        Y   18         
WRIPUBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
WRIDIVH  DS    CL8                                                              
WRIDIV   DS    CL3      8    8    3  A  U N             T        Y   20         
WRIDIVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   13    3  A  P H             T        Y              
WRIREGH  DS    CL8                                                              
WRIREG   DS    CL7      8   18    7  A  U N             T        Y   22         
WRIREGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8   27    4  A  P H             T        Y              
WRIDISH  DS    CL8                                                              
WRIDIS   DS    CL7      8   33    7  A  U N             T        Y   24         
WRIDISX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   42    6  A  P H             T        Y              
WRIADCH  DS    CL8                                                              
WRIADC   DS    CL6      8   51    6  A  U N             T        Y   26         
WRIADCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8   61    9  A  P H             T        Y              
WRIDTYH  DS    CL8                                                              
WRIDTY   DS    CL2      8   72    2  A  U N             T        Y   28         
WRIDTYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
WRIPERH  DS    CL8                                                              
WRIPER   DS    CL17     9   11   17  A  U N             T        Y   30         
WRIPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9   42    6  A  P N             T        Y              
WRIFLTH  DS    CL8                                                              
WRIFLT   DS    CL29     9   51   29  A  U N             T        Y   32         
WRIFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
WRIOPTH  DS    CL8                                                              
WRIOPT   DS    CL69    10   11   69  A  U N             T        Y   34         
WRIOPTX  DS    CL8                                                              
WRIOPT1H DS    CL8                                                              
WRIOPT1  DS    CL69    11   11   69  A  U N             T        Y   34         
WRIOPT1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
WRIHEADH DS    CL8                                                              
WRIHEAD  DS    CL20    12   10   20  A  U N             T        Y   40         
WRIHEADX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    12   34   20  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    12   59   20  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    13   10   20  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    13   34   20  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    13   59   20  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
WRIMIDH  DS    CL8                                                              
WRIMID   DS    CL20    14   10   20  A  U N             T        Y   43         
WRIMIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  P H             T        Y              
WRIROWSH DS    CL8                                                              
WRIROWS  DS    CL20    15   10   20  A  U N             T        Y   44         
WRIROWSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    15   34   20  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    15   59   20  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    16   10   20  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    16   34   20  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    16   59   20  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17   10    1  A  P N             T        Y              
WRICOLSH DS    CL8                                                              
WRICOLS  DS    CL32    17   12   32  A  U N             T        Y   50         
WRICOLSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   47   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   12   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   47   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   12   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   47   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   12   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   47   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    21   12   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    21   47   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    22   12   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    22   47   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    23   12   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    23   47   32  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     24    2    7  A  P N             T        Y              
WRITITH  DS    CL8                                                              
WRITIT   DS    CL63    24   10   63  A  U N             T        Y   60         
WRITITX  DS    CL8                                                              
WRILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
WRIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2192 BYTES                            
