*          DATA SET PRWRIHLPCB AT LEVEL 017 AS OF 09/08/94                      
***********************************************************************         
*                                                                     *         
*        HELP CONTROL BLOCK                                           *         
*                                                                     *         
***********************************************************************         
HELPCB   DSECT                                                                  
*                                                                               
HCBMTIC  DS    XL2                 MASTER ICODE FOR HELP MENU TABLE             
*                                                                               
HCBSCRN  DS    X                   SCREEN NUMBER TO USE FOR HELP PANELS         
HCBPAGE  DS    X                   THIS PAGE OF TEMPSTOR AS SAVEAREA            
HCBRTRN  DS    XL1                 RETURN CODE                                  
HCBRSELQ EQU   X'80'               SELECTION MADE                               
         DS    XL1                 SPARE                                        
*                                                                               
HCBATWA  DS    A                   A(TWA)                                       
HCBACOM  DS    A                   A(COMFACS)                                   
HCBATIOB DS    A                   A(TIOB)                                      
HCBASYRD DS    A                   A(EXIT)                                      
*                                                                               
HCBCTRY  DS    XL1                 COUNTRY                                      
HCBLANG  DS    XL2                 LANGUAGE                                     
HCBSYST  DS    XL1                 SYSTEM                                       
HCBMED   DS    XL1                 MEDIA                                        
HCBFLVR  DS    XL1                 FLAVOR                                       
HCBFTYP  DS    XL1                 FIELD TYPE                                   
         DS    XL13                SPARE                                        
HELPCBL  EQU   *-HELPCB            LENGTH OF CONTROL BLOCK                      
*                                                                               
