*          DATA SET PRWRIE7D   AT LEVEL 002 AS OF 03/26/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T405E7D      DATE 03/26/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
PNGNAMEH DS    XL8                                                              
PNGNAME  DS    CL8      5   10    8  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
PNGDESCH DS    XL8                                                              
PNGDESC  DS    CL27     5   28   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   58    7  A  P N             T        Y              
         DS    XL8                                               S= 200         
PNGRFLH  DS    XL8                                                              
PNGRFL   DS    CL4      5   66    4  A  U N             T        Y    8         
PNGRFLX  DS    XL8                                               S= 201         
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
PNGMEDH  DS    XL8                                                              
PNGMED   DS    CL1      7    8    1  A  U N             T        Y   10         
PNGMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   13    3  A  P H             T        Y              
PNGCLTH  DS    XL8                                                              
PNGCLT   DS    CL7      7   18    7  A  U N             T        Y   12         
PNGCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   27    4  A  P H             T        Y              
PNGPRDH  DS    XL8                                                              
PNGPRD   DS    CL7      7   33    7  A  U N             T        Y   14         
PNGPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   42    8  A  P H             T        Y              
PNGESTH  DS    XL8                                                              
PNGEST   DS    CL9      7   51    9  A  U N             T        Y   16         
PNGESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   61    3  A  P N             T        Y              
PNGPUBH  DS    XL8                                                              
PNGPUB   DS    CL14     7   66   14  A  P N             T        Y   18         
PNGPUBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
PNGDIVH  DS    XL8                                                              
PNGDIV   DS    CL3      8    8    3  A  P N             T        Y   20         
PNGDIVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   13    3  A  P N             T        Y              
PNGREGH  DS    XL8                                                              
PNGREG   DS    CL7      8   18    7  A  P N             T        Y   22         
PNGREGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      8   27    4  A  P N             T        Y              
PNGDISH  DS    XL8                                                              
PNGDIS   DS    CL7      8   33    7  A  P N             T        Y   24         
PNGDISX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8   42    6  A  P N             T        Y              
PNGADCH  DS    XL8                                                              
PNGADC   DS    CL6      8   51    6  A  P N             T        Y   26         
PNGADCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      8   61    9  A  P N             T        Y              
PNGDTYH  DS    XL8                                                              
PNGDTY   DS    CL2      8   72    2  A  P N             T        Y   28         
PNGDTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
PNGPERH  DS    XL8                                                              
PNGPER   DS    CL17     9   11   17  A  U N             T        Y   30         
PNGPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   42    6  A  P N             T        Y              
PNGFLTH  DS    XL8                                                              
PNGFLT   DS    CL29     9   51   29  A  U N             T        Y   32         
PNGFLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PNGOPTH  DS    XL8                                                              
PNGOPT   DS    CL69    10   11   69  A  U N             T        Y   34         
PNGOPTX  DS    XL8                                                              
PNGOPT1H DS    XL8                                                              
PNGOPT1  DS    CL69    11   11   69  A  U N             T        Y   34         
PNGOPT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL63    12   10   63  A  P N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P H             T        Y              
PNGTITH  DS    XL8                                                              
PNGTIT   DS    CL60    14   20   60  A  U N             T        Y   60         
PNGTITX  DS    XL8                                                              
PNGLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PNGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 960  BYTES                            
