*          DATA SET PRWRID9D   AT LEVEL 009 AS OF 06/29/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T405D9D      DATE 06/29/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
BTTMEDH  DS    CL8                                                              
BTTMED   DS    CL1      7    8    1  A  U N             T        Y   10         
BTTMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   13    3  A  P H             T        Y              
BTTCLTH  DS    CL8                                                              
BTTCLT   DS    CL7      7   18    7  A  U N             T        Y   12         
BTTCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   27    4  A  P H             T        Y              
BTTPRDH  DS    CL8                                                              
BTTPRD   DS    CL7      7   33    7  A  U N             T        Y   14         
BTTPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   42    8  A  P H             T        Y              
BTTESTH  DS    CL8                                                              
BTTEST   DS    CL9      7   51    9  A  U N             T        Y   16         
BTTESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   61    3  A  P N             T        Y              
BTTPUBH  DS    CL8                                                              
BTTPUB   DS    CL14     7   66   14  A  P N             T        Y   18         
BTTPUBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
BTTDIVH  DS    CL8                                                              
BTTDIV   DS    CL3      8    8    3  A  P N             T        Y   20         
BTTDIVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   13    3  A  P N             T        Y              
BTTREGH  DS    CL8                                                              
BTTREG   DS    CL7      8   18    7  A  P N             T        Y   22         
BTTREGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8   27    4  A  P N             T        Y              
BTTDISH  DS    CL8                                                              
BTTDIS   DS    CL7      8   33    7  A  P N             T        Y   24         
BTTDISX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   42    6  A  P N             T        Y              
BTTADCH  DS    CL8                                                              
BTTADC   DS    CL6      8   51    6  A  P N             T        Y   26         
BTTADCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8   61    9  A  P N             T        Y              
BTTDTYH  DS    CL8                                                              
BTTDTY   DS    CL2      8   72    2  A  P N             T        Y   28         
BTTDTYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
BTTPERH  DS    CL8                                                              
BTTPER   DS    CL17     9   11   17  A  P N             T        Y   30         
BTTPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9   42    6  A  P N             T        Y              
BTTFLTH  DS    CL8                                                              
BTTFLT   DS    CL29     9   51   29  A  U N             T        Y   32         
BTTFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
BTTOPTH  DS    CL8                                                              
BTTOPT   DS    CL69    10   11   69  A  U N             T        Y   34         
BTTOPTX  DS    CL8                                                              
BTTOPT1H DS    CL8                                                              
BTTOPT1  DS    CL69    11   11   69  A  U N             T        Y   34         
BTTOPT1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL63    12   10   63  A  P N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    14    2   13  A  P H             T        Y              
BTTMONH  DS    CL8                                                              
BTTMON   DS    CL5     14   20    5  A  U N             T        Y    0         
BTTMONX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    16    2   13  A  P N             T        Y              
BTTTAPH  DS    CL8                                                              
BTTTAP   DS    CL1     16   20    1  A  U N             T        Y    0         
BTTTAPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P H             T        Y              
BTTTITH  DS    CL8                                                              
BTTTIT   DS    CL60    18   20   60  A  U N             T        Y   60         
BTTTITX  DS    CL8                                                              
BTTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BTTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1016 BYTES                            
