*          DATA SET PRWRIEAD   AT LEVEL 007 AS OF 03/19/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T405EAD      DATE 03/19/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
SCJNAMH  DS    XL8                                                              
SCJNAM   DS    CL8      5   10    8  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
SCJDESCH DS    XL8                                                              
SCJDESC  DS    CL27     5   28   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   58    7  A  P N             T        Y              
         DS    XL8                                               S= 200         
SCJRFLH  DS    XL8                                                              
SCJRFL   DS    CL4      5   66    4  A  U N             T        Y    8         
SCJRFLX  DS    XL8                                               S= 201         
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SCJMEDH  DS    XL8                                                              
SCJMED   DS    CL1      7    8    1  A  U N             T        Y   10         
SCJMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   13    3  A  P H             T        Y              
SCJCLTH  DS    XL8                                                              
SCJCLT   DS    CL7      7   18    7  A  U N             T        Y   12         
SCJCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   27    4  A  P H             T        Y              
SCJPRDH  DS    XL8                                                              
SCJPRD   DS    CL7      7   33    7  A  U N             T        Y   14         
SCJPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   42    8  A  P H             T        Y              
SCJESTH  DS    XL8                                                              
SCJEST   DS    CL9      7   51    9  A  U N             T        Y   16         
SCJESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   61    3  A  P H             T        Y              
SCJPUBH  DS    XL8                                                              
SCJPUB   DS    CL14     7   66   14  A  U N             T        Y   18         
SCJPUBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
SCJDIVH  DS    XL8                                                              
SCJDIV   DS    CL3      8    8    3  A  U N             T        Y   20         
SCJDIVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   13    3  A  P H             T        Y              
SCJREGH  DS    XL8                                                              
SCJREG   DS    CL7      8   18    7  A  U N             T        Y   22         
SCJREGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      8   27    4  A  P H             T        Y              
SCJDISH  DS    XL8                                                              
SCJDIS   DS    CL7      8   33    7  A  U N             T        Y   24         
SCJDISX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8   42    6  A  P H             T        Y              
SCJADCH  DS    XL8                                                              
SCJADC   DS    CL6      8   51    6  A  U N             T        Y   26         
SCJADCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      8   61    9  A  P H             T        Y              
SCJDTYH  DS    XL8                                                              
SCJDTY   DS    CL2      8   72    2  A  U N             T        Y   28         
SCJDTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SCJPERH  DS    XL8                                                              
SCJPER   DS    CL17     9   11   17  A  U N             T        Y   30         
SCJPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   42    6  A  P N             T        Y              
SCJFLTH  DS    XL8                                                              
SCJFLT   DS    CL29     9   51   29  A  U N             T        Y   32         
SCJFLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SCJOPTH  DS    XL8                                                              
SCJOPT   DS    CL69    10   11   69  A  U N             T        Y   34         
SCJOPTX  DS    XL8                                                              
SCJOPT1H DS    XL8                                                              
SCJOPT1  DS    CL69    11   11   69  A  U N             T        Y   34         
SCJOPT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     24    2    7  A  P N             T        Y              
SCJTITH  DS    XL8                                                              
SCJTIT   DS    CL27    24   10   27  A  P N             T        Y   60         
SCJTITX  DS    XL8                                                              
SCJLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SCJWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 832  BYTES                            
