*          DATA SET PSIZETABS  AT LEVEL 008 AS OF 07/23/98                      
*                                                                               
*   PRINTPAK AD SIZE CODE- DESCRIPTION TABLE                                    
*                                                                               
*   ENTRIES ARE AD SIZE CODE,17 BYTE DESCRIPTION                                
*                                                                               
*   NOTE: SIZES S01-S53 ARE THE SAME FOR JUNIOR AND TABLIOD                     
*         THEIR CODES WILL BEIGN WITH J (JUNIOR) OR T (TABLIOD)                 
*                                                                               
PADSCDT  DC    C'J02',CL17'JR. PAGE'                                            
         DC    C'S01',CL17'SPREAD'                                              
         DC    C'S02',CL17'1 PAGE'                                              
         DC    C'S03',CL17'4/5 V PAGE'                                          
         DC    C'S04',CL17'4/5 H PAGE'                                          
         DC    C'S05',CL17'3/4 V PAGE'                                          
         DC    C'S06',CL17'3/4 H PAGE'                                          
         DC    C'S07',CL17'2/3 V PAGE'                                          
         DC    C'S08',CL17'2/3 H PAGE'                                          
         DC    C'S09',CL17'3/5 V PAGE'                                          
         DC    C'S10',CL17'3/5 H PAGE'                                          
         DC    C'S11',CL17'1/2 PG. ISLAND'                                      
         DC    C'S12',CL17'1/2 V PAGE'                                          
         DC    C'S13',CL17'1/2 H PAGE'                                          
         DC    C'S14',CL17'1/2 PG. SQUARE'                                      
         DC    C'S15',CL17'3/8 V PAGE'                                          
         DC    C'S16',CL17'3/8 H PAGE'                                          
         DC    C'S17',CL17'1/3 V PAGE'                                          
         DC    C'S18',CL17'1/3 H PAGE'                                          
         DC    C'S19',CL17'1/3 PG. SQUARE'                                      
         DC    C'S20',CL17'3/10 V PAGE'                                         
         DC    C'S21',CL17'3/10 H PAGE'  (NONE FOUND - THIS IS QUESS)           
         DC    C'S22',CL17'1/4 V PAGE'                                          
         DC    C'S23',CL17'1/4 H PAGE'                                          
         DC    C'S24',CL17'1/4 PG. SQUARE'                                      
         DC    C'S25',CL17'1/5 V PAGE'                                          
         DC    C'S26',CL17'1/5 H PAGE'                                          
         DC    C'S27',CL17'1/5 PG. SQUARE' (NONE FOUND - THIS IS QUESS)         
         DC    C'S28',CL17'1/5 PG. ISLAND' (NONE FOUND - THIS IS QUESS)         
         DC    C'S29',CL17'1/6 V PAGE'                                          
         DC    C'S30',CL17'1/6 H PAGE'                                          
         DC    C'S31',CL17'1/8 V PAGE'                                          
         DC    C'S32',CL17'1/8 H PAGE'                                          
         DC    C'S33',CL17'1/9 V PAGE'                                          
         DC    C'S34',CL17'1/9 H PAGE'                                          
         DC    C'S35',CL17'1/10 V PAGE'                                         
         DC    C'S36',CL17'1/10 H PAGE'                                         
         DC    C'S37',CL17'1/12 V PAGE'                                         
         DC    C'S38',CL17'1/12 H PAGE'                                         
         DC    C'S39',CL17'1/15 V PAGE'                                         
         DC    C'S40',CL17'1/15 H PAGE'                                         
         DC    C'S41',CL17'1/16 V PAGE'                                         
         DC    C'S42',CL17'1/16 H PAGE'                                         
         DC    C'S43',CL17'1/18 V PAGE'  (NONE FOUND - THIS IS A GUESS)         
         DC    C'S44',CL17'1/18 H PAGE'                                         
         DC    C'S45',CL17'1/24 V PAGE'                                         
         DC    C'S46',CL17'1/24 H PAGE'                                         
         DC    C'S47',CL17'1 INCH'                                              
         DC    C'S48',CL17'2 INCHES'                                            
         DC    C'S49',CL17'1 COLUMN'                                            
         DC    C'S50',CL17'2 COLUMNS'                                           
         DC    C'S51',CL17'3 COLUMNS'                                           
         DC    C'S52',CL17'4 COLUMNS'                                           
         DC    C'S53',CL17'5 COLUMNS'                                           
         DC    X'FF'             END OF TABLE                                   
         EJECT                                                                  
*                                                                               
*   PRINTPAK AD SIZE DESCRIPTION CODE TABLE                                     
*                                                                               
*   ENTRIES ARE 17 BYTES DESCRIPTION, AD SIZE CODE'                             
*                                                                               
PADSDCT  DS    0H                                                               
         DC    CL17'SPREAD           ',C'S01'                                   
         DC    CL17'1 PAGE           ',C'S02'                                   
         DC    CL17'PAGE             ',C'S02'                                   
         DC    CL17'PG               ',C'S02'                                   
         DC    CL17'PG.              ',C'S02'                                   
         DC    CL17'4/5 V PAGE       ',C'S03'                                   
         DC    CL17'4/5 V PG         ',C'S03'                                   
         DC    CL17'4/5 V PG.        ',C'S03'                                   
         DC    CL17'4/5 VER PAGE     ',C'S03'                                   
         DC    CL17'4/5 VER PG       ',C'S03'                                   
         DC    CL17'4/5 VER PG.      ',C'S03'                                   
         DC    CL17'4/5 H PAGE       ',C'S04'                                   
         DC    CL17'4/5 H PG         ',C'S04'                                   
         DC    CL17'4/5 H PG.        ',C'S04'                                   
         DC    CL17'4/5 HOR PAGE     ',C'S04'                                   
         DC    CL17'4/5 HOR PG       ',C'S04'                                   
         DC    CL17'4/5 HOR PG.      ',C'S04'                                   
         DC    CL17'4/5 HORZ PAGE    ',C'S04'                                   
         DC    CL17'4/5 HORZ PG      ',C'S04'                                   
         DC    CL17'4/5 HORZ PG.     ',C'S04'                                   
         DC    CL17'3/4 V PAGE       ',C'S05'                                   
         DC    CL17'3/4 V PG         ',C'S05'                                   
         DC    CL17'3/4 V PG.        ',C'S05'                                   
         DC    CL17'3/4 VER PAGE     ',C'S05'                                   
         DC    CL17'3/4 VER PG       ',C'S05'                                   
         DC    CL17'3/4 VER PG.      ',C'S05'                                   
         DC    CL17'3/4 H PAGE       ',C'S06'                                   
         DC    CL17'3/4 H PG         ',C'S06'                                   
         DC    CL17'3/4 H PG.        ',C'S06'                                   
         DC    CL17'3/4 HOR PAGE     ',C'S06'                                   
         DC    CL17'3/4 HOR PG       ',C'S06'                                   
         DC    CL17'3/4 HOR PG.      ',C'S06'                                   
         DC    CL17'3/4 HORZ PAGE    ',C'S06'                                   
         DC    CL17'3/4 HORZ PG      ',C'S06'                                   
         DC    CL17'3/4 HORZ PG.     ',C'S06'                                   
         DC    CL17'2/3 V PAGE       ',C'S07'                                   
         DC    CL17'2/3 V PG         ',C'S07'                                   
         DC    CL17'2/3 V PG.        ',C'S07'                                   
         DC    CL17'2/3 VER PAGE     ',C'S07'                                   
         DC    CL17'2/3 VER PG       ',C'S07'                                   
         DC    CL17'2/3 VER PG.      ',C'S07'                                   
         DC    CL17'2/3 H PAGE       ',C'S08'                                   
         DC    CL17'2/3 H PG         ',C'S08'                                   
         DC    CL17'2/3 H PG.        ',C'S08'                                   
         DC    CL17'2/3 HOR PAGE     ',C'S08'                                   
         DC    CL17'2/3 HOR PG       ',C'S08'                                   
         DC    CL17'2/3 HOR PG.      ',C'S08'                                   
         DC    CL17'2/3 HORZ PAGE    ',C'S08'                                   
         DC    CL17'2/3 HORZ PG      ',C'S08'                                   
         DC    CL17'2/3 HORZ PG.     ',C'S08'                                   
         DC    CL17'3/5 V PAGE       ',C'S09'                                   
         DC    CL17'3/5 V PG         ',C'S09'                                   
         DC    CL17'3/5 V PG.        ',C'S09'                                   
         DC    CL17'3/5 VER PAGE     ',C'S09'                                   
         DC    CL17'3/5 VER PG       ',C'S09'                                   
         DC    CL17'3/5 VER PG.      ',C'S09'                                   
         DC    CL17'3/5 H PAGE       ',C'S10'                                   
         DC    CL17'3/5 H PG         ',C'S10'                                   
         DC    CL17'3/5 H PG.        ',C'S10'                                   
         DC    CL17'3/5 HOR PAGE     ',C'S10'                                   
         DC    CL17'3/5 HOR PG       ',C'S10'                                   
         DC    CL17'3/5 HOR PG.      ',C'S10'                                   
         DC    CL17'3/5 HORZ PAGE    ',C'S10'                                   
         DC    CL17'3/5 HORZ PG      ',C'S10'                                   
         DC    CL17'3/5 HORZ PG.     ',C'S10'                                   
         DC    CL17'1/2 PAGE ISLAND  ',C'S11'                                   
         DC    CL17'1/2 PG ISLAND    ',C'S11'                                   
         DC    CL17'1/2 PG. ISLAND   ',C'S11'                                   
         DC    CL17'1/2 PAGE IS      ',C'S11'                                   
         DC    CL17'1/2 PG IS        ',C'S11'                                   
         DC    CL17'1/2 PG. IS       ',C'S11'                                   
         DC    CL17'1/2 PAGE ISL     ',C'S11'                                   
         DC    CL17'1/2 PG ISL       ',C'S11'                                   
         DC    CL17'1/2 PG. ISL      ',C'S11'                                   
         DC    CL17'1/2 PAGE ISLD    ',C'S11'                                   
         DC    CL17'1/2 PG ISLD      ',C'S11'                                   
         DC    CL17'1/2 PG. ISLD     ',C'S11'                                   
         DC    CL17'1/2 V PAGE       ',C'S12'                                   
         DC    CL17'1/2 V PG         ',C'S12'                                   
         DC    CL17'1/2 V PG.        ',C'S12'                                   
         DC    CL17'1/2 VER PAGE     ',C'S12'                                   
         DC    CL17'1/2 VER PG       ',C'S12'                                   
         DC    CL17'1/2 VER PG.      ',C'S12'                                   
         DC    CL17'1/2 H PAGE       ',C'S13'                                   
         DC    CL17'1/2 H PG         ',C'S13'                                   
         DC    CL17'1/2 H PG.        ',C'S13'                                   
         DC    CL17'1/2 HOR PAGE     ',C'S13'                                   
         DC    CL17'1/2 HOR PG       ',C'S13'                                   
         DC    CL17'1/2 HOR PG.      ',C'S13'                                   
         DC    CL17'1/2 HORZ PAGE    ',C'S13'                                   
         DC    CL17'1/2 HORZ PG      ',C'S13'                                   
         DC    CL17'1/2 HORZ PG.     ',C'S13'                                   
         DC    CL17'1/2 PAGE SQUARE  ',C'S14'                                   
         DC    CL17'1/2 PG SQUARE    ',C'S14'                                   
         DC    CL17'1/2 PG. SQUARE   ',C'S14'                                   
         DC    CL17'1/2 PAGE SQ      ',C'S14'                                   
         DC    CL17'1/2 PG SQ        ',C'S14'                                   
         DC    CL17'1/2 PG. SQ       ',C'S14'                                   
         DC    CL17'3/8 V PAGE       ',C'S15'                                   
         DC    CL17'3/8 V PG         ',C'S15'                                   
         DC    CL17'3/8 V PG.        ',C'S15'                                   
         DC    CL17'3/8 VER PAGE     ',C'S15'                                   
         DC    CL17'3/8 VER PG       ',C'S15'                                   
         DC    CL17'3/8 VER PG.      ',C'S15'                                   
         DC    CL17'3/8 H PAGE       ',C'S16'                                   
         DC    CL17'3/8 H PG         ',C'S16'                                   
         DC    CL17'3/8 H PG.        ',C'S16'                                   
         DC    CL17'3/8 HOR PAGE     ',C'S16'                                   
         DC    CL17'3/8 HOR PG       ',C'S16'                                   
         DC    CL17'3/8 HOR PG.      ',C'S16'                                   
         DC    CL17'3/8 HORZ PAGE    ',C'S16'                                   
         DC    CL17'3/8 HORZ PG      ',C'S16'                                   
         DC    CL17'3/8 HORZ PG.     ',C'S16'                                   
         DC    CL17'1/3 V PAGE       ',C'S17'                                   
         DC    CL17'1/3 V PG         ',C'S17'                                   
         DC    CL17'1/3 V PG.        ',C'S17'                                   
         DC    CL17'1/3 VER PAGE     ',C'S17'                                   
         DC    CL17'1/3 VER PG       ',C'S17'                                   
         DC    CL17'1/3 VER PG.      ',C'S17'                                   
         DC    CL17'1/3 H PAGE       ',C'S18'                                   
         DC    CL17'1/3 H PG         ',C'S18'                                   
         DC    CL17'1/3 H PG.        ',C'S18'                                   
         DC    CL17'1/3 HOR PAGE     ',C'S18'                                   
         DC    CL17'1/3 HOR PG       ',C'S18'                                   
         DC    CL17'1/3 HOR PG.      ',C'S18'                                   
         DC    CL17'1/3 HORZ PAGE    ',C'S18'                                   
         DC    CL17'1/3 HORZ PG      ',C'S18'                                   
         DC    CL17'1/3 HORZ PG.     ',C'S18'                                   
         DC    CL17'1/3 PAGE SQUARE  ',C'S19'                                   
         DC    CL17'1/3 PG SQUARE    ',C'S19'                                   
         DC    CL17'1/3 PG. SQUARE   ',C'S19'                                   
         DC    CL17'1/3 PAGE SQ      ',C'S19'                                   
         DC    CL17'1/3 PG SQ        ',C'S19'                                   
         DC    CL17'1/3 PG. SQ       ',C'S19'                                   
         DC    CL17'3/10 V PAGE      ',C'S20'                                   
         DC    CL17'3/10 V PG        ',C'S20'                                   
         DC    CL17'3/10 V PG.       ',C'S20'                                   
         DC    CL17'3/10 VER PAGE    ',C'S20'                                   
         DC    CL17'3/10 VER PG      ',C'S20'                                   
         DC    CL17'3/10 VER PG.     ',C'S20'                                   
         DC    CL17'3/10 H PAGE      ',C'S21'       GUESS                       
         DC    CL17'3/10 H PG        ',C'S21'       GUESS                       
         DC    CL17'3/10 H PG.       ',C'S21'       GUESS                       
         DC    CL17'3/10 HOR PAGE    ',C'S21'       GUESS                       
         DC    CL17'3/10 HOR PG      ',C'S21'       GUESS                       
         DC    CL17'3/10 HOR PG.     ',C'S21'       GUESS                       
         DC    CL17'3/10 HORZ PAGE   ',C'S21'       GUESS                       
         DC    CL17'3/10 HORZ PG     ',C'S21'       GUESS                       
         DC    CL17'3/10 HORZ PG.    ',C'S21'       GUESS                       
         DC    CL17'1/4 V PAGE       ',C'S22'                                   
         DC    CL17'1/4 V PG         ',C'S22'                                   
         DC    CL17'1/4 V PG.        ',C'S22'                                   
         DC    CL17'1/4 VER PAGE     ',C'S22'                                   
         DC    CL17'1/4 VER PG       ',C'S22'                                   
         DC    CL17'1/4 VER PG.      ',C'S22'                                   
         DC    CL17'1/4 H PAGE       ',C'S23'                                   
         DC    CL17'1/4 H PG         ',C'S23'                                   
         DC    CL17'1/4 H PG.        ',C'S23'                                   
         DC    CL17'1/4 HOR PAGE     ',C'S23'                                   
         DC    CL17'1/4 HOR PG       ',C'S23'                                   
         DC    CL17'1/4 HOR PG.      ',C'S23'                                   
         DC    CL17'1/4 HORZ PAGE    ',C'S23'                                   
         DC    CL17'1/4 HORZ PG      ',C'S23'                                   
         DC    CL17'1/4 HORZ PG.     ',C'S23'                                   
         DC    CL17'1/4 PAGE SQUARE  ',C'S24'                                   
         DC    CL17'1/4 PG SQUARE    ',C'S24'                                   
         DC    CL17'1/4 PG. SQUARE   ',C'S24'                                   
         DC    CL17'1/4 PAGE SQ      ',C'S24'                                   
         DC    CL17'1/4 PG SQ        ',C'S24'                                   
         DC    CL17'1/4 PG. SQ       ',C'S24'                                   
         DC    CL17'1/5 V PAGE       ',C'S25'                                   
         DC    CL17'1/5 V PG         ',C'S25'                                   
         DC    CL17'1/5 V PG.        ',C'S25'                                   
         DC    CL17'1/5 VER PAGE     ',C'S25'                                   
         DC    CL17'1/5 VER PG       ',C'S25'                                   
         DC    CL17'1/5 VER PG.      ',C'S25'                                   
         DC    CL17'1/5 H PAGE       ',C'S26'                                   
         DC    CL17'1/5 H PG         ',C'S26'                                   
         DC    CL17'1/5 H PG.        ',C'S26'                                   
         DC    CL17'1/5 HOR PAGE     ',C'S26'                                   
         DC    CL17'1/5 HOR PG       ',C'S26'                                   
         DC    CL17'1/5 HOR PG.      ',C'S26'                                   
         DC    CL17'1/5 HORZ PAGE    ',C'S26'                                   
         DC    CL17'1/5 HORZ PG      ',C'S26'                                   
         DC    CL17'1/5 HORZ PG.     ',C'S26'                                   
         DC    CL17'1/5 PAGE SQUARE  ',C'S27'       GUESS                       
         DC    CL17'1/5 PG SQUARE    ',C'S27'       GUESS                       
         DC    CL17'1/5 PG. SQUARE   ',C'S27'       GUESS                       
         DC    CL17'1/5 PAGE SQ      ',C'S27'       GUESS                       
         DC    CL17'1/5 PG SQ        ',C'S27'       GUESS                       
         DC    CL17'1/5 PG. SQ       ',C'S27'       GUESS                       
         DC    CL17'1/5 PAGE ISLAND  ',C'S28'       GUESS                       
         DC    CL17'1/5 PG ISLAND    ',C'S28'       GUESS                       
         DC    CL17'1/5 PG. ISLAND   ',C'S28'       GUESS                       
         DC    CL17'1/5 PAGE ISLD    ',C'S28'       GUESS                       
         DC    CL17'1/5 PG ISLD      ',C'S28'       GUESS                       
         DC    CL17'1/5 PG. ISLD     ',C'S28'       GUESS                       
         DC    CL17'1/5 PAGE ISL     ',C'S28'       GUESS                       
         DC    CL17'1/5 PG ISL       ',C'S28'       GUESS                       
         DC    CL17'1/5 PG. ISL      ',C'S28'       GUESS                       
         DC    CL17'1/5 PAGE IS      ',C'S28'       GUESS                       
         DC    CL17'1/5 PG IS        ',C'S28'       GUESS                       
         DC    CL17'1/5 PG. IS       ',C'S28'       GUESS                       
         DC    CL17'1/6 V PAGE       ',C'S29'                                   
         DC    CL17'1/6 V PG         ',C'S29'                                   
         DC    CL17'1/6 V PG.        ',C'S29'                                   
         DC    CL17'1/6 VER PAGE     ',C'S29'                                   
         DC    CL17'1/6 VER PG       ',C'S29'                                   
         DC    CL17'1/6 VER PG.      ',C'S29'                                   
         DC    CL17'1/6 H PAGE       ',C'S30'                                   
         DC    CL17'1/6 H PG         ',C'S30'                                   
         DC    CL17'1/6 H PG.        ',C'S30'                                   
         DC    CL17'1/6 HOR PAGE     ',C'S30'                                   
         DC    CL17'1/6 HOR PG       ',C'S30'                                   
         DC    CL17'1/6 HOR PG.      ',C'S30'                                   
         DC    CL17'1/6 HORZ PAGE    ',C'S30'                                   
         DC    CL17'1/6 HORZ PG      ',C'S30'                                   
         DC    CL17'1/6 HORZ PG.     ',C'S30'                                   
         DC    CL17'1/8 V PAGE       ',C'S31'                                   
         DC    CL17'1/8 V PG         ',C'S31'                                   
         DC    CL17'1/8 V PG.        ',C'S31'                                   
         DC    CL17'1/8 VER PAGE     ',C'S31'                                   
         DC    CL17'1/8 VER PG       ',C'S31'                                   
         DC    CL17'1/8 VER PG.      ',C'S31'                                   
         DC    CL17'1/8 H PAGE       ',C'S32'                                   
         DC    CL17'1/8 H PG         ',C'S32'                                   
         DC    CL17'1/8 H PG.        ',C'S32'                                   
         DC    CL17'1/8 HOR PAGE     ',C'S32'                                   
         DC    CL17'1/8 HOR PG       ',C'S32'                                   
         DC    CL17'1/8 HOR PG.      ',C'S32'                                   
         DC    CL17'1/8 HORZ PAGE    ',C'S32'                                   
         DC    CL17'1/8 HORZ PG      ',C'S32'                                   
         DC    CL17'1/8 HORZ PG.     ',C'S32'                                   
         DC    CL17'1/9 V PAGE       ',C'S33'                                   
         DC    CL17'1/9 V PG         ',C'S33'                                   
         DC    CL17'1/9 V PG.        ',C'S33'                                   
         DC    CL17'1/9 VER PAGE     ',C'S33'                                   
         DC    CL17'1/9 VER PG       ',C'S33'                                   
         DC    CL17'1/9 VER PG.      ',C'S33'                                   
         DC    CL17'1/9 H PAGE       ',C'S34'                                   
         DC    CL17'1/9 H PG         ',C'S34'                                   
         DC    CL17'1/9 H PG.        ',C'S34'                                   
         DC    CL17'1/9 HOR PAGE     ',C'S34'                                   
         DC    CL17'1/9 HOR PG       ',C'S34'                                   
         DC    CL17'1/9 HOR PG.      ',C'S34'                                   
         DC    CL17'1/9 HORZ PAGE    ',C'S34'                                   
         DC    CL17'1/9 HORZ PG      ',C'S34'                                   
         DC    CL17'1/9 HORZ PG.     ',C'S34'                                   
         DC    CL17'1/10 V PAGE      ',C'S35'                                   
         DC    CL17'1/10 V PG        ',C'S35'                                   
         DC    CL17'1/10 V PG.       ',C'S35'                                   
         DC    CL17'1/10 VER PAGE    ',C'S35'                                   
         DC    CL17'1/10 VER PG      ',C'S35'                                   
         DC    CL17'1/10 VER PG.     ',C'S35'                                   
         DC    CL17'1/10 H PAGE      ',C'S36'                                   
         DC    CL17'1/10 H PG        ',C'S36'                                   
         DC    CL17'1/10 H PG.       ',C'S36'                                   
         DC    CL17'1/10 HOR PAGE    ',C'S36'                                   
         DC    CL17'1/10 HOR PG      ',C'S36'                                   
         DC    CL17'1/10 HOR PG.     ',C'S36'                                   
         DC    CL17'1/10 HORZ PAGE   ',C'S36'                                   
         DC    CL17'1/10 HORZ PG     ',C'S36'                                   
         DC    CL17'1/10 HORZ PG,    ',C'S36'                                   
         DC    CL17'1/12 V PAGE      ',C'S37'                                   
         DC    CL17'1/12 V PG        ',C'S37'                                   
         DC    CL17'1/12 V PG.       ',C'S37'                                   
         DC    CL17'1/12 VER PAGE    ',C'S37'                                   
         DC    CL17'1/12 VER PG      ',C'S37'                                   
         DC    CL17'1/12 VER PG.     ',C'S37'                                   
         DC    CL17'1/12 H PAGE      ',C'S38'                                   
         DC    CL17'1/12 H PG        ',C'S38'                                   
         DC    CL17'1/12 H PG.       ',C'S38'                                   
         DC    CL17'1/12 HOR PAGE    ',C'S38'                                   
         DC    CL17'1/12 HOR PG      ',C'S38'                                   
         DC    CL17'1/12 HOR PG.     ',C'S38'                                   
         DC    CL17'1/12 HORZ PAGE   ',C'S38'                                   
         DC    CL17'1/12 HORZ PG     ',C'S38'                                   
         DC    CL17'1/12 HORZ PG.    ',C'S38'                                   
         DC    CL17'1/15 V PAGE      ',C'S39'                                   
         DC    CL17'1/15 V PG        ',C'S39'                                   
         DC    CL17'1/15 V PG.       ',C'S39'                                   
         DC    CL17'1/15 VER PAGE    ',C'S39'                                   
         DC    CL17'1/15 VER PG      ',C'S39'                                   
         DC    CL17'1/15 VER PG.     ',C'S39'                                   
         DC    CL17'1/15 H PAGE      ',C'S40'                                   
         DC    CL17'1/15 H PG        ',C'S40'                                   
         DC    CL17'1/15 H PG.       ',C'S40'                                   
         DC    CL17'1/15 HOR PAGE    ',C'S40'                                   
         DC    CL17'1/15 HOR PG      ',C'S40'                                   
         DC    CL17'1/15 HOR PG.     ',C'S40'                                   
         DC    CL17'1/15 HORZ PAGE   ',C'S40'                                   
         DC    CL17'1/15 HORZ PG     ',C'S40'                                   
         DC    CL17'1/15 HORZ PG.    ',C'S40'                                   
         DC    CL17'1/16 V PAGE      ',C'S41'                                   
         DC    CL17'1/16 V PG        ',C'S41'                                   
         DC    CL17'1/16 V PG.       ',C'S41'                                   
         DC    CL17'1/16 VER PAGE    ',C'S41'                                   
         DC    CL17'1/16 VER PG      ',C'S41'                                   
         DC    CL17'1/16 VER PG.     ',C'S41'                                   
         DC    CL17'1/16 H PAGE      ',C'S42'                                   
         DC    CL17'1/16 H PG        ',C'S42'                                   
         DC    CL17'1/16 H PG.       ',C'S42'                                   
         DC    CL17'1/16 HOR PAGE    ',C'S42'                                   
         DC    CL17'1/16 HOR PG      ',C'S42'                                   
         DC    CL17'1/16 HOR PG.     ',C'S42'                                   
         DC    CL17'1/16 HORZ PAGE   ',C'S42'                                   
         DC    CL17'1/16 HORZ PG     ',C'S42'                                   
         DC    CL17'1/16 HORZ PG.    ',C'S42'                                   
         DC    CL17'1/18 V PAGE      ',C'S43'       GUESS                       
         DC    CL17'1/18 V PG        ',C'S43'       GUESS                       
         DC    CL17'1/18 V PG.       ',C'S43'       GUESS                       
         DC    CL17'1/18 VER PAGE    ',C'S43'       GUESS                       
         DC    CL17'1/18 VER PG      ',C'S43'       GUESS                       
         DC    CL17'1/18 VER PG.     ',C'S43'       GUESS                       
         DC    CL17'1/18 H PAGE      ',C'S44'                                   
         DC    CL17'1/18 H PG        ',C'S44'                                   
         DC    CL17'1/18 H PG.       ',C'S44'                                   
         DC    CL17'1/18 HOR PAGE    ',C'S44'                                   
         DC    CL17'1/18 HOR PG      ',C'S44'                                   
         DC    CL17'1/18 HOR PG.     ',C'S44'                                   
         DC    CL17'1/18 HORZ PAGE   ',C'S44'                                   
         DC    CL17'1/18 HORZ PG     ',C'S44'                                   
         DC    CL17'1/18 HORZ PG.    ',C'S44'                                   
         DC    CL17'1/24 V PAGE      ',C'S45'                                   
         DC    CL17'1/24 V PG        ',C'S45'                                   
         DC    CL17'1/24 V PG.       ',C'S45'                                   
         DC    CL17'1/24 VER PAGE    ',C'S45'                                   
         DC    CL17'1/24 VER PG      ',C'S45'                                   
         DC    CL17'1/24 VER PG.     ',C'S45'                                   
         DC    CL17'1/24 H PAGE      ',C'S46'                                   
         DC    CL17'1/24 H PG        ',C'S46'                                   
         DC    CL17'1/24 H PG.       ',C'S46'                                   
         DC    CL17'1/24 HOR PAGE    ',C'S46'                                   
         DC    CL17'1/24 HOR PG      ',C'S46'                                   
         DC    CL17'1/24 HOR PG.     ',C'S46'                                   
         DC    CL17'1/24 HORZ PAGE   ',C'S46'                                   
         DC    CL17'1/24 HORZ PG     ',C'S46'                                   
         DC    CL17'1/24 HORZ PG.    ',C'S46'                                   
         DC    CL17'1 INCH           ',C'S47'                                   
         DC    CL17'1 IN             ',C'S47'                                   
         DC    CL17'1"               ',C'S47'                                   
         DC    CL17'1 "              ',C'S47'                                   
         DC    CL17'2 INCHES         ',C'S48'                                   
         DC    CL17'2 INS            ',C'S48'                                   
         DC    CL17'2"               ',C'S48'                                   
         DC    CL17'2 "              ',C'S48'                                   
         DC    CL17'1 COLUMN         ',C'S49'                                   
         DC    CL17'1 COL            ',C'S49'                                   
         DC    CL17'2 COLS           ',C'S50'                                   
         DC    CL17'3 COLUMNS        ',C'S51'                                   
         DC    CL17'3 COLS           ',C'S51'                                   
         DC    CL17'4 COLUMNS        ',C'S52'                                   
         DC    CL17'4 COLS           ',C'S52'                                   
         DC    CL17'5 COLUMNS        ',C'S53'                                   
         DC    CL17'5 COLS           ',C'S53'                                   
         DC    X'FF'             END OF TABLE                                   
         EJECT                                                                  
*                                                                               
*        PRINTPAK SAFETY CODE TABLE                                             
*                                                                               
*        ENTRIES ARE CODE, DESCRIPTION                                          
PSAFETAB DC    C'1',CL10'ANY EDGE'                                              
         DC    C'2',CL10'TOP'                                                   
         DC    C'3',CL10'BOTTOM'                                                
         DC    C'4',CL10'FACE'                                                  
         DC    C'5',CL10'GUTTER'                                                
         DC    X'FF'             END OF TABLE                                   
