*          DATA SET PSIZETAB1  AT LEVEL 002 AS OF 08/21/98                      
*                                                                               
*   PRINTPAK AD SIZE CODE-DESCRIPTION TABLE                                     
*                                                                               
*   ENTRIES ARE AD SIZE CODE, 17 BYTE DESCRIPTION                               
*                                                                               
*   NOTE: SIZES S01-S53 ARE THE SAME FOR JUNIOR AND TABLOID                     
*         THEIR CODES WILL BEGIN WITH J (JUNIOR) OR T (TABLOID)                 
*                                                                               
PADSCDT  DS    0H                                                               
         DC    C'S01',CL17'SPREAD'                                              
         DC    C'S02',CL17'1 PAGE'                                              
         DC    C'S03',CL17'4/5 V PAGE'                                          
         DC    C'S04',CL17'4/5 H PAGE'                                          
         DC    C'S05',CL17'3/4 V PAGE'                                          
         DC    C'S06',CL17'3/4 H PAGE'                                          
         DC    C'S07',CL17'2/3 V PAGE'                                          
         DC    C'S08',CL17'2/3 H PAGE'                                          
         DC    C'S09',CL17'3/5 V PAGE'                                          
         DC    C'S10',CL17'3/5 H PAGE'                                          
         DC    C'S11',CL17'1/2 PG ISLAND'                                       
         DC    C'S12',CL17'1/2 V PAGE'                                          
         DC    C'S13',CL17'1/2 H PAGE'                                          
         DC    C'S14',CL17'1/2 PG SQUARE'                                       
         DC    C'S15',CL17'3/8 V PAGE'                                          
         DC    C'S16',CL17'3/8 H PAGE'                                          
         DC    C'S17',CL17'1/3 V PAGE'                                          
         DC    C'S18',CL17'1/3 H PAGE'                                          
         DC    C'S19',CL17'1/3 PG SQUARE'                                       
         DC    C'S20',CL17'3/10 V PAGE'                                         
         DC    C'S21',CL17'3/10 H PAGE'  (NONE FOUND - THIS IS GUESS)           
         DC    C'S22',CL17'1/4 V PAGE'                                          
         DC    C'S23',CL17'1/4 H PAGE'                                          
         DC    C'S24',CL17'1/4 PG SQUARE'                                       
         DC    C'S25',CL17'1/5 V PAGE'                                          
         DC    C'S26',CL17'1/5 H PAGE'                                          
         DC    C'S27',CL17'1/5 PG SQUARE' (NONE FOUND - THIS IS GUESS)          
         DC    C'S28',CL17'1/5 PG ISLAND' (NONE FOUND - THIS IS GUESS)          
         DC    C'S29',CL17'1/6 V PAGE'                                          
         DC    C'S30',CL17'1/6 H PAGE'                                          
         DC    C'S31',CL17'1/8 V PAGE'                                          
         DC    C'S32',CL17'1/8 H PAGE'                                          
         DC    C'S33',CL17'1/9 V PAGE'                                          
         DC    C'S34',CL17'1/9 H PAGE'                                          
         DC    C'S35',CL17'1/10 V PAGE'                                         
         DC    C'S36',CL17'1/10 H PAGE'                                         
         DC    C'S37',CL17'1/12 V PAGE'                                         
         DC    C'S38',CL17'1/12 H PAGE'                                         
         DC    C'S39',CL17'1/15 V PAGE'                                         
         DC    C'S40',CL17'1/15 H PAGE'                                         
         DC    C'S41',CL17'1/16 V PAGE'                                         
         DC    C'S42',CL17'1/16 H PAGE'                                         
         DC    C'S43',CL17'1/18 V PAGE'  (NONE FOUND - THIS IS A GUESS)         
         DC    C'S44',CL17'1/18 H PAGE'                                         
         DC    C'S45',CL17'1/24 V PAGE'                                         
         DC    C'S46',CL17'1/24 H PAGE'                                         
         DC    C'S47',CL17'1 INCH'                                              
         DC    C'S48',CL17'2 INCHES'                                            
         DC    C'S49',CL17'1 COLUMN'                                            
         DC    C'S50',CL17'2 COLUMNS'                                           
         DC    C'S51',CL17'3 COLUMNS'                                           
         DC    C'S52',CL17'4 COLUMNS'                                           
         DC    C'S53',CL17'5 COLUMNS'                                           
         DC    X'FF'             END OF TABLE                                   
*                                                                               
