*          DATA SET PTRAPRDPP  AT LEVEL 001 AS OF 12/13/00                      
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
*       PRINTPAK TRAFFIC/PRODUCT PASSIVE POINTER                                
*                                                                               
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
PTRPKEY  DS    0CL25                                                            
PTRPKAGY DS    CL2                 AGENCY CODE                                  
PTRPKMED DS    CL1                 MEDIA                                        
PTRPKRCD DS    XL1'A4'                                                          
PTRPKIDQ EQU   X'A4'               TRAFFIC/PRD PP RECORD ID                     
PTRPKCLT DS    CL3                 CLIENT CODE                                  
PTRPKTRA DS    CL1                 TRAFFIC CODE                                 
PTRPKPRD DS    CL3                 PRODUCT CODE                                 
         DS    CL14                SPARE                                        
*                                                                               
PTRPCNTL DS    XL2                                                              
PTRPDISK DS    XL4                 DISK ADDRESS (PRODUCT)                       
