*          DATA SET PTXBRECD   AT LEVEL 003 AS OF 01/28/19                      
       ++INCLUDE DXHDRD            HEADER                                       
         EJECT                                                                  
       ++INCLUDE DXTRLD            TRAILER                                      
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY RECORD                           (05082) *         
***********************************************************************         
         SPACE 1                                                                
PXG$BUY  DSECT                     GROUP M ACCOUNT DATA RECORD                  
*                                                                               
PXG$LEN  DS    CL4                 RECORD LENGTH                                
*                                                                               
PXG$TYP  DS    CL5                 RECORD TYPE (05082)                          
PXG#01   DS    C                                                                
PXG$ACT  DS    CL1                 RECORD ACTION                                
PXG#02   DS    C                                                                
PXG$DAT  DS    CL8                 RECORD DATE                                  
PXG#03   DS    C                                                                
PXG$TME  DS    CL6                 RECORD TIME                                  
PXG#04   DS    C                                                                
*                                                                               
PXG$SEQ  DS    CL8                 SEQNUM                                       
PXG#05   DS    C                                                                
PXG$RTYP DS    CL3                 RECORD TYPE (PAY/RCV)                        
PXG#06   DS    C                                                                
PXG$TTYP DS    CL3                 TRANSACTION TYPE                             
PXG#07   DS    C                                                                
*                                                                               
PXG$ACCD DS    CL14                ACCOUNT CODE                                 
PXG#08   DS    C                                                                
PXG$CONT DS    CL14                CONTRA ACCOUNT CODE                          
PXG#09   DS    C                                                                
PXG$OFFC DS    CL2                 OFFICE CODE                                  
PXG#10   DS    C                                                                
PXG$TRDT DS    CL8                 TRANSACTION DATE                             
PXG#11   DS    C                                                                
PXG$TRRF DS    CL6                 REFNUM                                       
PXG#12   DS    C                                                                
PXG$TRSR DS    CL3                 SUB-REFNUM                                   
PXG#13   DS    C                                                                
PXG$SYS  DS    CL2                 SYSTEM CODE                                  
PXG#14   DS    C                                                                
PXG$MED  DS    CL1                 MEDIA                                        
PXG#15   DS    C                                                                
PXG$CNT  DS    CL3                 CLIENT                                       
PXG#16   DS    C                                                                
PXG$PRD  DS    CL6                 CLIENT/PRODUCT                               
PXG#17   DS    C                                                                
PXG$EST  DS    CL6                 ESTIMATE                                     
PXG#18   DS    C                                                                
PXG$DR   DS    CL16                DEBIT DOLLARS                                
PXG#19   DS    C                                                                
PXG$CR   DS    CL16                CREDIT DOLLARS                               
PXG#20   DS    C                                                                
PXG$MOA  DS    CL4                 MONTH OF ACTIVITY                            
PXG#21   DS    C                                                                
PXG$ACDT DS    CL8                 ACTIVITY DATE                                
PXG#22   DS    C                                                                
PXG$BREF DS    CL6                 BATCH REF                                    
PXG#23   DS    C                                                                
PXG$MOS  DS    CL4                 MONTH OF SERVICE                             
PXG#24   DS    C                                                                
PXG$BNET DS    CL16                NET BILLING AMOUNT                           
PXG#25   DS    C                                                                
PXG$BINC DS    CL16                BILLING INCOME: COMMISSION                   
PXG#26   DS    C                                                                
PXG$INAC DS    CL12                INCOME ACCOUNT                               
PXG#27   DS    C                                                                
PXG$CKDT DS    CL8                 CHECK DATE                                   
PXG#28   DS    C                                                                
PXG$CHEK DS    CL6                 CHECK NUMBER                                 
PXG#29   DS    C                                                                
PXG$VDDT DS    CL8                 VOID DATE                                    
PXG#30   DS    C                                                                
PXG$DPDT DS    CL8                 DEPOSIT DATE                                 
PXG#31   DS    C                                                                
PXG$CLDT DS    CL8                 CLEARED DATE                                 
PXG#32   DS    C                                                                
PXG$DUDT DS    CL8                 DUE DATE                                     
PXG#33   DS    C                                                                
PXG$INV  DS    CL20                INVOICE NUMBER                               
PXG#34   DS    C                                                                
PXG$OFDT DS    CL8                 OFFSET DATE                                  
PXG#35   DS    C                                                                
PXG$STDT DS    CL8                STATEMENT DATE                                
PXG#36   DS    C                                                                
PXG$BKCD DS    CL14                BANK CODE                                    
PXG#37   DS    C                                                                
PXG$WOAC DS    CL14                WRITEOFF ACCOUNT                             
PXG#38   DS    C                                                                
PXG$WONU DS    CL11                WRITEOFF NUMBER                              
PXG#39   DS    C                                                                
PXG$WODT DS    CL8                 WRITEOFF DATE                                
PXG#40   DS    C                                                                
PXG$XFAC DS    CL14                TRANSFER ACCOUNT                             
PXG#41   DS    C                                                                
PXG$XFDT DS    CL8                 TRANSFER DATE                                
PXG#42   DS    C                                                                
PXG$AOAC DS    CL14                AOR ACCOUNT                                  
PXG#43   DS    C                                                                
PXG$AOR$ DS    CL16                AOR AMOUNT                                   
PXG#44   DS    C                                                                
PXG$AOBL DS    CL20                AOR BILL NUMBER                              
PXG#45   DS    C                                                                
PXG$WKCD DS    CL2                 WORK CODE                                    
PXG#46   DS    C                                                                
PXG$NARR DS    CL200               NARRATIVE                                    
PXG#47   DS    C                                                                
PXG$CURR DS    CL3                 SAP CURRENCY (USD/CND)                       
PXG#48   DS    C                                                                
PXG$STYP DS    CL3                 SAP TRANSACTION TYPE (INV/CRM)               
PXG#49   DS    C                                                                
PXG$NETW DS    CL12                SAP NETWORK                                  
PXG#50   DS    C                                                                
PXG$BGRS DS    CL16                GROSS BILLING AMOUNT                         
PXG#51   DS    C                                                                
PXG$EDSC DS    CL20                ESTIMATE DESCRIPTION                         
PXG#52   DS    C                                                                
PXG$PRD1 DS    CL32                USER FIELD  - PRODUCT 1                      
PXG#53   DS    C                                                                
PXG$PRD2 DS    CL16                USER FIELD  - PRODUCT 2                      
PXG#54   DS    C                                                                
PXG$EST1 DS    CL32                USER FIELD  - ESTIMATE 1                     
PXG#55   DS    C                                                                
PXG$EST2 DS    CL16                USER FIELD  - ESTIMATE 2                     
PXG#56   DS    C                                                                
PXG$SECA DS    CL2                 SECURITY AGENCY                              
PXG#57   DS    C                                                                
PXG$PID  DS    CL8                 PID (PERSONAL IDENTIFICATION NUMBER)         
PXG#58   DS    C                                                                
PXG$ITMN DS    CL5                 ITEM NUMBER                                  
PXG#59   DS    C                                                                
PXG$VNDC DS    CL12                VENDOR CODE                                  
PXG#60   DS    C                                                                
PXG$VNDN DS    CL24                VENDOR NAME                                  
PXG#61   DS    C                                                                
PXG$GRS  DS    CL16                GROSS                                        
PXG#62   DS    C                                                                
PXG$NET  DS    CL16                NET                                          
PXG#63   DS    C                                                                
PXG$TAXA DS    CL16                TAX AMOUNT                                   
PXG#64   DS    C                                                                
PXG$TAXC DS    CL2                 TAX CODE                                     
PXG#65   DS    C                                                                
PXG$INSO DS    CL40                INSERTION ORDER                              
PXG#66   DS    C                                                                
PXG$CMPG DS    CL60                CAMPAIGN                                     
PXG#67   DS    C                                                                
PXG$AGY  DS    CL2                 AGENCY ALPHA                                 
PXG#68   DS    C                                                                
PXG$MEDA DS    CL32                MEDIA AUTHORIZATION NUMBER                   
PXG#69   DS    C                                                                
PXG$ESTU DS    CL3                 ESTIMATE UNIQUE NUMBER (NET)                 
PXG#70   DS    C                                                                
PXG$BUYU DS    CL09                BUY UNIQUE NUMBER (PRT)                      
PXG#71   DS    C                                                                
PXG$VOUC DS    CL40                VOUCHER NUMBER                               
         ORG   PXG$VOUC                                                         
PXG$VMOS DS    CL4                 VOUCHER MOS                                  
PXG$VINV DS    CL20                VOUCHER INVOICE                              
         DS    CL16                                                             
         ORG                                                                    
PXG#72   DS    C                                                                
PXG$ACN  DS    CL8                 RECORD ACTION NAME                           
PXG#73   DS    C                                                                
PXG$PLID DS    CL60                PLACEMENT ID                                 
PXG#74   DS    C                                                                
*                                                                               
PXG$BUYL EQU   *-PXG$BUY           RECORD LENGTH                                
PXG$BUYX EQU   *                                                                
         EJECT                                                                  
         EJECT                                                                  
         SPACE 1                                                                
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY CUSTOM COLUMN RECORD                     *         
***********************************************************************         
         SPACE 1                                                                
PRICBD   DSECT                     BUY CUSTOM COLUMN RECORD                     
PRICBLEN DS    CL4                 RECORD LENGTH                                
PRICBTYP DS    CL5                 RECORD TYPE     '06116'                      
         DS    C                                                                
PRICBACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRICBDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRICBTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRICBAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRICBMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRICBCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRICBSER DS    CL9                 BUY SERIAL NUMBER                            
         DS    C                                                                
PRICBSEQ DS    CL5                 AGENCY UNIQUE SEQUENCE NUMBER                
         DS    C                                                                
PRICBDTL DS    XL2                 PRICBDTA LENGTH                              
PRICBDTA DS    CL60                COLUMN DATA  (VARCHAR)                       
*                                                                               
PRICBDX  DS    CL2                 RECORD END                                   
PRICBDL  EQU   *-PRICBD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY COMMENT RECORD                                     
***********************************************************************         
         SPACE 1                                                                
PRIBCD   DSECT                     BUY COMMENT RECORD                           
PRIBCLEN DS    CL4                 RECORD LENGTH                                
PRIBCTYP DS    CL5                 RECORD TYPE '06111'                          
         DS    C                                                                
PRIBCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBCMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBCCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBCSER DS    CL9                 PLACEHOLDER FOR NEW BUY SERIAL #             
         DS    C                                                                
PRIBCTPE DS    CL1                 I=INSERTION,P=POSITIONAL,C=COMMENT           
*                                  T=TEARSHEET                                  
         DS    C                                                                
PRIBCCML DS    XL2                                                              
PRIBCCOM DS    CL255                                                            
*                                                                               
PRIBCDX  DS    CL2                 RECORD END                                   
PRIBCDL  EQU   *-PRIBCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY SUMMARY RECORD                                     
***********************************************************************         
         SPACE 1                                                                
PRIBSD   DSECT                     BUY SUMMARY RECORD                           
PRIBSLEN DS    CL4                 RECORD LENGTH                                
PRIBSTYP DS    CL5                 RECORD TYPE '06109'                          
         DS    C                                                                
PRIBSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBSAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBSMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBSCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBSSER DS    CL9                 PLACEHOLDER FOR NEW BUY SERIAL #             
         DS    C                                                                
PRIBSBLT DS    CL1                 Y/N DESIGN ISSUE - TABLE STRUCTURE           
*                                  FOR BUY LINE TOTAL PLUS                      
         DS    C                                                                
PRIBSPRD DS    CL3                 BRAND DETAIL                                 
         DS    C                                                                
PRIBSGRS DS    CL11                ORDER GROSS                                  
         DS    C                                                                
PRIBSCOM DS    CL11                COMMISSION                                   
         DS    C                                                                
PRIBSCDS DS    CL11                CASH DISCOUNT                                
         DS    C                                                                
PRIBSPGR DS    CL11                PAID GROSS                                   
         DS    C                                                                
PRIBSPCM DS    CL11                PAID COMMISSION                              
         DS    C                                                                
PRIBSPCD DS    CL11                PAID CASH DISCOUNT                           
         DS    C                                                                
PRIBSBGR DS    CL11                BILLED GROSS                                 
         DS    C                                                                
PRIBSBCM DS    CL11                BILLED COMMISSION                            
         DS    C                                                                
PRIBSBCD DS    CL11                BILLED CASH DISCOUNT                         
         DS    C                                                                
PRIBSTAX DS    CL11                STATE SALES TAXES                            
         DS    C                                                                
PRIBSGST DS    CL11                ORDERED GST                                  
         DS    C                                                                
PRIBSPGS DS    CL11                PAID GST                                     
         DS    C                                                                
PRIBSBGS DS    CL11                BILLED GST                                   
         DS    C                                                                
PRIBSPST DS    CL11                PST        ORDERED PROVINCIAL TAXES          
         DS    C                                                                
PRIBSPPS DS    CL11                PAID PST   PAID PROVINICIAL TAX              
         DS    C                                                                
PRIBSBPS DS    CL11                BILLED PST BILLED PROVINICIAL TAX            
         DS    C                                                                
PRISSGRS DS    CL11                ORDER GROSS                                  
         DS    C                                                                
PRISSCOM DS    CL11                COMMISSION                                   
         DS    C                                                                
PRISSCDS DS    CL11                CASH DISCOUNT                                
         DS    C                                                                
PRISSPGR DS    CL11                PAID GROSS                                   
         DS    C                                                                
PRISSPCM DS    CL11                PAID COMMISSION                              
         DS    C                                                                
PRISSPCD DS    CL11                PAID CASH DISCOUNT                           
         DS    C                                                                
PRISSBGR DS    CL11                BILLED GROSS                                 
         DS    C                                                                
PRISSBCM DS    CL11                BILLED COMMISSION                            
         DS    C                                                                
PRISSBCD DS    CL11                BILLED CASH DISCOUNT                         
         DS    C                                                                
PRISSTAX DS    CL11                STATE SALES TAXES                            
         DS    C                                                                
PRISSGST DS    CL11                ORDERED GST                                  
         DS    C                                                                
PRISSPGS DS    CL11                PAID GST                                     
         DS    C                                                                
PRISSBGS DS    CL11                BILLED GST                                   
         DS    C                                                                
PRISSPST DS    CL11                PST        ORDERED PROVINCIAL TAXES          
         DS    C                                                                
PRISSPPS DS    CL11                PAID PST   PAID PROVINICIAL TAX              
         DS    C                                                                
PRISSBPS DS    CL11                BILLED PST BILLED PROVINICIAL TAX            
         DS    C                                                                
PRIBSC2D DS    CL11         COS2 DOLLARS (GROSS)                                
         DS    C                                                                
PRISSC2D DS    CL11         COS2 DOLLARS (GROSS) (SPECIAL CHARGES)              
         DS    C                                                                
PRIPCGRS DS    CL11                PLANNED COST GROSS                           
         DS    C                                                                
PRIPCCOM DS    CL11                PLANNED COST COMMISSION                      
*****    DS    C                                                                
*****PRIPCBGR DS    CL11                PLANNED COST BILLED GROSS               
*****    DS    C                                                                
*****PRIPCBCM DS    CL11                PLANNED COST BILLED COMMISSION          
*****    DS    C                                                                
*****PRIPCTAX DS    CL11                PLANNED COST SALES TAX                  
*****    DS    C                                                                
*****PRIPCGST DS    CL11                PLANNED COST GST                        
*****    DS    C                                                                
*****PRIPCBGS DS    CL11                PLANNED COST BILLED GST                 
*****    DS    C                                                                
*****PRIPCPST DS    CL11                PLANNED COST PST                        
*****    DS    C                                                                
*****PRIPCBPS DS    CL11                PLANNED COST BILLED PST                 
         DS    C                                                                
PRIBSFXO DS    CL11                FX ORDERED DOLLARS                           
         DS    C                                                                
PRIBSFXP DS    CL11                FX PAID DOLLARS                              
         DS    C                                                                
PRIBSFXA DS    CL11                FX PAYABLE DOLLARS                           
*                                                                               
PRIBSDX  DS    CL2                 RECORD END                                   
PRIBSDL  EQU   *-PRIBSD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY ADDITIONAL CHARGES RECORD                          
***********************************************************************         
         SPACE 1                                                                
PRIBAD   DSECT                     BUY ADDITIONAL CHARGES RECORD                
PRIBALEN DS    CL4                 RECORD LENGTH                                
PRIBATYP DS    CL5                 RECORD TYPE '06126'                          
         DS    C                                                                
PRIBAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBAAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBAMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBACNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBASER DS    CL9                 PLACEHOLDER FOR NEW BUY SERIAL #             
         DS    C                                                                
PRIBABLT DS    CL1                 Y/N DESIGN ISSUE - TABLE STRUCTURE           
*                                  FOR BUY LINE TOTAL PLUS                      
         DS    C                                                                
PRIBAPRD DS    CL3                 BRAND DETAIL                                 
         DS    C                                                                
PRIBACHG DS    CL2                 ADDITIONAL CHARGE CODE - FOREIGN KEY         
*                                   TO ADD'L CHG REC (WITH AGY AND MED)         
         DS    C                                                                
PRIBAGRS DS    CL11                ORDER GROSS                                  
         DS    C                                                                
PRIBACOM DS    CL11                COMMISSION                                   
         DS    C                                                                
PRIBACDS DS    CL11                CASH DISCOUNT                                
         DS    C                                                                
PRIBAPGR DS    CL11                PAID GROSS                                   
         DS    C                                                                
PRIBAPCM DS    CL11                PAID COMMISSION                              
         DS    C                                                                
PRIBAPCD DS    CL11                PAID CASH DISCOUNT                           
         DS    C                                                                
PRIBABGR DS    CL11                BILLED GROSS                                 
         DS    C                                                                
PRIBABCM DS    CL11                BILLED COMMISSION                            
         DS    C                                                                
PRIBABCD DS    CL11                BILLED CASH DISCOUNT                         
         DS    C                                                                
PRIBATAX DS    CL11                STATE SALES TAXES                            
         DS    C                                                                
PRIBAGST DS    CL11                ORDERED GST                                  
         DS    C                                                                
PRIBAPGS DS    CL11                PAID GST                                     
         DS    C                                                                
PRIBABGS DS    CL11                BILLED GST                                   
         DS    C                                                                
PRIBAPST DS    CL11                PST        ORDERED PROVINCIAL TAXES          
         DS    C                                                                
PRIBAPPS DS    CL11                PAID PST   PAID PROVINICIAL TAX              
         DS    C                                                                
PRIBABPS DS    CL11                BILLED PST BILLED PROVINICIAL TAX            
         DS    C                                                                
PRIBAC2D DS    CL11                COS2 DOLLARS GROSS                           
*                                                                               
PRIBADX  DS    CL2                 RECORD END                                   
PRIBADL  EQU   *-PRIBAD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PRODUCT                                                
***********************************************************************         
         SPACE 1                                                                
PRIPDD   DSECT                     PRODUCT RECORD                               
PRIPDLEN DS    CL4                 RECORD LENGTH                                
PRIPDTYP DS    CL5                 RECORD TYPE   '06103'                        
         DS    C                                                                
PRIPDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIPDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIPDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIPDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIPDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIPDCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIPDPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
PRIPDNME DS    CL20                NAME                                         
         DS    C                                                                
PRIPDDIV DS    CL3                 DIVISION                                     
         DS    C                                                                
PRIPDINF DS    CL6                 INTERFACE CODE                               
         DS    C                                                                
PRIPDOFF DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
PRIPDACN DS    CL8                 ACCOUNT NUMBER                               
         DS    C                                                                
PRIPDTAX DS    CL1                 DEFAULT TO CLIENT'S TAX CODE                 
         DS    C                                                                
PRIPDUV1 DS    CL32                USER1 VALUE                                  
         DS    C                                                                
PRIPDUV2 DS    CL16                USER2 VALUE                                  
         DS    C                                                                
PRIPDBFM DS    CL18                BILL FORMULA                                 
*                                                                               
PRIPDDX  DS    CL2                 RECORD END                                   
PRIPDDL  EQU   *-PRIPDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUDGET RECORD                                          
***********************************************************************         
         SPACE 1                                                                
PRIBDD   DSECT                     BUDGET RECORD                                
PRIBDLEN DS    CL4                 RECORD LENGTH                                
PRIBDTYP DS    CL5                 RECORD TYPE  '06129'                         
         DS    C                                                                
PRIBDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBDCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBDPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
PRIBDEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
PRIBDREG DS    CL3                 REGION                                       
         DS    C                                                                
PRIBDDIS DS    CL3                 DISTRICT                                     
         DS    C                                                                
PRIBDMY  DS    CL6                 MONTY/YEAR MMM/YY                            
         DS    C                                                                
PRIBDTP  DS    C                   BUDGET TYPE                                  
         DS    C                                                                
PRIBDAMT DS    CL12                AMOUNT                                       
*                                                                               
PRIBDDX  DS    CL2                 RECORD END                                   
PRIBDDL  EQU   *-PRIBDD            RECORD LENGTH                                
***********************************************************************         
* PRINT SYSTEM EXTRACT - MEDIA RECORD                                 *         
***********************************************************************         
         SPACE 1                                                                
PRIMDD   DSECT                     MEDIA RECORD                                 
PRIMDLEN DS    CL4                 RECORD LENGTH                                
PRIMDTYP DS    CL5                 RECORD TYPE     '06100'                      
         DS    C                                                                
PRIMDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIMDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIMDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIMDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIMDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIMDAGN DS    CL33                AGENCY NAME                                  
         DS    C                                                                
PRIMDMDN DS    CL20                EXTRACT NEEDS CODE TO EXPAND                 
         DS    C                   ABBREVIATIONS OF INTERACTIVE                 
*                                                                               
PRIMDISC DS    CL1                 REPRESENT AS COUNTRY,CANADA FLAG Y/N         
         DS    C                                                                
*                                                                               
PRIMDDX  DS    CL2                 RECORD END                                   
PRIMDDL  EQU   *-PRIMDD            RECORD LENGTH                                
         EJECT                                                                  
