*          DATA SET PTXPARM    AT LEVEL 121 AS OF 12/09/18                      
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
* PRINT EXTRACT PARAMETER BLOCK                                                 
* PASSED BETWEEN PTXTRACT AND PTXROUTS EXTRACT ROUTINES                         
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
PTXPARM  DS    0F                                                               
*                                                                               
PTXPFLG1 DS    X                   FLAG 1                                       
NORDSEQ  EQU   X'01'               DO NOT READ NEXT RECORD                      
KILLQ    EQU   X'02'               GENERATE ACTION "KILL"                       
BLDMOSTQ EQU   X'04'               BUDGET: BUILD MOS TABLE                      
NOWRITEQ EQU   X'08'               DO NOT WRITE THIS RECORD                     
MULTIQ   EQU   X'10'               MULTIPLE WRITES PER RECORD                   
*                                                                               
ELCOUNT  DS    X                   ELEMENT COUNT                                
BUDTYPE  DS    C                   BUDGET TYPE                                  
*                                                                               
SVAAABFM DS    CL18                PRODUCT AAA'S BILL FORMULA                   
SVPRDBFM DS    CL18                PRODUCT'S BILL FORMULA                       
*                                                                               
PTXPARMLQ EQU  *-PTXPARM                                                        
