*          DATA SET PTXRECD    AT LEVEL 117 AS OF 12/11/20                      
       ++INCLUDE DXHDRD                                                         
         EJECT                                                                  
       ++INCLUDE DXTRLD            TRAILER                                      
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - MEDIA RECORD                                 *         
***********************************************************************         
         SPACE 1                                                                
PRIMDD   DSECT                     MEDIA RECORD                                 
PRIMDLEN DS    CL4                 RECORD LENGTH                                
PRIMDTYP DS    CL5                 RECORD TYPE     '06100'                      
         DS    C                                                                
PRIMDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIMDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIMDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIMDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIMDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIMDAGN DS    CL33                AGENCY NAME                                  
         DS    C                                                                
PRIMDMDN DS    CL20                EXTRACT NEEDS CODE TO EXPAND                 
         DS    C                   ABBREVIATIONS OF INTERACTIVE                 
*                                                                               
PRIMDISC DS    CL1                 REPRESENT AS COUNTRY,CANADA FLAG Y/N         
         DS    C                                                                
*                                                                               
PRIMDDX  DS    CL2                 RECORD END                                   
PRIMDDL  EQU   *-PRIMDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - CLIENT RECORD                                          
***********************************************************************         
         SPACE 1                                                                
PRICND   DSECT                     CLIENT RECORD                                
PRICNLEN DS    CL4                 RECORD LENGTH                                
PRICNTYP DS    CL5                 RECORD TYPE     '06101'                      
         DS    C                                                                
PRICNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRICNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRICNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRICNAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRICNMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRICNCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRICNNME DS    CL20                NAME                                         
         DS    C                                                                
PRICNOFF DS    CL1                 OFFICE                                       
         DS    C                                                                
PRICNTAX DS    CL1                 GST TAX CODE                                 
         DS    C                                                                
PRICNBLL DS    CL1                 BILL GROUP                                   
         DS    C                                                                
PRICNISF DS    CL1                 Y/N - FINANCIAL CLIENT- MAY NOT NEED         
         DS    C                                                                
PRICNPU1 DS    CL20                PRODUCT USER FIELD NAME 1                    
         DS    C                                                                
PRICNPU2 DS    CL20                PRODUCT USER FIELD NAME 2                    
         DS    C                                                                
PRICNEU1 DS    CL20                ESTIMATE USER FIELD NAME 1                   
         DS    C                                                                
PRICNEU2 DS    CL20                ESTIMATE USER FIELD NAME 2                   
         DS    C                                                                
PRICNMN  DS    CL20                MEDIA NAME OVERRIDE - SEED WITH              
*                                  MEDIA NAME FROM MEDIA TABLE                  
         DS    C                                                                
PRICNCOD DS    CL6                 INTERFACE CODE                               
         DS    C                                                                
PRICNOF2 DS    CL2                 CLIENT 2-CHR MEDIA OFFICE                    
         DS    C                                                                
PRICNDRD DS    CL3                 DRD CLIENT                                   
         DS    C                                                                
PRICNAOF DS    CL2                 CLIENT ACC OFFICE CODE                       
         DS    C                                                                
PRICNAAG DS    CL2                 CLIENT ACC OFFICE AGENCY                     
         DS    C                                                                
PRICNPRO DS    CL32                CLIENT PROFILE                               
         DS    C                                                                
PRICPU1R DS    C                   CLIENT PRD USER FIELD 1 - REQUIRED           
         DS    C                                                                
PRICPU1T DS    C                   CLIENT PRD USER FIELD 1 - DATA TYPE          
         DS    C                                                                
PRICPU1L DS    CL3                 CLIENT PRD USER FIELD 1 - MAX LENGTH         
         DS    C                                                                
PRICPU2R DS    C                   CLIENT PRD USER FIELD 2 - REQUIRED           
         DS    C                                                                
PRICPU2T DS    C                   CLIENT PRD USER FIELD 2 - DATA TYPE          
         DS    C                                                                
PRICPU2L DS    CL3                 CLIENT PRD USER FIELD 2 - MAX LENGTH         
         DS    C                                                                
PRICEU1R DS    C                   CLIENT EST USER FIELD 1 - REQUIRED           
         DS    C                                                                
PRICEU1T DS    C                   CLIENT EST USER FIELD 1 - DATA TYPE          
         DS    C                                                                
PRICEU1L DS    CL3                 CLIENT EST USER FIELD 1 - MAX LENGTH         
         DS    C                                                                
PRICEU2R DS    C                   CLIENT EST USER FIELD 2 - REQUIRED           
         DS    C                                                                
PRICEU2T DS    C                   CLIENT EST USER FIELD 2 - DATA TYPE          
         DS    C                                                                
PRICEU2L DS    CL3                 CLIENT EST USER FIELD 2 - MAX LENGTH         
         DS    C                                                                
PRICCEXN DS    CL50                CLIENT EXTENDED NAME                         
         DS    C                                                                
PRICDIVI DS    CL1                 CLIENT DIVISION                              
         DS    C                                                                
PRICBDCO DS    CL1                 CLIENT BILLABLE DATE CALC OVERRIDE           
         DS    C                                                                
PRICBDBD DS    CL1                 CLIENT BILL DATE/BASE DATE                   
         DS    C                                                                
PRICBDDA DS    CL1                 CLIENT BILL DATE ADJUSTMENT                  
         DS    C                                                                
PRICNNAD DS    CL1                 CLIENT NON NEWSPAPER ADJUSTMENT              
         DS    C                                                                
PRICCLTY DS    CL1                 CLIENT TYPE                                  
         DS    C                                                                
PRICMASC DS    CL3                 CLIENT MASTER/SUB CODE                       
         DS    C                                                                
PRICPEBF DS    CL1                 CLIENT PRD/EST BILLING FORMULAS              
         DS    C                                                                
PRICSREP DS    CL4                 CLIENT SPECIAL REP                           
         DS    C                                                                
PRICFROP DS    CL10                CLIENT FROZON OPTION                         
         DS    C                                                                
PRICCOS2 DS    CL10                CLIENT COS2 OPTION                           
         DS    C                                                                
PRICUCBC DS    CL1                 CLIENT UCOMM BILLING CONTROL                 
*                                                                               
PRICNDX  DS    CL2                 RECORD END                                   
PRICNDL  EQU   *-PRICND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - DIVISION RECORD                                        
***********************************************************************         
         SPACE 1                                                                
PRIDVD   DSECT                     DIVSION RECORD                               
PRIDVLEN DS    CL4                 RECORD LENGTH                                
PRIDVTYP DS    CL5                 RECORD TYPE   '06102'                        
         DS    C                                                                
PRIDVACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIDVDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIDVTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIDVAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIDVMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIDVCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIDVDIV DS    CL3                 DIVISION                                     
         DS    C                                                                
PRIDVNME DS    CL20                NAME                                         
*                                                                               
PRIDVDX  DS    CL2                 RECORD END                                   
PRIDVDL  EQU   *-PRIDVD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PRODUCT                                                
***********************************************************************         
         SPACE 1                                                                
PRIPDD   DSECT                     PRODUCT RECORD                               
PRIPDLEN DS    CL4                 RECORD LENGTH                                
PRIPDTYP DS    CL5                 RECORD TYPE   '06103'                        
         DS    C                                                                
PRIPDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIPDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIPDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIPDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIPDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIPDCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIPDPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
PRIPDNME DS    CL20                NAME                                         
         DS    C                                                                
PRIPDDIV DS    CL3                 DIVISION                                     
         DS    C                                                                
PRIPDINF DS    CL6                 INTERFACE CODE                               
         DS    C                                                                
PRIPDOFF DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
PRIPDACN DS    CL8                 ACCOUNT NUMBER                               
         DS    C                                                                
PRIPDTAX DS    CL1                 DEFAULT TO CLIENT'S TAX CODE                 
         DS    C                                                                
PRIPDUV1 DS    CL32                USER1 VALUE                                  
         DS    C                                                                
PRIPDUV2 DS    CL16                USER2 VALUE                                  
         DS    C                                                                
PRIPDBFM DS    CL18                BILL FORMULA                                 
         DS    C                                                                
PRIPBRN1 DS    CL20                BILL RECEIPT NAME 1                          
         DS    C                                                                
PRIPBRN2 DS    CL20                BILL RECEIPT NAME 2                          
         DS    C                                                                
PRIPLIN1 DS    CL30                ADDRESS - LINE 1                             
         DS    C                                                                
PRIPLIN2 DS    CL30                ADDRESS - LINE 2                             
*                                                                               
PRIPDDX  DS    CL2                 RECORD END                                   
PRIPDDL  EQU   *-PRIPDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - JOB                                                    
***********************************************************************         
         SPACE 1                                                                
PRIJBD   DSECT                     JOB RECORD                                   
PRIJBLEN DS    CL4                 RECORD LENGTH                                
PRIJBTYP DS    CL5                 RECORD TYPE   '06110'                        
         DS    C                                                                
PRIJBACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIJBDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIJBTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIJBAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIJBMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIJBCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIJBPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
PRIJBJOB DS    CL6                 JOB                                          
         DS    C                                                                
PRIJBCP1 DS    CL25                CAPTION1                                     
         DS    C                                                                
PRIJBCP2 DS    CL25                CAPTION2                                     
         DS    C                                                                
PRIJBCPN DS    CL17                COPY NUMBER                                  
         DS    C                                                                
PRIJBSPC DS    CL20                SPACE DESCRIPTION                            
         DS    C                                                                
PRIJBCOD DS    CL3                 PREMIUM CODE                                 
         DS    C                                                                
PRIJBSTR DS    CL8                 START DATE                                   
         DS    C                                                                
PRIJBEND DS    CL8                 END   DATE                                   
         DS    C                                                                
PRIJBFLT DS    CL6                 FILTER                                       
         DS    C                                                                
PRIJBAID DS    CL12                ADID                                         
*                                                                               
PRIJBDX  DS    CL2                 RECORD END                                   
PRIJBDL  EQU   *-PRIJBD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - ESTIMATE RECORD                                        
***********************************************************************         
         SPACE 1                                                                
PRIESD   DSECT                     ESTIMATE RECORD                              
PRIESLEN DS    CL4                 RECORD LENGTH                                
PRIESTYP DS    CL5                 RECORD TYPE  '06104'                         
         DS    C                                                                
PRIESACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIESDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIESTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIESAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIESMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIESCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIESPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
PRIESEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
PRIESNM1 DS    CL20                NAME1                                        
         DS    C                                                                
PRIESNM2 DS    CL20                NAME2                                        
         DS    C                                                                
PRIESSRT DS    CL8                 START DATE                                   
         DS    C                                                                
PRIESEND DS    CL8                 END DATE                                     
         DS    C                                                                
PRIESREV DS    CL3                 REVISION                                     
         DS    C                                                                
PRIESIST DS    CL1                 IS TEST    (N=LIVE,Y=TEST,S=STEW)            
         DS    C                                                                
PRIESUV1 DS    CL32                USER1 VALUE                                  
         DS    C                                                                
PRIESUV2 DS    CL16                USER2 VALUE                                  
         DS    C                                                                
PRIESFLT DS    CL3                 FILTERS                                      
         DS    C                                                                
PRIESAZD DS    CL8                 PLANNED COST ACTUALIZATION DT (OPT)          
         DS    C                                                                
PRIESBFM DS    CL18                BILL FORMULA                                 
         DS    C                                                                
PRIEBDCO DS    CL1                 BILLABLE DATE CALCULATION OVERRIDE           
         DS    C                                                                
PRIEBDBD DS    CL1                 BILL DATE/BASE DATE                          
         DS    C                                                                
PRIEBDDA DS    CL1                 BILL DATE/DATE ADJUSTMENT                    
         DS    C                                                                
PRIENNAD DS    CL1                 NON NEWSPAPER ADJUSTMENT                     
         DS    C                                                                
PRIEZZZX DS    CL47                ALLOCATION EXTENSION                         
         DS    C                                                                
PRIECOS2 DS    CL10                COS2 OPTION                                  
*                                                                               
PRIESDX  DS    CL2                 RECORD END                                   
PRIESDL  EQU   *-PRIESD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PUB RECORD                                             
***********************************************************************         
         SPACE 1                                                                
PRIPBD   DSECT                     PUB RECORD                                   
PRIPBLEN DS    CL4                 RECORD LENGTH                                
PRIPBTYP DS    CL5                 RECORD TYPE '06105'                          
         DS    C                                                                
PRIPBACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIPBDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIPBTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIPBAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIPBMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIPBPUN DS    CL8                 PUB NUMBER                                   
         DS    C                                                                
PRIPBPUZ DS    CL2                 PUB ZONE                                     
         DS    C                                                                
PRIPBPUE DS    CL3                 PUB EDITION                                  
         DS    C                                                                
PRIPBPUD DS    CL20                PUB DISPLAY                                  
         DS    C                                                                
PRIPBNME DS    CL20                NAME                                         
         DS    C                                                                
PRIPBZNM DS    CL20                ZONE NAME                                    
         DS    C                                                                
PRIPBCTY DS    CL16                CARRY TO ALLOW FLOATING CITY,                
*                                  STATE IN FRONT OF NAMES                      
         DS    C                                                                
PRIPBSTT DS    CL2                 STATE                                        
         DS    C                                                                
PRIPBPSH DS    CL4                 FOREIGN KEY TO REP TABLE-PUBLISHER           
*                                  VIEW ON REP TABLE                            
         DS    C                                                                
PRIPBLNG DS    CL1                 LANGUAGE                                     
         DS    C                                                                
PRIPBFRE DS    CL2                 FREQUENCY                                    
         DS    C                                                                
PRIPBCED DS    CL8                 CIRCULATION EFF DATE (OPTIONAL)              
         DS    C                                                                
PRIPBSOU DS    CL4                 SOURCE                                       
         DS    C                                                                
PRIPBCIR DS    CL10                CIRCULATION                                  
         DS    C                                                                
PRIPBAD1 DS    CL30                ADDRESS                                      
         DS    C                                                                
PRIPBAD2 DS    CL30                ADDR LINE 2                                  
         DS    C                                                                
PRIPBZIP DS    CL10                ZIP                                          
         DS    C                                                                
PRIPBKDT DS    CL8                 KILL DATE  (OPTIONAL)                        
         DS    C                                                                
PRIPBLOK DS    CL1                 PUB LOCKED?  Y=YES,N=NO                      
         DS    C                                                                
PRIPBZLK DS    CL1                 PUB ZONE LOCKED?  Y=YES,N=NO                 
         DS    C                                                                
PRIPBPRP DS    CL4                 PUB PAYING REP                               
         DS    C                                                                
PRIPBNSC DS    CL2                 NUMERIC STATE CODE                           
*                                                                               
PRIPBDX  DS    CL2                 RECORD END                                   
PRIPBDL  EQU   *-PRIPBD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - CONTRACT RECORD                                        
***********************************************************************         
         SPACE 1                                                                
PRICTD   DSECT                     CONTRACT RECORD                              
PRICTLEN DS    CL4                 RECORD LENGTH                                
PRICTTYP DS    CL5                 RECORD TYPE '06106'                          
         DS    C                                                                
PRICTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRICTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRICTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRICTAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRICTMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRICTCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRICTPRD DS    CL3                 PRODUCT  COULD BE NULL                       
         DS    C                                                                
PRICTPUN DS    CL8                 PUB NUMBER                                   
         DS    C                                                                
PRICTPUZ DS    CL2                 PUB ZONE                                     
         DS    C                                                                
PRICTPUE DS    CL3                 PUB EDITION                                  
         DS    C                                                                
PRICTCRT DS    CL3                 CONTRACT                                     
         DS    C                                                                
PRICTSRT DS    CL8                 START DATE                                   
         DS    C                                                                
PRICTEND DS    CL8                 END DATE                                     
         DS    C                                                                
PRICTREV DS    CL8                 REVISION DATE                                
         DS    C                                                                
PRICTTPE DS    CL1                 TYPE                                         
         DS    C                                                                
PRICTLDS DS    CL8                 LEVEL DESCRIPTION                            
*                                                                               
PRICTDX  DS    CL2                 RECORD END                                   
PRICTDL  EQU   *-PRICTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - REP RECORD                                             
***********************************************************************         
         SPACE 1                                                                
PRIRPD   DSECT                     REP RECORD                                   
PRIRPLEN DS    CL4                 RECORD LENGTH                                
PRIRPTYP DS    CL5                 RECORD TYPE '06107'                          
         DS    C                                                                
PRIRPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIRPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIRPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIRPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIRPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIRPREP DS    CL4                 REP                                          
         DS    C                                                                
PRIRPNME DS    CL30                NAME                                         
         DS    C                                                                
PRIRPISP DS    CL1               Y/N DEFINE PUBLISHER VIEW WHERE ISP=Y          
         DS    C                                                                
PRIRPAD1 DS    CL30                ADDRESS LINE 1                               
         DS    C                                                                
PRIRPAD2 DS    CL30                ADDRESS LINE 2                               
         DS    C                                                                
PRIRPATT DS    CL20                ATTENTION                                    
         DS    C                                                                
PRIRPTEL DS    CL12                TELEPHONE NUMBER                             
         DS    C                                                                
PRIRPFAX DS    CL12                FAX NUMBER                                   
         DS    C                                                                
PRIRPSTA DS    CL2                 FOREIGN STATE CODE - 90 IF CANADA            
*                                    ELSE BLANK                                 
PRIRPDX  DS    CL2                 RECORD END                                   
PRIRPDL  EQU   *-PRIRPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY RECORD                                             
***********************************************************************         
         SPACE 1                                                                
PRIBYD   DSECT                     GROUP/SUBGRP INFORMATION RECORD              
PRIBYLEN DS    CL4                 RECORD LENGTH                                
PRIBYTYP DS    CL5                 RECORD TYPE '06108'                          
         DS    C                                                                
PRIBYACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBYDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBYTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBYAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBYMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBYCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBYPRD DS    CL3                 ZZZ=POOL BUY ELSE BRAND BUY                  
*                                  (DEFINE POOL,BRAND BUY VIEW?)                
         DS    C                                                                
PRIBYPUN DS    CL8                 JOIN TO PUB FOR FULL DISPLAY                 
         DS    C                                                                
PRIBYPUZ DS    CL2                 PUB ZONE                                     
         DS    C                                                                
PRIBYPUE DS    CL3                 PUB EDITION                                  
         DS    C                                                                
PRIBYIND DS    CL8                 INSERTON DATE                                
         DS    C                                                                
PRIBYEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
PRIBYLIN DS    CL3                 LINE NUMBER                                  
         DS    C                                                                
PRIBYISD DS    CL1                 IS DELETED Y/N                               
         DS    C                                                                
PRIBYIST DS    CL1                 IS TESTED Y/N                                
         DS    C                                                                
PRIBYSER DS    CL9                 PLACEHOLDER FOR NEW BUY SERIAL #             
         DS    C                                                                
PRIBYSPD DS    CL20                DISPLAY FORMSPACE DESCRIPTION                
         DS    C                                                                
PRIBYLAS DS    CL17                LAST INSERTION NUMBER - DISPLAY FORM         
         DS    C                                                                
PRIBYCP1 DS    CL25                CAPTION1 OVERRIDE OPTIONAL                   
         DS    C                                                                
PRIBYCP2 DS    CL25                CAPTION2 OVERRIDE OPTIONAL                   
         DS    C                                                                
PRIBYCOP DS    CL17                AD COPY OVERRIDE OPTIONAL                    
         DS    C                                                                
PRIBYRED DS    CL5                 REGULAR DISPLAYS OUTDOOR                     
         DS    C                                                                
PRIBYILL DS    CL5                 ILLUMINATED DISPLAYS OUTDOOR                 
         DS    C                                                                
PRIBYLNN DS    CL5                 LINES NEWSPAPERS-EQUIVALENCE FACTOR          
*                                  0F 14 - VIEW COLUMNS                         
         DS    C                                                                
PRIBYCIN DS    CL7                 COLUMN INCHES                                
         DS    C                                                                
PRIBYCOL DS    CL3                 COLORS                                       
         DS    C                                                                
PRIBYPRC DS    CL9                 COLOR PREMIUM CHARGE                         
         DS    C                                                                
PRIBYPLC DS    CL10                PLANNED COST                                 
         DS    C                                                                
PRIBYCUN DS    CL8                 CONTRACT UNITS                               
         DS    C                                                                
PRIBYJOB DS    CL6                 FOREIGN KEY TO JOB VIA JOB CODE              
         DS    C                                                                
PRIBYCLD DS    CL8                 CLOSEING DATE    OPTIONAL                    
         DS    C                                                                
PRIBYOSD DS    CL8                 ON SALE DATE     OPTIONAL                    
         DS    C                                                                
PRIBYPAD DS    CL8                 PAYABLE DATE     REQUIRED                    
         DS    C                                                                
PRIBYBLD DS    CL8                 BILLING DATE     REQUIRED                    
         DS    C                                                                
PRIBYMCL DS    CL8                 MATERIAL CLOSING                             
         DS    C                                                                
PRIBYTPG DS    CL10                TEARSHEET PAGE                               
         DS    C                                                                
PRIBYEXT DS    CL8                 MATERIALS EXTENSION DATE                     
         DS    C                                                                
PRIBYSP2 DS    CL20                SPACE DISCRIPTION 2                          
         DS    C                                                                
PRIBYSPR DS    CL1                 SPACE RESERVATION  Y/N                       
         DS    C                                                                
PRIBYREF DS    CL10                REFERENCE NUMBER                             
         DS    C                                                                
PRIBYAID DS    CL12                FOREIGN KEY TO JOB VIA ADID                  
         DS    C                                                                
PRIBYDEC DS    CL10                DAILY EFFECTIVE CIRCULATION                  
         DS    C                                                                
PRIBYSHO DS    CL5                 OUTDOOR SHOWING                              
         DS    C                                                                
PRIBYUID DS    CL8                 UPLOAD ID (UPID)                             
         DS    C                                                                
PRIBYORG DS    CL20                INSERTION ORIGIN (IDESK,PBU,ETC.)            
         DS    C                                                                
PRIBYETP DS    CL1                 ENTRY TYPE - N=NET INPUT IN BUY PGM          
         DS    C                                                                
PRIBYRTP DS    CL1                 RATE TYPE - C, S OR BLANK                    
         DS    C                                                                
PRIBYREP DS    CL4                 SPECIAL REP CODE                             
         DS    C                                                                
PRIBYCLR DS    CL4                 "PAY" REP CODE (CLEARANCE PAYEE)             
         DS    C                                                                
PRIBCRDT DS    CL8                 BUY CREATION DATE                            
         DS    C                                                                
PRIBFXC  DS    CL2                 FXCODE                                       
         DS    C                                                                
PRIBFXR  DS    CL11                FXRATE                                       
         DS    C                                                                
PRIBCHDT DS    CL8                 BUY LAST CHANGE DATE                         
         DS    C                                                                
PRIBCHPD DS    CL8                 BUY LAST CHANGE PID                          
         DS    C                                                                
PRIBMSTA DS    C                   MATCH STATUS                                 
*                                                                               
PRIBYDX  DS    CL2                 RECORD END                                   
PRIBYDL  EQU   *-PRIBYD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY SUMMARY RECORD                                     
***********************************************************************         
         SPACE 1                                                                
PRIBSD   DSECT                     BUY SUMMARY RECORD                           
PRIBSLEN DS    CL4                 RECORD LENGTH                                
PRIBSTYP DS    CL5                 RECORD TYPE '06109'                          
         DS    C                                                                
PRIBSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBSAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBSMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBSCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBSSER DS    CL9                 PLACEHOLDER FOR NEW BUY SERIAL #             
         DS    C                                                                
PRIBSBLT DS    CL1                 Y/N DESIGN ISSUE - TABLE STRUCTURE           
*                                  FOR BUY LINE TOTAL PLUS                      
         DS    C                                                                
PRIBSPRD DS    CL3                 BRAND DETAIL                                 
         DS    C                                                                
PRIBSGRS DS    CL11                ORDER GROSS                                  
         DS    C                                                                
PRIBSCOM DS    CL11                COMMISSION                                   
         DS    C                                                                
PRIBSCDS DS    CL11                CASH DISCOUNT                                
         DS    C                                                                
PRIBSPGR DS    CL11                PAID GROSS                                   
         DS    C                                                                
PRIBSPCM DS    CL11                PAID COMMISSION                              
         DS    C                                                                
PRIBSPCD DS    CL11                PAID CASH DISCOUNT                           
         DS    C                                                                
PRIBSBGR DS    CL11                BILLED GROSS                                 
         DS    C                                                                
PRIBSBCM DS    CL11                BILLED COMMISSION                            
         DS    C                                                                
PRIBSBCD DS    CL11                BILLED CASH DISCOUNT                         
         DS    C                                                                
PRIBSTAX DS    CL11                STATE SALES TAXES                            
         DS    C                                                                
PRIBSGST DS    CL11                ORDERED GST                                  
         DS    C                                                                
PRIBSPGS DS    CL11                PAID GST                                     
         DS    C                                                                
PRIBSBGS DS    CL11                BILLED GST                                   
         DS    C                                                                
PRIBSPST DS    CL11                PST        ORDERED PROVINCIAL TAXES          
         DS    C                                                                
PRIBSPPS DS    CL11                PAID PST   PAID PROVINICIAL TAX              
         DS    C                                                                
PRIBSBPS DS    CL11                BILLED PST BILLED PROVINICIAL TAX            
         DS    C                                                                
PRISSGRS DS    CL11                ORDER GROSS                                  
         DS    C                                                                
PRISSCOM DS    CL11                COMMISSION                                   
         DS    C                                                                
PRISSCDS DS    CL11                CASH DISCOUNT                                
         DS    C                                                                
PRISSPGR DS    CL11                PAID GROSS                                   
         DS    C                                                                
PRISSPCM DS    CL11                PAID COMMISSION                              
         DS    C                                                                
PRISSPCD DS    CL11                PAID CASH DISCOUNT                           
         DS    C                                                                
PRISSBGR DS    CL11                BILLED GROSS                                 
         DS    C                                                                
PRISSBCM DS    CL11                BILLED COMMISSION                            
         DS    C                                                                
PRISSBCD DS    CL11                BILLED CASH DISCOUNT                         
         DS    C                                                                
PRISSTAX DS    CL11                STATE SALES TAXES                            
         DS    C                                                                
PRISSGST DS    CL11                ORDERED GST                                  
         DS    C                                                                
PRISSPGS DS    CL11                PAID GST                                     
         DS    C                                                                
PRISSBGS DS    CL11                BILLED GST                                   
         DS    C                                                                
PRISSPST DS    CL11                PST        ORDERED PROVINCIAL TAXES          
         DS    C                                                                
PRISSPPS DS    CL11                PAID PST   PAID PROVINICIAL TAX              
         DS    C                                                                
PRISSBPS DS    CL11                BILLED PST BILLED PROVINICIAL TAX            
         DS    C                                                                
PRIBSC2D DS    CL11         COS2 DOLLARS (GROSS)                                
         DS    C                                                                
PRISSC2D DS    CL11         COS2 DOLLARS (GROSS) (SPECIAL CHARGES)              
         DS    C                                                                
PRIPCGRS DS    CL11                PLANNED COST GROSS                           
         DS    C                                                                
PRIPCCOM DS    CL11                PLANNED COST COMMISSION                      
*****    DS    C                                                                
*****PRIPCBGR DS    CL11                PLANNED COST BILLED GROSS               
*****    DS    C                                                                
*****PRIPCBCM DS    CL11                PLANNED COST BILLED COMMISSION          
*****    DS    C                                                                
*****PRIPCTAX DS    CL11                PLANNED COST SALES TAX                  
*****    DS    C                                                                
*****PRIPCGST DS    CL11                PLANNED COST GST                        
*****    DS    C                                                                
*****PRIPCBGS DS    CL11                PLANNED COST BILLED GST                 
*****    DS    C                                                                
*****PRIPCPST DS    CL11                PLANNED COST PST                        
*****    DS    C                                                                
*****PRIPCBPS DS    CL11                PLANNED COST BILLED PST                 
         DS    C                                                                
PRIBSFXO DS    CL11                FX ORDERED DOLLARS                           
         DS    C                                                                
PRIBSFXP DS    CL11                FX PAID DOLLARS                              
         DS    C                                                                
PRIBSFXA DS    CL11                FX PAYABLE DOLLARS                           
         DS    C                                                                
PRIBBC2G DS    CL11                BILLED COST 2 GROSS                          
         DS    C                                                                
PRIBBC2N DS    CL11                BILLED COST 2 NET                            
         DS    C                                                                
PRIBBFXG DS    CL11                BILLED FX GROSS                              
         DS    C                                                                
PRIBBFXN DS    CL11                BILLED FX NET                                
*                                                                               
PRIBSDX  DS    CL2                 RECORD END                                   
PRIBSDL  EQU   *-PRIBSD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY ADDITIONAL CHARGES RECORD                          
***********************************************************************         
         SPACE 1                                                                
PRIBAD   DSECT                     BUY ADDITIONAL CHARGES RECORD                
PRIBALEN DS    CL4                 RECORD LENGTH                                
PRIBATYP DS    CL5                 RECORD TYPE '06126'                          
         DS    C                                                                
PRIBAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBAAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBAMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBACNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBASER DS    CL9                 PLACEHOLDER FOR NEW BUY SERIAL #             
         DS    C                                                                
PRIBABLT DS    CL1                 Y/N DESIGN ISSUE - TABLE STRUCTURE           
*                                  FOR BUY LINE TOTAL PLUS                      
         DS    C                                                                
PRIBAPRD DS    CL3                 BRAND DETAIL                                 
         DS    C                                                                
PRIBACHG DS    CL2                 ADDITIONAL CHARGE CODE - FOREIGN KEY         
*                                   TO ADD'L CHG REC (WITH AGY AND MED)         
         DS    C                                                                
PRIBAGRS DS    CL11                ORDER GROSS                                  
         DS    C                                                                
PRIBACOM DS    CL11                COMMISSION                                   
         DS    C                                                                
PRIBACDS DS    CL11                CASH DISCOUNT                                
         DS    C                                                                
PRIBAPGR DS    CL11                PAID GROSS                                   
         DS    C                                                                
PRIBAPCM DS    CL11                PAID COMMISSION                              
         DS    C                                                                
PRIBAPCD DS    CL11                PAID CASH DISCOUNT                           
         DS    C                                                                
PRIBABGR DS    CL11                BILLED GROSS                                 
         DS    C                                                                
PRIBABCM DS    CL11                BILLED COMMISSION                            
         DS    C                                                                
PRIBABCD DS    CL11                BILLED CASH DISCOUNT                         
         DS    C                                                                
PRIBATAX DS    CL11                STATE SALES TAXES                            
         DS    C                                                                
PRIBAGST DS    CL11                ORDERED GST                                  
         DS    C                                                                
PRIBAPGS DS    CL11                PAID GST                                     
         DS    C                                                                
PRIBABGS DS    CL11                BILLED GST                                   
         DS    C                                                                
PRIBAPST DS    CL11                PST        ORDERED PROVINCIAL TAXES          
         DS    C                                                                
PRIBAPPS DS    CL11                PAID PST   PAID PROVINICIAL TAX              
         DS    C                                                                
PRIBABPS DS    CL11                BILLED PST BILLED PROVINICIAL TAX            
         DS    C                                                                
PRIBAC2D DS    CL11                COS2 DOLLARS GROSS                           
*                                                                               
PRIBADX  DS    CL2                 RECORD END                                   
PRIBADL  EQU   *-PRIBAD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY COMMENT RECORD                                     
***********************************************************************         
         SPACE 1                                                                
PRIBCD   DSECT                     BUY COMMENT RECORD                           
PRIBCLEN DS    CL4                 RECORD LENGTH                                
PRIBCTYP DS    CL5                 RECORD TYPE '06111'                          
         DS    C                                                                
PRIBCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBCMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBCCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBCSER DS    CL9                 PLACEHOLDER FOR NEW BUY SERIAL #             
         DS    C                                                                
PRIBCTPE DS    CL1                 I=INSERTION,P=POSITIONAL,C=COMMENT           
*                                  T=TEARSHEET                                  
         DS    C                                                                
PRIBCCML DS    XL2                                                              
PRIBCCOM DS    CL255                                                            
*                                                                               
PRIBCDX  DS    CL2                 RECORD END                                   
PRIBCDL  EQU   *-PRIBCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY CUSTOM COLUMN RECORD                     *         
***********************************************************************         
         SPACE 1                                                                
PRICBD   DSECT                     BUY CUSTOM COLUMN RECORD                     
PRICBLEN DS    CL4                 RECORD LENGTH                                
PRICBTYP DS    CL5                 RECORD TYPE     '06116'                      
         DS    C                                                                
PRICBACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRICBDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRICBTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRICBAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRICBMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRICBCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRICBSER DS    CL9                 BUY SERIAL NUMBER                            
         DS    C                                                                
PRICBSEQ DS    CL5                 AGENCY UNIQUE SEQUENCE NUMBER                
         DS    C                                                                
PRICBDTL DS    XL2                 PRICBDTA LENGTH                              
PRICBDTA DS    CL60                COLUMN DATA  (VARCHAR)                       
*                                                                               
PRICBDX  DS    CL2                 RECORD END                                   
PRICBDL  EQU   *-PRICBD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PUB GROUP DEFINITION RECORD                  *         
***********************************************************************         
         SPACE 1                                                                
PRIPFD   DSECT                     PUB GROUP DEFINITION RECORD                  
PRIPFLEN DS    CL4                 RECORD LENGTH                                
PRIPFTYP DS    CL5                 RECORD TYPE     '06112'                      
         DS    C                                                                
PRIPFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIPFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIPFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIPFAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIPFMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIPFID  DS    CL2                 TWO BYTE CODE - ALLOWS FOR EXPANSION         
         DS    C                                                                
PRIPFB1N DS    CL12                BREAK 1 TITLE - E.G. PUBLISHER               
         DS    C                                                                
PRIPFB1L DS    CL5                 BREAK 1 CODE LENGTH                          
         DS    C                                                                
PRIPFB2N DS    CL12                BREAK 2 TITLE - E.G. REGION                  
         DS    C                                                                
PRIPFB2L DS    CL5                 BREAK 2 CODE LENGTH                          
*                                                                               
PRIPFDX  DS    CL2                 RECORD END                                   
PRIPFDL  EQU   *-PRIPFD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PUB GROUP RECORD                             *         
***********************************************************************         
         SPACE 1                                                                
PRIPGRD  DSECT                     PUB GROUP RECORD                             
PRIPGLEN DS    CL4                 RECORD LENGTH                                
PRIPGTYP DS    CL5                 RECORD TYPE     '06113'                      
         DS    C                                                                
PRIPGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIPGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIPGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIPGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIPGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIPGID  DS    CL2          2 BYTE ID CODE - ALLOWS FOR EXPANSION               
         DS    C                                                                
PRIPGGRP DS    CL4          CONCATENATION OF BREAK1 AND 2 CODES                 
         DS    C                                                                
PRIPGPGP DS    CL6          CONCATENATION OF ID & BREAK1 AND 2 CODES            
         DS    C                                                                
PRIPGB1C DS    CL4                 BREAK1 CODE                                  
         DS    C                                                                
PRIPGB2C DS    CL4                 BREAK2 CODE                                  
         DS    C                                                                
PRIPGB1N DS    CL24                BREAK1 NAME                                  
         DS    C                                                                
PRIPGB2N DS    CL24                BREAK2 NAME                                  
*                                                                               
PRIPGDX  DS    CL2                 RECORD END                                   
PRIPGDL  EQU   *-PRIPGRD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PUB GROUP PUB RECORD                         *         
***********************************************************************         
         SPACE 1                                                                
PRIPPD   DSECT                     PUB GROUP PUB RECORD                         
PRIPPLEN DS    CL4                 RECORD LENGTH                                
PRIPPTYP DS    CL5                 RECORD TYPE     '06114'                      
         DS    C                                                                
PRIPPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIPPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIPPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIPPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIPPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIPPPGP DS    CL6          CONCATENATION OF ID & BREAK1 AND 2 CODES            
         DS    C                                                                
PRIPPNUM DS    CL8                 PUB NUMBER                                   
         DS    C                                                                
PRIPPZON DS    CL2                 PUB ZONE                                     
         DS    C                                                                
PRIPPED  DS    CL3                 PUB EDITION                                  
*                                                                               
PRIPPDX  DS    CL2                 RECORD END                                   
PRIPPDL  EQU   *-PRIPPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - CUSTOM COLUMN RECORD                         *         
***********************************************************************         
         SPACE 1                                                                
PRICCD   DSECT                     CUSTOM COLUMN RECORD                         
PRICCLEN DS    CL4                 RECORD LENGTH                                
PRICCTYP DS    CL5                 RECORD TYPE     '06115'                      
         DS    C                                                                
PRICCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRICCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRICCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRICCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRICCCOL DS    CL12                AGENCY UNIQUE COLUMN NAME                    
         DS    C                                                                
PRICCSEQ DS    CL5                 AGENCY UNIQUE SEQUENCE NUMBER                
         DS    C                                                                
PRICCDES DS    CL25                COLUMN DESCRIPTION                           
         DS    C                                                                
PRICCHD1 DS    CL12                COLUMN HEADER 1                              
         DS    C                                                                
PRICCHD2 DS    CL12                COLUMN HEADER 2                              
         DS    C                                                                
PRICCDEF DS    CL5                 COLUMN TYPE                                  
*                                   1=TEXT, 2=NUMERIC, 3=DOLLARS                
*                                   4=DATE, 5=DATE RANGE, 6=PERCENT             
PRICCDX  DS    CL2                 RECORD END                                   
PRICCDL  EQU   *-PRICCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - CLIENT GROUP DEFINITION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
PRICDD   DSECT                     CLIENT GROUP DEFINITION RECORD               
PRICDLEN DS    CL4                 RECORD LENGTH                                
PRICDTYP DS    CL5                 RECORD TYPE     '06117'                      
         DS    C                                                                
PRICDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRICDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRICDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRICDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRICDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRICDID  DS    CL2                 TWO BYTE CODE - ALLOWS FOR EXPANSION         
         DS    C                                                                
PRICDB1N DS    CL12                BREAK 1 TITLE                                
         DS    C                                                                
PRICDB1L DS    CL5                 BREAK 1 CODE LENGTH                          
         DS    C                                                                
PRICDB2N DS    CL12                BREAK 2 TITLE                                
         DS    C                                                                
PRICDB2L DS    CL5                 BREAK 2 CODE LENGTH                          
*                                                                               
PRICDDX  DS    CL2                 RECORD END                                   
PRICDDL  EQU   *-PRICDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - CLIENT GROUP RECORD                          *         
***********************************************************************         
         SPACE 1                                                                
PRICGRD  DSECT                     CLIENT GROUP RECORD                          
PRICGLEN DS    CL4                 RECORD LENGTH                                
PRICGTYP DS    CL5                 RECORD TYPE     '06118'                      
         DS    C                                                                
PRICGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRICGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRICGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRICGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRICGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRICGID  DS    CL2          2 BYTE ID CODE - ALLOWS FOR EXPANSION               
         DS    C                                                                
PRICGGRP DS    CL4          CONCATENATION OF BREAK1 AND 2 CODES                 
         DS    C                                                                
PRICGPGP DS    CL6          CONCATENATION OF ID & BREAK1 AND 2 CODES            
         DS    C                                                                
PRICGB1C DS    CL4                 BREAK1 CODE                                  
         DS    C                                                                
PRICGB2C DS    CL4                 BREAK2 CODE                                  
         DS    C                                                                
PRICGB1N DS    CL24                BREAK1 NAME                                  
         DS    C                                                                
PRICGB2N DS    CL24                BREAK2 NAME                                  
*                                                                               
PRICGDX  DS    CL2                 RECORD END                                   
PRICGDL  EQU   *-PRICGRD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - CLIENT GROUP CLIENT RECORD                   *         
***********************************************************************         
         SPACE 1                                                                
PRICLD   DSECT                     CLIENT GROUP CLIENT RECORD                   
PRICLLEN DS    CL4                 RECORD LENGTH                                
PRICLTYP DS    CL5                 RECORD TYPE     '06119'                      
         DS    C                                                                
PRICLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRICLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRICLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRICLAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRICLMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRICLPGP DS    CL6          CONCATENATION OF ID & BREAK1 AND 2 CODES            
         DS    C                                                                
PRICLCLT DS    CL3                 CLIENT CODE                                  
*                                                                               
PRICLDX  DS    CL2                 RECORD END                                   
PRICLDL  EQU   *-PRICLD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PRODUCT GROUP DEFINITION RECORD              *         
***********************************************************************         
         SPACE 1                                                                
PRIGDRD  DSECT                     PRODUCT GROUP DEFINITION RECORD              
PRIGDLEN DS    CL4                 RECORD LENGTH                                
PRIGDTYP DS    CL5                 RECORD TYPE     '06120'                      
         DS    C                                                                
PRIGDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIGDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIGDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIGDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIGDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIGDCLT DS    CL3                 CLIENT CODE                                  
         DS    C                                                                
PRIGDID  DS    CL2                 TWO BYTE CODE - ALLOWS FOR EXPANSION         
         DS    C                                                                
PRIGDB1N DS    CL12                BREAK 1 TITLE                                
         DS    C                                                                
PRIGDB1L DS    CL5                 BREAK 1 CODE LENGTH                          
         DS    C                                                                
PRIGDB2N DS    CL12                BREAK 2 TITLE                                
         DS    C                                                                
PRIGDB2L DS    CL5                 BREAK 2 CODE LENGTH                          
*                                                                               
PRIGDDX  DS    CL2                 RECORD END                                   
PRIGDDL  EQU   *-PRIGDRD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PRODUCT GROUP RECORD                         *         
***********************************************************************         
         SPACE 1                                                                
PRIGGRD  DSECT                     PRODUCT GROUP RECORD                         
PRIGGLEN DS    CL4                 RECORD LENGTH                                
PRIGGTYP DS    CL5                 RECORD TYPE     '06121'                      
         DS    C                                                                
PRIGGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIGGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIGGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIGGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIGGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIGGCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIGGID  DS    CL2          2 BYTE ID CODE - ALLOWS FOR EXPANSION               
         DS    C                                                                
PRIGGGRP DS    CL4          CONCATENATION OF BREAK1 AND 2 CODES                 
         DS    C                                                                
PRIGGPGP DS    CL6          CONCATENATION OF ID & BREAK1 AND 2 CODES            
         DS    C                                                                
PRIGGB1C DS    CL4                 BREAK1 CODE                                  
         DS    C                                                                
PRIGGB2C DS    CL4                 BREAK2 CODE                                  
         DS    C                                                                
PRIGGB1N DS    CL24                BREAK1 NAME                                  
         DS    C                                                                
PRIGGB2N DS    CL24                BREAK2 NAME                                  
*                                                                               
PRIGGDX  DS    CL2                 RECORD END                                   
PRIGGDL  EQU   *-PRIGGRD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PRODUCT GROUP PRODUCT RECORD                 *         
***********************************************************************         
         SPACE 1                                                                
PRIGPRD  DSECT                     PRODUCT GROUP PRODUCT RECORD                 
PRIGPLEN DS    CL4                 RECORD LENGTH                                
PRIGPTYP DS    CL5                 RECORD TYPE     '06122'                      
         DS    C                                                                
PRIGPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIGPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIGPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIGPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIGPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIGPCLT DS    CL3                 CLIENT CODE                                  
         DS    C                                                                
PRIGPPGP DS    CL6          CONCATENATION OF ID & BREAK1 AND 2 CODES            
         DS    C                                                                
PRIGPPRD DS    CL3                 PRODUCT CODE                                 
*                                                                               
PRIGPDX  DS    CL2                 RECORD END                                   
PRIGPDL  EQU   *-PRIGPRD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - REGION RECORD                                *         
***********************************************************************         
         SPACE 1                                                                
PRIRGD   DSECT                     REGION RECORD                                
PRIRGLEN DS    CL4                 RECORD LENGTH                                
PRIRGTYP DS    CL5                 RECORD TYPE   '06123'                        
         DS    C                                                                
PRIRGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIRGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIRGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIRGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIRGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIRGCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIRGDIV DS    CL3                 DIVISION                                     
         DS    C                                                                
PRIRGREG DS    CL3                 REGION                                       
         DS    C                                                                
PRIRGNME DS    CL20                NAME                                         
*                                                                               
PRIRGDX  DS    CL2                 RECORD END                                   
PRIRGDL  EQU   *-PRIRGD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - DISTRICT RECORD                              *         
***********************************************************************         
         SPACE 1                                                                
PRIDSD   DSECT                     DISTRICT RECORD                              
PRIDSLEN DS    CL4                 RECORD LENGTH                                
PRIDSTYP DS    CL5                 RECORD TYPE   '06124'                        
         DS    C                                                                
PRIDSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIDSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIDSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIDSAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIDSMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIDSCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIDSDIV DS    CL3                 DIVISION                                     
         DS    C                                                                
PRIDSREG DS    CL3                 REGION                                       
         DS    C                                                                
PRIDSDST DS    CL3                 DISTRICT                                     
         DS    C                                                                
PRIDSNME DS    CL20                NAME                                         
*                                                                               
PRIDSDX  DS    CL2                 RECORD END                                   
PRIDSDL  EQU   *-PRIDSD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - PUB DISTRICT ASSIGNMENTS RECORD              *         
***********************************************************************         
         SPACE 1                                                                
PRIDPD   DSECT                     PUB DISTRICT ASSIGNMENTS RECORD              
PRIDPLEN DS    CL4                 RECORD LENGTH                                
PRIDPTYP DS    CL5                 RECORD TYPE   '06125'                        
         DS    C                                                                
PRIDPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIDPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIDPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIDPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIDPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIDPPUN DS    CL8                 PUB NUMBER                                   
         DS    C                                                                
PRIDPPUZ DS    CL2                 PUB ZONE                                     
         DS    C                                                                
PRIDPPUE DS    CL3                 PUB EDITION                                  
         DS    C                                                                
PRIDPCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIDPDIV DS    CL3                 DIVISION                                     
         DS    C                                                                
PRIDPREG DS    CL3                 REGION                                       
         DS    C                                                                
PRIDPDST DS    CL3                 DISTRICT                                     
         DS    C                                                                
PRIDPSHR DS    CL5                 SHARE PERCENT - 2 DECIMALS (NN.NN)           
*                                                                               
PRIDPDX  DS    CL2                 RECORD END                                   
PRIDPDL  EQU   *-PRIDPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - ADDITIONAL CHARGES RECORD                    *         
***********************************************************************         
         SPACE 1                                                                
PRIACD   DSECT                     ADDITIONAL CHARGES RECORD                    
PRIACLEN DS    CL4                 RECORD LENGTH                                
PRIACTYP DS    CL5                 RECORD TYPE     '06127'                      
         DS    C                                                                
PRIACACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIACDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIACTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIACAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIACMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIACCHG DS    CL2                 CHARGE CODE                                  
         DS    C                                                                
PRIACTPE DS    CL1                 TYPE:M=MEDIA & P=PRODUCTION RELATED          
         DS    C                                                                
PRIACDSC DS    CL20                DESCRIPTION                                  
*                                                                               
PRIACDX  DS    CL2                 RECORD END                                   
PRIACDL  EQU   *-PRIACD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* PRINT SYSTEM EXTRACT - UCOMM RECORD                                           
***********************************************************************         
         SPACE 1                                                                
PRIUCD   DSECT                     UCOMM RECORD                                 
PRIUCLEN DS    CL4                 RECORD LENGTH                                
PRIUCTYP DS    CL5                 RECORD TYPE  '06128'                         
         DS    C                                                                
PRIUCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIUCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIUCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIUCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIUCMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIUCCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIUCPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
PRIUCEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
PRIUCDIV DS    CL3                 DIVISION                                     
         DS    C                                                                
PRIUCREG DS    CL3                 REGION                                       
         DS    C                                                                
PRIUCDST DS    CL3                 DISTRICT                                     
         DS    C                                                                
PRIUCSEQ DS    CL1                 SEQNUM ("GENERATED" FROM ELEM CODE)          
         DS    C                                                                
PRIUCNAM DS    CL20                FIELDNAME                                    
         DS    C                                                                
PRIUCTXT DS    CL32                FIELDDATA                                    
         DS    C                                                                
PRIUCLN  DS    CL2                 MAXFIELDDATALENGTH                           
         DS    C                                                                
PRIUCEDT DS    CL1                 EDITTYPE                                     
         DS    C                                                                
PRIUCMBI DS    CL1                 MBI                                          
*                                                                               
PRIUCDX  DS    CL2                 RECORD END                                   
PRIUCDL  EQU   *-PRIUCD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUDGET RECORD                                          
***********************************************************************         
         SPACE 1                                                                
PRIBDD   DSECT                     BUDGET RECORD                                
PRIBDLEN DS    CL4                 RECORD LENGTH                                
PRIBDTYP DS    CL5                 RECORD TYPE  '06129'                         
         DS    C                                                                
PRIBDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBDCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBDPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
PRIBDEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
PRIBDREG DS    CL3                 REGION                                       
         DS    C                                                                
PRIBDDIS DS    CL3                 DISTRICT                                     
         DS    C                                                                
PRIBDMY  DS    CL6                 MONTY/YEAR MMM/YY                            
         DS    C                                                                
PRIBDTP  DS    C                   BUDGET TYPE                                  
         DS    C                                                                
PRIBDAMT DS    CL12                AMOUNT                                       
*                                                                               
PRIBDDX  DS    CL2                 RECORD END                                   
PRIBDDL  EQU   *-PRIBDD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* PRINT SYSTEM EXTRACT - STANDARD COLUMN RECORD                       *         
***********************************************************************         
         SPACE 1                                                                
PRISCD   DSECT                     STANDARD COLUMN RECORD                       
PRISCLEN DS    CL4                 RECORD LENGTH                                
PRISCTYP DS    CL5                 RECORD TYPE     '06130'                      
         DS    C                                                                
PRISCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRISCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRISCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRISCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRISCCOL DS    CL12                UNIQUE COLUMN NAME                           
         DS    C                                                                
PRISCSEQ DS    CL5                 UNIQUE SEQUENCE NUMBER                       
         DS    C                                                                
PRISCDES DS    CL25                COLUMN DESCRIPTION                           
         DS    C                                                                
PRISCHD1 DS    CL12                COLUMN HEADER 1                              
         DS    C                                                                
PRISCHD2 DS    CL12                COLUMN HEADER 2                              
         DS    C                                                                
PRISCDEF DS    CL5                 COLUMN TYPE                                  
*                                   1=TEXT, 2=NUMERIC, 3=DOLLARS                
*                                   4=DATE, 5=DATE RANGE, 6=PERCENT             
PRISCDX  DS    CL2                 RECORD END                                   
PRISCDL  EQU   *-PRISCD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* PRINT SYSTEM EXTRACT - BUY STANDARD COLUMN RECORD                   *         
***********************************************************************         
         SPACE 1                                                                
PRISBD   DSECT                     BUY STANDARD COLUMN RECORD                   
PRISBLEN DS    CL4                 RECORD LENGTH                                
PRISBTYP DS    CL5                 RECORD TYPE     '06131'                      
         DS    C                                                                
PRISBACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRISBDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRISBTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRISBAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRISBMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRISBCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRISBSER DS    CL9                 BUY SERIAL NUMBER                            
         DS    C                                                                
PRISBSEQ DS    CL5                 AGENCY UNIQUE SEQUENCE NUMBER                
         DS    C                                                                
PRISBDTL DS    XL2                 PRISBDTA LENGTH                              
PRISBDTA DS    CL60                COLUMN DATA  (VARCHAR)                       
*                                                                               
PRISBDX  DS    CL2                 RECORD END                                   
PRISBDL  EQU   *-PRISBD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* PRINT SYSTEM EXTRACT - BILL FORMULA RECORD                          *         
***********************************************************************         
         SPACE 1                                                                
PRIBFD   DSECT                     BILL FORMULA RECORD                          
PRIBFLEN DS    CL4                 RECORD LENGTH                                
PRIBFTYP DS    CL5                 RECORD TYPE     '06132'                      
         DS    C                                                                
PRIBFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
PRIBFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
PRIBFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
PRIBFAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
PRIBFMED DS    CL1                 MEDIA                                        
         DS    C                                                                
PRIBFCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
PRIBFPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
PRIBFEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
PRIBFMOS DS    CL10                START MONTH OF SERVICE                       
         DS    C                                                                
PRIBFORM DS    CL29                BILLING FORMULA                              
         DS    C                                                                
PRIBFSAC DS    CL10                SHOW AC AS                                   
         DS    C                                                                
PRIBFPCT DS    CL10                PERCENTAGE OF                                
         DS    C                                                                
*                                                                               
PRIBFDX  DS    CL2                 RECORD END                                   
PRIBFDL  EQU   *-PRIBFD            RECORD LENGTH                                
         EJECT                                                                  
