*          DATA SET PUBCIREL   AT LEVEL 007 AS OF 06/14/83                      
PUBCIREL DS    0C                  ** PRINTPAK CIRCULATION ELEMENT **           
         DS    X'30'     B         ELEMENT CODE                                 
         DS    AL1(50)   B         ELEMENT LENGTH                               
PUBCDAT  DS    CL3       B         CIRC DATE - YMD                              
PUBCIR1  DS    PL5       P         CIRC 1                                       
PUBCIR2  DS    PL5       P         SPARE                                        
PUBCIR3  DS    PL5       P         SPARE                                        
PUBCIR4  DS    PL5       P         SPARE                                        
PUBCIR5  DS    PL5       P         SPARE                                        
PUBCIR6  DS    PL5       P         SPARE                                        
PUBCSRC  DS    CL4       AN        CIRCULATION SOURCE                           
         DS    CL11                SPARE                                        
