*          DATA SET PUBDSTELN  AT LEVEL 006 AS OF 08/03/92                      
PUBDSTEL DS    0C .                ** PRINTPAK - PUBLICATION DISTRICT           
*                                     AND REGION ELEM **                        
         DS    X'71' .   B         ELEMENT CODE                                 
         DS    AL1(18) . B         ELEMENT LENGTH                               
*                                                                               
PUBDCLT  DS    CL3 .     A         CLIENT                                       
PUBDDIV  DS    CL3 .     N         DIVISION                                     
PUBDREG  DS    CL3 .     N         REGION                                       
PUBDDST  DS    CL3 .     N         DISTRICT                                     
PUBDSHR  DS    CL2 .     B         REG/DST SHARE PCT (2 DECIMALS)               
         DS    CL2 .               SPARE                                        
