*          DATA SET PUBDSTEL   AT LEVEL 008 AS OF 06/14/83                      
PUBDSTEL DS    0C                  ** PRINTPAK PUB REG/DIST ELEM **             
         DS    X'71'     B         ELEMENT CODE                                 
         DS    AL1(18)   B         ELEMENT LENGTH                               
*                                                                               
PUBDCLT  DS    CL3       A         CLIENT                                       
PUBDDIV  DS    CL3       N         DIVISION                                     
PUBDREG  DS    CL3       N         REGION                                       
PUBDDST  DS    CL3       N         DISTRICT                                     
PUBDSHR  DS    XL2       B         REG/DST SHARE PCT. - .NN                     
         DS    CL2                 SPARE                                        
