*          DATA SET PUBDSCEL   AT LEVEL 003 AS OF 06/14/83                      
PUBDSCEL DS    0C                  ** PRINTPAK DISCOUNT TABLE ELEM **           
         DS    X'51'     B         ELEMENT CODE                                 
         DS    AL1(14)   B         ELEMENT LENGTH                               
PUBDSCLV DS    CL5       P         DISCOUNT LEVEL                               
PUBDSCRT DS    CL5       P         DISCOUNT RATE - .NNNNN                       
         DS    CL2                 SPARE                                        
