*          DATA SET PUBGRPEL   AT LEVEL 001 AS OF 02/25/75                      
PUBGRPEL DS    0C .                **PRINTPAK PUB GROUP ELEM**                  
         DS    X'70' .             ELEMENT CODE                                 
         DS    AL1(09) .           ELEMENT LENGTH                               
PUBGMEMB DS    0CL6 .                                                           
PUBGPUB  DS    CL4 .     PWOS      PUB                                          
PUBGZON  DS    CL1 .     PWOS      ZONE                                         
PUBGED   DS    CL1 .     A         EDITION                                      
