*          DATA SET PUBLEQEL   AT LEVEL 004 AS OF 06/14/83                      
PUBLEQEL DS    0C                  ** PRINTPAK PUBLICATION LINE-                
*                                  EQUIVALENCE ELEM**                           
         DS    X'40'     B         ELEM CODE                                    
         DS    AL1(10)   B         ELEM LENGTH                                  
*                                                                               
PUBLESPC DS    CL6       A/N       SPACE (S.A.U.) CODE                          
PUBLELNS DS    XL2       B         LINE EQUIVALENT                              
