*          DATA SET PUBPRMEL   AT LEVEL 007 AS OF 12/27/99                      
PUBPRMEL DS    0C                  ** PRINTPAK PUB PREMIUM ELEMENT **           
         DS    X'60'     B         ELEMENT CODE                                 
         DS    AL1(40)   B         ELEMENT LENGTH                               
PUBPCOD  DS    CL3       C         PREMIUM TYPE CODE                            
*                                  '1C ' = 1 COLOR, ETC                         
PUBPSTRT DS    XL3       B         EFFECTIVE DATE                               
PUBPDAYS DS    XL1       B         DAYS AVAILABLE                               
*                                  X'40' = MON, X'20' = TUES ETC                
PUBPMINS DS    CL4       P         MINIMUM SIZE                                 
PUBPMINC DS    CL5       P         MINIMUM CHARGE ($)                           
         DS    CL4                 SPARE                                        
PUBPTYPC DS    CL1       B         TYPE OF CHARGE                               
*                                  X'80' = FLAT                                 
*                                  X'40' = B/W + FLAT                           
*                                  X'20' = B/W + PCT.                           
*                                  X'10' = B/W + LINE                           
*                                  X'08' = B/W + INCH                           
PUBPCLMO DS    CL2       P         CLOSING DATE - REL. MONTH                    
PUBPCLDA DS    CL2       P                      - DAY                           
PUBPCLT  DS    CL3                 CLIENT CODE (12/99)                          
         DS    CL10                SPARE (12/99 - WAS 13)                       
