*          DATA SET PUBPTBEL   AT LEVEL 005 AS OF 03/15/02                      
PUBPTBEL DS    0C                  ** PRINTPAK PUB PREM CHARGE ELEM **          
         DS    X'61'     B         ELEMENT CODE                                 
         DS    AL1(14)   B         ELEMENT LENGTH                               
PUBPTBLN DS    CL5       P         LINEAGE - MAX AD SIZE FOR WHICH              
*                                            THIS RATE APPLIES                  
PUBPTBCH DS    CL6       P         CHARGE FOR THIS AD SIZE - .NNNNN             
         DS    CL1                 SPARE                                        
