*          DATA SET PUBSAPEL   AT LEVEL 001 AS OF 05/14/14                      
PUBSAPEL DS    0C                  ** PRINTPAK SAP INTERFACE ELEM **            
         DS    X'91'     B         ELEMENT CODE                                 
         DS    AL1(12)   B         ELEMENT LENGTH                               
*                                                                               
PUBSAPCD DS    CL10                SAP INTERFACE CODE                           
