*          DATA SET PUBSADEL   AT LEVEL 008 AS OF 12/20/89                      
PUBSADEL DS    0C                  ** PRINTPAK PUB SUPPL. ADDR ELEM **          
         DS    X'11'     B         ELEMENT CODE                                 
         DS    AL1(50)   B         ELEMENT LENGTH                               
*        DS    AL1(62)   B         NEW ELEMENT LENGTH (12/18/89)                
*                                                                               
PUBSAOFF DS    XL3                 3X'FF' = AGENCY                              
*                                  X'FF' + X + BLANK = OFFICE X                 
*                                  ELSE CLIENT CODE                             
PUBATTN  DS    CL24      AN        ATTENTION OF FIELD                           
PUBTEL   DS    CL12      AN        TELEPHONE                                    
PUBSFAXN DS    CL12      AN        FAX TELEPHONE NUMBER                         
         DS    CL9                 SPARE                                        
