*          DATA SET PUBTADEL   AT LEVEL 001 AS OF 02/18/74                      
PUBTADEL DS    0C .                ** PRINTPAK - PUBLICATON TRAFFIC             
*                                     ADDRESS ELEMENT **                        
         DS    X'13' .   B         ELEMENT CODE                                 
         DS    AL1(140) .B         ELEMENT LENGTH                               
*                                                                               
PUBTOFF  DS    CL3 .     N         OFFICE NUMBER - &X'FF' = DEFAULT             
PUBTNAM  DS    CL20 .    AN        NAME                                         
PUBTLIN1 DS    CL30 .    AN        LINE 1                                       
PUBTLIN2 DS    CL30 .    AN        LINE 2                                       
PUBTATTN DS    CL24 .    AN        ATTENTION                                    
         DS    CL31 .              SPARE                                        
