*          DATA SET PUBTAXEL   AT LEVEL 007 AS OF 07/07/86                      
PUBTAXEL DS    0C                  ** PRINTPAK PUB TAX ELEM **                  
         DS    X'22'     B         ELEMENT CODE                                 
         DS    AL1(30)   B         ELEMENT LENGTH                               
*                                                                               
PUBTAX1  DS    XL3       B         4 DECIMALS                                   
PUBTAX1D DS    CL3       B         EFFECTIVE DATE FOR PUBTAX1                   
PUBTAX2  DS    XL3       B         4 DECIMALS                                   
PUBTAX2D DS    CL3       B         EFFECTIVE DATE FOR PUBTAX2                   
PUBTAX3  DS    XL3       B         4 DECIMALS                                   
PUBTAX3D DS    CL3       B         EFFECTIVE DATE FOR PUBTAX3                   
         DS    CL10      B         SPARE                                        
