*          DATA SET PUBWEBEL   AT LEVEL 002 AS OF 11/02/98                      
PUBWEBEL DS    0C                  ** PRINTPAK PUB WEB ELEM **                  
         DS    X'70'     B         ELEMENT CODE                                 
         DS    X         B         ELEMENT LENGTH - VARIABLE                    
*                                                                               
PUBWEBS  DS    0C                  WEB SITE                                     
