*          DATA SET PZBLOCK    AT LEVEL 115 AS OF 09/26/97                      
         SPACE 2                                                                
*****************************************************************               
*                                                               *               
*            CONTROL DSECT FOR EZMOD                            *               
*                                                               *               
*****************************************************************               
*                                                               *               
*        NOTE- PPEZF'S USE AIO3 FOR PZBLOCK, SO IT MUST BE AS   *               
*              BIG AS EZBLOCKL.                                                 
*                                                                               
*****************************************************************               
         SPACE 2                                                                
EZBLOCKD DSECT                                                                  
*                                  CONTROLS/DATA SET BY CALLER                  
*                                  ---------------------------                  
         SPACE 1                                                                
EZHOOK   DS    A                   A(USER'S PROCESSING ROUTINE)                 
         DS    2A                  SPARE                                        
EZWKRFIL DS    CL8                 WORKER FILE NAME                             
EZWKRIND DS    XL44                WORKER FILE INDEX                            
EZWKRBUF DS    A                   A(BUFFER FOR WORKER FILE)                    
EZWKRREC DS    A                   A(WORKER FILE RECORD AREA)                   
EZAREC   DS    A                   A(IO AREA)                                   
EZPRTAB  DS    A                   A(PRODUCT TABLE AREA)                        
EZPRTABL DS    H                   LENGTH OF PROD TABLE                         
         DS    H                   SPARE                                        
EZCOMFCS DS    A                   A(COMFACS)                                   
EZARECTB DS    A                   A(EZRECTAB)                                  
EZPRINT  DS    A                   A(PRINT ROUTINE)                             
EZUTL    DS    A                   A(UTL)                                       
         DS    2A                  SPARE                                        
*                                                                               
*                                **PROCESSING CONTROLS (CAN BE CHANGED          
*                                **BY USER DURING HOOK ROUTINE)                 
*                                                                               
EZTRACE  DS    XL1                 X'80 = TRACE FIELDS                          
*                                  X'40'= TRACE CALLS                           
*                                  X'20'= TRACE ERRORS                          
*                                  X'10'= TRACE ADDED INVOICE RECS              
*                                  X'08'= PDUMPS                                
*                                  X'04'= RECORDS                               
*                                                                               
EZLOOKSW DS    XL1                                                              
EZLNOADV EQU   X'80'                - NO ADV LOOKUP                             
EZLNOPRD EQU   X'40'                - NO PRD LOOKUP                             
EZLNOIOR EQU   X'20'                - NO INS ORD LOOKUP                         
EZLRDCOV EQU   X'10'                - DO PROC 'COVER LETTER INVOICES'           
EZL2PASS EQU   X'04'                - 2 PASSES THRU DETAILS                     
*                                 (** 2 PASS DOESN'T WORK, DON'T USE!)          
EZLWRGOP EQU   X'02'                - OVERRIDE WSJ REGIONAL BUY OPT             
*                                     (SO Z9 WILL SHOW ALL INSERTS)             
*                                                                               
EZTEST   DS    CL1                 Y= NO WORKER FILE MARKING                    
EZWRITE  DS    CL1                 N= NO FILE MARKING                           
EZCONVSW DS    XL1                 X'FF' - NO DATA CONVERSIONS                  
EZRPLOPT DS    CL1                 Y= OK TO REPLACE INVOICE (EZADDINV)          
*                                                                               
EZAGY    DS    CL2                 ALPHA AGENCY                                 
EZMED    DS    XL1                 MEDIA                                        
EZSELINV DS    CL10                INVOICE NUMBER FILTER                        
EZSRCE   DS    CL4                 SOURCE (COMPANY OR SYSTEM)                   
EZSAVSYS DS    CL1                 SAVED UTL SYSTEM NUMBER IF MPL               
*                                  ALREADY OPEN                                 
EZMPLOPN DS    CL1                 MPL FILE OPEN SWITCH                         
EZCONSE  DS    XL1                 SENUM FOR MPL FILE                           
*                                                                               
EZPRNTSE DS    XL1  (PRNTSE)       PRNT SYSTEM SE NUMBER                        
EZOFF    DS    CL1                 Y=OFF-LINE)                                  
         DS    30C                 SPARE                                        
         SPACE 2                                                                
*                                  CONTROLS/DATA RETURNED                       
*                                  ----------------------                       
         SPACE 1                                                                
EZMODE   DS    XL1                 MODE                                         
*                                                                               
EZERRP   EQU   200                 PROCESS ERROR                                
*                                                                               
EZINVP   EQU   25                  PROCESS INVOICE                              
EZICCOMP EQU   26                          INVOICE COMMENT (TOP)                
EZSPTP   EQU   29                          SPOT DETAIL                          
EZRECP   EQU   30                          RECONCILIATION REMARK                
EZAAP    EQU   32                          ADDITIONAL ADJUSTMENT                
EZIBCOMP EQU   31                          INVOICE COMMENT (BOTTOM)             
*                                                                               
*                                                                               
EZSPTL   EQU   37                  END OF  SPOT                                 
EZINVL   EQU   35                          INVOICE                              
EZBATL   EQU   34                          BATCH                                
*                                                                               
*        NOTE- USER CAN ALTER FLOW BY SETTING MODE BEFORE                       
*              RETURNING FROM HIS PROCESSING HOOK. E.G.-                        
*              SETTING MODE TO EZINVL WILL CAUSE A SKIP TO                      
*              START OF NEXT INVOICE.                                           
*                                                                               
         SPACE 2                                                                
EZRECSEQ DS    H                   SEQ NUMBER OF CURRENT REC                    
EZINVSEQ DS    H                   SEQ NUMBER OF CURRENT INV                    
*                                                                               
EZERRCD  DS    XL1                 ERROR CODE                                   
EZERRLEV DS    XL1                 ERROR LEVEL - THIS ERROR                     
EZERRLVR DS    XL1                 ERROR LEVEL - HIGHEST THIS REC               
EZERRLVI DS    XL1                 ERROR LEVEL - HIGHEST THIS INVOICE           
EZERRLVB DS    XL1                 ERROR LEVEL - HIGHEST THIS BATCH             
EZERRREC DS    CL20                NAME OF RECORD IN ERROR                      
EZERRFLD DS    CL20                NAME OF FIELD IN ERROR                       
EZERRMSG DS    CL40                ERROR MESSAGE                                
EZERRDTA DS    CL30                ERROR DATA                                   
*                                                                               
EZBTBRDT DS    XL3                 DATE RECEIVED- BINARY 3                      
EZBTBRTM DS    XL2                 TIME RECEIVED                                
EZBTSTN  DS    CL4                 STATION (PUB)                                
*                                                                               
EZPROF   DS    XL16                MAIN PROFILE (PZ PROF)                       
         ORG   EZPROF                                                           
EZESTOPT DS    CL1   #1            Y=COPY ESTIMATE NUMBERS                      
EZMPROPT DS    CL1   #2            Y=DONT CVT IF ANY PRD MISSING                
EZRCSOPT DS    CL1   #3            Y=PROCESS REGIONAL COMBO SUMMARIES           
EZEDNOPT DS    CL1   #4            EDITION MATCH CONTROL                        
*                                  E=EXACT, Z=EXACT OR 00, A=ALL                
         ORG   EZPROF+16                                                        
EZPROF2  DS    XL16                SECOND PROFILE (Z5 PROF)                     
         ORG   EZPROF2                                                          
EZZ9REQ  DS    CL1                 REQUEST Z9 INV FACSIMILE REPORT              
*                                   FOR ALL CONVERTED THIS RUN                  
         ORG   EZPROF2+16                                                       
*                                                                               
EZRNFRPT DS    CL1                 Y= REPEAT OF RECORD NOT FOUND                
EZERRFAD DS    XL4                 A(FIELD IN ERROR)                            
         DS    25C                 SPARE                                        
         DS    0D                                                               
         SPACE 2                                                                
*                      STATION HEADER - (AT MODE EZINVP)                        
*                      --------------                                           
*                                **RECEIVED**                                   
EZSNFRST DS    0C                                                               
EZSNSTA  DS    CL4                 PUB CODE                                     
EZSNNAME DS    CL30                NAME                                         
EZSNLIN1 DS    CL30                ADDRESS LINE 1                               
EZSNLIN2 DS    CL30                        LINE 2                               
EZSNLIN3 DS    CL30                        LINE 3                               
EZSNLIN4 DS    CL30                        LINE 4                               
EZSNSYS  DS    CL15                COMPUTER SYSTEM                              
         DS    CL10                SPARE                                        
*                                  **LOOKED UP/CONVERTED                        
EZSNMED  DS    CL1                 MEDIA                                        
EZSNPUB  DS    XL4                 PUB                                          
EZSNZON  DS    XL1                 ZONE                                         
EZSNEDT  DS    XL1                 EDITN                                        
EZSNETAB DS    XL3                 A(EDITION TABLE)                             
EZSNANM1 DS    CL20                AGENCY PUB NAME 1                            
EZSNANM2 DS    CL20                AGENCY PUB NAME 2                            
         DS    CL10                SPARE                                        
*                                                                               
*                                                                               
EZSNDLEN EQU   *-EZSNFRST                                                       
         SPACE 2                                                                
*                      PAYEE HEADER (AT MODE EZINVP)                            
*                      ------------                                             
*                                **RECEIVED**                                   
EZPYFRST DS    0C                                                               
EZPYNAM  DS    CL30                PAYEE NAME                                   
EZPYLIN1 DS    CL30                ADDRESS LINE 1                               
EZPYLIN2 DS    CL30                        LINE 2                               
EZPYLIN3 DS    CL30                        LINE 3                               
EZPYLIN4 DS    CL30                        LINE 4                               
EZPYDLEN EQU   *-EZPYFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      AGENCY IDENTIFICATION (AT MODE EZINVP)                   
*                      ---------------------                                    
*                                **RECEIVED**                                   
EZAGFRST DS    0C                                                               
EZAGCODE DS    CL8                 AGENCY CODE (SIGN ON EQUIV)                  
EZAGNAM  DS    CL30                AGENCY NAME                                  
EZAGLIN1 DS    CL30                ADDRESS LINE 1                               
EZAGLIN2 DS    CL30                        LINE 2                               
EZAGLIN3 DS    CL30                        LINE 3                               
EZAGLIN4 DS    CL30                        LINE 3                               
         DS    CL10                SPARE                                        
*                                                                               
EZAGDLEN EQU   *-EZAGFRST                                                       
         SPACE 2                                                                
*                      STANDARD COMMENT (TOP) (AT MODE EZINVP)                  
*                      ----------------------                                   
*                                **RECEIVED**                                   
EZSTFRST DS    0C                                                               
EZSTCOM  DS    CL130                                                            
         DS    4CL130              5 ALLTOGETHER                                
*                                                                               
EZSTDLEN EQU   *-EZSTFRST                                                       
EZSTCMN  EQU   (*-EZSTFRST)/L'EZSTCOM                                           
         SPACE 2                                                                
*                      STANDARD COMMENT (BOTTOM) (AT MODE EZINVP)               
*                      ----------------------                                   
*                                **RECEIVED**                                   
EZSBFRST DS    0C                                                               
EZSBCOM  DS    CL130                                                            
         DS    4CL130              5 ALLTOGETHER                                
*                                                                               
EZSBDLEN EQU   *-EZSBFRST                                                       
EZSBCMN  EQU   (*-EZSBFRST)/L'EZSBCOM                                           
         SPACE 2                                                                
*                    INVOICE HEADER (AT MODE EZINVP)                            
*                    --------------                                             
*                                                                               
*                                **RECEIVED**                                   
EZIHFRST DS    0C                                                               
EZIHCNVS DS    0CL20               CONVERSION STATUS (ADDED ON LOAD)            
EZIHCVST DS    XL1                   STATUS BYTE                                
*              X'80'                   STOP LEADING BLANK ELIMINATION           
EZIHCVQ  EQU   X'40'                   CONVERTED                                
EZIHRCVQ EQU   X'20'                   RECONVERT                                
EZIHCOVR EQU   X'10'                   CLIENT/PROD/EST OVERRIDE                 
EZIHCDEL EQU   X'08'                   INVOICE IS DELETED                       
EZIHCCMB EQU   X'04'                   INVOICE WAS COMBINED WITH                
*                                      ANOTHER (MORE THAN 255)                  
EZIHCVDT DS    XL3                   DATE CONVERTED                             
EZIHCVAD DS    CL3                   CLIENT (MAY BE SET BEFORE CONVERT          
*                                    AS OVERRIDE TO LOOKUP)                     
EZIHCVPR DS    CL3                   PRODUCT (AS ABOVE)                         
EZIHCVES DS    XL2                   ESTIMATE (AS ABOVE)                        
EZIHLKST DS    XL1                   LOOK-UP STATUS                             
EZIHLANF EQU   X'80'                   SPOTPAK ADVERTISER NOT FOUND             
EZIHLPNF EQU   X'40'                   SPOTPAK PRODUCT(S) NOT FOUND             
EZIHLENF EQU   X'20'                   SPOTPAK ESTIMATE NOT FOUND               
EZIHSTAC EQU   X'10'                   STATION CALL LETTERS INVALID             
         SPACE                                                                  
EZIHSPRT DS    XL1                   SPECIAL RATE OVERRIDE                      
EZIHCVND DS    XL1                   STATUS-STOP TRAILING BLK DEL               
         DS    CL5                 SPARE                                        
*                                                                               
EZIHAVCD DS    CL8                 AGENCY ADVERTISER CODE                       
EZIHAVNM DS    CL25                ADVERTISER NAME                              
EZIHPRCD DS    CL8                 AGENCY PRODUCT CODE                          
EZIHPRNM DS    CL25                PRODUCT NAME                                 
EZIHEST  DS    CL10                AGENCY ESTIMATE CODE                         
EZIHEDCD DS    CL8                 EDITION CODE                                 
EZIHEDNM DS    CL20                EDITION NAME                                 
EZIHREP  DS    CL25                REPRESENTATIVE                               
EZIHSLSP DS    CL25                SALESPERSON                                  
EZIHIDAT DS    CL6                 INVOICE DATE                                 
EZIHDUED DS    CL6                 INVOICE DUE DATE                             
EZIHORD  DS    CL15                ORDER TYPE                                   
EZIHINV  DS    CL10                INVOICE NUMBER                               
EZIHMON  DS    CL4                 INSERTION MONTH                              
EZIHISDT DS    CL6                 INVOICE PERIOD START DATE                    
EZIHIEDT DS    CL6                 INVOICE PERIOD END DATE                      
EZIHRORD DS    CL10                REP CONTRACT/ORDER NUMBER                    
EZIHSORD DS    CL10                PUB CONTRACT/ORDER NUMBER                    
EZIHCSDT DS    CL6                 CONTRACT START DATE                          
EZIHCEDT DS    CL6                 CONTRACT END DATE                            
EZIHINST DS    CL25                BILLING INSTRUCTIONS                         
EZIHRC   DS    CL10                RATE CARD NUMBER                             
EZIHACF  DS    CL1                 AGENCY COMMISSION FLAG (Y,N)                 
EZIHSTP  DS    CL10                SALES TAX PERCENT  99V9999                   
EZIHACON DS    CL25                AGENCY CONTACT                               
EZIHSCON DS    CL25                STATION CONTACT                              
EZIHAOFF DS    CL25                AGENCY OFFICE                                
EZIHAACC DS    CL10                AGENCY ACCOUNT NUMBER                        
EZIHSADC DS    CL8                 PUB ADVERTISER CODE                          
EZIHSPRC DS    CL8                 PUB PRODUCT CODE                             
EZIHTPC  DS    CL8                 TRADING PARTNER CODE                         
EZIHDEAL DS    CL10                DEAL NUMBER                                  
EZIHCD   DS    CL10                CASH DISCOUNT % (TEXT)                       
         DS    CL25                SPARE                                        
*                                                                               
*                                **LOOKED UP**                                  
*        NOTE- THESE FIELDS ARE BEST USED AT EZINVL NOT EZINVP)                 
*                                                                               
EZIHLADN DS    CL20                ADVERTISER (CLIENT) NAME                     
EZIHLADC DS    CL3                 CODE                                         
EZIHLPRN DS    CL20                PRODUCT NAME                                 
EZIHLPRC DS    CL3                 CODE                                         
EZIHLZON DS    XL1                 ZONE                                         
EZIHLEDC DS    XL1                 EDITION                                      
*                                                                               
*                                **CONVERTED**                                  
EZIHDIDT DS    CL8                 INVOICE DATE - MMMDD/YY                      
EZIHBIDT DS    XL3                              - BINARY                        
EZIHDUDT DS    CL8                 DUE DATE     - MMMDD/YY                      
EZIHBUDT DS    XL3                              - BINARY                        
EZIHDSDT DS    CL8                 SCHED START  - MMMDD/YY                      
EZIHDEDT DS    CL8                 SCHED END    - MMMDD/YY                      
EZIHDISD DS    CL8                 INVOICE START- MMMDD/YY                      
EZIHDIED DS    CL8                 INVOICE END  - MMMDD/YY                      
EZIHDCSD DS    CL8                 CONTRACT ST  - MMMDD/YY                      
EZIHDCED DS    CL8                 CONTRACT END - MMMDD/YY                      
EZIHDMOS DS    CL6                 MONTH OF SVC - MMM/YY                        
EZIHBMOS DS    XL2                              - BINARY YYMM                   
EZIHBEST DS    XL2                 AGENCY ESTIMATE                              
EZIHBSTP DS    XL4                 SALES TAX PERCENT                            
*                                                                               
EZIHCINV DS    CL10                COMBINED INVOICE NUMBER                      
*                                **TOTALS**                                     
         DS    0F                                                               
EZIHTOTS DS    0XL24                                                            
EZIHTCR  DS    F                   RECON CR'S                                   
EZIHTDR  DS    F                   RECON DB'S                                   
EZIHTSPC DS    F                   SPOT COST                                    
EZIHTSPN DS    F                   SPOT COUNT                                   
EZIHDLEN EQU   *-EZIHFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      INVOICE COMMENT (TOP) (AT MODE EZICCOMP)                 
*                      ---------------------                                    
*                                **RECEIVED**                                   
EZICFRST DS    0C                                                               
EZICCOM  DS    CL130               COMMENT                                      
*                                                                               
EZICDLEN EQU   *-EZICFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      INSERTION (AT MODE EZSPTP)                               
*                      ---------------------                                    
*                                **RECEIVED**                                   
EZSPFRST DS    0C                                                               
EZSPCNVS DS    0CL10               OVERRIDE STATUS (ADDED ON LOAD)              
EZSPCVST DS    XL1                   STATUS BYTE                                
*              X'80'                   STOP LEADING BLANK ELIMINATION           
EZSPCOVR EQU   X'10'                   CLIENT/PROD OVERRIDE                     
EZSPCVPR DS    CL3                   PRODUCT OVERRIDE                           
EZSPCVES DS    XL2                   ESTIMATE OVERRIDE                          
EZSPLKST DS    XL1                   LOOK-UP STATUS                             
EZSPLPNF EQU   X'40'                   SPOTPAK PRODUCT NOT FOUND                
EZSPLENF EQU   X'20'                   SPOTPAK ESTIMATE NOT FOUND               
         SPACE                                                                  
EZSPCVND DS    XL1                   STATUS-STOP TRAILING BLK DEL               
         DS    CL2                 SPARE                                        
*                                                                               
EZSPIORD DS    CL17                INSERTION ORDER NUMBER                       
EZSPDATE DS    CL6                 DATE                                         
EZSPRCOM DS    CL1                 REGIONAL COMBO      Y=SUMMARY LINE           
EZSPRCCD DS    CL2                 REGIONAL COMBO CODE                          
EZSPREFN DS    CL10                REFERENCE NUMBER ?                           
EZSPADCD DS    CL6                 AD CODE                                      
EZSPCOPY DS    CL17                COPY CODE                                    
EZSPCAPT DS    CL50                CAPTION                                      
EZSPPAGE DS    CL5                 PAGE/SECTION                                 
EZSPSPCE DS    CL17                SIZE/SPACE DESC                              
EZSPLINS DS    CL5                 LINES                                        
EZSPCLMS DS    CL5                 COLUMNS                                      
EZSPICHS DS    CL5                 INCHES                                       
EZSPPOS1 DS    CL10                SPECIAL POSITION 1                           
EZSPPOS2 DS    CL10                SPECIAL POSITION 2                           
EZSPPOS3 DS    CL10                SPECIAL POSITION 3                           
EZSPPRM1 DS    CL10                SPECIAL PREMIUM 1                            
EZSPPRM2 DS    CL10                SPECIAL PREMIUM 2                            
EZSPPRM3 DS    CL10                SPECIAL PREMIUM 3                            
EZSPCLPR DS    CL10                COLOR PREMIUM CODE                           
EZSPCLAM DS    CL10                COLOR PREMIUM AMOUNT                         
EZSPTEAR DS    CL1                 TEARSHEET   Y/N                              
EZSPRATE DS    CL10                UNIT RATE   NNNVNNNN                         
EZSPGRS  DS    CL10                GROSS AMOUNT                                 
EZSPNET  DS    CL10                NET AMOUNT                                   
EZSPCD   DS    CL10                CASH DISCOUNT                                
*                                                                               
EZSPADR  DS    CL10                ADJUSTMENT AMOUNT - DR                       
EZSPACR  DS    CL10                ADJUSTMENT AMOUNT - CR                       
EZSPCLEV DS    CL20                CONTRACT LEVEL                               
         DS    CL20                SPARE                                        
*                                                                               
*        NOTE- THESE FIELDS SHOULD HAVE DATA ONLY IF NOT IN INV HEADER          
*                                                                               
EZSPEDCD DS    CL8                 EDITION CODE                                 
EZSPEDNM DS    CL20                EDITION NAME                                 
EZSPPRCD DS    CL8                 PRODUCT CODE                                 
EZSPPRNM DS    CL20                PRODUCT NAME                                 
EZSPEST  DS    CL10                ESTIMATE                                     
         DS    CL20                SPARE                                        
*                                                                               
*                                **LOOKED UP**                                  
*                                  NOTE- NO LOOKUP OF ADCODE AND                
*                                        AND RELATED DATA                       
EZSPLPRN DS    CL20                PRODUCT NAME                                 
EZSPLPRC DS    CL3                 CODE                                         
EZSPLZON DS    XL1                 ZONE                                         
EZSPLEDC DS    XL1                 EDITION                                      
*                                                                               
*                                **CONVERTED**                                  
EZSPDDT  DS    CL8                 DATE - MMMDD/YY                              
EZSPCDT  DS    XL2                      - COMPRESSED                            
EZSPBRAT DS    XL4                 RATE                                         
EZSPBDR  DS    XL4                 ADJSUTMENT -DR                               
EZSPBCR  DS    XL4                 ADJUSTMENT -CR                               
         DS    CL3                 SPARE                                        
EZSPBEST DS    XL2                 ESTIMATE                                     
EZSPIODT DS    XL2                 IO DATE                                      
EZSPIONM DS    XL2                 IO NUMBER                                    
EZSPBLNS DS    XL4                 LINES                                        
EZSPBCLS DS    XL4                 COLUMNS                                      
EZSPBICS DS    XL4                 INCHES                                       
EZSPBPM1 DS    XL4                 SPEC PREM 1 AMOUNT                           
EZSPBPM2 DS    XL4                 SPEC PREM 2 AMOUNT                           
EZSPBPM3 DS    XL4                 SPEC PREM 3 AMOUNT                           
EZSPBGRS DS    XL4                 GROSS                                        
EZSPBNET DS    XL4                 NET                                          
EZSPBCD  DS    XL4                 CASH DISCOUNT                                
EZSPBCLA DS    XL4                 COLOR PREMIUM AMOUNT                         
*                                                                               
         DS    CL6                 SPARE                                        
*                                                                               
EZSPDLEN EQU   *-EZSPFRST                                                       
*                                                                               
         SPACE 2                                                                
*                            RECONCILIATION REMARK (AT MODE EZRECP)             
*                            ---------------------                              
*                                **RECEIVED**                                   
EZRRFRST DS    0C                                                               
EZRRREM  DS    CL20                REMARKS                                      
*                                                                               
EZRRDLEN EQU   *-EZRRFRST                                                       
         SPACE 2                                                                
*                            ADDITIONAL ADJUSTMENT                              
*                            ---------------------                              
*                                **RECEIVED**                                   
EZAAFRST DS    0C                                                               
EZAADESC DS    CL35                DESCRIPTION                                  
EZAAGRS  DS    CL10                GROSS                                        
EZAANET  DS    CL10                NET                                          
EZAACD   DS    CL10                CD                                           
         DS    CL20                SPARE                                        
*                                                                               
*                                **CONVERTED**                                  
*                                                                               
EZAABGRS DS    XL4                 GROSS                                        
EZAABNET DS    XL4                 NET                                          
EZAABCD  DS    XL4                 CASH DISCOUNT                                
*                                                                               
EZAADLEN EQU   *-EZAAFRST                                                       
*                                                                               
         SPACE 2                                                                
*                      INVOICE COMMENT (BOTTOM)                                 
*                      ------------------------                                 
*                                **RECEIVED**                                   
EZIBFRST DS    0C                                                               
EZIBCOM  DS    CL130               COMMENT                                      
*                                                                               
EZIBDLEN EQU   *-EZIBFRST                                                       
         SPACE 2                                                                
*                      INVOICE TOTALS (AT MODE EZINVL)                          
*                      --------------                                           
*                                **RECEIVED**                                   
EZITFRST DS    0H                                                               
EZITSCH  DS    CL11                MONTHLY COST/SCHEDULE                        
EZITACT  DS    CL11                MONTHLY COST/ACTUAL                          
EZITAGC  DS    CL11                AGENCY COMMISSION                            
EZITCD   DS    CL11                CASH DISCOUNT                                
EZITDUE  DS    CL11                NET DUE                                      
EZITRDR  DS    CL11                RECONCILIATION -DR                           
EZITRCR  DS    CL11                               -CR                           
EZITRTO  DS    CL11                               -TOTAL                        
EZITSTX  DS    CL11                STATE TAX                                    
EZITLTX  DS    CL11                LOCAL TAX                                    
EZITPGR  DS    CL11                PRIOR BALANCE - GROSS                        
EZITPNT  DS    CL11                PRIOR BALANCE - NET                          
EZITSPC  DS    CL5                 NUMBER OF SPOTS                              
EZITGST  DS    CL11                GST - CANADA                                 
EZITQST  DS    CL11                QST - QUEBEC                                 
         DS    CL17                SPARE                                        
*                                                                               
*                                **CONVERTED**                                  
EZITBSCH DS    XL4                 MONTHLY COST/ORDERED                         
EZITBACT DS    XL4                 MONTHLY COST/ACTUAL                          
EZITBAGC DS    XL4                 AGENCY COMMISSION                            
EZITBCD  DS    XL4                 CASH DISCOUNT                                
EZITBDUE DS    XL4                 NET DUE                                      
EZITBRDR DS    XL4                 RECONCILIATION -DR                           
EZITBRCR DS    XL4                                -CR                           
EZITBRTO DS    XL4                                -TOTAL                        
EZITBSTX DS    XL4                 STATE TAX                                    
EZITBLTX DS    XL4                 LOCAL TAX                                    
EZITBPGR DS    XL4                 PRIOR BALANCE - GROSS                        
EZITBPNT DS    XL4                 PRIOR BALANCE - NET                          
EZITBSPC DS    XL4                 SPOT COUNT                                   
EZITBGST DS    XL4                 GST - CANADA                                 
EZITBQST DS    XL4                 QST - QUEBEC                                 
*                                                                               
         DS    CL8                 SPARE                                        
EZITDLEN EQU   *-EZITFRST                                                       
*                                                                               
         DS    0D                                                               
EZWKA    DS    XL175               EZMOD SAVED WORK AREA                        
EZBLOCKL EQU   *-EZBLOCKD                                                       
         EJECT                                                                  
*                                  RECORD CODE EQUATES                          
*                                  -------------------                          
EZAGEQ   EQU   X'21'               AGENCY                                       
EZSNEQ   EQU   X'22'               PUBLICATION                                  
EZPYEQ   EQU   X'23'               PAYEE                                        
EZSTEQ   EQU   X'24'               STANDARD COMMENT (TOP)                       
EZSBEQ   EQU   X'25'               STANDARD COMMENT (BOTTOM)                    
EZIHEQ   EQU   X'31'               INVOICE HEADER                               
EZICEQ   EQU   X'32'               INVOICE COMMENT (TOP)                        
EZSPEQ   EQU   X'51'               SPOT DETAIL                                  
EZRREQ   EQU   X'52'               RECONCILIATION                               
EZAAEQ   EQU   X'53'               ADDITIONAL ADJUSTMENT                        
EZIBEQ   EQU   X'33'               INVOICE COMMENT (BOTTOM)                     
EZITEQ   EQU   X'34'               INVOICE TOTAL                                
EZBTEQ   EQU   X'12'               BATCH TOTAL                                  
         SPACE 3                                                                
*                                  ERROR CODE EQUATES                           
*                                  -------------------                          
EZERRMIS EQU   X'01'               MISSING FIELD                                
EZERRINV EQU   X'02'               INVALID DATA                                 
EZERRRNF EQU   X'03'               RECORD NOT FOUND                             
EZERRPRD EQU   X'04'               PRODUCT INCONSISTENCY                        
EZERROMN EQU   X'07'               OUT OF MONTH ERROR                           
EZERRFLN EQU   X'08'               FIELD TOO LONG- TRUNCATED                    
EZERRSCO EQU   X'09'               STANDARD COMMENT OVERFLOW                    
EZERRRTP EQU   X'0A'               INVALID RECORD TYPE                          
EZERRSCD EQU   X'0B'               INVALID SPOTPAK CLT/PRD CODE                 
EZERRSPL EQU   X'0C'               SPOT DETAIL SPOT LEN ZERO                    
EZERRSTA EQU   X'0D'               STATION CALL LETTERS BAD                     
EZERRADV EQU   X'0E'               ADVERTISER INCONSISTENCY                     
EZERRADC EQU   X'0F'               AD CODE INCONSISTENCY                        
EZERRION EQU   X'10'               IO FIELD ERROR                               
EZERRINF EQU   X'11'               IO NOT FOUND                                 
EZERRPNA EQU   X'12'               PUB NOT FOUND FOR AGENCY                     
EZERREDT EQU   X'13'               EDITION INCONSISTENCY                        
*                                                                               
*                                  SET BY EZADDINV                              
*                                  (REASONS FOR NON-CONVERSION)                 
*                                                                               
EZERRDUP EQU   X'21'               INVOICE ON FILE                              
EZERROVF EQU   X'22'               INVOICE OVERFLOW                             
EZERRANF EQU   X'23'               ADVERTISER NOT ON FILE                       
EZERRPNF EQU   X'24'               INVOICE PRODUCT NOT ON FILE                  
EZERRMUL EQU   X'25'               CAN'T RECONVERT COMBINED INVOICES            
EZERRMPR EQU   X'26'               NOT ALL DETAILS HAVE PRODUCT                 
         SPACE 3                                                                
*                                  ERROR LEVEL EQUATES                          
*                                  -------------------                          
EZERLBAT EQU   X'80'               BATCH NO GOOD                                
EZERLINV EQU   X'40'               INVOICE NO GOOD                              
         SPACE 3                                                                
*                                  RECORD DESCRIPTOR DSECT                      
*                                  -----------------------                      
EZRDD    DSECT                                                                  
EZRDRCD  DS    CL2                 RECORD CODE                                  
EZRDRCQ  DS    CL1                 RECORD CODE - INTERNAL                       
EZRDFRST DS    AL3                 FIRST FIELD                                  
EZRDNAM  DS    CL20                NAME OF RECORD                               
EZRDDL   EQU   *-EZRDD                                                          
         SPACE 3                                                                
*                                  FIELD DESCRIPTOR DSECT                       
*                                  ----------------------                       
EZFDD    DSECT                                                                  
EZFDLEN  DS    CL1                 MAX LENGTH FOR RECEIVED DATA                 
EZFDDSP  DS    SL2                 DISPLACEMENT INTO EZBLKD                     
EZFDNAM  DS    CL20                NAME OF FIELD                                
EZFDDL   EQU   *-EZFDD                                                          
*                                                                               
