*          DATA SET PZFFFD     AT LEVEL 002 AS OF 09/13/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN PZFFE0D      DATE 09/13/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
UVLCLIH  DS    CL8                                                              
UVLCLI   DS    CL4      6   13    4   A    U    N         T    I    Y           
UVLCLINH DS    CL8                                                              
UVLCLIN  DS    CL20     6   20   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      7    2    8   A    P    N         T         Y           
UVLESTH  DS    CL8                                                              
UVLEST   DS    CL4      7   13    4   A    U    N         T         Y           
UVLESTNH DS    CL8                                                              
UVLESTN  DS    CL24     7   20   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      8    2    7   A    P    N         T         Y           
UVLNETH  DS    CL8                                                              
UVLNET   DS    CL4      8   13    4   A    U    N         T         Y           
UVLNETNH DS    CL8                                                              
UVLNETN  DS    CL24     8   20   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9    2    7   A    P    N         T         Y           
UVLPAKH  DS    CL8                                                              
UVLPAK   DS    CL4      9   13    4   A    U    N         T         Y           
UVLPAKNH DS    CL8                                                              
UVLPAKN  DS    CL36     9   20   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     10    2    9   A    P    N         T         Y           
UVLUNVH  DS    CL8                                                              
UVLUNV   DS    CL4     10   13    4   A    U    N         T         Y           
UVLUNVNH DS    CL8                                                              
UVLUNVN  DS    CL36    10   20   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     11   13    1   A    U    N         T         Y           
UVLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
UVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 329  BYTES                            
