*          DATA SET RARDAYPRT  AT LEVEL 017 AS OF 11/16/00                      
RARDPTAB DS    0C                                                               
* MONDAY FRIDAY DAYPARTS                                                        
         DC    AL1(01,(2+1*3)),X'95',AL1(QXR6A,QXR10A) MF 6A-10A                
         DC    AL1(02,(2+1*3)),X'95',AL1(QXR10A,QXR3P) MF 10-3P                 
         DC    AL1(03,(2+1*3)),X'95',AL1(QXR3P,QXR7P) MF 3-7P                   
         DC    AL1(04,(2+1*3)),X'95',AL1(QXR7P,QXR12M) MF 7P-12M                
         DC    AL1(05,(2+1*3)),X'95',AL1(QXR6A,QXR7P) MF 6A-7P                  
         DC    AL1(06,(2+1*3)),X'95',AL1(QXR6A,QXR12M) MF 6A-12M                
         DC    AL1(22,(2+1*3)),X'95',AL1(QXR12M,QXR12M) MF 12M-12M              
         DC    AL1(19,(2+1*3)),X'95',AL1(QXR12M,QXR6A) MF 12M-6A                
* NEW                                                                           
         DC    AL1(07,(2+2*3)),X'95',AL1(QXR6A,QXR10A) MF 6-10A/3-7P            
         DC                    X'95',AL1(QXR3P,QXR7P)                           
         DC    AL1(21,(2+1*3)),X'95',AL1(QXR1A,QXR5E) MF 1A-5A                  
         DC    AL1(09,(2+1*3)),X'95',AL1(QXR10A,QXR7P) MF 10A-7P                
         DC    AL1(10,(2+1*3)),X'95',AL1(QXR10A,QXR12M) MF 10A-12M              
         DC    AL1(11,(2+1*3)),X'95',AL1(QXR3P,QXR12M) MF 3P-12M                
         DC    AL1(12,(2+1*3)),X'95',AL1(QXR5A,QXR10A) MF 5-10A                 
         DC    AL1(13,(2+2*3)),X'95',AL1(QXR6A,QXR10A) MF 6-10A/3P-12M          
         DC                    X'95',AL1(QXR3P,QXR12M)                          
         DC    AL1(14,(2+2*3)),X'95',AL1(QXR6A,QXR10A) MF 6-10A/7P-12M          
         DC                    X'95',AL1(QXR7P,QXR12M)                          
         DC    AL1(15,(2+2*3)),X'95',AL1(QXR6A,QXR3P) MF 6A-3P/7P-12M           
         DC                    X'95',AL1(QXR7P,QXR12M)                          
         DC    AL1(16,(2+4*3)),X'95',AL1(QXR6A,QXR10A) MF 6-10/7-12M/WK         
         DC                    X'95',AL1(QXR7P,QXR12M)                          
         DC                    X'60',AL1(QXR6A,QXR12M)                          
         DC                    X'70',AL1(QXR6A,QXR12M)                          
         DC    AL1(17,(2+2*3)),X'95',AL1(QXR10A,QXR3P) MF 10A-3P/7P-12M         
         DC                    X'95',AL1(QXR7P,QXR12M) MF 10A-3P/7P-12M         
         DC    AL1(18,(2+1*3)),X'95',AL1(QXR6A,QXR3P) MF 6A-3P                  
*                                                                               
* SATURDAY DAYPARTS                                                             
         DC    AL1(01,(2+1*3)),X'60',AL1(QXR6A,QXR10A) SA 6-10A                 
         DC    AL1(02,(2+1*3)),X'60',AL1(QXR10A,QXR3P) SA 10A-3P                
         DC    AL1(03,(2+1*3)),X'60',AL1(QXR3P,QXR7P) SA 3-7P                   
         DC    AL1(04,(2+1*3)),X'60',AL1(QXR7P,QXR12M) SA 7P-12M                
         DC    AL1(21,(2+1*3)),X'60',AL1(QXR1A,QXR5E) SA 1A-5A                  
         DC    AL1(22,(2+1*3)),X'60',AL1(QXR12M,QXR12M) SU 12M-12M              
         DC    AL1(06,(2+1*3)),X'60',AL1(QXR6A,QXR12M) SA 6A-12M                
         DC    AL1(19,(2+1*3)),X'60',AL1(QXR12M,QXR6A) SA 12M-6A                
         DC    AL1(05,(2+1*3)),X'60',AL1(QXR6A,QXR7P) SA 6A-7P                  
*                                                                               
* SUNDAY DAYPARTS                                                               
         DC    AL1(01,(2+1*3)),X'70',AL1(QXR6A,QXR10A) SU 6-10A                 
         DC    AL1(02,(2+1*3)),X'70',AL1(QXR10A,QXR3P) SU 10A-3P                
         DC    AL1(03,(2+1*3)),X'70',AL1(QXR3P,QXR7P) SU 3-7P                   
         DC    AL1(04,(2+1*3)),X'70',AL1(QXR7P,QXR12M) SU 7P-12M                
         DC    AL1(21,(2+1*3)),X'70',AL1(QXR1A,QXR5E) SU 1A-5A                  
         DC    AL1(22,(2+1*3)),X'70',AL1(QXR12M,QXR12M) SU 12M-12M              
         DC    AL1(19,(2+1*3)),X'70',AL1(QXR12M,QXR6A) SU 12M-6A                
         DC    AL1(06,(2+1*3)),X'70',AL1(QXR6A,QXR12M) SU 6A-12M                
         DC    AL1(05,(2+1*3)),X'70',AL1(QXR6A,QXR12M) SU 6A-7P                 
*        DC    AL1(05,(2+1*3)),X'70',AL1(QXR1A,QXR5E) BUG FIX                   
*                                                                               
* WEEKEND DAYPARTS                                                              
         DC    AL1(06,(2+1*3)),X'E7',AL1(QXR6A,QXR12M) SS 6A-12M                
         DC    AL1(09,(2+1*3)),X'E7',AL1(QXR10A,QXR7P) SS 10A-7P                
         DC    AL1(22,(2+1*3)),X'E7',AL1(QXR12M,QXR12M) SS 12M-12M              
         DC    AL1(05,(2+1*3)),X'E7',AL1(QXR6A,QXR7P) SS 6A-7P                  
         DC    AL1(19,(2+1*3)),X'E7',AL1(QXR12M,QXR6A) SS 12M-6A                
         DC    AL1(01,(2+1*3)),X'E7',AL1(QXR6A,QXR10A) SS 6A-10A                
         DC    AL1(02,(2+1*3)),X'E7',AL1(QXR10A,QXR3P) SS 10A-3P                
         DC    AL1(03,(2+1*3)),X'E7',AL1(QXR3P,QXR7P) SS 3P-7P                  
         DC    AL1(04,(2+1*3)),X'E7',AL1(QXR7P,QXR12M) SS 7P-12M                
*                                                                               
* MONDAY SATURDAY DAYPARTS                                                      
         DC    AL1(01,(2+1*3)),X'96',AL1(QXR6A,QXR10A) MSA 6-10A                
         DC    AL1(02,(2+1*3)),X'96',AL1(QXR10A,QXR3P) MSA 10A-3P               
         DC    AL1(03,(2+1*3)),X'96',AL1(QXR3P,QXR7P) MSA 3-7P                  
         DC    AL1(04,(2+1*3)),X'96',AL1(QXR7P,QXR12M) MSA 7P-12M               
         DC    AL1(12,(2+1*3)),X'96',AL1(QXR5A,QXR10A) MSA 5A-10A               
         DC    AL1(22,(2+1*3)),X'96',AL1(QXR12M,QXR12M) MSA 12M-12M             
         DC    AL1(06,(2+1*3)),X'96',AL1(QXR6A,QXR12M) MSA 6A-12M               
         DC    AL1(05,(2+1*3)),X'96',AL1(QXR6A,QXR7P) MSA 6A-7P                 
         DC    AL1(19,(2+1*3)),X'96',AL1(QXR12M,QXR6A) MSA 12M-6A               
         DC    AL1(07,(2+2*3)),X'96',AL1(QXR6A,QXR10A) MSA 6-10A/3-7P           
         DC                    X'96',AL1(QXR3P,QXR7P)                           
*                                                                               
* MONDAY SUNDAY DAYPARTS                                                        
         DC    AL1(02,(2+1*3)),X'97',AL1(QXR10A,QXR3P) MS 10A-3P                
         DC    AL1(19,(2+1*3)),X'97',AL1(QXR12M,QXR6A) MS 12M-6A                
         DC    AL1(20,(2+1*3)),X'97',AL1(QXR6A,QXR6A) MS 6A-6A                  
         DC    AL1(21,(2+1*3)),X'97',AL1(QXR1A,QXR5A) MS 1A-5A                  
         DC    AL1(05,(2+1*3)),X'97',AL1(QXR6A,QXR7P) MS 6A-7P                  
         DC    AL1(01,(2+1*3)),X'97',AL1(QXR6A,QXR10A) MS 6A-10A                
         DC    AL1(03,(2+1*3)),X'97',AL1(QXR3P,QXR7P) MS 3P-7P                  
         DC    AL1(04,(2+1*3)),X'97',AL1(QXR7P,QXR12M) MS 7P-12M                
         DC    AL1(22,(2+1*3)),X'97',AL1(QXR12M,QXR12M) MS 12M-12M              
         DC    AL1(06,(2+1*3)),X'97',AL1(QXR6A,QXR12M) MS 6A-12M                
         DC    AL1(11,(2+1*3)),X'97',AL1(QXR3P,QXR12M) MS 3P-12M                
         DC    AL1(17,(2+2*3)),X'97',AL1(QXR10A,QXR3P) MS 10A-3P/7P-12M         
         DC                    X'97',AL1(QXR7P,QXR12M) MS 10A-3P/7P-12M         
*                                                                               
* ALL DAYPARTS                                                                  
         DC    AL1(22,(2+1*3)),X'98',AL1(QXR12M,QXR12M) ALL 12M-12M             
         DC    AL1(06,(2+1*3)),X'98',AL1(QXR6A,QXR12M) ALL 6A-12M               
*                                                                               
* MS* DAYPARTS ALL MONDAY-SUNDAY DAYPARTS                                       
         DC    AL1(22,(2+1*3)),X'92',AL1(QXR12M,QXR12M) ALL 12M-12M             
         DC    AL1(06,(2+1*3)),X'92',AL1(QXR6A,QXR12M) ALL 6A-12M               
         DC    AL1(05,(2+1*3)),X'92',AL1(QXR6A,QXR7P) MS 6A-7P                  
*                                                                               
* MF* DAYPARTS ALL MONDAY-FRIDAY DAYPARTS                                       
         DC    AL1(22,(2+1*3)),X'91',AL1(QXR12M,QXR12M) ALL 12M-12M             
         DC    AL1(06,(2+1*3)),X'91',AL1(QXR6A,QXR12M) ALL 6A-12M               
         DC    AL1(05,(2+1*3)),X'91',AL1(QXR6A,QXR7P) MS 6A-7P                  
*                                                                               
         DC    X'00'               END OF TABLE                                 
         SPACE 2                                                                
QXR5E    EQU   96                                                               
QXR5A    EQU   0                                                                
QXR6A    EQU   QXR5A+4*1                                                        
QXR10A   EQU   QXR6A+4*4                                                        
QXR3P    EQU   QXR10A+4*5                                                       
QXR7P    EQU   QXR3P+4*4                                                        
QXR12M   EQU   QXR7P+4*5                                                        
QXR1A    EQU   QXR12M+4*1                                                       
         SPACE 2                                                                
*ARTABD  DSECT                                                                  
*ARDPT   DS    C                   DAYPART NUMBER                               
*ARLEN   DS    C                   ENTRY LENGTH                                 
*ARDAY   DS    C                   DEMO FILE DAY CODE                           
*ARQXRS  DS    C                   START QUARTER HOUR                           
*ARQXRE  DS    C                   END QUARTER HOUR                             
*ARTABQ  EQU   *-RARTABQ                                                        
