*          DATA SET RCARDDELD  AT LEVEL 069 AS OF 05/28/99                      
*              RATE CARDS TO BE DELETED                                         
* THIS TABLE IS USED BY REREP2402D TO DELETE RATE CARDS                         
* AND CORRESPONDING RDETAIL RECORDS.                                            
*                                                                               
RCARDAGY DC    CL2'UV'             AGENCY:                                      
*                                   UNNY                                        
*                                                                               
*              LIST OF RATE CARDS TO DELETE                                     
*                                                                               
RCARDDEL DC    CL8'2Q99 ENT'                                                    
         DC    CL8'2Q99A'                                                       
         DC    CL8'2Q99B'                                                       
         DC    CL8'2Q99C'                                                       
         DC    CL8'2Q99D'                                                       
         DC    CL8'2Q99E'                                                       
         DC    CL8'LA-2Q99A'                                                    
RCARDDX  DC    X'FF'               END OF RATECARD DELETE LIST                  
*                                                                               
