*          DATA SET RCMWORK    AT LEVEL 009 AS OF 02/05/79                      
         TITLE 'RCMWORK - REPORT CONTROL WORK AREAS'                            
RCMWORK  DSECT                                                                  
OLDROUTE DC    X'00'                                                            
OLDAGMD  DC    X'00'                                                            
PRTAGYID DC    CL8' '                                                           
RCMAGY   DS    CL2                 REQUESTED AGENCY CODE                        
BINAGY   DC    X'00'               BINARY AGENCY CODE                           
REQNO    DC    PL4'0'                                                           
REQSTART DC    PL4'0'                                                           
PROGREQ  DC    PL4'0'                                                           
PROGERR  DC    PL4'0'                                                           
PRDADDR  DC    A(0)                                                             
MKTADDR  DC    A(0)                                                             
PROFADDR DC    A(0)                                                             
GOALADDR DC    A(0)                                                             
CLTST    DC    H'0'                                                             
DIVST    DC    H'0'                                                             
PRDST    DC    H'0'                                                             
ESTST    DC    H'0'                                                             
DSTST    DC    H'0'                                                             
MKTST    DC    H'0'                                                             
RPSAVE   DC    XL70'00'                                                         
SAVENAME DS    CL33                                                             
SAVEADDR DS    CL33                                                             
         EJECT                                                                  
VRPWORK  DC    V(RPWORKC)                                                       
VDMOD000 DC    V(DMOD000)                                                       
VOPEN    DC    V(OPEN)                                                          
VWCTYPE  DC    V(WCTYPE)                                                        
VREPREQ  DC    V(REPREQ)                                                        
VSPTFILE DC    V(SPTFILE)                                                       
VSPTDIR  DC    V(SPTDIR)                                                        
VSTATION DC    V(STATION)                                                       
VDEMFILE DC    V(DEMFILE)                                                       
VDEMDIR  DC    V(DEMDIR)                                                        
VR00310  DC    V(R00310)                                                        
VWRTAPE  DC    V(WRTAPE)                                                        
VRDTAPE  DC    V(RDTAPE)                                                        
VCLTAPE  DC    V(CLTAPE)                                                        
VREADER  DC    V(READER)                                                        
VREQTAPE DC    V(REQTAPE)                                                       
VPRTTAPE DC    V(PRTTAPE)                                                       
VPRINTER DC    V(PRINTER)                                                       
VIN1     DC    V(IN1)                                                           
VOUT1    DC    V(OUT1)                                                          
VOUT2    DC    V(OUT2)                                                          
VT00301  DC    V(T00301)                                                        
VT00303  DC    V(T00303)                                                        
VSSB     DC    V(SSB)                                                           
VDATAMGR DC    V(DATAMGR)                                                       
VGETWORK DC    V(GETWORK)                                                       
VRECOVER DC    V(RECOVER)                                                       
VOPENSYS DC    V(OPENSYS)                                                       
VBOOT    DC    V(BOOT)                                                          
VREMOTEC DC    V(REMOTEC)                                                       
VPQBUFF  DC    V(PQBUFF)                                                        
VPQOPEN  DC    V(PQOPEN)                                                        
         EJECT                                                                  
