*          DATA SET REBASB2D   AT LEVEL 003 AS OF 04/03/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T824B2D      DATE 04/03/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
FSCSTAH  DS    CL8                                                              
FSCSTA   DS    CL7      5   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   52    1  A  P N             T        Y              
FSCCPPH  DS    CL8                                                              
FSCCPP   DS    CL9      7    2    9  A  P N             T        Y              
FSCCMPH  DS    CL8                                                              
FSCCMP   DS    CL11     7   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   65   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   31   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   65   11  A  U N             T        Y              
FSCLSTH  DS    CL8                                                              
FSCLST   DS    CL1     20   14    1  A  U N             T        Y              
FSCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
FSCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1096 BYTES                            
