*          DATA SET REBASB3D   AT LEVEL 003 AS OF 04/03/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T824B3D      DATE 04/03/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
OTMSTAH  DS    CL8                                                              
OTMSTA   DS    CL7      5   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   52    1  A  P N             T        Y              
OTMOFFH  DS    CL8                                                              
OTMOFF   DS    CL6      7    6    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   35    4  A  P N             T        Y              
OTMOF1H  DS    CL8                                                              
OTMOF1   DS    CL2      8    8    2  A  U N             T        Y              
OTMOFNH  DS    CL8                                                              
OTMOFN   DS    CL20     8   12   20  A  P N             T        Y              
OTMTM1H  DS    CL8                                                              
OTMTM1   DS    CL2      8   36    2  A  U N             T        Y              
OTMTMNH  DS    CL8                                                              
OTMTMN   DS    CL21     8   40   21  A  P N             T        Y              
OTMOF2H  DS    CL8                                                              
OTMOF2   DS    CL2      9    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     9   12   20  A  P N             T        Y              
OTMTM2H  DS    CL8                                                              
OTMTM2   DS    CL2      9   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     9   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    10   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    10   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    12   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    13   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    14   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    15   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    16   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    17   40   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   12   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   36    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    18   40   21  A  P N             T        Y              
OTMLSTH  DS    CL8                                                              
OTMLST   DS    CL1     19   14    1  A  U N             T        Y              
OTMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OTMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 928  BYTES                            
