*          DATA SET RECMTF8DD  AT LEVEL 009 AS OF 07/27/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F8D      DATE 07/27/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
CBIACTH  DS    CL8                                                              
CBIACT   DS    CL8      9   11    8  A   U    N         T        Y   10         
CBIACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   41    7  A   P    N         T        Y              
CBINUMH  DS    CL8                                                              
CBINUM   DS    CL8      9   50    8  A   U    N         T        Y   20         
CBINUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    N         T        Y              
CBIFLNH  DS    CL8                                                              
CBIFLN   DS    CL3     10   11    3  A   U    N         T        Y   30         
CBIFLNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    N         T        Y              
CBIFLTH  DS    CL8                                                              
CBIFLT   DS    CL58    11   11   58  A   U    N         T        Y   40         
CBIFLTX  DS    CL8                                                              
CBIFLT2H DS    CL8                                                              
CBIFLT2  DS    CL58    12   11   58  A   U    N         T        Y   40         
CBIFLT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A   P    N         T        Y              
CBICMB1H DS    CL8                                                              
CBICMB1  DS    CL7     15   18    7  A   P    N         T        Y   42         
CBICMB1X DS    CL8                                                              
CBICMB2H DS    CL8                                                              
CBICMB2  DS    CL7     15   32    7  A   P    N         T        Y   42         
CBICMB2X DS    CL8                                                              
CBICMB3H DS    CL8                                                              
CBICMB3  DS    CL7     15   46    7  A   P    N         T        Y   42         
CBICMB3X DS    CL8                                                              
CBICMB4H DS    CL8                                                              
CBICMB4  DS    CL7     15   60    7  A   P    N         T        Y   42         
CBICMB4X DS    CL8                                                              
CBIFLG1H DS    CL8                                                              
CBIFLG1  DS    CL3     16    2    3  A   P    N         T        Y              
CBIDAY1H DS    CL8                                                              
CBIDAY1  DS    CL11    16    7   11  A   U    N         T        Y   50         
CBIDAY1X DS    CL8                                                              
CBITIMH  DS    CL8                                                              
CBITIM   DS    CL12    16   22   12  A   U    N         T        Y   60         
CBITIMX  DS    CL8                                                              
CBITYPH  DS    CL8                                                              
CBITYP   DS    CL4     16   38    4  A   U    N         T        Y   70         
CBITYPX  DS    CL8                                                              
CBISPTSH DS    CL8                                                              
CBISPTS  DS    CL3     16   46    3  A   U    N         T        Y   80         
CBISPTSX DS    CL8                                                              
CBICOMH  DS    CL8                                                              
CBICOM   DS    CL26    16   52   26  A   U    N         T        Y  100         
CBICOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   P    N         T        Y              
CBIRAT1H DS    CL8                                                              
CBIRAT1  DS    CL7     17   18    7  A   U    N         T        Y   90         
CBIRAT1X DS    CL8                                                              
CBIRAT2H DS    CL8                                                              
CBIRAT2  DS    CL7     17   32    7  A   U    N         T        Y   90         
CBIRAT2X DS    CL8                                                              
CBIRAT3H DS    CL8                                                              
CBIRAT3  DS    CL7     17   46    7  A   U    N         T        Y   90         
CBIRAT3X DS    CL8                                                              
CBIRAT4H DS    CL8                                                              
CBIRAT4  DS    CL7     17   60    7  A   U    N         T        Y   90         
CBIRAT4X DS    CL8                                                              
CBIFLG2H DS    CL8                                                              
CBIFLG2  DS    CL3     18    2    3  A   P    N         T        Y              
CBIDAY2H DS    CL8                                                              
CBIDAY2  DS    CL11    18    7   11  A   U    N         T        Y   50         
CBIDAY2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18   22   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   38    4  A   U    N         T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     18   46    3  A   U    N         T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL26    18   52   26  A   U    N         T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   P    N         T        Y              
CBIRAT5H DS    CL8                                                              
CBIRAT5  DS    CL7     19   18    7  A   U    N         T        Y   90         
CBIRAT5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   32    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   46    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   60    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    20    7   11  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20   22   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     20   38    4  A   U    N         T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     20   46    3  A   U    N         T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL26    20   52   26  A   U    N         T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   18    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21   32    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21   46    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21   60    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    22    7   11  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    22   22   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     22   38    4  A   U    N         T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     22   46    3  A   U    N         T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL26    22   52   26  A   U    N         T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   18    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23   32    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23   46    7  A   U    N         T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23   60    7  A   U    N         T        Y   90         
         DS    CL8                                                              
CBIENDH  DS    CL8                                                              
CBIEND   DS    CL1     24    2    1  A   P    N         T        Y              
CBILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CBIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1504 BYTES                            
