*          DATA SET RECNTF6D   AT LEVEL 007 AS OF 05/06/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F6D      DATE 05/06/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14    12    2   14  A   P    N         T        Y              
BCPDATEH DS    CL8                                                              
BCPDATE  DS    CL18    12   18   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    13    2   31  A   P    N         T        Y              
BCPCCMTH DS    CL8                                                              
BCPCCMT  DS    CL1     13   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    14    2   30  A   P    N         T        Y              
BCPBCMTH DS    CL8                                                              
BCPBCMT  DS    CL1     14   34    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A   P    H         T        Y              
BCPTKFH  DS    CL8                                                              
BCPTKF   DS    CL10    15   18   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   42   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   54   10  A   U    N         T        Y              
BCPTKLH  DS    CL8                                                              
BCPTKL   DS    CL10    15   66   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   78    1  A   P    N         T        Y              
BCPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BCPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 272  BYTES                            
