*          DATA SET RECNTWR2K  AT LEVEL 062 AS OF 10/25/13                      
*                                                                               
***********************************************************************         
*                                                                     *         
*        RECNTWRK --- ERR & EXIT RTNS, ADDRESSES, COMMON STORAGE      *         
*                                                                     *         
* ------------------------------------------------------------------- *         
* NOTE: IOAREA AND RBUYREC REMAIN TO BE 1000 BYTES AFTER THE CONTRACT *         
*       AND OTHER IO AREAS WERE INCREASED TO 2000 BYTES. THIS WAS     *         
*       DONE TO PRESERVE ADDRESSIBILITY TO IOAREA, BUY AND CONTRACT.  *         
*                                                                     *         
* 12DEC11 BOB ADD REGENAUD TO RECORD LAYOUTS                          *         
* 11NOV11 SMY ADD STAOPT5 TO PRINT BUYLINE DEMO VALUES ON CONTRACTS   *         
* ??AUG03 MN  ADD IO AREAS FOR DARE RECORD READ AND AGENCY            *         
*             EQUIVALENCY RECORD READ                                 *         
* 26FEB98 SKU INCREASE RCONREC TO 6000 BYTES. ACTUAL PHYSICAL         *         
*             LIMIT IS 3976. THE 24 BYTES RESERVED FOR RECOVERY       *         
*             UPGRADE CODE IS LINKED WITH CONDITIONAL STATEMENTS      *         
* 07NOV97 JRD ELCODE+1 BECOMES BUCKET FLAGS FOR RECNT30/18/38/39      *         
* 03APR97 SKU DEFINE ELCODE IN WORK AREA, INSTEAD OF IN THE PROGRAM   *         
*             AREA FOR CORE-RESIDENT MODULES                          *         
* 13NOV95 SKU INCREASE RCONREC TO 2000 BYTES. ACTUAL PHYSICAL         *         
*             LIMIT IS 1976. THE 24 BYTES RESERVED FOR RECOVERY       *         
* 09JAN95 BU  ADD 'REGENMKG' RECORD                                   *         
* 01FEB94 BU  ADD 'REGENDSP' AND 'REGENDCT' RECORDS                   *         
* 02MAR93 SKU RENAMED FLTCNTL TO FLTCTRL TO AVOID CONFLICT.           *         
* 05FEB93 SKU ADD FLIGHT SORTING VARIABLES FOR REPORTING              *         
* 20JAN93 SKU ORG REGENOFF2 AND REGENAGY2 TO IOAREA                   *         
*             ADDED VARIABLES FOR MODS 18, 30, AND 38. (BU)           *         
* 06JAN93 SKU CHANGE SAVED DISK ADDRESS TO SAVED KEY FOR              *         
*             COMBO SINCE DA MAY CHANGE                               *         
* 15DEC92 SKU ADD SAVED COMBO SUPPORT VARIABLES                       *         
*             MOVE USECOMBO TO COMMON STORAGE                         *         
* 21OCT92 SKU ADD SWITCH TO TURN COMBO SUPPORT ON OR OFF              *         
* 18MAY92 SKU FIX MYP DSECT                                           *         
* 28APR92 SKU ADD SVCATADV FOR SAVING ADV CAT CODE                    *         
* 08APR92 SKU ADD ADDRESS FOR REGENDAY AND MEDGET                     *         
* 31MAR92 SKU ADD SVKVER, SVSENF TO CHECK CAN/DEL IN T80215           *         
* 13MAR92 SKU ADD SVCAT FOR PRODUCT LOCK ROUTINE IN T80210            *         
* 23JAN92 SKU ADD SVADV AND SVPRD FOR PRODUCT LOCK ROUTINE IN T80210  *         
* 19NOV91 SKU ALLOCATE ADDRESS FOR REGENSTC                           *         
* 10OCT91 SKU ADD IO4 AND ORG OCM AND CMT TO IO4                      *         
* 03APR90 EFJ ADD TOMBSTONE.  ADD LOCAL GETEL & ELCODE                *         
*                                                                     *         
***********************************************************************         
*                                                                               
*              EXIT ROUTINES                                                    
         SPACE 1                                                                
EXXMOD   DC    0H'0'                                                            
         XMOD1 1                                                                
         SPACE 1                                                                
EXIT     DC    0H'0'                                                            
         OI    6(R2),X'40'         INSERT CURSOR AND RETURN SCREEN              
         GOTO1 VEXIT                                                            
         SPACE 1                                                                
ERROR    DC    0H'0'                                                            
         GOTO1 VERROR                                                           
         EJECT                                                                  
         GETEL R6,34,ELCODE                                                     
         DS    X                   THIS WAS ELCODE. IT'S BEEN MOVED TO          
*                                  GENOLD DSECT TO BYPASS NON-REENTRANT         
*                                  PROBLEMS FOR CORE-RES MODULES.               
MYSPACES DC    60C' '                                                           
         DS    0H                                                               
PATCH    DS    CL30                                                             
         SPACE 1                                                                
       ++INCLUDE FLDIND                                                         
         EJECT                                                                  
ACTERR   EQU   75                  CONTRACT ACTION INVALID                      
BACERR   EQU   76                  BUY ACTION INVALID                           
AGYERR   EQU   152                 AGENCY INVALID                               
AOFERR   EQU   77                  AGENCY OFFICE INVALID                        
ADVERR   EQU   153                 ADVERTISER INVALID                           
STAERR   EQU   150                 STATION INVALID                              
PRDERR   EQU   109                 PRODUCT INVALID                              
SALERR   EQU   154                 SALESMAN INVALID                             
OFFERR   EQU   151                 REP OFFICE INVALID                           
RTGERR   EQU   78                  RATING SERVICE INVALID                       
SDTERR   EQU   79                  START DATE INVALID                           
EDTERR   EQU   80                  END DATE INVALID                             
CHGERR   EQU   81                  FIELD CANNOT BE CHANGED                      
CONERR   EQU   82                  CONTRACT NUMBER NOT FOUND                    
DAYERR   EQU   83                  DAY FIELD INVALID                            
TIMERR   EQU   84                  TIME FIELD INVALID                           
LENERR   EQU   85                  LENGTH INVALID                               
SDYERR   EQU   86                  START DAY AND DATE NOT EQUAL                 
EDYERR   EQU   87                  END DAY AND DATE NOT EQUAL                   
NPWERR   EQU   88                  NUMBER PER WEEK INVALID                      
RATERR   EQU   89                  RATE INVALID                                 
BUYERR   EQU   90                  BUY NOT FOUND                                
KDTERR   EQU   91                  CONTRACT DATES OVERLAP BUY DATES             
MGDERR   EQU   92                  MAKE-GOOD FORMAT = MG=MMMDD-N(LINE)          
RESERR   EQU   95                  INVALID RESET FUNCTION                       
RE2ERR   EQU   96                  NO DOUBLE RESET                              
RE3ERR   EQU   97                  K ADDED TODAY OR ALREADY CHANGED             
CATERR   EQU   98                  CATEGORY ERROR                               
KEYERR   EQU   99                  NO KEY CHANGES AFTER 15 DAYS                 
MGNERR   EQU   42                  MISSED LINE NOT FOUND                        
MGLERR   EQU   43                  MG= VALID ONLY IN FIRST COMMENT              
SECERR   EQU   44                  VALID SECTIONS = 1-99                        
BIASSEC  EQU   419                 BIAS SECTION: 2 CHARS NUMERIC                
MGRERR   EQU   45                  MAKE-GOOD RATES MUST BE ZERO                 
MG1ERR   EQU   46                  MUST DELETE MAKE-GOODS FIRST                 
MG2ERR   EQU   47                  MISSED DATE INVALID                          
MG3ERR   EQU   104                 MG MISSED SPOTS = MG=JAN15-1(5)              
PLNERR   EQU   48                  PLAN MUST BE 3 NUMERIC OR 3 ALPHA            
CALERR   EQU   49                  K DATES MUST NOT EXCEED CALENDAR YR          
BUCERR   EQU   100                 K DATES MUST OVERLAP WEEKLY BUCKETS          
DELERR   EQU   103                 HISTORICAL DATA OR BUYS EXIST FOR K          
MAXERR   EQU   93                  MAXIMUM BUY LINES EXCEEDED                   
AODERR   EQU   94                  MULTI-OFFICE AGENCIES REQUIRE OFFICE         
INVINP   EQU   2                   INVALID INPUT FIELD                          
PCTERR   EQU   213                 PCTS TOTAL MORE THAN 100                     
BLNKERR  EQU   214                 ONLY I BLANK FLD ALLOWED                     
BALERR   EQU   215                 AMTS DONT TOT RIGHT                          
PTOTERR  EQU   216                 NO PCT IN TOT                                
MONERR   EQU   13                  INVALID MONTH                                
SPLERR1  EQU   219                 DATA CAN'T BE CHANGED                        
SPLERR2  EQU   220                 THIS MONTH ALREADY REPORTED                  
SPLERR3  EQU   221                                                              
COMERR   EQU   225                 EASI STA/AGY - COMMENT REQUIRED              
PDEMERR  EQU   243                 MUST DESIGNATE PRIMARY DEMO                  
BUD2BIG  EQU   388                 BUDGET FIELD TOO BIG                         
NODATAIN EQU   392                 DATA NOT PERMITTED FOR TYPE N CONS           
*                                     OR GEN/ZZ CONTRACTS                       
BUYORSPL EQU   409                 BUYS AND/OR SPL EXIST FOR CONTRACT           
DAREORDR EQU   434                 DARE ORDER PROHIBITS FIELD CHANGE            
ORDRAWIN EQU   443                 ORDER A WIN: NEED SPL VALUE                  
TRDINCSH EQU   867                 NO TRADE $ IN CASH ORDER                     
*                                                                               
* HARD CODE FOR NOW, WILL USE THMS WHEN WE GET A CHANCE                         
* SCAN FOR THE FOLLOWING EQUATE TO LINK BOOKS                                   
*                                                                               
DDSTMADJ EQU   6                   DDS TIME ADJUSTMENT                          
*                                                                               
         EJECT                                                                  
*              DSECT FOR WORK AREA                                              
         SPACE 1                                                                
GENOLD   DSECT                                                                  
DMWORK   DS    12D                                                              
WORK     DS    CL48                                                             
DMCB     DS    6F                                                               
DUB      DS    D                                                                
VTWA     DS    A                   A(TWA)                                       
VDEMOVAL DS    A                   A(DEMOVAL)                                   
VGTBROAD DS    A                   A(GETBROAD)                                  
*                                                                               
DATAMGR  DS    A                   V(DATAMGR)                                   
CALLOV   DS    A                   ONLINE=V(CALLOV)                             
GETMSG   DS    A                   V(GETMSG)                                    
GETTXT   DS    A                   V(GETTXT)                                    
         DS    A(0)                ONLINE=CSWITCH                               
HELLO    DS    A                   V(HELLO)                                     
SCANNER  DS    A                   V(SCANNER)                                   
UNSCAN   DS    A                   V(UNSCAN)                                    
HEXIN    DS    A                   V(HEXIN)                                     
HEXOUT   DS    A                   V(HEXOUT)                                    
CASHVAL  DS    A                   V(CASHVAL)                                   
DATVAL   DS    A                   V(DATVAL)                                    
DATCON   DS    A                   V(DATCON)                                    
         DS    A(0)                ONLINE=CTERMVAL                              
SCUNKEY  DS    A                   V(SCUNKEY)                                   
ADDAY    DS    A                   V(ADDAY)                                     
GETDAY   DS    A                   V(GETDAY)                                    
GETPROF  DS    A                                                                
PERVERT  DS    A                   V(PERVERT)                                   
GETFACT  DS    A                   V(GETFACT)                                   
XSORT    DS    A                   V(XSORT)                                     
REQTWA   DS    A                   V(REQTWA)                                    
         DS    A(0)                ONLINE=CSYSCON                               
         SPACE 1                                                                
VADDELEM DS    F                   A(ADD ELEMENT ROUTINE)                       
VDELELEM DS    F                   A(DELETE ELEMENT ROUTINE)                    
VMOVEREC DS    F                   A(MOVE RECORD ROUTINE)                       
VDISMSG  DS    F                   A(DISPLAY MESSAGE ROUTINE)                   
VFOUTBLK DS    F                   A(FOUT BLANKS ROUTINE)                       
VCHECKEL DS    F                   A(CHECK ELEMENT ROUTINE)                     
VGETMNDY DS    F                   A(GET MONDAY DATE ROUTINE)                   
VLOAD    DS    F                   V(LOAD A NEW OVERLAY ROUTINE)                
VLDSCRN  DS    F                   A(LOAD SCREEN ROUTINE)                       
VANY     DS    F                   V(ANY)                                       
VANY2    DS    F                   V(ANY2)                                      
VPACK    DS    F                   V(PACK)                                      
VMOVE    DS    F                   V(MOVE)                                      
VREAD    DS    F                   V(READ)                                      
VSEQ     DS    F                   V(SEQ)                                       
VHIGH    DS    F                   V(HIGH)                                      
VADD     DS    F                   V(ADD)                                       
VWRITE   DS    F                   V(WRITE)                                     
VGETREC  DS    F                   V(GETREC)                                    
VPUTREC  DS    F                   V(PUTREC)                                    
VADDREC  DS    F                   (V(ADDREC)                                   
VCKTAREQ DS    F                   V(CHECK FOR TURN-AROUND REQUEST)             
VERROR   DS    F                   V(ERROR)                                     
VEXIT    DS    F                   V(EXIT)                                      
VCLEAR   DS    F                   CLEAR HEADLINE FIELDS                        
VRECUP   DS    F                   V(RECUP)                                     
VREGENVR DS    F                   EXTERNAL ROUTINE A(REGENVER)                 
VGENDMV  DS    F                   V(REGENDMV)                                  
         SPACE 1                                                                
BASERB   DS    A                   BASE RB FOR BASE SUBROUTINES                 
BASER9   DS    A                                                                
BASERD   DS    A                                                                
         SPACE 1                                                                
AFACILS  DS    F                                                                
ACOMFACS DS    A                                                                
*                                                                               
AIOAREA  DS    A                                                                
AIO      DS    A                                                                
AIO2     DS    A                                                                
AIO3     DS    A                                                                
AIO4     DS    A                                                                
ASPULAR  DS    A                                                                
DATAMGR2 DS    A                   TEMP DATAMGR TO TRAP DUMP                    
AALTIO   DS    A                   = SPOOLAR + CONLENQ                          
*                                                                               
ELCODE   DS    X                   FOR ELEMENT PROCESSING                       
BUCKFLGS DS    X                   BUCKETING FLAGS                              
BUYFLAGS DS    X                   FLAGS FOR USE IN BUY MODULES                 
*                                  X'80'  =  CONTRACT IS 'TRADE'                
*                                     ALL BUYS MUST BE SET TO TRADE             
*                                  X'40'  =  CONTRACT IS 'CASH'                 
*                                     TV ORDER WITH CASH BUY FOUND              
*                                  (X'80'/X'40' MUST BE MUTUALLY                
*                                     EXCLUSIVE)                                
SVDEMFLG DS    XL1                 DEMO PRINT FLAG SAVEAREA                     
*                                  X'02' - DON'T PRINT DEMOS                    
*                                                                               
INTTYPE  DS    CL1                                                              
INTCONNO DS    CL4                                                              
INTREPNO DS    H                                                                
INTPAGNO DS    H                                                                
         DS    0F                                                               
WORK2    DS    CL240                                                            
CNSTDATE DS    CL2                                                              
CNENDATE DS    CL2                                                              
STARTKEY DS    CL27                                                             
LOWKEY   DS    CL27                                                             
HIGHKEY  DS    CL27                                                             
ENDKEY   DS    CL27                                                             
SVDXDA   DS    F                                                                
         ORG   CNSTDATE                                                         
WORK3    DS    CL240                                                            
         DS    C                   MYP-1                                        
MYP      DS    CL132               PRINT LINE                                   
STALIST  DS    CL37                                                             
STLNUM   DS    CL1                                                              
EMPBIT   DS    CL1                                                              
PUTBYTE  DS    CL1                                                              
PCTAMT   DS    F                                                                
SAVETOT  DS    F                                                                
MAXLNES  DS    CL1                 MAX LINES                                    
LNE      DS    CL1                 LINE CTR                                     
PG       DS    CL1                 PAGE CTR                                     
DMCB2    DS    6F                                                               
CONACT   DS    CL4                 CONTRACT ACTION                              
BUYACT   DS    CL3                 BUY ACTION                                   
BUYNUM   DS    CL3                 BUY NUMBER                                   
WSTAEXP  DS    CL20                STATION EXPANSION                            
WOFFEXP  DS    CL20                OFFICE                                       
WAGYEXP  DS    CL20                AGENCY                                       
WADVEXP  DS    CL20                ADVERTISER                                   
WSALEXP  DS    CL20                SALESMAN                                     
WPRDEXP  DS    CL20                PRODUCT                                      
         EJECT                                                                  
* LIST OF V TYPES FROM T80218                                                   
* USED BY T80217 AND T80222 FOR STEREO                                          
OUTDAY   DS    A                                                                
REGENPBY DS    A                                                                
REGENBUC DS    A                                                                
REGENTL2 DS    A                                                                
UNTIME   DS    A                                                                
BOOKVAL  DS    V                   RESOLVED IN T80280                           
CENTER   DS    V                   RESOLVED IN T80280                           
CHOPPER  DS    V                   RESOLVED IN T80280                           
DAYVAL   DS    V                   RESOLVED IN T80280                           
DEMCON   DS    V                   RESOLVED IN T80280                           
DEMEX    DS    V                   RESOLVED IN T80280                           
DEMOTAB  DS    V                   RESOLVED IN T80280                           
DEMVAL   DS    V                   RESOLVED IN T80280                           
DEMUP    DS    V                   RESOLVED IN T80280                           
SPOOL    DS    V                   RESOLVED IN T80280                           
SQUASHER DS    V                   RESOLVED IN T80280                           
TIMVAL   DS    V                   RESOLVED IN T80280                           
UNDAY    DS    V                   RESOLVED IN T80280                           
UNDERLIN DS    V                   RESOLVED IN T80280                           
TSAR     DS    A                                                                
         DS    2V                  SPARE                                        
UPVAL    DS    V                   RESOLVED IN T80280                           
UNBOOK   DS    V                   RESOLVED IN T80280                           
UNUPGR   DS    V                   RESOLVED IN T80280                           
OVRD     DS    V                   RESOLVED IN T80280                           
UNOVRD   DS    V                   RESOLVED IN T80280                           
TEXT     DS    V                   RESOLVED IN T80280                           
UNTEXT   DS    V                   RESOLVED IN T80280                           
*                                                                               
VREPFACS DS    V                   V(REPFACS) RESOLVED IN RECNT00               
AAUTOGEN DS    V                   A(AUTOGEN FIELD FILL ROUTINE)                
         SPACE 1                                                                
SAVAM    DS    CL4                 AM STATION OF -C STATION                     
SAVFM    DS    CL4                 FM STATION OF -C STATION                     
SENDTIME DS    F                   STANDARD TIME OF DAY OF SEND                 
TODAY    DS    CL3       B         TODAY'S DATE                                 
MONDATE  DS    CL2                 PACKED MONDAY WEEK DATE                      
SVSENF   DS    CL1                 SEND STATUS                                  
STAT2    DS    XL1                 X'80' BUY CHANGED-UPDATE VER OR MOD          
FRSTFLD  DS    A                   A(FIRST INPUT HEADER)                        
LASTFLD  DS    A                   A(LAST  INPUT HEADER)                        
NUMFLD   DS    H                   NUMBER OF INPUT FIELDS                       
AGYNUM   DS    CL1                 AGENCY NUMBER                                
         ORG   AGYNUM                                                           
ECFORMAT DS    CL1                 USED IN BUY EDIT MODULES, WHERE              
*                                     AGYNUM IS NOT NEEDED                      
REPALPHA DS    0CL2                                                             
AGYALPHA DS    CL2                 AGENCY ALPHA CODE                            
TERMNAL  DS    CL1                 TERMINAL NUMBER                              
DMINBTS  DS    CL1                 SET TO X'C0' BY INITL                        
DMOUTBTS DS    CL1                 SET TO X'FD' BY INITL                        
DMBYTE   DS    CL1                                                              
UPDATE   DS    CL1                                                              
BYTE     DS    CL1                 USED IN DATAMGR ERROR TESTS                  
BYTE2    DS    CL1                                                              
BYTE3    DS    CL1                                                              
BYTE4    DS    CL1                                                              
KEY      DS    CL32                                                             
KEYSAVE  DS    CL32                SET EQUAL TO KEY ON READ HIGH                
FILENAME DS    CL8                                                              
COMMAND  DS    CL6                                                              
FULL     DS    F                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
TEMP     DS    6F                  TEMPORARY STORAGE                            
TAREQ    DS    CL1                 TURN-AROUND REQUEST FLAG                     
UPVER    DS    CL1                 FLAG TO UP VERSION AND UN-CONFIRM            
DFLDH    DS    CL8                 DUMMY FIELD HEADER                           
DFLDD    DS    CL8                 DUMMY FIELD DATA                             
VREGENSC DS    A                   EXTERNAL ROUTINE A(REGENSTC)                 
SVADV    DS    CL4                 SAVES ADVERTISER/CAT/PRD CDE FOR PRD         
SVPRD    DS    CL3                 LOCK IN T80210                               
SVCAT    DS    CL2                 LOCK IN T80210, PRD CAT CODE                 
SVKVER   DS    X                   CONTRACT VERSION NUMBER (T80215)             
SVKSENF  DS    X                   CONTRACT SEND INFO (T80215)                  
VREGENDP DS    A                   EXTERNAL ROUTINE A(REGENDAY)                 
VMEDGET  DS    A                   EXTERNAL ROUTINE A(MEDGET)                   
SVCATADV DS    CL2                 ADV CAT CODE                                 
*                                                                               
LOCALVAR EQU   *                                                                
*                                                                               
* FOLLOWING USED IN RECNT01                                                     
*                                                                               
         DS    0F                  ALIGNMENT: DON'T REMOVE!!                    
         DS    F                   SPARE                                        
         DS    CL3                 SPARE                                        
*                                  X'80' NEED TO DELETE CFC COMMENT             
SASPADDS DS    CL1                 'ADDS' SASP USER FLAG TO CON10               
SVCNUM   DS    F                   SAVED COMBO K NUM (TWACNUM)                  
SVCOMBO  DS    XL36                SAVED 17 ELEMENT                             
CBSTAT   DS    X                   COMBO STATUS BITS                            
CANACT   EQU   X'02'               BUY ACTION IS CANCEL                         
*                                                                               
* FOLLOWING USED IN RECNT15                                                     
*                                                                               
BSTATUS  DS    CL1                 BUY STATUS                                   
*                                  X'80'=NO MEANING                             
*                                  X'40'=BUY CHANGED THIS VERSION               
RE17ORG  DS    0C                                                               
*                                                                               
A03ELT   DS    A                   A(03 ELT FOR MISSED SPOT)                    
SDATSPLT DS    CL16                START DATE WORK AREA                         
EDATSPLT DS    CL16                END  DATE WORK AREA                          
GENWRKAR DS    CL64                GENERAL WORKAREA                             
SAV03ELT DS    CL16                SAVE AREA FOR 03 ELT                         
SAV03EL2 DS    CL16                2ND SAVE AREA FOR 03 ELT                     
SAV03ORI DS    CL16                SAVE ORIGINAL 03 ELEMENT                     
SAVENDTE DS    CL3                 MOVING END DATE                              
SAVEDTNW DS    XL1                 SAVE NUMBER PER WEEK                         
ORIDEFLG DS    XL1                 OVERRIDE FLAG OF ORIGINAL 03 ELT             
ALTWKFLG DS    XL1                 ALTERNATING WEEK FLAG                        
FRSTWEEK DS    XL1                 ONE-TIME SWITCH                              
SAV56ORI DS    CL16                SAVE AREA FOR 56 ELEMENT                     
SAVCOMDT DS    CL3                 SAVE AREA: DATE OF INSERTED SPOT             
MG2NDATE DS    CL1                 2ND DATE WITHIN MG= STRING                   
SAVMGADR DS    A                   A(DELIMITER IN MG= STRING)                   
*                                                                               
         ORG   RE17ORG                                                          
*                                                                               
* FOLLOWING USED IN RECNT17                                                     
*                                                                               
SOPTIONS DS    X                   STATION OPTIONS                              
STAOPT7  EQU   X'80'               OPTION TO PRINT AGY, ADV AND TRAF #          
STAOPT5  EQU   X'40'               OPTION TO PRINT BUYLINE DEMO VALUES          
*                                    ON CONTRACTS                               
*                                                                               
STCMODE  DS    X                   REGENSC MODES                                
*                                                                               
PRTCMBPT DS    XL1                 PRINT COMBO POINTER, SO WE KNOW              
*                                    WHICH CONTRACT WE ARE READING              
         DS    A                   SPARE                                        
SVCOMBO2 DS    XL36                SAVES OFF 17 ELEMENT                         
*                                                                               
*   MISCELLANEOUS STORAGE FOR PASSIVE KEY GENERATION IN RECNT1E                 
*        REUSES FIELD SVCOMBO2.                                                 
         ORG   SVCOMBO2                                                         
ORIGBYCD DS    CL3                 ORIGINAL BUYLINE CODE                        
BYCDKEY  DS    CL27                SAVE SPACE FOR BUYLINE KEY                   
         DS    CL06                SPARE                                        
*                                                                               
*                                                                               
*   MISCELLANEOUS STORAGE FOR PASSIVE KEY GENERATION IN RECNT2A,3A,10           
*        REUSES FIELD SVCOMBO2.                                                 
         ORG   SVCOMBO2                                                         
*                                                                               
*        FIELDS FOR FINDING OLD PASSIVES                                        
*                                                                               
SAVSAL   DS    CL3                 SALESPERSON                                  
SAVDSL   DS    CL3                 DEVELOPMENTAL SALESPERSON                    
SAVTEM   DS    CL2                 TEAM                                         
SAVGRP   DS    CL2                 GROUP CODE                                   
SAVADV   DS    CL4                 ADVERTISER                                   
SAVDAT   DS    XL2                 FIRST OFFER DATE (COMPRESSED)                
SAVWIP   DS    XL1                 WIP STATUS                                   
SAVSTT   DS    XL1                 OFFER STATUS                                 
SAVDST   DS    XL1                 DARE STATUS                                  
         DS    CL17                SPARE                                        
*                                                                               
USECOMBO DC    C'Y'      Y/N       FLAG TO INDICATE COMBO ON/OFF USAGE          
*                                                                               
*                                                                               
*                                                                               
SVCONKEY DS    CL27                SAVED COMBO CONTRACT KEY IN 01               
SVBUYKEY DS    CL27                SAVED COMBO BUY KEY IN 01                    
SVCONKY2 DS    CL27                SAVE CONTRACT KEY IN 17                      
SVCNUM2  DS    F                   SAVED COMBO K NUM (TWACNUM) IN 17            
*                                                                               
* FOLLOWING USED IN RECNT18/30/38                                               
TRUFLAG  DS    CL1                 ADD 'EC' ELEMENT ON CONTRACT                 
*                                     REWRITE IF 'Y'                            
*                                                                               
* FOLLOWING USED IN RECNT63                                                     
FLTNDX   DS    X                   FLIGHTED BUY COUNTER                         
FLTNOW   DS    X                   CURRENT FLIGHT NUMBER                        
FLTCTRL  DS    X                   FLIGHT CONTROL INDICATOR                     
SAVASPL  DS    A                   A(SPL ELEMENT)                               
*                                                                               
* FOLLOWING USED IN RECNT51/4C                                                  
FLAGCOMS DS    X                   COMMENT CHANGED FLAG                         
*                                                                               
* FOLLOWING USED IN RECNT63                                                     
EST$$$   DS    F                   CONTRACT ESTIMATE $$ AMT                     
PCONSCOC DS    F                   STATION CON ORD COMMENT                      
PCONRCOC DS    F                   REP CON ORD COMMENT                          
PCONSPLC DS    F                   SPL COMMENT                                  
PCONCONC DS    F                   CONTRACT COMMENT                             
*                                                                               
* FOLLOWING USED IN RECNT70                                                     
*                                                                               
DAYTABLE DS    14F                 FOUR BYTES PER MONTH                         
*                                  BYTES 1-2  =  DATE: YM                       
*                                  BYTES 3-4 =  # DAYS W/IN MONTH               
NEW23ELT DS    XL10                                                             
TOTDAYS  DS    F                   TOTAL DAYS IN FLIGHT                         
CYCLEDAT DS    CL6                 WORK SPACE FOR DATES                         
DAYCOUNT DS    CL13                TWELVE ONE-BYTE MONTH FIELDS                 
*                                     PLUS DELIMITER                            
* FOLLOWING USED IN RECNT17, POINT PERSON NAME USED IN ALL WRKSHEETS            
*                                                                               
KPRTOPTS DS    X                   CONTRACT OR FAX COPY                         
KPRTOPFX EQU   X'80'               FAX HEADER                                   
WPTPEXP  DS    CL20                POINT PERSON NAME                            
WPTPPH#  DS    CL20                POINT PERSON PHONE NUMBER                    
SVDAIN30 DS    F                   DISK ADDRESS USED IN RECNT30                 
COVERFLG DS    X                   COVERSHEET PRINTING FLAGS                    
*        X'80' AUTOFORMAT FLAG                                                  
*        X'40' COVERSHEET PRINTED                                               
APRTCOV  DS    A                   A(REPRTCOV) FOR WORKSHEETS ONLY              
SVHEADCD DS    X                   SAVE HEADLINE CODE TO RESTORE                
*                                                                               
LOCALVX  EQU   *-LOCALVAR                                                       
*                                                                               
*                                                                               
         DS    CL(375-LOCALVX)     SPARE                                        
*                                                                               
         ORG   LOCALVAR                                                         
*                                                                               
*        SECTION TO PROVIDE LOCAL STORAGE FOR MAKEGOOD MODULES                  
MGDATTIM DS    CL4                 DATE/TIME FOR M/G KEY                        
MGWORK   DS    12D                 IO WORK AREA                                 
AMGIO    DS    A                   A(MG IO AREA)                                
ADDORSEL DS    CL1                 A  =  ADD ACTION                             
*                                  S  =  SELECT ACTION                          
NEXTBUYL DS    XL1                 NEXT BUY LINE #                              
LINECNTR DS    XL1                 LINE COUNTER FOR DUMP CONTROL                
MGSTOR#0 DS    A                   A(AVAILABLE MG RECD STORAGE AREA)            
MGSTOR#1 DS    A                   A(1ST MG REC STOR AREA)                      
MGSTOR#2 DS    A                   A(2ND MG REC STOR AREA)                      
MGSTOR#3 DS    A                   A(3RD MG REC STOR AREA)                      
*                                                                               
OFFRDISP DS    F                   OFFER DISPLACEMENT:  1ST SET, ETC            
MGTOTSPT DS    F                   MG'S TOTAL SPOTS                             
MGTOTWKS DS    F                   MG'S TOTAL WEEKS                             
ELTBILD  DS    CL64                ALTERNATE ELEMENT BUILD AREA                 
LASTDTTM DS    CL4                 GROUP CODE DATE/TIME                         
LASTLINS DS    CL2                 MASTER/MAKEGOOD LINE #S                      
SAVMGKEY DS    CL27                KEY SAVE AREA                                
SV20ELTS DS    CL60                SAVE AREA FOR 3X20 ELTS                      
SAVKEYWK DS    CL27                ADDITIONAL KEYSAVE AREA                      
CHOYSCTR DS    X                   CHOICE COUNTER                               
DAYTMCTR DS    X                   DAY/TIME ELEMENT COUNTER                     
DAYTMFLG DS    X                   DAY/TIME VALIDATION FLAG                     
*                                  0  =  BOTH FIELDS ENTERED                    
*                                  1  =  NEITHER FIELD ENTERED:                 
*                                     COPY 02 ELTS FROM ORIG REC                
*                                  2  =  SEED ELTS FROM ORIG ORDER              
*                                     NO DAYS  ENTERED                          
*                                  3  =  SEED ELTS FROM ORIG ORDER              
*                                     NO TIMES ENTERED                          
*                                  8  =  ERROR IN TIME FIELD                    
*                                  9  =  ERROR IN DAY  FIELD                    
REDISPIT DS    X                   REDISPLAY FLAG                               
ADYTMELT DS    A                   A(DAYTIME ELT IN PROGRESS)                   
AORIGBUY DS    A                   A(ORIGINAL BUY)                              
ANOTHER1 DS    CL1                 X'00' = NO ADDITIONAL MISSED DATE            
*                                  X'01' = ANOTHER MISSED DATE                  
*                                  X'02' = MG OFFER BUY NUMBER ASSIGNED         
X04FLAG  DS    CL1                 0 = 1ST MISSED DATE IN STRING                
*                                  1 = 2ND THROUGH N                            
TESTCTR2 DS    XL1                                                              
         DS    CL1                 SPARE                                        
         ORG   WORK2+120                                                        
ELTBILD2 DS    CL64                ALTERNATE ELEMENT BUILD AREA2                
AELTBILD DS    A                   POINTER WITHIN ELTBILD2                      
AMISSED  DS    A                   POINTER WITHIN MISSED DATE STRING            
         ORG                                                                    
IOAREA   DS    0D                  45 DOUBLE WORDS SO FAR                       
*              FOLLOWING RECORDS ORG TO IOAREA                                  
*              REGENSTA                                                         
*              REGENREPA                                                        
*              REGENOFF                                                         
*              REGENAGY                                                         
*              REGENADV                                                         
*              REGENSAL                                                         
*              REGENPRD                                                         
*              REGENCTG                                                         
*              REGENEOM                                                         
*              REGENEOP                                                         
*              REGENDSP                                                         
*              REGENDCT                                                         
       ++INCLUDE REGENSTA                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENREPA                                                      
         ORG   IOAREA                                                           
       ++INCLUDE REGENOFF                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENOFF2                                                      
         ORG   IOAREA                                                           
       ++INCLUDE REGENAGY                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENAGY2                                                      
         ORG   IOAREA                                                           
       ++INCLUDE REGENADV                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENEDI                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENSAL                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENPRD                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENCTG                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENPTP                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENCTY                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENEOM                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENEOP                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENDSP                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENDCT                                                       
*                                                                               
         ORG   IOAREA+1008                                                      
*              REGENBUY                BUY RECORD                               
         DS    0D                                                               
       ++INCLUDE REGENBUY                                                       
         ORG   RBUYREC                                                          
*              REGENAUD                AUDIT COMMENTS RECORDS                   
         DS    0D                                                               
       ++INCLUDE REGENAUD                                                       
         ORG   RBUYREC                                                          
*              REGENMKG                MAKEGOOD RECORD (SHADOW BUY)             
         ORG   RBUYREC                                                          
       ++INCLUDE REGENMKG                                                       
*MN                                                                             
         ORG   RBUYREC                                                          
       ++INCLUDE REGENDRO                                                       
*MN                                                                             
*              REGENCON                CONTRACT RECORD                          
         ORG   RBUYREC+1008                                                     
CONIO    DS    0D                                                               
*                                                                               
       ++INCLUDE REGENCON                                                       
***********************************************************************         
*** THIS AREA SETS CONTRACT AT MAXIMUM 6000 BYTES, ACTUAL LIMIT IS ****         
*** 3976 AS SET BY DDHELEN                                         ****         
***********************************************************************         
CONLENQ  EQU   6000                                                             
         ORG   RCONREC+CONLENQ+8                                                
         DS    0D                                                               
IO2      DS    CL(CONLENQ)                                                      
IO3      DS    CL(CONLENQ)                                                      
IO4      DS    CL(CONLENQ)             USE BY REGENSTC                          
SPOOLAR  DS    CL(2*CONLENQ)                                                    
         ORG   SPOOLAR+CONLENQ                                                  
ALTIO    DS    CL(CONLENQ)                                                      
         SPACE 2                                                                
GENOLDX  EQU   *                                                                
         EJECT                                                                  
*** DATA FROM REAVLWRKD                                                         
         ORG   WORK2                                                            
INTLINNO DS    H                                                                
         SPACE 1                                                                
PARAS    DS    6F                                                               
ASPOOLD  DS    A                                                                
DMSOURCE DS    CL1                                                              
DMFILE   DS    CL1                                                              
OPTION   DS    CL1                                                              
MAX      DS    CL1                                                              
ACTUAL   DS    CL2                                                              
DMCOM    DS    CL1                                                              
PAVMEDIA DS    CL1                                                              
BOOKS    DS    CL18                                                             
DEMOS    DS    CL24                                                             
NUMBOOKS DS    CL1                                                              
NUMDEMOS DS    CL1                                                              
ACTSTAT  DS    CL5                                                              
ION      DS    CL1                                                              
PLANRATE DS    CL4                                                              
RATE     DS    CL4                                                              
SECS     DS    CL1                                                              
PLANWKS  DS    CL1                                                              
PLANPW   DS    CL1                                                              
DETWKS   DS    CL1                                                              
DETPW    DS    CL1                                                              
         SPACE 1                                                                
AANY     DS    A                                                                
AHIGH    DS    A                                                                
ASEQ     DS    A                                                                
AREAD    DS    A                                                                
AGETREC  DS    A                                                                
         SPACE 1                                                                
ATIA     DS    A                                                                
DAMAJOR  DS    CL4                                                              
PQOPEN   DS    A                                                                
         SPACE 1                                                                
SAVERB   DS    A                                                                
SAVERD   DS    A                                                                
         SPACE 2                                                                
*              DEDBLOCK                                                         
DBLOCKD  DSECT                                                                  
       ++INCLUDE DEDBLOCK                                                       
         EJECT                                                                  
       ++INCLUDE RECNTWA                                                        
         EJECT                                                                  
       ++INCLUDE RECNTPROF         PROFILE EQUATES                              
       ++INCLUDE REPFACSQ          REPFACS EQUATES                              
       ++INCLUDE REPTABSQ          REPTABS EQUATES                              
