*          DATA SET RECNTD3D   AT LEVEL 003 AS OF 01/15/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802D3D      DATE 01/15/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
STESTRTH DS    CL8                                                              
STESTRT  DS    CL78     2    2   78  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL78     3    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78     4    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78     5    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78     6    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78     7    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78     8    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  U N             T        Y              
STELLINH DS    CL8                                                              
STELLIN  DS    CL78    24    2   78  A  U N             T        Y              
STELAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
STEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1984 BYTES                            
