*          DATA SET RECNTC5D   AT LEVEL 002 AS OF 09/08/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802C5D      DATE 09/08/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      9    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   31    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      9   35    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   45    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11     9   49   11  A  P H             T        Y              
MLBDEM1H DS    XL8                                                              
MLBDEM1  DS    CL7      9   72    7  A  P H             T        Y              
MLBMFL1H DS    XL8                                                              
MLBMFL1  DS    CL3     10    1    3  A  P H             T        Y              
MLBMDTSH DS    XL8                                                              
MLBMDTS  DS    CL25    10    5   25  A  U N             T        Y              
MLBMSPTH DS    XL8                                                              
MLBMSPT  DS    CL3     10   31    3  N  U N             T        Y              
MLBMRATH DS    XL8                                                              
MLBMRAT  DS    CL9     10   35    9  A  U N             T        Y              
MLBMLN#H DS    XL8                                                              
MLBMLN#  DS    CL3     10   45    3  N  U N             T        Y              
MLBMTMSH DS    XL8                                                              
MLBMTMS  DS    CL15    10   49   15  A  U N             T        Y              
MLBMDEMH DS    XL8                                                              
MLBMDEM  DS    CL8     10   72    8  A  U N             T        Y  255         
MLBMDEMX DS    XL8                                                              
MLBMGN1H DS    XL8                                                              
MLBMGN1  DS    CL3     11    2    3  A  P N             T        Y              
MLBOPGNH DS    XL8                                                              
MLBOPGN  DS    CL17    11    6   17  A  U N             T        Y              
MLBMFC1H DS    XL8                                                              
MLBMFC1  DS    CL3     11   24    3  A  P N             T        Y              
MLBMCMTH DS    XL8                                                              
MLBMCMT  DS    CL43    11   28   43  A  U N             T        Y              
MLBMFL2H DS    XL8                                                              
MLBMFL2  DS    CL3     12    1    3  A  P H             T        Y              
MLBMDT2H DS    XL8                                                              
MLBMDT2  DS    CL25    12    5   25  A  U N             T        Y              
MLBMSP2H DS    XL8                                                              
MLBMSP2  DS    CL3     12   31    3  N  U N             T        Y              
MLBMRT2H DS    XL8                                                              
MLBMRT2  DS    CL9     12   35    9  A  U N             T        Y              
MLBMLN2H DS    XL8                                                              
MLBMLN2  DS    CL3     12   45    3  N  U N             T        Y              
MLBMTM2H DS    XL8                                                              
MLBMTM2  DS    CL15    12   49   15  A  U N             T        Y              
MLBODE2H DS    XL8                                                              
MLBODE2  DS    CL8     12   72    8  A  U N             T        Y  255         
MLBODE2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    13    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   24    3  A  P N             T        Y              
MLBMFC2H DS    XL8                                                              
MLBMFC2  DS    CL43    13   28   43  A  U N             T        Y              
MLBMFL3H DS    XL8                                                              
MLBMFL3  DS    CL3     14    1    3  A  P H             T        Y              
MLBMDT3H DS    XL8                                                              
MLBMDT3  DS    CL25    14    5   25  A  U N             T        Y              
MLBMSP3H DS    XL8                                                              
MLBMSP3  DS    CL3     14   31    3  N  U N             T        Y              
MLBMRT3H DS    XL8                                                              
MLBMRT3  DS    CL9     14   35    9  A  U N             T        Y              
MLBMLN3H DS    XL8                                                              
MLBMLN3  DS    CL3     14   45    3  N  U N             T        Y              
MLBMTM3H DS    XL8                                                              
MLBMTM3  DS    CL15    14   49   15  A  U N             T        Y              
MLBODE3H DS    XL8                                                              
MLBODE3  DS    CL8     14   72    8  A  U N             T        Y  255         
MLBODE3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    15    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   24    3  A  P N             T        Y              
MLBMFC3H DS    XL8                                                              
MLBMFC3  DS    CL43    15   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17    5   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     17   31    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17   35    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     17   45    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     17   49    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17   65    4  A  P H             T        Y              
MLBDEM2H DS    XL8                                                              
MLBDEM2  DS    CL8     17   72    8  A  P H             T        Y  255         
MLBDEM2X DS    XL8                                                              
MLBBFL1H DS    XL8                                                              
MLBBFL1  DS    CL3     18    1    3  A  P H             T        Y              
MLBBDTSH DS    XL8                                                              
MLBBDTS  DS    CL25    18    5   25  A  U N             T        Y              
MLBBSPTH DS    XL8                                                              
MLBBSPT  DS    CL3     18   31    3  N  U N             T        Y              
MLBBRATH DS    XL8                                                              
MLBBRAT  DS    CL9     18   35    9  A  U N             T        Y              
MLBBLENH DS    XL8                                                              
MLBBLEN  DS    CL3     18   45    3  N  U N             T        Y              
MLBBDYSH DS    XL8                                                              
MLBBDYS  DS    CL15    18   49   15  A  U N             T        Y              
MLBBTMSH DS    XL8                                                              
MLBBTMS  DS    CL15    18   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
MLBBPN1H DS    XL8                                                              
MLBBPN1  DS    CL17    19    6   17  A  U N             T        Y              
MLBBFC1H DS    XL8                                                              
MLBBFC1  DS    CL3     19   24    3  A  P N             T        Y              
MLBBCMTH DS    XL8                                                              
MLBBCMT  DS    CL43    19   28   43  A  U N             T        Y              
MLBBDEMH DS    XL8                                                              
MLBBDEM  DS    CL8     19   72    8  A  U N             T        Y  255         
MLBBDEMX DS    XL8                                                              
MLBBFL2H DS    XL8                                                              
MLBBFL2  DS    CL3     20    1    3  A  P H             T        Y              
MLBBDT2H DS    XL8                                                              
MLBBDT2  DS    CL25    20    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   45    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   49   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
MLBBPN2H DS    XL8                                                              
MLBBPN2  DS    CL17    21    6   17  A  U N             T        Y              
MLBBFC2H DS    XL8                                                              
MLBBFC2  DS    CL3     21   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43    21   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   72    8  A  U N             T        Y  255         
         DS    XL8                                                              
MLBBFL3H DS    XL8                                                              
MLBBFL3  DS    CL3     22    1    3  A  P H             T        Y              
MLBBDT3H DS    XL8                                                              
MLBBDT3  DS    CL25    22    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   45    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22   49   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    23    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43    23   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   72    8  A  U N             T        Y  255         
         DS    XL8                                                              
MLBPFLNH DS    XL8                                                              
MLBPFLN  DS    CL78    24    2   78  A  P N             T        Y              
MLBLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MLBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
