*          DATA SET RECNTE2D   AT LEVEL 004 AS OF 11/03/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802E2D      DATE 11/03/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MO2STRTH DS    CL8                                                              
MO2STRT  DS    CL6     12    2    6  A  P N             T        Y              
MO2STA1H DS    CL8                                                              
MO2STA1  DS    CL10    12   11   10  A  P N             T        Y   10         
MO2STA1X DS    CL8                                                              
MO2STA2H DS    CL8                                                              
MO2STA2  DS    CL10    12   29   10  A  P N             T        Y   10         
MO2STA2X DS    CL8                                                              
MO2STA3H DS    CL8                                                              
MO2STA3  DS    CL10    12   47   10  A  P N             T        Y   10         
MO2STA3X DS    CL8                                                              
MO2STA4H DS    CL8                                                              
MO2STA4  DS    CL10    12   65   10  A  P N             T        Y   10         
MO2STA4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    20   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    20   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    20   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    21   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    21   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    21   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    22   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    22   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    22   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     23    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    23   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    23   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    23   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    24   11   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    24   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    24   47   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    24   65   10  A  P N             T        Y   10         
         DS    CL8                                                              
MO2LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MO2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1544 BYTES                            
