*          DATA SET RECNTFEDS  AT LEVEL 009 AS OF 05/19/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802FED      DATE 05/19/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
BUYDAYSH DS    CL8                                                              
BUYDAYS  DS    CL60    12   11   60  A  U N             T        Y   10         
BUYDAYSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
BUYTIMSH DS    CL8                                                              
BUYTIMS  DS    CL60    13   11   60  A  U N             T        Y   20         
BUYTIMSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
BUYLENH  DS    CL8                                                              
BUYLEN   DS    CL8     14   11    8  A  U N             T        Y   30         
BUYLENX  DS    CL8                                                              
BUYXDAYH DS    CL8                                                              
BUYXDAY  DS    CL7     14   72    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
BUYDTESH DS    CL8                                                              
BUYDTES  DS    CL60    15   11   60  A  U N             T        Y   40         
BUYDTESX DS    CL8                                                              
BUYDTE2H DS    CL8                                                              
BUYDTE2  DS    CL60    16   11   60  A  U N             T        Y   40         
BUYDTE2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17    2    4  A  P N             T        Y              
BUYTYPH  DS    CL8                                                              
BUYTYP   DS    CL2     17   11    2  A  U N             T        Y   50         
BUYTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17   15    3  A  P N             T        Y              
BUYDPTH  DS    CL8                                                              
BUYDPT   DS    CL1     17   21    1  A  U N             T        Y   55         
BUYDPTX  DS    CL8                                                              
BUYCLSPH DS    CL8                                                              
BUYCLSP  DS    CL3     17   25    3  A  P N             T        Y              
BUYCLSH  DS    CL8                                                              
BUYCLS   DS    CL9     17   31    9  A  U N             T        Y   60         
BUYCLSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17   42    4  A  P N             T        Y              
BUYSECH  DS    CL8                                                              
BUYSEC   DS    CL8     17   49    8  A  U N             T        Y   70         
BUYSECX  DS    CL8                                                              
BUYPLNLH DS    CL8                                                              
BUYPLNL  DS    CL4     17   60    4  A  P N             T        Y              
BUYPLNH  DS    CL8                                                              
BUYPLN   DS    CL8     17   67    8  A  U N             T        Y   80         
BUYPLNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
BUYNPWH  DS    CL8                                                              
BUYNPW   DS    CL8     18   11    8  A  U N             T        Y   90         
BUYNPWX  DS    CL8                                                              
BUYCMBSH DS    CL8                                                              
BUYCMBS  DS    CL6     18   31    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   51    6  A  P N             T        Y              
BUYCMBLH DS    CL8                                                              
BUYCMBL  DS    CL6     18   61    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
BUYRATEH DS    CL8                                                              
BUYRATE  DS    CL9     19   11    9  A  U N             T        Y  100         
BUYRATEX DS    CL8                                                              
BUYCBC1H DS    CL8                                                              
BUYCBC1  DS    CL8     19   30    8  A  U N             T        Y  105         
BUYCBC1X DS    CL8                                                              
BUYCBC2H DS    CL8                                                              
BUYCBC2  DS    CL8     19   40    8  A  U N             T        Y  105         
BUYCBC2X DS    CL8                                                              
BUYCBC3H DS    CL8                                                              
BUYCBC3  DS    CL8     19   50    8  A  U N             T        Y  105         
BUYCBC3X DS    CL8                                                              
BUYCBC4H DS    CL8                                                              
BUYCBC4  DS    CL8     19   60    8  A  U N             T        Y  105         
BUYCBC4X DS    CL8                                                              
BUYCOMTH DS    CL8                                                              
BUYCOMT  DS    CL7     20    2    7  A  P N             T        Y              
BUYCOM1H DS    CL8                                                              
BUYCOM1  DS    CL60    20   11   60  A  U N             T        Y  110         
BUYCOM1X DS    CL8                                                              
BUYCOM2H DS    CL8                                                              
BUYCOM2  DS    CL60    21   11   60  A  U N             T        Y  110         
BUYCOM2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
BUYORDCH DS    CL8                                                              
BUYORDC  DS    CL60    22   11   60  A  U N             T        Y  120         
BUYORDCX DS    CL8                                                              
BUYMODH  DS    CL8                                                              
BUYMOD   DS    CL2     22   73    2  A  P N             T        Y              
BUYFLTH  DS    CL8                                                              
BUYFLT   DS    CL3     22   76    3  A  P N             T        Y              
BUYORD2H DS    CL8                                                              
BUYORD2  DS    CL60    23   11   60  A  U N             T        Y  120         
BUYORD2X DS    CL8                                                              
BUYNOTLH DS    CL8                                                              
BUYNOTL  DS    CL9     24    2    9  A  P Z             T        Y              
BUYNOTH  DS    CL8                                                              
BUYNOT   DS    CL15    24   12   15  A  P N             T        Y              
BUYUPTLH DS    CL8                                                              
BUYUPTL  DS    CL14    24   30   14  A  P Z             T        Y              
BUYUPTH  DS    CL8                                                              
BUYUPT   DS    CL1     24   46    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   75    1  A  U N             T        Y              
BUYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BUYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1240 BYTES                            
