*          DATA SET RECNTECD   AT LEVEL 006 AS OF 10/14/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802ECD      DATE 10/14/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
HISPRD1H DS    XL8                                                              
HISPRD1  DS    CL4     12    8    4  A  U N             T        Y   10         
HISPRD1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     12   15    5  A  P N             T        Y              
HISPRD2H DS    XL8                                                              
HISPRD2  DS    CL4     12   21    4  A  U N             T        Y   20         
HISPRD2X DS    XL8                                                              
HISLIN1H DS    XL8                                                              
HISLIN1  DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
HISPROFH DS    XL8                                                              
HISPROF  DS    CL79    23    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    24    2   79  A  P N             T        Y              
HISLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
HISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1120 BYTES                            
