*          DATA SET RECNTF2DS  AT LEVEL 006 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F2D      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MCHOLDDH DS    CL8                                                              
MCHOLDD  DS    CL7     12    2    7  A  P N             T        Y              
MCHOLDNH DS    CL8                                                              
MCHOLDN  DS    CL4     12   11    4  A  U N             T        Y   10         
MCHOLDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13    2    4  A  P N             T        Y              
MCHBUYSH DS    CL8                                                              
MCHBUYS  DS    CL8     13   11    8  A  U N             T        Y   20         
MCHBUYSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
MCHNEWDH DS    CL8                                                              
MCHNEWD  DS    CL7     15    2    7  A  P N             T        Y              
MCHNEWNH DS    CL8                                                              
MCHNEWN  DS    CL6     15   11    6  A  U N             T        Y   30         
MCHNEWNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
MCHFLTH  DS    CL8                                                              
MCHFLT   DS    CL60    16   11   60  A  U N             T        Y   40         
MCHFLTX  DS    CL8                                                              
MCHTABH  DS    CL8                                                              
MCHTAB   DS    CL1     17   11    1  A  U N             T        Y   50         
MCHTABX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
MCHERR1H DS    CL8                                                              
MCHERR1  DS    CL78    20    2   78  A  P N             T        Y              
MCHERR2H DS    CL8                                                              
MCHERR2  DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A  P N             T        Y              
MCHLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MCHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 448  BYTES                            
