*          DATA SET RECNTC2D   AT LEVEL 011 AS OF 04/07/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802C2D      DATE 04/07/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL14     9    5   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   31    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   35    3  A  P H             T        Y              
MGPDEM1H DS    XL8                                                              
MGPDEM1  DS    CL7      9   40    7  A  P H             T        Y              
MGPOFL1H DS    XL8                                                              
MGPOFL1  DS    CL3     10    1    3  A  P H             T        Y              
MGPODTSH DS    XL8                                                              
MGPODTS  DS    CL25    10    5   25  A  U N             T        Y              
MGPOSPTH DS    XL8                                                              
MGPOSPT  DS    CL3     10   31    3  N  U N             T        Y              
MGPOLN#H DS    XL8                                                              
MGPOLN#  DS    CL3     10   35    3  N  U N             T        Y              
MGPODEMH DS    XL8                                                              
MGPODEM  DS    CL8     10   40    8  A  P N             T        Y  255         
MGPODEMX DS    XL8                                                              
MGPOFC1H DS    XL8                                                              
MGPOFC1  DS    CL3     11    2    3  A  P N             T        Y              
MGPOCMTH DS    XL8                                                              
MGPOCMT  DS    CL60    11    7   60  A  U N             T        Y              
MGPOFL2H DS    XL8                                                              
MGPOFL2  DS    CL3     12    1    3  A  P H             T        Y              
MGPODT2H DS    XL8                                                              
MGPODT2  DS    CL25    12    5   25  A  U N             T        Y              
MGPOSP2H DS    XL8                                                              
MGPOSP2  DS    CL3     12   31    3  N  U N             T        Y              
MGPOLN2H DS    XL8                                                              
MGPOLN2  DS    CL3     12   35    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   40    8  A  P N             T        Y  255         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    13    7   60  A  U N             T        Y              
MGPOFL3H DS    XL8                                                              
MGPOFL3  DS    CL3     14    1    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25    14    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   35    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   40    8  A  P N             T        Y  255         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    15    7   60  A  U N             T        Y              
MGPOFL4H DS    XL8                                                              
MGPOFL4  DS    CL3     16    1    3  A  P H             T        Y              
MGPODT4H DS    XL8                                                              
MGPODT4  DS    CL25    16    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   35    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   40    8  A  P N             T        Y  255         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    17    7   60  A  U N             T        Y              
MGPOFL5H DS    XL8                                                              
MGPOFL5  DS    CL3     18    1    3  A  P H             T        Y              
MGPODT5H DS    XL8                                                              
MGPODT5  DS    CL25    18    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   35    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   40    8  A  P N             T        Y  255         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    19    7   60  A  U N             T        Y              
MGPOFL6H DS    XL8                                                              
MGPOFL6  DS    CL3     20    1    3  A  P H             T        Y              
MGPODT6H DS    XL8                                                              
MGPODT6  DS    CL25    20    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   35    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   40    8  A  P N             T        Y  255         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    21    7   60  A  U N             T        Y              
MGPOFL7H DS    XL8                                                              
MGPOFL7  DS    CL3     22    1    3  A  P H             T        Y              
MGPODT7H DS    XL8                                                              
MGPODT7  DS    CL25    22    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   31    3  N  U N             T        Y              
MGPOLNLH DS    XL8                                                              
MGPOLNL  DS    CL3     22   35    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   40    8  A  P N             T        Y  255         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    23    7   60  A  U N             T        Y              
MGPPFLNH DS    XL8                                                              
MGPPFLN  DS    CL78    24    2   78  A  P N             T        Y              
MGPLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MGPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1336 BYTES                            
