*          DATA SET RECNTFDD   AT LEVEL 009 AS OF 10/02/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802FDD      DATE 10/02/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL79    12    2   79  A   P    N         T        Y              
LINLIN1H DS    CL8                                                              
LINLIN1  DS    CL79    13    2   79  A   P    N         T        Y              
LINLIN2H DS    CL8                                                              
LINLIN2  DS    CL79    14    2   79  A   P    N         T        Y              
LINLIN3H DS    CL8                                                              
LINLIN3  DS    CL79    15    2   79  A   P    N         T        Y              
LINLIN4H DS    CL8                                                              
LINLIN4  DS    CL79    16    2   79  A   P    N         T        Y              
LINLIN5H DS    CL8                                                              
LINLIN5  DS    CL79    17    2   79  A   P    N         T        Y              
LINLIN6H DS    CL8                                                              
LINLIN6  DS    CL79    18    2   79  A   P    N         T        Y              
LINLIN7H DS    CL8                                                              
LINLIN7  DS    CL79    19    2   79  A   P    N         T        Y              
LINLIN8H DS    CL8                                                              
LINLIN8  DS    CL79    20    2   79  A   P    N         T        Y              
LINLIN9H DS    CL8                                                              
LINLIN9  DS    CL79    21    2   79  A   P    N         T        Y              
LINLINAH DS    CL8                                                              
LINLINA  DS    CL79    22    2   79  A   P    N         T        Y              
LINLINBH DS    CL8                                                              
LINLINB  DS    CL79    23    2   79  A   P    N         T        Y              
LINLINCH DS    CL8                                                              
LINLINC  DS    CL79    24    2   79  A   P    N         T        Y              
LINLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1136 BYTES                            
