*          DATA SET RECNTDED   AT LEVEL 005 AS OF 06/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802DED      DATE 06/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      2   41    4  A  P N             T        Y              
BUYTYPEH DS    XL8                                                              
BUYTYPE  DS    CL2      2   49    2  A  P N             T        Y  110         
BUYTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     2   69   11  A  P N             T        Y              
BUYSTAH  DS    XL8                                                              
BUYSTA   DS    CL7      3    2    7  A  P N             T        Y              
BUYSALH  DS    XL8                                                              
BUYSAL   DS    CL3      3   11    3  A  P N             T        Y              
BUYHDTEH DS    XL8                                                              
BUYHDTE  DS    CL17     3   25   17  A  P N             T        Y              
BUYAGYH  DS    XL8                                                              
BUYAGY   DS    CL7      3   49    7  A  P N             T        Y              
BUYAGYNH DS    XL8                                                              
BUYAGYN  DS    CL6      3   57    6  A  P N             T        Y              
BUYADVH  DS    XL8                                                              
BUYADV   DS    CL4      3   65    4  A  P N             T        Y              
BUYADVNH DS    XL8                                                              
BUYADVN  DS    CL10     3   70   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
BUYBACTH DS    XL8                                                              
BUYBACT  DS    CL8      4   11    8  A  U N        M    T        Y    0         
BUYBACTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   41    7  A  P N             T        Y              
BUYBNUMH DS    XL8                                                              
BUYBNUM  DS    CL8      4   50    8  A  U N             T        Y    0         
BUYBNUMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5    6    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   14    8  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   24    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   32    8  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   42    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   50    8  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   60    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   68    8  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
BUYDAYSH DS    XL8                                                              
BUYDAYS  DS    CL60     6   11   60  A  U N             T        Y    0         
BUYDAYSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
BUYTIMSH DS    XL8                                                              
BUYTIMS  DS    CL60     7   11   60  A  U N             T        Y    0         
BUYTIMSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
BUYLENH  DS    XL8                                                              
BUYLEN   DS    CL8      8   11    8  A  U N             T        Y    0         
BUYLENX  DS    XL8                                                              
BUYCCOVH DS    XL8                                                              
BUYCCOV  DS    CL11     8   21   11  A  P Z             T        Y              
BUYDCATH DS    XL8                                                              
BUYDCAT  DS    CL10     8   34   10  A  P N             T        Y              
BUYDVALH DS    XL8                                                              
BUYDVAL  DS    CL8      8   45    8  A  U N             T        Y              
BUYBCODH DS    XL8                                                              
BUYBCOD  DS    CL8      8   55    8  A  P Z             T        Y              
BUYSCODH DS    XL8                                                              
BUYSCOD  DS    CL3      8   65    3  A  P Z             T        Y              
BUYXDAYH DS    XL8                                                              
BUYXDAY  DS    CL7      8   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
BUYDTESH DS    XL8                                                              
BUYDTES  DS    CL60     9   11   60  A  U N             T        Y    0         
BUYDTESX DS    XL8                                                              
BUYDTE2H DS    XL8                                                              
BUYDTE2  DS    CL60    10   11   60  A  U N             T        Y    0         
BUYDTE2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11    2    4  A  P N             T        Y              
BUYTYPH  DS    XL8                                                              
BUYTYP   DS    CL2     11   11    2  A  U N             T        Y    0         
BUYTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   15    3  A  P N             T        Y              
BUYDPTH  DS    XL8                                                              
BUYDPT   DS    CL1     11   21    1  A  U N             T        Y    0         
BUYDPTX  DS    XL8                                                              
BUYCLSPH DS    XL8                                                              
BUYCLSP  DS    CL3     11   25    3  A  P N             T        Y              
BUYCLSH  DS    XL8                                                              
BUYCLS   DS    CL10    11   30   10  A  U N             T        Y    0         
BUYCLSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11   42    4  A  P N             T        Y              
BUYSECH  DS    XL8                                                              
BUYSEC   DS    CL8     11   49    8  A  U N             T        Y    0         
BUYSECX  DS    XL8                                                              
BUYPLNLH DS    XL8                                                              
BUYPLNL  DS    CL4     11   60    4  A  P N             T        Y              
BUYPLNH  DS    XL8                                                              
BUYPLN   DS    CL8     11   67    8  A  U N             T        Y    0         
BUYPLNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
BUYNPWH  DS    XL8                                                              
BUYNPW   DS    CL8     12   11    8  A  U N             T        Y    0         
BUYNPWX  DS    XL8                                                              
BUYCMBSH DS    XL8                                                              
BUYCMBS  DS    CL6     12   31    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   41    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   51    6  A  P N             T        Y              
BUYCMBLH DS    XL8                                                              
BUYCMBL  DS    CL6     12   61    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
BUYRATEH DS    XL8                                                              
BUYRATE  DS    CL9     13   11    9  A  U N             T        Y    0         
BUYRATEX DS    XL8                                                              
BUYCBC1H DS    XL8                                                              
BUYCBC1  DS    CL8     13   30    8  A  U N             T        Y    0         
BUYCBC1X DS    XL8                                                              
BUYCBC2H DS    XL8                                                              
BUYCBC2  DS    CL8     13   40    8  A  U N             T        Y    0         
BUYCBC2X DS    XL8                                                              
BUYCBC3H DS    XL8                                                              
BUYCBC3  DS    CL8     13   50    8  A  U N             T        Y    0         
BUYCBC3X DS    XL8                                                              
BUYCBC4H DS    XL8                                                              
BUYCBC4  DS    CL8     13   60    8  A  U N             T        Y    0         
BUYCBC4X DS    XL8                                                              
BUYCOMTH DS    XL8                                                              
BUYCOMT  DS    CL7     14    2    7  A  P N             T        Y              
BUYCOM1H DS    XL8                                                              
BUYCOM1  DS    CL60    14   11   60  A  U N             T        Y    0         
BUYCOM1X DS    XL8                                                              
BUYCOMUH DS    XL8                                                              
BUYCOMU  DS    CL7     15    2    7  A  P N             T        Y              
BUYCOM2H DS    XL8                                                              
BUYCOM2  DS    CL60    15   11   60  A  U N             T        Y    0         
BUYCOM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
BUYORDCH DS    XL8                                                              
BUYORDC  DS    CL60    16   11   60  A  U N             T        Y    0         
BUYORDCX DS    XL8                                                              
BUYMODH  DS    XL8                                                              
BUYMOD   DS    CL2     16   73    2  A  P N             T        Y              
BUYFLTH  DS    XL8                                                              
BUYFLT   DS    CL3     16   76    3  A  P N             T        Y              
BUYORD2H DS    XL8                                                              
BUYORD2  DS    CL60    17   11   60  A  U N             T        Y    0         
BUYORD2X DS    XL8                                                              
BUYNOTLH DS    XL8                                                              
BUYNOTL  DS    CL5     18    2    5  A  P Z             T        Y              
BUYNOTH  DS    XL8                                                              
BUYNOT   DS    CL15    18    8   15  A  P N             T        Y              
BUYUPTLH DS    XL8                                                              
BUYUPTL  DS    CL8     18   25    8  A  P Z             T        Y              
BUYUPTH  DS    XL8                                                              
BUYUPT   DS    CL1     18   34    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   37    4  A  P N             T        Y              
BUYPGMH  DS    XL8                                                              
BUYPGM   DS    CL34    18   42   34  A  U N             T        Y              
BUYMSD1H DS    XL8                                                              
BUYMSD1  DS    CL12    19    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   15    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   19    3  A  P N             T        Y              
BUYMSD2H DS    XL8                                                              
BUYMSD2  DS    CL12    19   25   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   38    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   42    3  A  P N             T        Y              
BUYMSD3H DS    XL8                                                              
BUYMSD3  DS    CL12    19   48   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   65    3  A  P N             T        Y              
BUYMD1H  DS    XL8                                                              
BUYMD1   DS    CL12    20    2   12  A  U N             T        Y              
BUYSP1H  DS    XL8                                                              
BUYSP1   DS    CL3     20   15    3  N  U N             T        Y              
BUYLN1H  DS    XL8                                                              
BUYLN1   DS    CL3     20   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   48   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   61    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   15    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   48   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   61    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   15    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   48   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   61    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    23    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   15    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   48   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   61    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    24    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   15    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    24   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   42    3  N  U N             T        Y              
BUYMDLH  DS    XL8                                                              
BUYMDL   DS    CL12    24   48   12  A  U N             T        Y              
BUYSPLH  DS    XL8                                                              
BUYSPL   DS    CL3     24   61    3  N  U N             T        Y              
BUYLNLH  DS    XL8                                                              
BUYLNL   DS    CL3     24   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   75    1  A  U N             T        Y              
BUYLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BUYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2520 BYTES                            
