*          DATA SET RECNTC3D   AT LEVEL 002 AS OF 09/08/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802C3D      DATE 09/08/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL13     9    5   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   31    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      9   35    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   45    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      9   49    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      9   65    4  A  P H             T        Y              
MGBDEM1H DS    XL8                                                              
MGBDEM1  DS    CL7      9   72    7  A  P H             T        Y              
MGBOFL1H DS    XL8                                                              
MGBOFL1  DS    CL3     10    1    3  A  P H             T        Y              
MGBODTSH DS    XL8                                                              
MGBODTS  DS    CL25    10    5   25  A  U N             T        Y              
MGBOSPTH DS    XL8                                                              
MGBOSPT  DS    CL3     10   31    3  N  U N             T        Y              
MGBORATH DS    XL8                                                              
MGBORAT  DS    CL9     10   35    9  A  U N             T        Y              
MGBOLENH DS    XL8                                                              
MGBOLEN  DS    CL3     10   45    3  N  U N             T        Y              
MGBODYSH DS    XL8                                                              
MGBODYS  DS    CL15    10   49   15  A  U N             T        Y              
MGBOTMSH DS    XL8                                                              
MGBOTMS  DS    CL15    10   65   15  A  U N             T        Y              
MGBPGN1H DS    XL8                                                              
MGBPGN1  DS    CL3     11    2    3  A  P N             T        Y              
MGBOPGNH DS    XL8                                                              
MGBOPGN  DS    CL17    11    6   17  A  U N             T        Y              
MGBOFC1H DS    XL8                                                              
MGBOFC1  DS    CL3     11   24    3  A  P N             T        Y              
MGBOCMTH DS    XL8                                                              
MGBOCMT  DS    CL43    11   28   43  A  U N             T        Y              
MGBODEMH DS    XL8                                                              
MGBODEM  DS    CL8     11   72    8  A  U N             T        Y  255         
MGBODEMX DS    XL8                                                              
MGBOFL2H DS    XL8                                                              
MGBOFL2  DS    CL3     12    1    3  A  P H             T        Y              
MGBODT2H DS    XL8                                                              
MGBODT2  DS    CL25    12    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   45    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12   49   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    13    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43    13   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   72    8  A  U N             T        Y  255         
         DS    XL8                                                              
MGBOFL3H DS    XL8                                                              
MGBOFL3  DS    CL3     14    1    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25    14    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   45    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   49   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    15    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43    15   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   72    8  A  U N             T        Y  255         
         DS    XL8                                                              
MGBOFL4H DS    XL8                                                              
MGBOFL4  DS    CL3     16    1    3  A  P H             T        Y              
MGBODT4H DS    XL8                                                              
MGBODT4  DS    CL25    16    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   45    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   49   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    17    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43    17   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   72    8  A  U N             T        Y  255         
         DS    XL8                                                              
MGBOFL5H DS    XL8                                                              
MGBOFL5  DS    CL3     18    1    3  A  P H             T        Y              
MGBODT5H DS    XL8                                                              
MGBODT5  DS    CL25    18    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   45    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   49   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    19    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43    19   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   72    8  A  U N             T        Y  255         
         DS    XL8                                                              
MGBOFL6H DS    XL8                                                              
MGBOFL6  DS    CL3     20    1    3  A  P H             T        Y              
MGBODT6H DS    XL8                                                              
MGBODT6  DS    CL25    20    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   45    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   49   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    21    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43    21   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   72    8  A  U N             T        Y  255         
         DS    XL8                                                              
MGBOFL7H DS    XL8                                                              
MGBOFL7  DS    CL3     22    1    3  A  P H             T        Y              
MGBODT7H DS    XL8                                                              
MGBODT7  DS    CL25    22    5   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   31    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   45    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22   49   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    23    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43    23   28   43  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   72    8  A  U N             T        Y  255         
         DS    XL8                                                              
MGBPFLNH DS    XL8                                                              
MGBPFLN  DS    CL78    24    2   78  A  P N             T        Y              
MGBLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MGBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1944 BYTES                            
