*          DATA SET RECNTC7D   AT LEVEL 002 AS OF 02/20/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802C7D      DATE 02/20/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SBSTYPH  DS    XL8                                                              
SBSTYP   DS    CL25    12    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
SBSDATEH DS    XL8                                                              
SBSDATE  DS    CL30    13    9   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   42   10  A  P N             T        Y              
SBSCOSTH DS    XL8                                                              
SBSCOST  DS    CL14    13   54   14  A  U N             T        Y              
SBSDCL1H DS    XL8                                                              
SBSDCL1  DS    CL24    15    2   24  A  P N             T        Y              
SBSDCF1H DS    XL8                                                              
SBSDCF1  DS    CL40    15   28   40  A  U N             T        Y              
SBSDCL2H DS    XL8                                                              
SBSDCL2  DS    CL24    16    2   24  A  P N             T        Y              
SBSDCF2H DS    XL8                                                              
SBSDCF2  DS    CL40    16   28   40  A  U N             T        Y              
SBSACTH  DS    XL8                                                              
SBSACT   DS    CL4     17    2    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
SBSCMT1H DS    XL8                                                              
SBSCMT1  DS    CL60    18   11   60  A  U N             T        Y              
SBSCMT2H DS    XL8                                                              
SBSCMT2  DS    CL60    19   11   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
SBSOCM1H DS    XL8                                                              
SBSOCM1  DS    CL60    21   11   60  A  U N             T        Y              
SBSOCM2H DS    XL8                                                              
SBSOCM2  DS    CL60    22   11   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   75    1  A  U N             T        Y              
SBSLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SBSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 616  BYTES                            
