*          DATA SET RECNTBED   AT LEVEL 013 AS OF 03/01/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802BED      DATE 03/01/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ADLHAGYH DS    XL8                                                              
ADLHAGY  DS    CL6      3    2    6  A  P N             T        Y              
ADLAGYH  DS    XL8                                                              
ADLAGY   DS    CL8      3   10    8  A  P N             T        Y   40         
ADLAGYX  DS    XL8                                                              
ADLAGYNH DS    XL8                                                              
ADLAGYN  DS    CL20     3   19   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      3   41    7  A  P N             T        Y              
ADLADVH  DS    XL8                                                              
ADLADV   DS    CL8      3   49    8  A  P N             T        Y   60         
ADLADVX  DS    XL8                                                              
ADLADVNH DS    XL8                                                              
ADLADVN  DS    CL20     3   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
ADLSTAH  DS    XL8                                                              
ADLSTA   DS    CL8      4   10    8  A  P N             T        Y   90         
ADLSTAX  DS    XL8                                                              
ADLSTAMH DS    XL8                                                              
ADLSTAM  DS    CL20     4   19   20  A  P N             T        Y              
ADLHPRDH DS    XL8                                                              
ADLHPRD  DS    CL7      4   41    7  A  P N             T        Y              
ADLPRDH  DS    XL8                                                              
ADLPRD   DS    CL20     4   49   20  A  P N             T        Y   70         
ADLPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
ADLSALH  DS    XL8                                                              
ADLSAL   DS    CL3      5   10    3  A  P N             T        Y  120         
ADLSALX  DS    XL8                                                              
ADLSALNH DS    XL8                                                              
ADLSALN  DS    CL19     5   14   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   41    5  A  P N             T        Y              
ADLODTSH DS    XL8                                                              
ADLODTS  DS    CL17     5   49   17  A  P N             T        Y   30         
ADLODTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL28     7   27   28  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL42     9    2   42  A  P N             T        Y              
ADLCSELH DS    XL8                                                              
ADLCSEL  DS    CL4     10    2    4  A  U N             T        Y   10         
ADLCSELX DS    XL8                                                              
ADLCDESH DS    XL8                                                              
ADLCDES  DS    CL72    10    7   72  A  P N             T        Y              
ADLCSE2H DS    XL8                                                              
ADLCSE2  DS    CL4     11    2    4  A  U N             T        Y   10         
ADLCSE2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    11    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    12    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    13    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    14    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    15    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    16    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    17    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    18    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    19    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    20    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21    2    4  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    21    7   72  A  P N             T        Y              
ADLCLISH DS    XL8                                                              
ADLCLIS  DS    CL4     22    2    4  A  U N             T        Y   10         
ADLCLISX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    22    7   72  A  P N             T        Y              
ADLCLSTH DS    XL8                                                              
ADLCLST  DS    CL4     23    2    4  A  U N             T        Y   10         
ADLCLSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    23    7   72  A  P N             T        Y              
ADLPFKSH DS    XL8                                                              
ADLPFKS  DS    CL79    24    2   79  A  P N             T        Y              
ADLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ADLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
