*          DATA SET RECNTD8D   AT LEVEL 004 AS OF 06/22/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802D8D      DATE 06/22/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL15    12    2   15  A  P N             T        Y              
PCEESINH DS    XL8                                                              
PCEESIN  DS    CL1     12   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   24   13  A  P N             T        Y              
PCEACDTH DS    XL8                                                              
PCEACDT  DS    CL8     12   39    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   51   20  A  P N             T        Y              
PCEACDFH DS    XL8                                                              
PCEACDF  DS    CL1     12   73    1  A  U N             T        Y              
PCEMCOHH DS    XL8                                                              
PCEMCOH  DS    CL21    14    2   21  A  P N             T        Y              
PCEMCONH DS    XL8                                                              
PCEMCON  DS    CL10    14   26   10  A  U N             T        Y              
PCESTRTH DS    XL8                                                              
PCESTRT  DS    CL5     16    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    8   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16   22    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   28   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   48   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17    8   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17   22    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   28   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   48   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    8   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18   22    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   28   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   48   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19    8   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19   22    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   28   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   48   10  A  P N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    8   10  A  P N             T        Y   10         
         DS    XL8                                                              
PCELAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PCEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 664  BYTES                            
