*          DATA SET RECNTEAD   AT LEVEL 009 AS OF 09/20/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802EAD      DATE 09/20/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MO$MON1H DS    XL8                                                              
MO$MON1  DS    CL4     12    2    4  N  U N             T        Y              
MO$ACT1H DS    XL8                                                              
MO$ACT1  DS    CL6     12    8    6  N  U N             T        Y              
MO$BUC1H DS    XL8                                                              
MO$BUC1  DS    CL9     12   16    9  N  U N             T        Y              
MO$MON2H DS    XL8                                                              
MO$MON2  DS    CL4     13    2    4  N  U N             T        Y              
MO$ACT2H DS    XL8                                                              
MO$ACT2  DS    CL6     13    8    6  N  U N             T        Y              
MO$BUC2H DS    XL8                                                              
MO$BUC2  DS    CL9     13   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   16    9  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   16    9  N  U N             T        Y              
MO$ENDH  DS    XL8                                                              
MO$END   DS    CL4     23    2    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23    8    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   16    9  N  U N             T        Y              
MO$LAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MO$WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 520  BYTES                            
