*          DATA SET RECNTEDD   AT LEVEL 006 AS OF 11/03/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802EDD      DATE 11/03/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MONSTRTH DS    CL8                                                              
MONSTRT  DS    CL6     12    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    9   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12   22    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   49   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    9   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   22    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   49   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    9   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   22    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   49   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    9   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   22    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   29   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   42    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   49   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    9   10  A  P N             T        Y   10         
         DS    CL8                                                              
MONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 528  BYTES                            
