*          DATA SET RECNTE4D   AT LEVEL 012 AS OF 10/01/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802E4D      DATE 10/01/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    5    5  A  P N             T        Y              
ADSSBUXH DS    CL8                                                              
ADSSBUX  DS    CL66    12   13   66  A  U N             T        Y   14         
ADSSBUXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    5    5  A  P N             T        Y              
ADSSDEMH DS    CL8                                                              
ADSSDEM  DS    CL66    13   13   66  A  U N             T        Y   16         
ADSSDEMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    5    4  A  P N             T        Y              
ADSSLENH DS    CL8                                                              
ADSSLEN  DS    CL25    14   13   25  A  U N             T        Y   20         
ADSSLENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    14   40   13  A  P N             T        Y              
ADSSRTBH DS    CL8                                                              
ADSSRTB  DS    CL1     14   54    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   59   11  A  P N             T        Y              
ADSSACTH DS    CL8                                                              
ADSSACT  DS    CL8     14   71    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    5   10  A  P N             T        Y              
ADSSBUDH DS    CL8                                                              
ADSSBUD  DS    CL8     15   17    8  A  U N             T        Y    6         
ADSSBUDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   27   10  A  P N             T        Y              
ADSSGOLH DS    CL8                                                              
ADSSGOL  DS    CL5     15   39    5  A  U N             T        Y    8         
ADSSGOLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   46   10  A  P N             T        Y              
ADSSTBDH DS    CL8                                                              
ADSSTBD  DS    CL8     15   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   67    4  A  P Z             T        Y              
ADSSTGPH DS    CL8                                                              
ADSSTGP  DS    CL7     15   72    7  A  P N             T        Y   24         
ADSSTGPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    5    3  A  P N             T        Y              
ADSSDPTH DS    CL8                                                              
ADSSDPT  DS    CL1     16   10    1  A  U N             T        Y   18         
ADSSDPTX DS    CL8                                                              
ADSSNDPH DS    CL8                                                              
ADSSNDP  DS    CL1     16   19    1  A  U N             T        Y   18         
ADSSNDPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   28    1  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   37    1  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   46    1  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   55    1  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   64    1  A  U N             T        Y   18         
         DS    CL8                                                              
ADSSLDPH DS    CL8                                                              
ADSSLDP  DS    CL1     16   73    1  A  U N             T        Y   18         
ADSSLDPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    5    3  A  P N             T        Y              
ADSSCPPH DS    CL8                                                              
ADSSCPP  DS    CL8     17   10    8  A  U N             T        Y   26         
ADSSCPPX DS    CL8                                                              
ADSSNCPH DS    CL8                                                              
ADSSNCP  DS    CL8     17   19    8  A  U N             T        Y   26         
ADSSNCPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   28    8  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   37    8  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   46    8  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   55    8  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   64    8  A  U N             T        Y   26         
         DS    CL8                                                              
ADSSLCPH DS    CL8                                                              
ADSSLCP  DS    CL8     17   73    8  A  U N             T        Y   26         
ADSSLCPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    5    3  A  P Z             T        Y              
ADSSGPFH DS    CL8                                                              
ADSSGPF  DS    CL1     18   10    1  A  P N             T        Y              
ADSSGRPH DS    CL8                                                              
ADSSGRP  DS    CL4     18   12    4  A  P N             T        Y   22         
ADSSGRPX DS    CL8                                                              
ADSSNGPH DS    CL8                                                              
ADSSNGP  DS    CL4     18   19    4  A  P N             T        Y   22         
ADSSNGPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   28    4  A  P N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   37    4  A  P N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   46    4  A  P N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   55    4  A  P N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   64    4  A  P N             T        Y   22         
         DS    CL8                                                              
ADSSLGPH DS    CL8                                                              
ADSSLGP  DS    CL4     18   73    4  A  P N             T        Y   22         
ADSSLGPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    5    8  A  P N             T        Y              
ADSSCM1H DS    CL8                                                              
ADSSCM1  DS    CL60    19   15   60  A  U N             T        Y   30         
ADSSCM1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
ADSSCM2H DS    CL8                                                              
ADSSCM2  DS    CL60    20   15   60  A  U N             T        Y   30         
ADSSCM2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    21   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
ADSSLCMH DS    CL8                                                              
ADSSLCM  DS    CL60    22   15   60  A  U N             T        Y   30         
ADSSLCMX DS    CL8                                                              
ADSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ADSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1416 BYTES                            
