*          DATA SET RECNTE6D   AT LEVEL 002 AS OF 04/23/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802E6D      DATE 04/23/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BCMCMBSH DS    CL8                                                              
BCMCMBS  DS    CL6     12    2    6  A  P N             T        Y              
BCMCMBCH DS    CL8                                                              
BCMCMBC  DS    CL6     12   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    13   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    14   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    16   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    19   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    20   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    22   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    23   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A  P N             T        Y              
BCMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BCMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 728  BYTES                            
