*          DATA SET RECNTEDSD  AT LEVEL 001 AS OF 11/03/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802EDD      DATE 11/03/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MONSTRTH DS    CL8                                                              
MONSTRT  DS    CL5     12    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    8   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     12   22    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   28   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     12   42    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   48   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    8   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13   22    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   28   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13   42    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   48   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     14    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    8   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     14   22    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   28   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     14   42    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   48   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    8   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15   22    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   28   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15   42    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   48   10  A  P N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     16    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    8   10  A  P N             T        Y   10         
         DS    CL8                                                              
MONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 512  BYTES                            
