*          DATA SET RECNTF0D   AT LEVEL 008 AS OF 02/10/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F0D      DATE 01/24/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      3    2    5  A  P N             T        Y              
ORDTOTH  DS    XL8                                                              
ORDTOT   DS    CL12     3    8   12  A  U N             T        Y   10         
ORDTOTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      3   21    4  A  P N             T        Y              
ORDASSTH DS    XL8                                                              
ORDASST  DS    CL9      3   26    9  A  U N             T        Y   20         
ORDASSTX DS    XL8                                                              
ORDEMHH  DS    XL8                                                              
ORDEMH   DS    CL1      3   37    1  A  P Z             T        Y   80         
ORDEMHX  DS    XL8                                                              
ORDEMLH  DS    XL8                                                              
ORDEML   DS    CL41     3   39   41  A  P Z             T        Y   80         
ORDEMLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
ORDRCMTH DS    XL8                                                              
ORDRCMT  DS    CL60     4   11   60  A  U N             T        Y   30         
ORDRCMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60     5   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60     6   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60     7   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60     8   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60     9   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    10   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    11   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    12   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    13   11   60  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
ORDTRFH  DS    XL8                                                              
ORDTRF   DS    CL10    14   11   10  A  U N             T        Y   40         
ORDTRFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   23    3  A  P N             T        Y              
ORDAGYH  DS    XL8                                                              
ORDAGY   DS    CL11    14   27   11  A  U N             T        Y   50         
ORDAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   40    3  A  P N             T        Y              
ORDADVH  DS    XL8                                                              
ORDADV   DS    CL11    14   44   11  A  U N             T        Y   60         
ORDADVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   57    3  A  P N             T        Y              
ORDOFFH  DS    XL8                                                              
ORDOFF   DS    CL6     14   61    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   69    3  A  P N             T        Y              
ORDSALH  DS    XL8                                                              
ORDSAL   DS    CL6     14   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
ORDSCMTH DS    XL8                                                              
ORDSCMT  DS    CL60    15   11   60  A  U N             T        Y   70         
ORDSCMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    16   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    17   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    18   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    19   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    20   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    21   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    22   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    23   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    24   11   60  A  U N             T        Y   70         
         DS    XL8                                                              
ORDTABH  DS    XL8                                                              
ORDTAB   DS    CL1     24   76    1  A  U N             T        Y              
ORDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ORDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
