*          DATA SET RECNTF9D   AT LEVEL 007 AS OF 10/02/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F9D      DATE 10/02/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL79    12    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A   P    H         T        Y              
CINCMB1H DS    CL8                                                              
CINCMB1  DS    CL7     13   18    7  A   P    H         T        Y              
CINCMB2H DS    CL8                                                              
CINCMB2  DS    CL7     13   32    7  A   P    H         T        Y              
CINCMB3H DS    CL8                                                              
CINCMB3  DS    CL7     13   46    7  A   P    H         T        Y              
CINCMB4H DS    CL8                                                              
CINCMB4  DS    CL7     13   60    7  A   P    H         T        Y              
CINLIN1H DS    CL8                                                              
CINLIN1  DS    CL79    14    2   79  A   P    N         T        Y              
CINLIN2H DS    CL8                                                              
CINLIN2  DS    CL79    15    2   79  A   P    N         T        Y              
CINLIN3H DS    CL8                                                              
CINLIN3  DS    CL79    16    2   79  A   P    N         T        Y              
CINLIN4H DS    CL8                                                              
CINLIN4  DS    CL79    17    2   79  A   P    N         T        Y              
CINLIN5H DS    CL8                                                              
CINLIN5  DS    CL79    18    2   79  A   P    N         T        Y              
CINLIN6H DS    CL8                                                              
CINLIN6  DS    CL79    19    2   79  A   P    N         T        Y              
CINLIN7H DS    CL8                                                              
CINLIN7  DS    CL79    20    2   79  A   P    N         T        Y              
CINLIN8H DS    CL8                                                              
CINLIN8  DS    CL79    21    2   79  A   P    N         T        Y              
CINLIN9H DS    CL8                                                              
CINLIN9  DS    CL79    22    2   79  A   P    N         T        Y              
CINLINAH DS    CL8                                                              
CINLINA  DS    CL79    23    2   79  A   P    N         T        Y              
CINLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1040 BYTES                            
