*          DATA SET RECNTCED   AT LEVEL 009 AS OF 03/12/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802CED      DATE 03/12/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL35    12    2   35  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   44    7  A  P N             T        Y              
BCDMCD1H DS    XL8                                                              
BCDMCD1  DS    CL2     13    2    2  A  P N             T        Y              
BCDLN#1H DS    XL8                                                              
BCDLN#1  DS    CL3     13    5    3  A  P N             T        Y              
BCDBCD1H DS    XL8                                                              
BCDBCD1  DS    CL3     13   10    3  A  U N             T        Y              
BCDDAY1H DS    XL8                                                              
BCDDAY1  DS    CL11    13   18   11  A  P N             T        Y              
BCDTIM1H DS    XL8                                                              
BCDTIM1  DS    CL11    13   32   11  A  P N             T        Y              
BCDPRG1H DS    XL8                                                              
BCDPRG1  DS    CL34    13   44   34  A  P N             T        Y              
BCDMCD2H DS    XL8                                                              
BCDMCD2  DS    CL2     14    2    2  A  P N             T        Y              
BCDLN#2H DS    XL8                                                              
BCDLN#2  DS    CL3     14    5    3  A  P N             T        Y              
BCDBCD2H DS    XL8                                                              
BCDBCD2  DS    CL3     14   10    3  A  U N             T        Y              
BCDDAY2H DS    XL8                                                              
BCDDAY2  DS    CL11    14   18   11  A  P N             T        Y              
BCDTIM2H DS    XL8                                                              
BCDTIM2  DS    CL11    14   32   11  A  P N             T        Y              
BCDPRG2H DS    XL8                                                              
BCDPRG2  DS    CL34    14   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    15   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    16   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    17   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    18   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    19   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    20   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    21   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    22   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    22   44   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    23   18   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    23   32   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    23   44   34  A  P N             T        Y              
BCDENDXH DS    XL8                                                              
BCDENDX  DS    CL1     24    2    1  A  P N             T        Y              
BCDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BCDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
