*          DATA SET RECNTE1D   AT LEVEL 003 AS OF 05/31/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802E1D      DATE 05/31/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
EP2MONTH DS    CL8                                                              
EP2MONT  DS    CL8     12    8    8  A  P N             T        Y   10         
EP2MONTX DS    CL8                                                              
EP2STA1H DS    CL8                                                              
EP2STA1  DS    CL7     12   17    7  A  P N             T        Y              
EP2AMT1H DS    CL8                                                              
EP2AMT1  DS    CL7     12   25    7  A  U N             T        Y   20         
EP2AMT1X DS    CL8                                                              
EP2STA2H DS    CL8                                                              
EP2STA2  DS    CL7     12   33    7  A  P N             T        Y              
EP2AMT2H DS    CL8                                                              
EP2AMT2  DS    CL7     12   41    7  A  U N             T        Y   20         
EP2AMT2X DS    CL8                                                              
EP2STA3H DS    CL8                                                              
EP2STA3  DS    CL7     12   49    7  A  P N             T        Y              
EP2AMT3H DS    CL8                                                              
EP2AMT3  DS    CL7     12   57    7  A  U N             T        Y   20         
EP2AMT3X DS    CL8                                                              
EP2STA4H DS    CL8                                                              
EP2STA4  DS    CL7     12   65    7  A  P N             T        Y              
EP2AMT4H DS    CL8                                                              
EP2AMT4  DS    CL7     12   73    7  A  U N             T        Y   20         
EP2AMT4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    13    4   18  A  P N             T        Y              
EP2TDATH DS    CL8                                                              
EP2TDAT  DS    CL8     13   24    8  A  P N             T        Y              
EP2COMPH DS    CL8                                                              
EP2COMP  DS    CL6     14    3    6  A  U N             T        Y   30         
EP2COMPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   17    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   31    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   45    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   59    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   73    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    3    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   17    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   31    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   45    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   59    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   73    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    3    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16   17    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16   31    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16   45    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16   59    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16   73    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    3    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   17    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   31    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   45    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   59    6  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   73    6  A  U N             T        Y   30         
         DS    CL8                                                              
EP2CPENH DS    CL8                                                              
EP2CPEN  DS    CL1     18    2    1  A  P N             T        Y              
EP2CMMTH DS    CL8                                                              
EP2CMMT  DS    CL8     19    3    8  A  P N             T        Y              
EP2COM1H DS    CL8                                                              
EP2COM1  DS    CL65    19   13   65  A  U N             T        Y   40         
EP2COM1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL65    20   13   65  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL65    21   13   65  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL65    22   13   65  A  U N             T        Y   40         
         DS    CL8                                                              
EP2TABH  DS    CL8                                                              
EP2TAB   DS    CL1     23   13    1  A  U N             T        Y              
EP2LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
EP2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1136 BYTES                            
