*          DATA SET RECNTE8D   AT LEVEL 005 AS OF 12/03/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802E8D      DATE 12/03/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL27    12   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    14    2   15  A  P N             T        Y              
EQCFLGH  DS    CL8                                                              
EQCFLG   DS    CL7     14   20    7  A  P N             T        Y              
EQCPRDH  DS    CL8                                                              
EQCPRD   DS    CL3     14   28    3  A  U N             T        Y   10         
EQCPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14   40   10  A  P N             T        Y              
EQCADVH  DS    CL8                                                              
EQCADV   DS    CL3     14   51    3  A  U N             T        Y   20         
EQCADVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   60    8  A  P N             T        Y              
EQCCATH  DS    CL8                                                              
EQCCAT   DS    CL6     14   69    6  A  U N             T        Y   30         
EQCCATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     15   20    9  A  P N             T        Y              
EQCCDYH  DS    CL8                                                              
EQCCDY   DS    CL1     15   30    1  A  U N             T        Y   40         
EQCCDYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     15   40    4  A  P N             T        Y              
EQCARAH  DS    CL8                                                              
EQCARA   DS    CL1     15   45    1  A  U N             T        Y   50         
EQCARAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   60   10  A  P N             T        Y              
EQCOTYH  DS    CL8                                                              
EQCOTY   DS    CL1     15   71    1  A  U N             T        Y   60         
EQCOTYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   20   10  A  P N             T        Y              
EQCEADVH DS    CL8                                                              
EQCEADV  DS    CL6     17   31    6  A  U N             T        Y   70         
EQCEADVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   40    6  A  P N             T        Y              
EQCEAGYH DS    CL8                                                              
EQCEAGY  DS    CL6     17   47    6  A  U N             T        Y   80         
EQCEAGYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18   20    6  A  P N             T        Y              
EQCEOFFH DS    CL8                                                              
EQCEOFF  DS    CL6     18   27    6  A  U N             T        Y   90         
EQCEOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    18   40   11  A  P N             T        Y              
EQCESALH DS    CL8                                                              
EQCESAL  DS    CL6     18   52    6  A  U N             T        Y  100         
EQCESALX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   78    1  A  P N             T        Y              
EQCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
EQCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 448  BYTES                            
