*          DATA SET RECNTD1SD  AT LEVEL 058 AS OF 03/22/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802D1D      DATE 03/22/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MGCHAGYH DS    CL8                                                              
MGCHAGY  DS    CL6      3    2    6  A  P N             T        Y              
MGCAGYH  DS    CL8                                                              
MGCAGY   DS    CL8      3   10    8  A  P N             T        Y   40         
MGCAGYX  DS    CL8                                                              
MGCAGYNH DS    CL8                                                              
MGCAGYN  DS    CL20     3   19   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      3   41    7  A  P N             T        Y              
MGCADVH  DS    CL8                                                              
MGCADV   DS    CL8      3   49    8  A  P N             T        Y   60         
MGCADVX  DS    CL8                                                              
MGCADVNH DS    CL8                                                              
MGCADVN  DS    CL20     3   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
MGCSTAH  DS    CL8                                                              
MGCSTA   DS    CL8      4   10    8  A  P N             T        Y   90         
MGCSTAX  DS    CL8                                                              
MGCSTAMH DS    CL8                                                              
MGCSTAM  DS    CL20     4   19   20  A  P N             T        Y              
MGCHPRDH DS    CL8                                                              
MGCHPRD  DS    CL7      4   41    7  A  P N             T        Y              
MGCPRDH  DS    CL8                                                              
MGCPRD   DS    CL20     4   49   20  A  P N             T        Y   70         
MGCPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
MGCSALH  DS    CL8                                                              
MGCSAL   DS    CL3      5   10    3  A  P N             T        Y  120         
MGCSALX  DS    CL8                                                              
MGCSALNH DS    CL8                                                              
MGCSALN  DS    CL19     5   14   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   41    5  A  P N             T        Y              
MGCODTSH DS    CL8                                                              
MGCODTS  DS    CL17     5   49   17  A  P N             T        Y   30         
MGCODTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27     6   26   27  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL39     7    2   39  A  P N             T        Y              
MGCBNUMH DS    CL8                                                              
MGCBNUM  DS    CL3      7   43    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   62   12  A  P N             T        Y              
MGCLSBYH DS    CL8                                                              
MGCLSBY  DS    CL3      7   75    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL42     8    2   42  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   50    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   75    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   17    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   21    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   32    7  A  P N             T        Y              
MGCMSELH DS    CL8                                                              
MGCMSEL  DS    CL2     10    2    2  A  U N             T        Y   10         
MGCMSELX DS    CL8                                                              
MGCMDESH DS    CL8                                                              
MGCMDES  DS    CL74    10    5   74  A  P N             T        Y              
MGCMSE2H DS    CL8                                                              
MGCMSE2  DS    CL2     11    2    2  A  U N             T        Y   10         
MGCMSE2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    5   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    5   74  A  P N             T        Y              
MGCMLISH DS    CL8                                                              
MGCMLIS  DS    CL2     23    2    2  A  U N             T        Y   10         
MGCMLISX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    23    5   74  A  P N             T        Y              
MGCMLSTH DS    CL8                                                              
MGCMLST  DS    CL2     24    2    2  A  U N             T        Y   10         
MGCMLSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    24    5   74  A  P N             T        Y              
MGCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MGCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2104 BYTES                            
