*          DATA SET RECNTF7DS  AT LEVEL 004 AS OF 03/22/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F7D      DATE 03/22/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      3    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      3    5    5  A  P N             T        Y              
SARSBUXH DS    CL8                                                              
SARSBUX  DS    CL66     3   13   66  A  U N             T        Y   14         
SARSBUXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      4    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      4    5    5  A  P N             T        Y              
SARSDEMH DS    CL8                                                              
SARSDEM  DS    CL66     4   13   66  A  U N             T        Y   16         
SARSDEMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      5    5    4  A  P N             T        Y              
SARSLENH DS    CL8                                                              
SARSLEN  DS    CL25     5   13   25  A  U N             T        Y   20         
SARSLENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     5   59   11  A  P N             T        Y              
SARSACTH DS    CL8                                                              
SARSACT  DS    CL8      5   71    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     6    5   10  A  P N             T        Y              
SARSBUDH DS    CL8                                                              
SARSBUD  DS    CL8      6   17    8  A  U N             T        Y    6         
SARSBUDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     6   27   10  A  P N             T        Y              
SARSGOLH DS    CL8                                                              
SARSGOL  DS    CL5      6   39    5  A  U N             T        Y    8         
SARSGOLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     6   46   10  A  P N             T        Y              
SARSTBDH DS    CL8                                                              
SARSTBD  DS    CL8      6   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   67    4  A  P Z             T        Y              
SARSTGPH DS    CL8                                                              
SARSTGP  DS    CL7      6   72    7  A  P N             T        Y   24         
SARSTGPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    5    3  A  P N             T        Y              
SARSDPTH DS    CL8                                                              
SARSDPT  DS    CL1      7   10    1  A  U N             T        Y   18         
SARSDPTX DS    CL8                                                              
SARSNDPH DS    CL8                                                              
SARSNDP  DS    CL1      7   19    1  A  U N             T        Y   18         
SARSNDPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   28    1  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   37    1  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   46    1  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   55    1  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   64    1  A  U N             T        Y   18         
         DS    CL8                                                              
SARSLDPH DS    CL8                                                              
SARSLDP  DS    CL1      7   73    1  A  U N             T        Y   18         
SARSLDPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    5    3  A  P N             T        Y              
SARSCPPH DS    CL8                                                              
SARSCPP  DS    CL8      8   10    8  A  U N             T        Y   26         
SARSCPPX DS    CL8                                                              
SARSNCPH DS    CL8                                                              
SARSNCP  DS    CL8      8   19    8  A  U N             T        Y   26         
SARSNCPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   28    8  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   37    8  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   46    8  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   55    8  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   64    8  A  U N             T        Y   26         
         DS    CL8                                                              
SARSLCPH DS    CL8                                                              
SARSLCP  DS    CL8      8   73    8  A  U N             T        Y   26         
SARSLCPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    5    3  A  P Z             T        Y              
SARSGPFH DS    CL8                                                              
SARSGPF  DS    CL1      9   10    1  A  P N             T        Y              
SARSGRPH DS    CL8                                                              
SARSGRP  DS    CL4      9   12    4  A  P N             T        Y   22         
SARSGRPX DS    CL8                                                              
SARSNGPH DS    CL8                                                              
SARSNGP  DS    CL4      9   19    4  A  P N             T        Y   22         
SARSNGPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9   28    4  A  P N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9   37    4  A  P N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9   46    4  A  P N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9   55    4  A  P N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9   64    4  A  P N             T        Y   22         
         DS    CL8                                                              
SARSLGPH DS    CL8                                                              
SARSLGP  DS    CL4      9   73    4  A  P N             T        Y   22         
SARSLGPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    5    8  A  P N             T        Y              
SARSCM1H DS    CL8                                                              
SARSCM1  DS    CL60    10   15   60  A  U N             T        Y   30         
SARSCM1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  P N             T        Y              
SARSCM2H DS    CL8                                                              
SARSCM2  DS    CL60    11   15   60  A  U N             T        Y   30         
SARSCM2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    12   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    13   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    14   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    15   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    16   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    18   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    19   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    20   15   60  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
SARSLCMH DS    CL8                                                              
SARSLCM  DS    CL60    21   15   60  A  U N             T        Y   30         
SARSLCMX DS    CL8                                                              
SARLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SARWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2064 BYTES                            
