*          DATA SET RECNTD9D   AT LEVEL 009 AS OF 04/03/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802D9D      DATE 04/03/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL31    12    2   31  A  P N             T        Y              
CFCMGOH  DS    CL8                                                              
CFCMGO   DS    CL1     12   35    1  A  U N             T        Y              
CFCMSGH  DS    CL8                                                              
CFCMSG   DS    CL60    13   11   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
CFCCMT1H DS    CL8                                                              
CFCCMT1  DS    CL60    14   11   60  A  U N             T        Y              
CFCCMT2H DS    CL8                                                              
CFCCMT2  DS    CL60    15   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    16   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    18   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    19   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    20   11   60  A  U N             T        Y              
CFCCMTXH DS    CL8                                                              
CFCCMTX  DS    CL60    21   11   60  A  U N             T        Y              
CFCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CFCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 680  BYTES                            
