*          DATA SET RECNTBFD   AT LEVEL 018 AS OF 03/01/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802BFD      DATE 03/01/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      3    2    7  A  P N             T        Y              
AUDAGYH  DS    XL8                                                              
AUDAGY   DS    CL8      3   10    8  A  P N             T        Y   10         
AUDAGYX  DS    XL8                                                              
AUDAGYNH DS    XL8                                                              
AUDAGYN  DS    CL20     3   19   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      3   42    7  A  P N             T        Y              
AUDADVH  DS    XL8                                                              
AUDADV   DS    CL8      3   50    8  A  P N             T        Y   20         
AUDADVX  DS    XL8                                                              
AUDADVNH DS    XL8                                                              
AUDADVN  DS    CL20     3   59   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
AUDSTAH  DS    XL8                                                              
AUDSTA   DS    CL8      4   10    8  A  P N             T        Y   30         
AUDSTAX  DS    XL8                                                              
AUDSTAMH DS    XL8                                                              
AUDSTAM  DS    CL20     4   19   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   42    7  A  P N             T        Y              
AUDPRDH  DS    XL8                                                              
AUDPRD   DS    CL8      4   50    8  A  P N             T        Y   40         
AUDPRDX  DS    XL8                                                              
AUDPRDNH DS    XL8                                                              
AUDPRDN  DS    CL20     4   59   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
AUDSALH  DS    XL8                                                              
AUDSAL   DS    CL8      5   10    8  A  P N             T        Y   50         
AUDSALX  DS    XL8                                                              
AUDSALNH DS    XL8                                                              
AUDSALN  DS    CL20     5   19   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   42    5  A  P N             T        Y              
AUDODTSH DS    XL8                                                              
AUDODTS  DS    CL20     5   50   20  A  P N             T        Y   60         
AUDODTSX DS    XL8                                                              
AUDVERH  DS    XL8                                                              
AUDVER   DS    CL8      7    2    8  A  P N             T        Y  100         
AUDVERX  DS    XL8                                                              
AUDADTH  DS    XL8                                                              
AUDADT   DS    CL8      7   11    8  A  P N             T        Y  110         
AUDADTX  DS    XL8                                                              
AUDATMH  DS    XL8                                                              
AUDATM   DS    CL8      7   20    8  A  P N             T        Y  120         
AUDATMX  DS    XL8                                                              
AUDPIDTH DS    XL8                                                              
AUDPIDT  DS    CL4      7   29    4  A  P N             T        Y              
AUDPIDH  DS    XL8                                                              
AUDPID   DS    CL8      7   34    8  A  P N             T        Y              
AUDASTTH DS    XL8                                                              
AUDASTT  DS    CL4      7   43    4  A  P N             T        Y              
AUDASTH  DS    XL8                                                              
AUDAST   DS    CL9      7   50    9  A  P N             T        Y   20         
AUDASTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7   60    5  A  P N             T        Y              
AUDTOTH  DS    XL8                                                              
AUDTOT   DS    CL12     7   66   12  A  P N             T        Y   10         
AUDTOTX  DS    XL8                                                              
AUDRCTTH DS    XL8                                                              
AUDRCTT  DS    CL7      9    2    7  A  P N             T        Y              
AUDRCMTH DS    XL8                                                              
AUDRCMT  DS    CL60     9   11   60  A  P N             T        Y   31         
AUDRCMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    10   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    11   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    12   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    13   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    14   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    15   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    16   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    17   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    18   11   60  A  P N             T        Y   31         
         DS    XL8                                                              
AUDCMTTH DS    XL8                                                              
AUDCMTT  DS    CL7     20    2    7  A  P N             T        Y              
AUDCMTH  DS    XL8                                                              
AUDCMT   DS    CL68    20   11   68  A  U N             T        Y   41         
AUDCMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL68    21   11   68  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL68    22   11   68  A  U N             T        Y   41         
         DS    XL8                                                              
AUDTABH  DS    XL8                                                              
AUDTAB   DS    CL1     23   76    1  A  U N             T        Y              
AUDPFKSH DS    XL8                                                              
AUDPFKS  DS    CL79    24    2   79  A  P N             T        Y              
AUDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
AUDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1704 BYTES                            
