*          DATA SET RECNTDFD   AT LEVEL 004 AS OF 06/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802DFD      DATE 06/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      2   41    4  A  P N             T        Y              
BU2TYPEH DS    XL8                                                              
BU2TYPE  DS    CL2      2   49    2  A  P N             T        Y  110         
BU2TYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     2   69   11  A  P N             T        Y              
BU2STAH  DS    XL8                                                              
BU2STA   DS    CL7      3    2    7  A  P N             T        Y              
BU2SALH  DS    XL8                                                              
BU2SAL   DS    CL3      3   11    3  A  P N             T        Y              
BU2HDTEH DS    XL8                                                              
BU2HDTE  DS    CL17     3   25   17  A  P N             T        Y              
BU2AGYH  DS    XL8                                                              
BU2AGY   DS    CL7      3   49    7  A  P N             T        Y              
BU2AGYNH DS    XL8                                                              
BU2AGYN  DS    CL6      3   57    6  A  P N             T        Y              
BU2ADVH  DS    XL8                                                              
BU2ADV   DS    CL4      3   65    4  A  P N             T        Y              
BU2ADVNH DS    XL8                                                              
BU2ADVN  DS    CL10     3   70   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
BU2BACTH DS    XL8                                                              
BU2BACT  DS    CL8      4   11    8  A  U N        M    T        Y    0         
BU2BACTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   41    7  A  P N             T        Y              
BU2BNUMH DS    XL8                                                              
BU2BNUM  DS    CL8      4   50    8  A  U N             T        Y    0         
BU2BNUMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5    6    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   14    8  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   24    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   32    8  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   42    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   50    8  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   60    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   68    8  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
BU2DAYSH DS    XL8                                                              
BU2DAYS  DS    CL60     6   11   60  A  U N             T        Y    0         
BU2DAYSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
BU2TIMSH DS    XL8                                                              
BU2TIMS  DS    CL60     7   11   60  A  U N             T        Y    0         
BU2TIMSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
BU2LENH  DS    XL8                                                              
BU2LEN   DS    CL8      8   11    8  A  U N             T        Y    0         
BU2LENX  DS    XL8                                                              
BU2CCOVH DS    XL8                                                              
BU2CCOV  DS    CL11     8   21   11  A  P Z             T        Y              
BU2DCATH DS    XL8                                                              
BU2DCAT  DS    CL10     8   34   10  A  P N             T        Y              
BU2DVALH DS    XL8                                                              
BU2DVAL  DS    CL8      8   45    8  A  U N             T        Y              
BU2BCODH DS    XL8                                                              
BU2BCOD  DS    CL8      8   55    8  A  P Z             T        Y              
BU2SCODH DS    XL8                                                              
BU2SCOD  DS    CL3      8   65    3  A  P Z             T        Y              
BU2XDAYH DS    XL8                                                              
BU2XDAY  DS    CL7      8   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
BU2DTESH DS    XL8                                                              
BU2DTES  DS    CL60     9   11   60  A  U N             T        Y    0         
BU2DTESX DS    XL8                                                              
BU2DTE2H DS    XL8                                                              
BU2DTE2  DS    CL60    10   11   60  A  U N             T        Y    0         
BU2DTE2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11    2    4  A  P N             T        Y              
BU2TYPH  DS    XL8                                                              
BU2TYP   DS    CL2     11   11    2  A  U N             T        Y    0         
BU2TYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   15    3  A  P N             T        Y              
BU2DPTH  DS    XL8                                                              
BU2DPT   DS    CL1     11   21    1  A  U N             T        Y    0         
BU2DPTX  DS    XL8                                                              
BU2CLSPH DS    XL8                                                              
BU2CLSP  DS    CL3     11   25    3  A  P N             T        Y              
BU2CLSH  DS    XL8                                                              
BU2CLS   DS    CL10    11   30   10  A  U N             T        Y    0         
BU2CLSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11   42    4  A  P N             T        Y              
BU2SECH  DS    XL8                                                              
BU2SEC   DS    CL8     11   49    8  A  U N             T        Y    0         
BU2SECX  DS    XL8                                                              
BU2PLNLH DS    XL8                                                              
BU2PLNL  DS    CL4     11   60    4  A  P N             T        Y              
BU2PLNH  DS    XL8                                                              
BU2PLN   DS    CL8     11   67    8  A  U N             T        Y    0         
BU2PLNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
BU2NPWH  DS    XL8                                                              
BU2NPW   DS    CL8     12   11    8  A  U N             T        Y    0         
BU2NPWX  DS    XL8                                                              
BU2CMBSH DS    XL8                                                              
BU2CMBS  DS    CL6     12   31    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   41    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   51    6  A  P N             T        Y              
BU2CMBLH DS    XL8                                                              
BU2CMBL  DS    CL6     12   61    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
BU2RATEH DS    XL8                                                              
BU2RATE  DS    CL9     13   11    9  A  U N             T        Y    0         
BU2RATEX DS    XL8                                                              
BU2CBC1H DS    XL8                                                              
BU2CBC1  DS    CL8     13   30    8  A  U N             T        Y    0         
BU2CBC1X DS    XL8                                                              
BU2CBC2H DS    XL8                                                              
BU2CBC2  DS    CL8     13   40    8  A  U N             T        Y    0         
BU2CBC2X DS    XL8                                                              
BU2CBC3H DS    XL8                                                              
BU2CBC3  DS    CL8     13   50    8  A  U N             T        Y    0         
BU2CBC3X DS    XL8                                                              
BU2CBC4H DS    XL8                                                              
BU2CBC4  DS    CL8     13   60    8  A  U N             T        Y    0         
BU2CBC4X DS    XL8                                                              
BU2COMTH DS    XL8                                                              
BU2COMT  DS    CL7     14    2    7  A  P N             T        Y              
BU2COM1H DS    XL8                                                              
BU2COM1  DS    CL60    14   11   60  A  U N             T        Y    0         
BU2COM1X DS    XL8                                                              
BU2COMUH DS    XL8                                                              
BU2COMU  DS    CL7     15    2    7  A  P N             T        Y              
BU2COM2H DS    XL8                                                              
BU2COM2  DS    CL60    15   11   60  A  U N             T        Y    0         
BU2COM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
BU2ORDCH DS    XL8                                                              
BU2ORDC  DS    CL60    16   11   60  A  U N             T        Y    0         
BU2ORDCX DS    XL8                                                              
BU2MODH  DS    XL8                                                              
BU2MOD   DS    CL2     16   73    2  A  P N             T        Y              
BU2FLTH  DS    XL8                                                              
BU2FLT   DS    CL3     16   76    3  A  P N             T        Y              
BU2ORD2H DS    XL8                                                              
BU2ORD2  DS    CL60    17   11   60  A  U N             T        Y    0         
BU2ORD2X DS    XL8                                                              
BU2NOTLH DS    XL8                                                              
BU2NOTL  DS    CL5     18    2    5  A  P Z             T        Y              
BU2NOTH  DS    XL8                                                              
BU2NOT   DS    CL15    18    8   15  A  P N             T        Y              
BU2UPTLH DS    XL8                                                              
BU2UPTL  DS    CL8     18   25    8  A  P Z             T        Y              
BU2UPTH  DS    XL8                                                              
BU2UPT   DS    CL1     18   34    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   37    4  A  P N             T        Y              
BU2PGMH  DS    XL8                                                              
BU2PGM   DS    CL34    18   42   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   15    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   19    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   25   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   38    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   48   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   65    3  A  P N             T        Y              
BU2MD1H  DS    XL8                                                              
BU2MD1   DS    CL12    20    2   12  A  U N             T        Y              
BU2SP1H  DS    XL8                                                              
BU2SP1   DS    CL3     20   15    3  N  U N             T        Y              
BU2LN1H  DS    XL8                                                              
BU2LN1   DS    CL3     20   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   48   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   61    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   15    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   48   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   61    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   15    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   48   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   61    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    23    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   15    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   42    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   48   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   61    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    24    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   15    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   19    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    24   25   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   38    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   42    3  N  U N             T        Y              
BU2MDLH  DS    XL8                                                              
BU2MDL   DS    CL12    24   48   12  A  U N             T        Y              
BU2SPLH  DS    XL8                                                              
BU2SPL   DS    CL3     24   61    3  N  U N             T        Y              
BU2LNLH  DS    XL8                                                              
BU2LNL   DS    CL3     24   65    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   75    1  A  U N             T        Y              
BU2LAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BU2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2520 BYTES                            
