*          DATA SET RECNTF1D   AT LEVEL 003 AS OF 07/28/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F1D      DATE 07/28/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
MCGOLD#H DS    CL8                                                              
MCGOLD#  DS    CL4     12   11    4  A   U    N         T        Y   10         
MCGOLD#X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    N         T        Y              
MCGBUYSH DS    CL8                                                              
MCGBUYS  DS    CL8     13   11    8  A   U    N         T        Y   20         
MCGBUYSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A   P    N         T        Y              
MCGNEWNH DS    CL8                                                              
MCGNEWN  DS    CL6     15   11    6  A   U    N         T        Y   30         
MCGNEWNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
MCGFLTH  DS    CL8                                                              
MCGFLT   DS    CL60    16   11   60  A   U    N         T        Y   40         
MCGFLTX  DS    CL8                                                              
MCGTABH  DS    CL8                                                              
MCGTAB   DS    CL1     17   11    1  A   U    N         T        Y   50         
MCGTABX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A   P    N         T        Y              
MCGERR1H DS    CL8                                                              
MCGERR1  DS    CL78    20    2   78  A   P    N         T        Y              
MCGERR2H DS    CL8                                                              
MCGERR2  DS    CL78    21    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A   P    N         T        Y              
MCGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MCGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 448  BYTES                            
