*          DATA SET RECNTD6D   AT LEVEL 013 AS OF 09/12/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802D6D      DATE 09/12/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MVKTXT1H DS    CL8                                                              
MVKTXT1  DS    CL20    13    5   20  A  P N             T        Y              
MVKSREPH DS    CL8                                                              
MVKSREP  DS    CL2     13   26    2  A  P N             T        Y              
MVKTXT2H DS    CL8                                                              
MVKTXT2  DS    CL21    15    5   21  A  P N             T        Y              
MVKDREPH DS    CL8                                                              
MVKDREP  DS    CL2     15   27    2  A  U N             T        Y              
MVKTXT3H DS    CL8                                                              
MVKTXT3  DS    CL39    17    5   39  A  P Z             T        Y              
MVKDCONH DS    CL8                                                              
MVKDCON  DS    CL8     17   45    8  A  P Z             T        Y              
MVKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MVKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 144  BYTES                            
