*          DATA SET RECNTE9D   AT LEVEL 001 AS OF 09/12/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802E9D      DATE 09/12/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL23    12   28   23  A  P N             T        Y              
EQCFLGH  DS    CL8                                                              
EQCFLG   DS    CL23    13    2   23  A  P N             T        Y              
EQCEADVH DS    CL8                                                              
EQCEADV  DS    CL5     13   28    5  A  U N             T        Y   10         
EQCEADVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    13   41   19  A  P N             T        Y              
EQCEAGYH DS    CL8                                                              
EQCEAGY  DS    CL6     13   63    6  A  U N             T        Y   20         
EQCEAGYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    14    2   19  A  P N             T        Y              
EQCEOFFH DS    CL8                                                              
EQCEOFF  DS    CL3     14   28    3  A  U N             T        Y   30         
EQCEOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    14   41   19  A  P N             T        Y              
EQCESALH DS    CL8                                                              
EQCESAL  DS    CL4     14   63    4  A  U N             T        Y   40         
EQCESALX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     16    2    9  A  P N             T        Y              
EQCRATEH DS    CL8                                                              
EQCRATE  DS    CL6     16   28    6  A  U N             T        Y   50         
EQCRATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    16   41   16  A  P N             T        Y              
EQCCUSH  DS    CL8                                                              
EQCCUS   DS    CL6     16   63    6  A  U N             T        Y   60         
EQCCUSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    17    2   13  A  P N             T        Y              
EQCCYCH  DS    CL8                                                              
EQCCYC   DS    CL6     17   28    6  A  U N             T        Y   70         
EQCCYCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    17   41   16  A  P N             T        Y              
EQCRCATH DS    CL8                                                              
EQCRCAT  DS    CL6     17   63    6  A  U N             T        Y   80         
EQCRCATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
EQCTFLGH DS    CL8                                                              
EQCTFLG  DS    CL6     18   28    6  A  U N             T        Y   90         
EQCTFLGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    18   41   19  A  P N             T        Y              
EQCPCT1H DS    CL8                                                              
EQCPCT1  DS    CL6     18   63    6  A  U N             T        Y  100         
EQCPCT1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    19    2   19  A  P N             T        Y              
EQCPCT2H DS    CL8                                                              
EQCPCT2  DS    CL6     19   28    6  A  U N             T        Y  110         
EQCPCT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19   41    9  A  P N             T        Y              
EQCCTYPH DS    CL8                                                              
EQCCTYP  DS    CL6     19   63    6  A  U N             T        Y  120         
EQCCTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    20    2   19  A  P N             T        Y              
EQCCSEPH DS    CL8                                                              
EQCCSEP  DS    CL6     20   28    6  A  U N             T        Y  130         
EQCCSEPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    20   41   16  A  P N             T        Y              
EQCSHANH DS    CL8                                                              
EQCSHAN  DS    CL6     20   63    6  A  U N             T        Y  140         
EQCSHANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
EQCICMTH DS    CL8                                                              
EQCICMT  DS    CL6     21   28    6  A  U N             T        Y  150         
EQCICMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    21   41   20  A  P N             T        Y              
EQCIMSCH DS    CL8                                                              
EQCIMSC  DS    CL6     21   63    6  A  U N             T        Y  160         
EQCIMSCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    22    2   14  A  P N             T        Y              
EQCSTAXH DS    CL8                                                              
EQCSTAX  DS    CL6     22   28    6  A  U N             T        Y  170         
EQCSTAXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     22   41    3  A  P N             T        Y              
EQCNRLH  DS    CL8                                                              
EQCNRL   DS    CL6     22   63    6  A  U N             T        Y  180         
EQCNRLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    23    2   15  A  P N             T        Y              
EQCTORDH DS    CL8                                                              
EQCTORD  DS    CL6     23   28    6  A  U N             T        Y  190         
EQCTORDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   78    1  A  P N             T        Y              
EQCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
EQCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 904  BYTES                            
