*          DATA SET RECNTC0D   AT LEVEL 002 AS OF 04/07/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802C0D      DATE 04/07/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL3      2   46    3  A  P N             T        Y              
MGHESTH  DS    XL8                                                              
MGHEST   DS    CL10     2   51   10  A  P N             T        Y              
MGHSTAH  DS    XL8                                                              
MGHSTA   DS    CL7      3    2    7  A  P N             T        Y              
MGHDTESH DS    XL8                                                              
MGHDTES  DS    CL17     3   25   17  A  P N             T        Y              
MGHAGYH  DS    XL8                                                              
MGHAGY   DS    CL7      3   46    7  A  P N             T        Y              
MGHAGYNH DS    XL8                                                              
MGHAGYN  DS    CL6      3   54    6  A  P N             T        Y              
MGHADVH  DS    XL8                                                              
MGHADV   DS    CL4      3   62    4  A  P N             T        Y              
MGHADVNH DS    XL8                                                              
MGHADVN  DS    CL11     3   67   11  A  P N             T        Y              
MGHSALH  DS    XL8                                                              
MGHSAL   DS    CL3      4    2    3  A  P N             T        Y              
MGHPRDH  DS    XL8                                                              
MGHPRD   DS    CL20     4   25   20  A  P N             T        Y              
MGHMOPQH DS    XL8                                                              
MGHMOPQ  DS    CL15     4   46   15  A  P N             T        Y              
MGHMOPTH DS    XL8                                                              
MGHMOPT  DS    CL2      4   62    2  A  U N             T        Y              
MGHDKADH DS    XL8                                                              
MGHDKAD  DS    CL8      4   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     5    2   14  A  P H             T        Y              
MGHMGRPH DS    XL8                                                              
MGHMGRP  DS    CL2      5   17    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   25    6  A  P N             T        Y              
MGHSTATH DS    XL8                                                              
MGHSTAT  DS    CL8      5   32    8  A  P N             T        Y              
MGHRSWPH DS    XL8                                                              
MGHRSWP  DS    CL3      5   41    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   46    5  A  P N             T        Y              
MGHCRDTH DS    XL8                                                              
MGHCRDT  DS    CL8      5   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   62    5  A  P N             T        Y              
MGHUPDTH DS    XL8                                                              
MGHUPDT  DS    CL8      5   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
MGHGCMTH DS    XL8                                                              
MGHGCMT  DS    CL70     6    8   70  A  U N             T        Y              
MGHGCM2H DS    XL8                                                              
MGHGCM2  DS    CL70     7    8   70  A  U N             T        Y              
MGHGCM3H DS    XL8                                                              
MGHGCM3  DS    CL70     8    8   70  A  U N             T        Y              
MGHTAGH  DS    XL8                                                              
MGHTAG   DS    CL1      9    2    1  A  P N             T        Y              
MGHLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MGHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 608  BYTES                            
