*          DATA SET RECNTEBD   AT LEVEL 009 AS OF 05/25/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802EBD      DATE 05/25/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL29     9   24   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    11    2   16  A  P N             T        Y              
FORSBUDH DS    CL8                                                              
FORSBUD  DS    CL8     11   19    8  A  U N             T        Y   10         
FORSBUDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    11   31   10  A  P N             T        Y              
FORSGOLH DS    CL8                                                              
FORSGOL  DS    CL5     11   42    5  A  U N             T        Y   20         
FORSGOLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11   51   11  A  P N             T        Y              
FORLUPDH DS    CL8                                                              
FORLUPD  DS    CL8     11   63    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
FORCMT1H DS    CL8                                                              
FORCMT1  DS    CL60    13   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   12    2  A  P N             T        Y              
FORCMT2H DS    CL8                                                              
FORCMT2  DS    CL60    14   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   12    2  A  P N             T        Y              
FORCMT3H DS    CL8                                                              
FORCMT3  DS    CL60    15   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   12    2  A  P N             T        Y              
FORCMT4H DS    CL8                                                              
FORCMT4  DS    CL60    16   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   78    1  A  P N             T        Y              
FORLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
FORWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 496  BYTES                            
