*          DATA SET RECNTF2D   AT LEVEL 023 AS OF 04/16/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F2D      DATE 04/16/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
MCIOLDBH DS    CL8                                                              
MCIOLDB  DS    CL20    12   15   20  A  U N             T        Y              
MCIORLH  DS    CL8                                                              
MCIORL   DS    CL2     12   37    2  A  P N             T        Y              
MCIOFLH  DS    CL8                                                              
MCIOFL   DS    CL14    12   43   14  A  P N             T        Y              
MCIOLDFH DS    CL8                                                              
MCIOLDF  DS    CL15    12   59   15  A  U N             T        Y              
MCIFLTLH DS    CL8                                                              
MCIFLTL  DS    CL12    14    2   12  A  P N             T        Y              
MCIFLTH  DS    CL8                                                              
MCIFLT   DS    CL4     14   16    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
MCIDAYSH DS    CL8                                                              
MCIDAYS  DS    CL60    15   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
MCITIMEH DS    CL8                                                              
MCITIME  DS    CL60    16   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
MCILENH  DS    CL8                                                              
MCILEN   DS    CL8     17   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
MCIDATEH DS    CL8                                                              
MCIDATE  DS    CL60    18   11   60  A  U N             T        Y              
MCISTA1H DS    CL8                                                              
MCISTA1  DS    CL6     19   13    6  A  P N             T        Y              
MCISTA2H DS    CL8                                                              
MCISTA2  DS    CL6     19   24    6  A  P N             T        Y              
MCISTA3H DS    CL8                                                              
MCISTA3  DS    CL6     19   35    6  A  P N             T        Y              
MCISTA4H DS    CL8                                                              
MCISTA4  DS    CL6     19   46    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20    2    4  A  P N             T        Y              
MCIRAT1H DS    CL8                                                              
MCIRAT1  DS    CL8     20   11    8  A  U N             T        Y              
MCIRAT2H DS    CL8                                                              
MCIRAT2  DS    CL8     20   22    8  A  P N             T        Y              
MCIRAT3H DS    CL8                                                              
MCIRAT3  DS    CL8     20   33    8  A  P N             T        Y              
MCIRAT4H DS    CL8                                                              
MCIRAT4  DS    CL8     20   44    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
MCICMT1H DS    CL8                                                              
MCICMT1  DS    CL60    21   11   60  A  U N             T        Y              
MCICMT2H DS    CL8                                                              
MCICMT2  DS    CL60    22   11   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
MCIOCM1H DS    CL8                                                              
MCIOCM1  DS    CL60    23   11   60  A  U N             T        Y              
MCIOCM2H DS    CL8                                                              
MCIOCM2  DS    CL60    24   11   60  A  U N             T        Y              
MCILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MCIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
