*          DATA SET RECNTEED   AT LEVEL 004 AS OF 09/05/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802EED      DATE 09/05/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4     12    2    4  A   P    N         T        Y              
UNICSHH  DS    CL8                                                              
UNICSH   DS    CL2     12   14    2  A   U    N         T        Y   10         
UNICSHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     12   21    5  A   P    N         T        Y              
UNITRDEH DS    CL8                                                              
UNITRDE  DS    CL2     12   31    2  A   U    N         T        Y   20         
UNITRDEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12   37    6  A   P    N         T        Y              
UNINONH  DS    CL8                                                              
UNINON   DS    CL2     12   45    2  A   U    N         T        Y   30         
UNINONX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13    2    5  A   P    N         T        Y              
UNILOCH  DS    CL8                                                              
UNILOC   DS    CL1     13   14    1  A   U    N         T        Y   40         
UNILOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   21    8  A   P    N         T        Y              
UNINATH  DS    CL8                                                              
UNINAT   DS    CL1     13   31    1  A   U    N         T        Y   50         
UNINATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13   37    4  A   P    N         T        Y              
UNILOCPH DS    CL8                                                              
UNILOCP  DS    CL1     13   45    1  A   U    N         T        Y   60         
UNILOCPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13   51    4  A   P    N         T        Y              
UNINATPH DS    CL8                                                              
UNINATP  DS    CL1     13   58    1  A   U    N         T        Y   70         
UNINATPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
UNISTNDH DS    CL8                                                              
UNISTND  DS    CL1     14   14    1  A   U    N         T        Y   80         
UNISTNDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   21    8  A   P    N         T        Y              
UNICALH  DS    CL8                                                              
UNICAL   DS    CL1     14   31    1  A   U    N         T        Y   90         
UNICALX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   37    6  A   P    N         T        Y              
UNIWKLYH DS    CL8                                                              
UNIWKLY  DS    CL1     14   45    1  A   U    N         T        Y  100         
UNIWKLYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   P    N         T        Y              
UNIPAMTH DS    CL8                                                              
UNIPAMT  DS    CL3     15   14    3  A   U    N         T        Y  110         
UNIPAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   P    N         T        Y              
UNISAMTH DS    CL8                                                              
UNISAMT  DS    CL3     16   14    3  A   U    N         T        Y  120         
UNISAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     17    2    9  A   P    N         T        Y              
UNIMPRDH DS    CL8                                                              
UNIMPRD  DS    CL1     17   14    1  A   U    N         T        Y  130         
UNIMPRDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    2    7  A   P    N         T        Y              
UNISEPIH DS    CL8                                                              
UNISEPI  DS    CL1     18   14    1  A   U    N         T        Y  140         
UNISEPIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19    2   11  A   P    N         T        Y              
UNISPTPH DS    CL8                                                              
UNISPTP  DS    CL1     19   14    1  A   U    N         T        Y  150         
UNISPTPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   P    N         T        Y              
UNIRMKH  DS    CL8                                                              
UNIRMK   DS    CL14    20   14   14  A   U    N         T        Y  160         
UNIRMKX  DS    CL8                                                              
UNITABH  DS    CL8                                                              
UNITAB   DS    CL1     21   11    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   41    1  A   P    N         T        Y              
UNILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
UNIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 544  BYTES                            
