*          DATA SET RECNTFED   AT LEVEL 004 AS OF 06/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802FED      DATE 06/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
BUYDAYSH DS    XL8                                                              
BUYDAYS  DS    CL60    12   11   60  A  U N             T        Y   10         
BUYDAYSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
BUYTIMSH DS    XL8                                                              
BUYTIMS  DS    CL60    13   11   60  A  U N             T        Y   20         
BUYTIMSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
BUYLENH  DS    XL8                                                              
BUYLEN   DS    CL8     14   11    8  A  U N             T        Y   30         
BUYLENX  DS    XL8                                                              
BUYCCOVH DS    XL8                                                              
BUYCCOV  DS    CL11    14   21   11  A  P Z             T        Y              
BUYDCATH DS    XL8                                                              
BUYDCAT  DS    CL10    14   34   10  A  P N             T        Y              
BUYDVALH DS    XL8                                                              
BUYDVAL  DS    CL8     14   45    8  A  U N             T        Y              
BUYBCODH DS    XL8                                                              
BUYBCOD  DS    CL8     14   55    8  A  P Z             T        Y              
BUYSCODH DS    XL8                                                              
BUYSCOD  DS    CL3     14   65    3  A  P Z             T        Y              
BUYXDAYH DS    XL8                                                              
BUYXDAY  DS    CL7     14   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
BUYDTESH DS    XL8                                                              
BUYDTES  DS    CL60    15   11   60  A  U N             T        Y   40         
BUYDTESX DS    XL8                                                              
BUYDTE2H DS    XL8                                                              
BUYDTE2  DS    CL60    16   11   60  A  U N             T        Y   40         
BUYDTE2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17    2    4  A  P N             T        Y              
BUYTYPH  DS    XL8                                                              
BUYTYP   DS    CL2     17   11    2  A  U N             T        Y   50         
BUYTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   15    3  A  P N             T        Y              
BUYDPTH  DS    XL8                                                              
BUYDPT   DS    CL1     17   21    1  A  U N             T        Y   55         
BUYDPTX  DS    XL8                                                              
BUYCLSPH DS    XL8                                                              
BUYCLSP  DS    CL3     17   25    3  A  P N             T        Y              
BUYCLSH  DS    XL8                                                              
BUYCLS   DS    CL10    17   30   10  A  U N             T        Y   60         
BUYCLSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17   42    4  A  P N             T        Y              
BUYSECH  DS    XL8                                                              
BUYSEC   DS    CL8     17   49    8  A  U N             T        Y   70         
BUYSECX  DS    XL8                                                              
BUYPLNLH DS    XL8                                                              
BUYPLNL  DS    CL4     17   60    4  A  P N             T        Y              
BUYPLNH  DS    XL8                                                              
BUYPLN   DS    CL8     17   67    8  A  U N             T        Y   80         
BUYPLNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
BUYNPWH  DS    XL8                                                              
BUYNPW   DS    CL8     18   11    8  A  U N             T        Y   90         
BUYNPWX  DS    XL8                                                              
BUYCMBSH DS    XL8                                                              
BUYCMBS  DS    CL6     18   31    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   41    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   51    6  A  P N             T        Y              
BUYCMBLH DS    XL8                                                              
BUYCMBL  DS    CL6     18   61    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
BUYRATEH DS    XL8                                                              
BUYRATE  DS    CL9     19   11    9  A  U N             T        Y  100         
BUYRATEX DS    XL8                                                              
BUYCBC1H DS    XL8                                                              
BUYCBC1  DS    CL8     19   30    8  A  U N             T        Y  105         
BUYCBC1X DS    XL8                                                              
BUYCBC2H DS    XL8                                                              
BUYCBC2  DS    CL8     19   40    8  A  U N             T        Y  105         
BUYCBC2X DS    XL8                                                              
BUYCBC3H DS    XL8                                                              
BUYCBC3  DS    CL8     19   50    8  A  U N             T        Y  105         
BUYCBC3X DS    XL8                                                              
BUYCBC4H DS    XL8                                                              
BUYCBC4  DS    CL8     19   60    8  A  U N             T        Y  105         
BUYCBC4X DS    XL8                                                              
BUYCOMTH DS    XL8                                                              
BUYCOMT  DS    CL7     20    2    7  A  P N             T        Y              
BUYCOM1H DS    XL8                                                              
BUYCOM1  DS    CL60    20   11   60  A  U N             T        Y  110         
BUYCOM1X DS    XL8                                                              
BUYCOMUH DS    XL8                                                              
BUYCOMU  DS    CL7     21    2    7  A  P N             T        Y              
BUYCOM2H DS    XL8                                                              
BUYCOM2  DS    CL60    21   11   60  A  U N             T        Y  110         
BUYCOM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
BUYORDCH DS    XL8                                                              
BUYORDC  DS    CL60    22   11   60  A  U N             T        Y  120         
BUYORDCX DS    XL8                                                              
BUYMODH  DS    XL8                                                              
BUYMOD   DS    CL2     22   73    2  A  P N             T        Y              
BUYFLTH  DS    XL8                                                              
BUYFLT   DS    CL3     22   76    3  A  P N             T        Y              
BUYORD2H DS    XL8                                                              
BUYORD2  DS    CL60    23   11   60  A  U N             T        Y  120         
BUYORD2X DS    XL8                                                              
BUYNOTLH DS    XL8                                                              
BUYNOTL  DS    CL5     24    2    5  A  P Z             T        Y              
BUYNOTH  DS    XL8                                                              
BUYNOT   DS    CL15    24    8   15  A  P N             T        Y              
BUYUPTLH DS    XL8                                                              
BUYUPTL  DS    CL8     24   25    8  A  P Z             T        Y              
BUYUPTH  DS    XL8                                                              
BUYUPT   DS    CL1     24   34    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     24   37    4  A  P N             T        Y              
BUYPGMH  DS    XL8                                                              
BUYPGM   DS    CL34    24   42   34  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
BUYLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BUYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1376 BYTES                            
