*          DATA SET RECNTFBD   AT LEVEL 001 AS OF 05/01/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802FBD      DATE 05/01/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13    12    2   13  A  P N             T        Y              
BOPORDH  DS    CL8                                                              
BOPORD   DS    CL4     12   21    4  A  U N             T        Y   10         
BOPORDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
BOPTIMEH DS    CL8                                                              
BOPTIME  DS    CL20    13   21   20  A  U N             T        Y   20         
BOPTIMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    14    2   17  A  P N             T        Y              
BOPBOBJH DS    CL8                                                              
BOPBOBJ  DS    CL20    14   21   20  A  U N             T        Y   30         
BOPBOBJX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
BOPBOOKH DS    CL8                                                              
BOPBOOK  DS    CL10    15   21   10  A  U N             T        Y   40         
BOPBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
BOPDEMOH DS    CL8                                                              
BOPDEMO  DS    CL20    16   21   20  A  U N             T        Y   50         
BOPDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17    2   11  A  P N             T        Y              
BOPMRKTH DS    CL8                                                              
BOPMRKT  DS    CL5     17   21    5  A  U N             T        Y   60         
BOPMRKTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    18    2   14  A  P N             T        Y              
BOPMERCH DS    CL8                                                              
BOPMERC  DS    CL4     18   21    4  A  U N             T        Y   70         
BOPMERCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19    2    9  A  P N             T        Y              
BOPAIRWH DS    CL8                                                              
BOPAIRW  DS    CL2     19   21    2  N  U N             T        Y   80         
BOPAIRWX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
BOPOTH1H DS    CL8                                                              
BOPOTH1  DS    CL35    20   21   35  A  U N             T        Y   90         
BOPOTH1X DS    CL8                                                              
BOPOTH2H DS    CL8                                                              
BOPOTH2  DS    CL35    21   21   35  A  U N             T        Y   90         
BOPOTH2X DS    CL8                                                              
BOPOTH3H DS    CL8                                                              
BOPOTH3  DS    CL35    22   21   35  A  U N             T        Y   90         
BOPOTH3X DS    CL8                                                              
BOPOTH4H DS    CL8                                                              
BOPOTH4  DS    CL35    23   21   35  A  U N             T        Y   90         
BOPOTH4X DS    CL8                                                              
BOPTABH  DS    CL8                                                              
BOPTAB   DS    CL1     23   66    1  A  U N             T        Y              
BOPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BOPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 616  BYTES                            
