*          DATA SET RECNTE3DS  AT LEVEL 005 AS OF 05/29/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802E3D      DATE 05/29/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      2   41    4  A  P N             T        Y              
CONTYPEH DS    CL8                                                              
CONTYPE  DS    CL2      2   49    2  A  U N             T        Y  110         
CONTYPEX DS    CL8                                                              
CONMODH  DS    CL8                                                              
CONMOD   DS    CL11     2   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  A  P N             T        Y              
CONAGYH  DS    CL8                                                              
CONAGY   DS    CL8      3   10    8  A  U N             T        Y   40         
CONAGYX  DS    CL8                                                              
CONAGYNH DS    CL8                                                              
CONAGYN  DS    CL20     3   19   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      3   41    5  A  P N             T        Y              
CONBUYH  DS    CL8                                                              
CONBUY   DS    CL20     3   49   20  A  U N             T        Y   50         
CONBUYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
CONADVH  DS    CL8                                                              
CONADV   DS    CL8      4   10    8  A  U N             T        Y   60         
CONADVX  DS    CL8                                                              
CONADVNH DS    CL8                                                              
CONADVN  DS    CL20     4   19   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      4   41    7  A  P N             T        Y              
CONPRDH  DS    CL8                                                              
CONPRD   DS    CL20     4   49   20  A  U N             T        Y   70         
CONPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      4   70    4  A  P N             T        Y              
CONCATH  DS    CL8                                                              
CONCAT   DS    CL5      4   75    5  A  U N             T        Y   80         
CONCATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
CONSTAH  DS    CL8                                                              
CONSTA   DS    CL8      5   10    8  A  U N             T        Y   90         
CONSTAX  DS    CL8                                                              
CONSTAMH DS    CL8                                                              
CONSTAM  DS    CL20     5   19   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   41    5  A  P N             T        Y              
CONDTESH DS    CL8                                                              
CONDTES  DS    CL17     5   49   17  A  U N             T        Y   30         
CONDTESX DS    CL8                                                              
CONARSKH DS    CL8                                                              
CONARSK  DS    CL10     5   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
CONSALH  DS    CL8                                                              
CONSAL   DS    CL3      6   10    3  A  U N             T        Y  120         
CONSALX  DS    CL8                                                              
CONSALNH DS    CL8                                                              
CONSALN  DS    CL19     6   14   19  A  P N             T        Y              
CONOFFNH DS    CL8                                                              
CONOFFN  DS    CL19     6   34   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   54    6  A  P N             T        Y              
CONDSPH  DS    CL8                                                              
CONDSP   DS    CL3      6   61    3  A  U N             T        Y  120         
CONDSPX  DS    CL8                                                              
CONDSPNH DS    CL8                                                              
CONDSPN  DS    CL15     6   65   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
CONRTGH  DS    CL8                                                              
CONRTG   DS    CL3      7   10    3  A  U N             T        Y  100         
CONRTGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   15    7  A  P N             T        Y              
CONIADVH DS    CL8                                                              
CONIADV  DS    CL4      7   23    4  A  U N             T        Y  131         
CONIADVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   28    4  A  P N             T        Y              
CONIPRDH DS    CL8                                                              
CONIPRD  DS    CL4      7   33    4  A  U N             T        Y  132         
CONIPRDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   38    3  A  P N             T        Y              
CONIESTH DS    CL8                                                              
CONIEST  DS    CL10     7   42   10  A  U N             T        Y  133         
CONIESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   54    6  A  P N             T        Y              
CONDCTH  DS    CL8                                                              
CONDCT   DS    CL2      7   61    2  A  U N             T        Y              
CONDCTNH DS    CL8                                                              
CONDCTN  DS    CL15     7   65   15  A  P N             T        Y              
CONSHRTH DS    CL8                                                              
CONSHRT  DS    CL7      8    2    7  A  P N             T        Y              
CONCOM1H DS    CL8                                                              
CONCOM1  DS    CL60     8   11   60  A  U N             T        Y  140         
CONCOM1X DS    CL8                                                              
CONCOM2H DS    CL8                                                              
CONCOM2  DS    CL60     9   11   60  A  U N             T        Y  140         
CONCOM2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CONBACTH DS    CL8                                                              
CONBACT  DS    CL8     10   11    8  A  U N        M    T        Y  150         
CONBACTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   41    7  A  P N             T        Y              
CONBNUMH DS    CL8                                                              
CONBNUM  DS    CL8     10   50    8  A  U N             T        Y  160         
CONBNUMX DS    CL8                                                              
CONCMBSH DS    CL8                                                              
CONCMBS  DS    CL6     11    6    6  A  P N             T        Y              
CONCMBCH DS    CL8                                                              
CONCMBC  DS    CL8     11   14    8  A  P N             T        Y  170         
CONCMBCX DS    CL8                                                              
CONCBS2H DS    CL8                                                              
CONCBS2  DS    CL6     11   24    6  A  P N             T        Y              
CONCBC2H DS    CL8                                                              
CONCBC2  DS    CL8     11   32    8  A  P N             T        Y  170         
CONCBC2X DS    CL8                                                              
CONCBS3H DS    CL8                                                              
CONCBS3  DS    CL6     11   42    6  A  P N             T        Y              
CONCBC3H DS    CL8                                                              
CONCBC3  DS    CL8     11   50    8  A  P N             T        Y  170         
CONCBC3X DS    CL8                                                              
CONCBSLH DS    CL8                                                              
CONCBSL  DS    CL6     11   60    6  A  P N             T        Y              
CONCMBLH DS    CL8                                                              
CONCMBL  DS    CL8     11   68    8  A  P N             T        Y  170         
CONCMBLX DS    CL8                                                              
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1176 BYTES                            
