*          DATA SET RECNTF4D   AT LEVEL 006 AS OF 09/25/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F4D      DATE 09/25/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60     8   11   60  A   P    N         T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60     9   11   60  A   P    N         T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   11    8  A   U    N    M    T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   41    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   50    8  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    6    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   14    8  A   P    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   24    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   32    8  A   P    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   42    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   50    8  A   P    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   60    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   68    8  A   P    N         T        Y   40         
         DS    CL8                                                              
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
