*          DATA SET RECNTD2D   AT LEVEL 003 AS OF 11/30/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802D2D      DATE 11/30/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14    12    3   14  A  P N             T        Y              
BCPHDATH DS    CL8                                                              
BCPHDAT  DS    CL18    12   19   18  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL31    13    3   31  A  P N             T        Y              
BCPCCOMH DS    CL8                                                              
BCPCCOM  DS    CL1     13   36    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    14    3   30  A  P N             T        Y              
BCPBCOMH DS    CL8                                                              
BCPBCOM  DS    CL1     14   35    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    15    3   14  A  P N             T        Y              
BCPCON1H DS    CL8                                                              
BCPCON1  DS    CL5     15   19    5  A  U N             T        Y              
BCPCON2H DS    CL8                                                              
BCPCON2  DS    CL5     15   26    5  A  U N             T        Y              
BCPCON3H DS    CL8                                                              
BCPCON3  DS    CL5     15   33    5  A  U N             T        Y              
BCPCON4H DS    CL8                                                              
BCPCON4  DS    CL5     15   40    5  A  U N             T        Y              
BCPCON5H DS    CL8                                                              
BCPCON5  DS    CL5     15   47    5  A  U N             T        Y              
BCPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BCPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 240  BYTES                            
