*          DATA SET RECNTF3DS  AT LEVEL 002 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F3D      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
MBYACTH  DS    CL8                                                              
MBYACT   DS    CL8      9   11    8  A  U N             T        Y   10         
MBYACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   41    7  A  P N             T        Y              
MBYNUMH  DS    CL8                                                              
MBYNUM   DS    CL8      9   50    8  A  U N             T        Y   20         
MBYNUMX  DS    CL8                                                              
MBYFNMH  DS    CL8                                                              
MBYFNM   DS    CL8     10    2    8  A  P N             T        Y              
MBYFLNH  DS    CL8                                                              
MBYFLN   DS    CL3     10   11    3  A  U N             T        Y   30         
MBYFLNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
MBYFLTH  DS    CL8                                                              
MBYFLT   DS    CL58    11   11   58  A  U N             T        Y   40         
MBYFLTX  DS    CL8                                                              
MBYFLT2H DS    CL8                                                              
MBYFLT2  DS    CL58    12   11   58  A  U N             T        Y   40         
MBYFLT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
MBYDAY1H DS    CL8                                                              
MBYDAY1  DS    CL11    15    3   11  A  U N             T        Y   50         
MBYDAY1X DS    CL8                                                              
MBYTIMH  DS    CL8                                                              
MBYTIM   DS    CL12    15   17   12  A  U N             T        Y   60         
MBYTIMX  DS    CL8                                                              
MBYTYPH  DS    CL8                                                              
MBYTYP   DS    CL4     15   32    4  A  U N             T        Y   70         
MBYTYPX  DS    CL8                                                              
MBYSPTSH DS    CL8                                                              
MBYSPTS  DS    CL3     15   38    3  A  U N             T        Y   80         
MBYSPTSX DS    CL8                                                              
MBYRATEH DS    CL8                                                              
MBYRATE  DS    CL7     15   43    7  A  U N             T        Y   90         
MBYRATEX DS    CL8                                                              
MBYCOMH  DS    CL8                                                              
MBYCOM   DS    CL28    15   53   28  A  U N             T        Y  100         
MBYCOMX  DS    CL8                                                              
MBYDAY2H DS    CL8                                                              
MBYDAY2  DS    CL11    16    3   11  A  U N             T        Y   50         
MBYDAY2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     16   32    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16   38    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16   43    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    16   53   28  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17    3   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17   32    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17   38    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17   43    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    17   53   28  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    18    3   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   32    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     18   38    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18   43    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    18   53   28  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19    3   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     19   32    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   38    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   43    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    19   53   28  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    20    3   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     20   32    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     20   38    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20   43    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    20   53   28  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    21    3   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    21   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     21   32    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     21   38    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21   43    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    21   53   28  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    22    3   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    22   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     22   32    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     22   38    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22   43    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    22   53   28  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    23    3   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    23   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     23   32    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     23   38    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23   43    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    23   53   28  A  U N             T        Y  100         
         DS    CL8                                                              
MBYENDH  DS    CL8                                                              
MBYEND   DS    CL1     24    2    1  A  P N             T        Y              
MBYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MBYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
