*          DATA SET RECNTF8DS  AT LEVEL 013 AS OF 11/13/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F8D      DATE 11/13/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
CBIACTH  DS    CL8                                                              
CBIACT   DS    CL8      9   11    8  A  U N             T        Y   10         
CBIACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   41    7  A  P N             T        Y              
CBINUMH  DS    CL8                                                              
CBINUM   DS    CL8      9   50    8  A  U N             T        Y   20         
CBINUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
CBIFLNH  DS    CL8                                                              
CBIFLN   DS    CL3     10   11    3  A  U N             T        Y   30         
CBIFLNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
CBIFLTH  DS    CL8                                                              
CBIFLT   DS    CL58    11   11   58  A  U N             T        Y   40         
CBIFLTX  DS    CL8                                                              
CBIFLT2H DS    CL8                                                              
CBIFLT2  DS    CL58    12   11   58  A  U N             T        Y   40         
CBIFLT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL42    14    2   42  A  P N             T        Y              
CBICMB1H DS    CL8                                                              
CBICMB1  DS    CL7     14   45    7  A  P N             T        Y   42         
CBICMB1X DS    CL8                                                              
CBICMB2H DS    CL8                                                              
CBICMB2  DS    CL7     14   54    7  A  P N             T        Y   42         
CBICMB2X DS    CL8                                                              
CBICMB3H DS    CL8                                                              
CBICMB3  DS    CL7     14   63    7  A  P N             T        Y   42         
CBICMB3X DS    CL8                                                              
CBICMB4H DS    CL8                                                              
CBICMB4  DS    CL7     14   72    7  A  P N             T        Y   42         
CBICMB4X DS    CL8                                                              
CBIDAY1H DS    CL8                                                              
CBIDAY1  DS    CL11    15    2   11  A  U N             T        Y   50         
CBIDAY1X DS    CL8                                                              
CBITIMH  DS    CL8                                                              
CBITIM   DS    CL12    15   17   12  A  U N             T        Y   60         
CBITIMX  DS    CL8                                                              
CBITYPH  DS    CL8                                                              
CBITYP   DS    CL4     15   33    4  A  U N             T        Y   70         
CBITYPX  DS    CL8                                                              
CBISPTSH DS    CL8                                                              
CBISPTS  DS    CL3     15   41    3  A  U N             T        Y   80         
CBISPTSX DS    CL8                                                              
CBIRAT1H DS    CL8                                                              
CBIRAT1  DS    CL7     15   45    7  A  U N             T        Y   90         
CBIRAT1X DS    CL8                                                              
CBIRAT2H DS    CL8                                                              
CBIRAT2  DS    CL7     15   54    7  A  U N             T        Y   90         
CBIRAT2X DS    CL8                                                              
CBIRAT3H DS    CL8                                                              
CBIRAT3  DS    CL7     15   63    7  A  U N             T        Y   90         
CBIRAT3X DS    CL8                                                              
CBIRAT4H DS    CL8                                                              
CBIRAT4  DS    CL7     15   72    7  A  U N             T        Y   90         
CBIRAT4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    3    8  A  P N             T        Y              
CBICOMH  DS    CL8                                                              
CBICOM   DS    CL60    16   13   60  A  U N             T        Y  100         
CBICOMX  DS    CL8                                                              
CBIDAY2H DS    CL8                                                              
CBIDAY2  DS    CL11    17    2   11  A  U N             T        Y   50         
CBIDAY2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17   33    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17   41    3  A  U N             T        Y   80         
         DS    CL8                                                              
CBIRAT5H DS    CL8                                                              
CBIRAT5  DS    CL7     17   45    7  A  U N             T        Y   90         
CBIRAT5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17   54    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17   63    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17   72    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18    3    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    18   13   60  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19    2   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     19   33    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   41    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   45    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   54    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   63    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   72    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20    3    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    20   13   60  A  U N             T        Y  100         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    21    2   11  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    21   17   12  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     21   33    4  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     21   41    3  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21   45    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21   54    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21   63    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21   72    7  A  U N             T        Y   90         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     22    3    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    22   13   60  A  U N             T        Y  100         
         DS    CL8                                                              
CBIENDH  DS    CL8                                                              
CBIEND   DS    CL1     24    2    1  A  P N             T        Y              
CBILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CBIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
