*          DATA SET REDARE5D   AT LEVEL 001 AS OF 11/18/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FE5D      DATE 11/18/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DE5HAGYH DS    XL8                                                              
DE5HAGY  DS    CL3      8    2    3  A  P N             T        Y              
DE5AGYCH DS    XL8                                                              
DE5AGYC  DS    CL8      8    7    8  A  P N             T        Y              
DE5AGYNH DS    XL8                                                              
DE5AGYN  DS    CL20     8   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   38    5  A  P N             T        Y              
DE5BUYH  DS    XL8                                                              
DE5BUY   DS    CL20     8   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
DE5ADVH  DS    XL8                                                              
DE5ADV   DS    CL4      9    7    4  A  P N             T        Y              
DE5ADVNH DS    XL8                                                              
DE5ADVN  DS    CL20     9   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   38    7  A  P N             T        Y              
DE5PRDH  DS    XL8                                                              
DE5PRD   DS    CL20     9   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
DE5STAH  DS    XL8                                                              
DE5STA   DS    CL7     10    7    7  A  P N             T        Y              
DE5STANH DS    XL8                                                              
DE5STAN  DS    CL20    10   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   38    7  A  P N             T        Y              
DE5SALH  DS    XL8                                                              
DE5SAL   DS    CL3     10   46    3  A  P N             T        Y              
DE5OFFCH DS    XL8                                                              
DE5OFFC  DS    CL2     10   50    2  A  P N             T        Y              
DE5SALNH DS    XL8                                                              
DE5SALN  DS    CL20    10   53   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
DE5DATEH DS    XL8                                                              
DE5DATE  DS    CL17    11    9   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   38    7  A  P N             T        Y              
DE5DPRTH DS    XL8                                                              
DE5DPRT  DS    CL30    11   46   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
DE5LENH  DS    XL8                                                              
DE5LEN   DS    CL30    12    7   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   38    5  A  P N             T        Y              
DE5DEMOH DS    XL8                                                              
DE5DEMO  DS    CL20    12   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   67    4  A  P N             T        Y              
DE5ESTH  DS    XL8                                                              
DE5EST   DS    CL4     12   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   79    1  A  P N             T        Y              
DE5LHEDH DS    XL8                                                              
DE5LHED  DS    CL78    14    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P H             T        Y              
DE5SELH  DS    XL8                                                              
DE5SEL   DS    CL1     16    2    1  A  U N             T        Y              
DE5STATH DS    XL8                                                              
DE5STAT  DS    CL10    16    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    16   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    17    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    18   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    19    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    20   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    21    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    22   17   61  A  P N             T        Y              
DE5LLINH DS    XL8                                                              
DE5LLIN  DS    CL76    23    2   76  A  P N             T        Y              
DE5PFLNH DS    XL8                                                              
DE5PFLN  DS    CL76    24    2   76  A  P Z             T        Y              
DE5LAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DE5WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1504 BYTES                            
