*          DATA SET REDARFDDS  AT LEVEL 005 AS OF 01/29/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FFDD      DATE 01/29/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DRHHAGYH DS    CL8                                                              
DRHHAGY  DS    CL3      8    2    3  A  P N             T        Y              
DRHAGYCH DS    CL8                                                              
DRHAGYC  DS    CL8      8    7    8  A  P N             T        Y              
DRHAGYNH DS    CL8                                                              
DRHAGYN  DS    CL20     8   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   38    5  A  P N             T        Y              
DRHBUYH  DS    CL8                                                              
DRHBUY   DS    CL20     8   46   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
DRHADVH  DS    CL8                                                              
DRHADV   DS    CL4      9    7    4  A  P N             T        Y              
DRHADVNH DS    CL8                                                              
DRHADVN  DS    CL20     9   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   38    7  A  P N             T        Y              
DRHPRDH  DS    CL8                                                              
DRHPRD   DS    CL20     9   46   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
DRHSTAH  DS    CL8                                                              
DRHSTA   DS    CL7     10    7    7  A  P N             T        Y              
DRHSTANH DS    CL8                                                              
DRHSTAN  DS    CL20    10   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   38    7  A  P N             T        Y              
DRHSALH  DS    CL8                                                              
DRHSAL   DS    CL3     10   46    3  A  P N             T        Y              
DRHOFFCH DS    CL8                                                              
DRHOFFC  DS    CL2     10   50    2  A  P N             T        Y              
DRHSALNH DS    CL8                                                              
DRHSALN  DS    CL20    10   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
DRHDATEH DS    CL8                                                              
DRHDATE  DS    CL17    11    9   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   38    7  A  P N             T        Y              
DRHDPRTH DS    CL8                                                              
DRHDPRT  DS    CL30    11   46   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
DRHLENH  DS    CL8                                                              
DRHLEN   DS    CL30    12    7   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   38    5  A  P N             T        Y              
DRHDEMOH DS    CL8                                                              
DRHDEMO  DS    CL20    12   46   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   67    4  A  P N             T        Y              
DRHESTH  DS    CL8                                                              
DRHEST   DS    CL4     12   72    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   79    1  A  P N             T        Y              
DRHLHEDH DS    CL8                                                              
DRHLHED  DS    CL78    14    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P H             T        Y              
DRHSELH  DS    CL8                                                              
DRHSEL   DS    CL1     16    2    1  A  U N             T        Y              
DRHSTATH DS    CL8                                                              
DRHSTAT  DS    CL7     16    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    17   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    17   58   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    19   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    19   58   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    21   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    21   58   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     22   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    23   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    23   58   14  A  P N             T        Y              
DRHLLINH DS    CL8                                                              
DRHLLIN  DS    CL5     23   73    5  A  P N             T        Y              
DRHPFLNH DS    CL8                                                              
DRHPFLN  DS    CL76    24    2   76  A  P Z             T        Y              
DRHLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DRHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1800 BYTES                            
