*          DATA SET REDARF2D   AT LEVEL 028 AS OF 02/05/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FF2D      DATE 02/05/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
MKGSTATH DS    CL8                                                              
MKGSTAT  DS    CL3      5   10    3  A  U N             T        Y   10         
MKGSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
MKGKNUMH DS    CL8                                                              
MKGKNUM  DS    CL10     5   26   10  A  U N             T        Y   20         
MKGKNUMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     5   38   10  A  P N             T        Y              
MKGKSTAH DS    CL8                                                              
MKGKSTA  DS    CL3      5   49    3  A  U N             T        Y   30         
MKGKSTAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
MKGOFFH  DS    CL8                                                              
MKGOFF   DS    CL2      6   10    2  A  U N             T        Y   40         
MKGOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
MKGSTAH  DS    CL8                                                              
MKGSTA   DS    CL7      6   28    7  A  U N             T        Y   50         
MKGSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     6   38   11  A  P N             T        Y              
MKGSALH  DS    CL8                                                              
MKGSAL   DS    CL3      6   51    3  A  U N             T        Y   60         
MKGSALX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   56    4  A  P N             T        Y              
MKGTEMH  DS    CL8                                                              
MKGTEM   DS    CL2      6   62    2  A  U N             T        Y   60         
MKGTEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     8    2   78  A  P H             T        Y              
MKGSELH  DS    CL8                                                              
MKGSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    24    2   76  A  P H             T        Y              
MKGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MKGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
