*          DATA SET REDARE0D   AT LEVEL 010 AS OF 11/06/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FE0D      DATE 11/06/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
HISHDLNH DS    XL8                                                              
HISHDLN  DS    CL8      5   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
HISAORDH DS    XL8                                                              
HISAORD  DS    CL8      5   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   38    3  A  P N             T        Y              
HISRNUMH DS    XL8                                                              
HISRNUM  DS    CL3      5   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     7    2   78  A  P H             T        Y              
HISLISTH DS    XL8                                                              
HISLIST  DS    CL78     8    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
HISENDCH DS    XL8                                                              
HISENDC  DS    CL78    22    2   78  A  P N             T        Y              
HISENDLH DS    XL8                                                              
HISENDL  DS    CL78    23    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    24    2   11  A  P N             T        Y              
HISLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
HISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1576 BYTES                            
