*          DATA SET REDARE1D   AT LEVEL 002 AS OF 06/23/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FE1D      DATE 06/23/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
DE1HDLNH DS    XL8                                                              
DE1HDLN  DS    CL10     5    8   10  A  U N             T        Y   10         
DE1HDLNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   19    6  A  P N             T        Y              
DE1TYPEH DS    XL8                                                              
DE1TYPE  DS    CL2      5   26    2  A  U N             T        Y   20         
DE1TYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   34    5  A  P N             T        Y              
DE1GRPH  DS    XL8                                                              
DE1GRP   DS    CL2      5   42    2  A  U N             T        Y   30         
DE1GRPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   46    4  A  P N             T        Y              
DE1TEAMH DS    XL8                                                              
DE1TEAM  DS    CL2      5   52    2  A  U N             T        Y   40         
DE1TEAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   56    4  A  P N             T        Y              
DE1INBXH DS    XL8                                                              
DE1INBX  DS    CL3      5   61    3  A  P N             T        Y   40         
DE1INBXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   65    3  A  P N             T        Y              
DE1BUYRH DS    XL8                                                              
DE1BUYR  DS    CL3      5   70    3  A  U N             T        Y   40         
DE1BUYRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   74    3  A  P N             T        Y              
DE1UNWH  DS    XL8                                                              
DE1UNW   DS    CL1      5   78    1  A  P N             T        Y   40         
DE1UNWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DE1STATH DS    XL8                                                              
DE1STAT  DS    CL7      6   10    7  A  U N             T        Y   50         
DE1STATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   19    6  A  P N             T        Y              
DE1AGYH  DS    XL8                                                              
DE1AGY   DS    CL7      6   26    7  A  U N             T        Y   60         
DE1AGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   34    6  A  P N             T        Y              
DE1OFFH  DS    XL8                                                              
DE1OFF   DS    CL2      6   42    2  A  U N             T        Y   70         
DE1OFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   46    4  A  P N             T        Y              
DE1SALPH DS    XL8                                                              
DE1SALP  DS    CL3      6   52    3  A  U N             T        Y   80         
DE1SALPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   56    3  A  P Z             T        Y              
DE1REPH  DS    XL8                                                              
DE1REP   DS    CL2      6   61    2  A  P Z             T        Y   80         
DE1REPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   65    4  A  P N             T        Y              
DE1SCRLH DS    XL8                                                              
DE1SCRL  DS    CL3      6   70    3  A  U N             T        Y   40         
DE1SCRLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DE1RDATH DS    XL8                                                              
DE1RDAT  DS    CL17     7   14   17  A  U N             T        Y   90         
DE1RDATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   34    6  A  P N             T        Y              
DE1RQTRH DS    XL8                                                              
DE1RQTR  DS    CL5      7   42    5  A  U N             T        Y  100         
DE1RQTRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   50    4  A  P N             T        Y              
DE1CMP1H DS    XL8                                                              
DE1CMP1  DS    CL4      7   55    4  A  U N             T        Y  110         
DE1CMP1X DS    XL8                                                              
DE1CMP2H DS    XL8                                                              
DE1CMP2  DS    CL4      7   60    4  A  U N             T        Y  120         
DE1CMP2X DS    XL8                                                              
DE1CMP3H DS    XL8                                                              
DE1CMP3  DS    CL4      7   65    4  A  U N             T        Y  130         
DE1CMP3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   70    3  A  P N             T        Y              
DE1MRKTH DS    XL8                                                              
DE1MRKT  DS    CL4      7   74    4  A  U N             T        Y  140         
DE1MRKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
DE1TAGH  DS    XL8                                                              
DE1TAG   DS    CL1      8    2    1  A  P N             T        Y              
DE1LAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DE1WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 632  BYTES                            
