*          DATA SET REDAREAD   AT LEVEL 010 AS OF 02/13/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FEAD      DATE 02/13/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
DEAHDLNH DS    XL8                                                              
DEAHDLN  DS    CL10     5    8   10  A  U N             T        Y   10         
DEAHDLNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   19    6  A  P N             T        Y              
DEATYPEH DS    XL8                                                              
DEATYPE  DS    CL2      5   26    2  A  U N             T        Y   20         
DEATYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   34    5  A  P N             T        Y              
DEAGRPH  DS    XL8                                                              
DEAGRP   DS    CL2      5   42    2  A  U N             T        Y   30         
DEAGRPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   46    4  A  P N             T        Y              
DEATEAMH DS    XL8                                                              
DEATEAM  DS    CL2      5   52    2  A  U N             T        Y   40         
DEATEAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   56    4  A  P N             T        Y              
DEAINBXH DS    XL8                                                              
DEAINBX  DS    CL3      5   61    3  A  U N             T        Y   40         
DEAINBXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   65    3  A  P N             T        Y              
DEABUYRH DS    XL8                                                              
DEABUYR  DS    CL3      5   70    3  A  U N             T        Y   40         
DEABUYRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   74    3  A  P N             T        Y              
DEAUNWH  DS    XL8                                                              
DEAUNW   DS    CL1      5   78    1  A  U N             T        Y   40         
DEAUNWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DEASTATH DS    XL8                                                              
DEASTAT  DS    CL7      6   10    7  A  U N             T        Y   50         
DEASTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   19    6  A  P N             T        Y              
DEAAGYH  DS    XL8                                                              
DEAAGY   DS    CL7      6   26    7  A  U N             T        Y   60         
DEAAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   34    6  A  P N             T        Y              
DEAOFFH  DS    XL8                                                              
DEAOFF   DS    CL2      6   42    2  A  U N             T        Y   70         
DEAOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   46    4  A  P N             T        Y              
DEASALPH DS    XL8                                                              
DEASALP  DS    CL3      6   52    3  A  U N             T        Y   80         
DEASALPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   56    3  A  P N             T        Y              
DEAREPH  DS    XL8                                                              
DEAREP   DS    CL2      6   61    2  A  U N             T        Y   80         
DEAREPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   65    4  A  P N             T        Y              
DEASCRLH DS    XL8                                                              
DEASCRL  DS    CL3      6   70    3  A  U N             T        Y   40         
DEASCRLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DEARDATH DS    XL8                                                              
DEARDAT  DS    CL17     7   14   17  A  U N             T        Y   90         
DEARDATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   34    6  A  P N             T        Y              
DEARQTRH DS    XL8                                                              
DEARQTR  DS    CL3      7   42    3  A  U N             T        Y  100         
DEARQTRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   50    4  A  P N             T        Y              
DEACMP1H DS    XL8                                                              
DEACMP1  DS    CL4      7   59    4  A  U N             T        Y              
DEACMP2H DS    XL8                                                              
DEACMP2  DS    CL4      7   64    4  A  U N             T        Y              
DEACMP3H DS    XL8                                                              
DEACMP3  DS    CL4      7   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
DEATAGH  DS    XL8                                                              
DEATAG   DS    CL1      8    2    1  A  P N             T        Y              
DEALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DEAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 576  BYTES                            
