*          DATA SET REDARE7D   AT LEVEL 010 AS OF 06/23/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FE7D      DATE 06/23/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
DE7HDLNH DS    XL8                                                              
DE7HDLN  DS    CL10     5    8   10  A  U N             T        Y   10         
DE7HDLNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   19    6  A  P N             T        Y              
DE7TYPEH DS    XL8                                                              
DE7TYPE  DS    CL2      5   26    2  A  U N             T        Y   20         
DE7TYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   34    5  A  P N             T        Y              
DE7GRPH  DS    XL8                                                              
DE7GRP   DS    CL2      5   42    2  A  U N             T        Y   30         
DE7GRPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   46    4  A  P N             T        Y              
DE7TEAMH DS    XL8                                                              
DE7TEAM  DS    CL2      5   52    2  A  U N             T        Y   40         
DE7TEAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   56    4  A  P N             T        Y              
DE7INBXH DS    XL8                                                              
DE7INBX  DS    CL3      5   61    3  A  P N             T        Y   40         
DE7INBXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   65    3  A  P N             T        Y              
DE7BUYRH DS    XL8                                                              
DE7BUYR  DS    CL3      5   70    3  A  U N             T        Y   40         
DE7BUYRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   74    3  A  P N             T        Y              
DE7UNWH  DS    XL8                                                              
DE7UNW   DS    CL1      5   78    1  A  P N             T        Y   40         
DE7UNWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DE7STATH DS    XL8                                                              
DE7STAT  DS    CL7      6   10    7  A  U N             T        Y   50         
DE7STATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   19    6  A  P N             T        Y              
DE7AGYH  DS    XL8                                                              
DE7AGY   DS    CL7      6   26    7  A  U N             T        Y   60         
DE7AGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   34    6  A  P N             T        Y              
DE7OFFH  DS    XL8                                                              
DE7OFF   DS    CL2      6   42    2  A  U N             T        Y   70         
DE7OFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   46    4  A  P N             T        Y              
DE7SALPH DS    XL8                                                              
DE7SALP  DS    CL3      6   52    3  A  U N             T        Y   80         
DE7SALPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   56    3  A  P Z             T        Y              
DE7REPH  DS    XL8                                                              
DE7REP   DS    CL2      6   61    2  A  P Z             T        Y   80         
DE7REPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   65    4  A  P N             T        Y              
DE7SCRLH DS    XL8                                                              
DE7SCRL  DS    CL3      6   70    3  A  U N             T        Y   40         
DE7SCRLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DE7RDATH DS    XL8                                                              
DE7RDAT  DS    CL17     7   14   17  A  U N             T        Y   90         
DE7RDATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   34    6  A  P N             T        Y              
DE7RQTRH DS    XL8                                                              
DE7RQTR  DS    CL5      7   42    5  A  U N             T        Y  100         
DE7RQTRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   50    4  A  P N             T        Y              
DE7CMP1H DS    XL8                                                              
DE7CMP1  DS    CL4      7   55    4  A  U N             T        Y  110         
DE7CMP1X DS    XL8                                                              
DE7CMP2H DS    XL8                                                              
DE7CMP2  DS    CL4      7   60    4  A  U N             T        Y  120         
DE7CMP2X DS    XL8                                                              
DE7CMP3H DS    XL8                                                              
DE7CMP3  DS    CL4      7   65    4  A  U N             T        Y  130         
DE7CMP3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   70    3  A  P N             T        Y              
DE7MRKTH DS    XL8                                                              
DE7MRKT  DS    CL4      7   74    4  A  U N             T        Y  140         
DE7MRKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
DE7PDATH DS    XL8                                                              
DE7PDAT  DS    CL17     8    7   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   34    4  A  P N             T        Y              
DE7PTIMH DS    XL8                                                              
DE7PTIM  DS    CL10     8   39   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
DE7PNUMH DS    XL8                                                              
DE7PNUM  DS    CL5      9   19    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   79    1  A  P N             T        Y              
DE7TAGH  DS    XL8                                                              
DE7TAG   DS    CL1     10    2    1  A  P N             T        Y              
DE7LAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DE7WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 736  BYTES                            
