*          DATA SET REDARF3DS  AT LEVEL 030 AS OF 03/16/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FF3D      DATE 03/16/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
MGBHDLNH DS    CL8                                                              
MGBHDLN  DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
MGBAORDH DS    CL8                                                              
MGBAORD  DS    CL8      5   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   38    5  A  P N             T        Y              
MGBGRPH  DS    CL8                                                              
MGBGRP   DS    CL2      5   46    2  A  U N             T        Y              
MGBWHOH  DS    CL8                                                              
MGBWHO   DS    CL18     5   56   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
MGBSTATH DS    CL8                                                              
MGBSTAT  DS    CL78     6    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P H             T        Y              
MGBGCMTH DS    CL8                                                              
MGBGCMT  DS    CL63     7   17   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  A  P H             T        Y              
MGBMCMTH DS    CL8                                                              
MGBMCMT  DS    CL63     8   17   63  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  A  P H             T        Y              
MGBLISTH DS    CL8                                                              
MGBLIST  DS    CL78    10    2   78  A  P N             T        Y              
MGBHISTH DS    CL8                                                              
MGBHIST  DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
MGBENDCH DS    CL8                                                              
MGBENDC  DS    CL78    22    2   78  A  P N             T        Y              
MGBENDLH DS    CL8                                                              
MGBENDL  DS    CL78    23    2   78  A  P N             T        Y              
MGBPFKYH DS    CL8                                                              
MGBPFKY  DS    CL78    24    2   78  A  P H             T        Y              
MGBLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MGBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1768 BYTES                            
