*          DATA SET REDARFEDS  AT LEVEL 007 AS OF 03/19/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FFED      DATE 03/19/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DARHDR1H DS    CL8                                                              
DARHDR1  DS    CL78     8    2   78  A  P H             T        Y              
DARHDR2H DS    CL8                                                              
DARHDR2  DS    CL78     9    2   78  A  P H             T        Y              
DARSELH  DS    CL8                                                              
DARSEL   DS    CL1     10    2    1  A  U N             T        Y              
DARSTATH DS    CL8                                                              
DARSTAT  DS    CL7     10    6    7  A  P H             T        Y              
DARCON#H DS    CL8                                                              
DARCON#  DS    CL8     10   14    8  A  P N             T        Y              
DARAGY#H DS    CL8                                                              
DARAGY#  DS    CL8     10   23    8  A  P N             T        Y              
DARSTAH  DS    CL8                                                              
DARSTA   DS    CL6     10   33    6  A  P N             T        Y              
DARAGYH  DS    CL8                                                              
DARAGY   DS    CL6     10   40    6  A  P N             T        Y              
DAROFFH  DS    CL8                                                              
DAROFF   DS    CL2     10   48    2  A  P N             T        Y              
DARSALPH DS    CL8                                                              
DARSALP  DS    CL3     10   53    3  A  P N             T        Y              
DARADVH  DS    CL8                                                              
DARADV   DS    CL20    10   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  P N             T        Y              
DARPRD1H DS    CL8                                                              
DARPRD1  DS    CL12    11    8   12  A  P N             T        Y              
DARPRD2H DS    CL8                                                              
DARPRD2  DS    CL12    11   21   12  A  P N             T        Y              
DARFLTH  DS    CL8                                                              
DARFLT   DS    CL17    11   35   17  A  P N             T        Y              
DAREST#H DS    CL8                                                              
DAREST#  DS    CL4     11   53    4  A  P N             T        Y              
DARTOTLH DS    CL8                                                              
DARTOTL  DS    CL14    11   58   14  A  P N             T        Y              
DARTSPTH DS    CL8                                                              
DARTSPT  DS    CL5     11   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     12   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    13   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13   58   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     14   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    15   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    15   58   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    17   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    17   58   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    19   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    19   58   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    21   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    21   58   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   73    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    6    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     22   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   33    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   40    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   48    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   53    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23    8   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   21   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    23   35   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    23   58   14  A  P N             T        Y              
DARLLINH DS    CL8                                                              
DARLLIN  DS    CL5     23   73    5  A  P N             T        Y              
DARPFLNH DS    CL8                                                              
DARPFLN  DS    CL76    24    2   76  A  P H             T        Y              
DARLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DARWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2040 BYTES                            
