*          DATA SET REDARE4DS  AT LEVEL 006 AS OF 11/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FE4D      DATE 11/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DRVHAGYH DS    XL8                                                              
DRVHAGY  DS    CL3      8    2    3  A  P N             T        Y              
DRVAGYCH DS    XL8                                                              
DRVAGYC  DS    CL8      8    7    8  A  P N             T        Y              
DRVAGYNH DS    XL8                                                              
DRVAGYN  DS    CL20     8   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   38    5  A  P N             T        Y              
DRVBUYH  DS    XL8                                                              
DRVBUY   DS    CL20     8   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
DRVADVH  DS    XL8                                                              
DRVADV   DS    CL4      9    7    4  A  P N             T        Y              
DRVADVNH DS    XL8                                                              
DRVADVN  DS    CL20     9   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   38    7  A  P N             T        Y              
DRVPRDH  DS    XL8                                                              
DRVPRD   DS    CL20     9   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
DRVSTAH  DS    XL8                                                              
DRVSTA   DS    CL7     10    7    7  A  P N             T        Y              
DRVSTANH DS    XL8                                                              
DRVSTAN  DS    CL20    10   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   38    7  A  P N             T        Y              
DRVSALH  DS    XL8                                                              
DRVSAL   DS    CL3     10   46    3  A  P N             T        Y              
DRVOFFCH DS    XL8                                                              
DRVOFFC  DS    CL2     10   50    2  A  P N             T        Y              
DRVSALNH DS    XL8                                                              
DRVSALN  DS    CL20    10   53   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
DRVDATEH DS    XL8                                                              
DRVDATE  DS    CL17    11    9   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   38    7  A  P N             T        Y              
DRVDPRTH DS    XL8                                                              
DRVDPRT  DS    CL30    11   46   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
DRVLENH  DS    XL8                                                              
DRVLEN   DS    CL30    12    7   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   38    5  A  P N             T        Y              
DRVDEMOH DS    XL8                                                              
DRVDEMO  DS    CL20    12   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   67    4  A  P N             T        Y              
DRVESTH  DS    XL8                                                              
DRVEST   DS    CL4     12   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
DRVAGODH DS    XL8                                                              
DRVAGOD  DS    CL8     14   16    8  A  P N             T        Y              
DRVSTATH DS    XL8                                                              
DRVSTAT  DS    CL42    14   38   42  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
DRVAAGYH DS    XL8                                                              
DRVAAGY  DS    CL6     15    7    6  A  P N             T        Y              
DRVAAGXH DS    XL8                                                              
DRVAAGX  DS    CL20    15   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   38    5  A  P N             T        Y              
DRVFROMH DS    XL8                                                              
DRVFROM  DS    CL24    15   46   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
DRVAADVH DS    XL8                                                              
DRVAADV  DS    CL6     16    7    6  A  P N             T        Y              
DRVAADXH DS    XL8                                                              
DRVAADX  DS    CL20    16   16   20  A  P N             T        Y              
DRVFONEH DS    XL8                                                              
DRVFONE  DS    CL40    16   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
DRVASTAH DS    XL8                                                              
DRVASTA  DS    CL7     17    7    7  A  P N             T        Y              
DRVAMKTH DS    XL8                                                              
DRVAMKT  DS    CL20    17   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   38    4  A  P N             T        Y              
DRVPRD1H DS    XL8                                                              
DRVPRD1  DS    CL34    17   46   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
DRVADTEH DS    XL8                                                              
DRVADTE  DS    CL17    18    9   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   38    4  A  P N             T        Y              
DRVPRD2H DS    XL8                                                              
DRVPRD2  DS    CL34    18   46   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
DRVRVSTH DS    XL8                                                              
DRVRVST  DS    CL24    19    9   24  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     19   38    5  A  P N             T        Y              
DRVADEMH DS    XL8                                                              
DRVADEM  DS    CL34    19   46   34  A  P N             T        Y              
DRVRVSHH DS    XL8                                                              
DRVRVSH  DS    CL6     20    2    6  A  P N             T        Y              
DRVRVS2H DS    XL8                                                              
DRVRVS2  DS    CL26    20    9   26  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12    20   38   12  A  P N             T        Y              
DRVCTOTH DS    XL8                                                              
DRVCTOT  DS    CL14    20   51   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   67    4  A  P N             T        Y              
DRVAESTH DS    XL8                                                              
DRVAEST  DS    CL8     20   72    8  A  P N             T        Y              
DRVQLNKH DS    XL8                                                              
DRVQLNK  DS    CL16    21    2   16  A  P H             T        Y              
DRVLINKH DS    XL8                                                              
DRVLINK  DS    CL1     21   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   38   12  A  P N             T        Y              
DRVTSPTH DS    XL8                                                              
DRVTSPT  DS    CL5     21   51    5  A  P N             T        Y              
DRVTFLGH DS    XL8                                                              
DRVTFLG  DS    CL5     21   67    5  A  P N             T        Y              
DRVINBH  DS    XL8                                                              
DRVINB   DS    CL5     22    2    5  A  P N             T        Y              
DRVPSNH  DS    XL8                                                              
DRVPSN   DS    CL25    22    9   25  A  P N             T        Y              
DRVNINBH DS    XL8                                                              
DRVNINB  DS    CL12    22   38   12  A  P N             T        Y              
DRVNPSNH DS    XL8                                                              
DRVNPSN  DS    CL5     22   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23    2    9  A  P N             T        Y              
DRVRECDH DS    XL8                                                              
DRVRECD  DS    CL8     23   12    8  A  P N             T        Y              
DRVRECTH DS    XL8                                                              
DRVRECT  DS    CL5     23   21    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   29    7  A  P N             T        Y              
DRVAPVDH DS    XL8                                                              
DRVAPVD  DS    CL8     23   37    8  A  P N             T        Y              
DRVAPVTH DS    XL8                                                              
DRVAPVT  DS    CL5     23   48    5  A  P N             T        Y              
DRVRJRCH DS    XL8                                                              
DRVRJRC  DS    CL9     23   56    9  A  P N             T        Y              
DRVREJDH DS    XL8                                                              
DRVREJD  DS    CL8     23   66    8  A  P N             T        Y              
DRVREJTH DS    XL8                                                              
DRVREJT  DS    CL5     23   75    5  A  P N             T        Y              
DRVPFKLH DS    XL8                                                              
DRVPFKL  DS    CL76    24    2   76  A  P N             T        Y              
DRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1608 BYTES                            
