*          DATA SET REDARF0SD  AT LEVEL 023 AS OF 06/29/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80FF0D      DATE 06/29/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
DRFHDLNH DS    CL8                                                              
DRFHDLN  DS    CL8      5   10    8  A  U N             T        Y   10         
DRFHDLNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
DRFTYPEH DS    CL8                                                              
DRFTYPE  DS    CL2      5   28    2  A  U N             T        Y   20         
DRFTYPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   38    5  A  P N             T        Y              
DRFGRPH  DS    CL8                                                              
DRFGRP   DS    CL2      5   46    2  A  U N             T        Y   30         
DRFGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   56    4  A  P N             T        Y              
DRFTEAMH DS    CL8                                                              
DRFTEAM  DS    CL2      5   64    2  A  U N             T        Y   40         
DRFTEAMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DRFSTATH DS    CL8                                                              
DRFSTAT  DS    CL7      6   10    7  A  U N             T        Y   50         
DRFSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
DRFAGYH  DS    CL8                                                              
DRFAGY   DS    CL7      6   28    7  A  U N             T        Y   60         
DRFAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
DRFOFFH  DS    CL8                                                              
DRFOFF   DS    CL4      6   46    4  A  U N             T        Y   70         
DRFOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
DRFSALPH DS    CL8                                                              
DRFSALP  DS    CL4      6   64    4  A  U N             T        Y   80         
DRFSALPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DRFRDATH DS    CL8                                                              
DRFRDAT  DS    CL17     7   14   17  A  U N             T        Y   90         
DRFRDATX DS    CL8                                                              
DRFVARIH DS    CL8                                                              
DRFVARI  DS    CL46     7   33   46  A  P N             T        Y  100         
DRFVARIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
DRFTAGH  DS    CL8                                                              
DRFTAG   DS    CL1      8    2    1  A  P N             T        Y              
DRFLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DRFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 408  BYTES                            
