*          DATA SET REDDSENT   AT LEVEL 055 AS OF 07/30/99                      
*              ELECTRONIC CONTRACT GENERIC RECORD LAYOUT                        
*                                                                               
***********************************************************************         
*  REDDSENT:  GENERIC LAYOUT                                          *         
*             ENTERPRISE PROPRIETARY FIELDS                           *         
***********************************************************************         
*  TABLE FOR GENERATION OF A GENERIC ELECTRONIC CONTRACT FILE         *         
*                                                                     *         
*  FLD                                                                *         
*  POS   FIELD NAME    LEN    DESCRIPTION                             *         
*  ---   ------------  ---    --------------------------------------  *         
*    1   RECORD TYPE     1                                            *         
*                             X'00' = CONTROL: PUTS OUT FIELD ID ONLY *         
*                             X'02' = STATION RECORD                  *         
*                             X'04' = OFFICE  RECORD                  *         
*                             X'06' = SALESPERSON RECORD              *         
*                             X'08' = ADVERTISER RECORD               *         
*                             X'09' = PRODUCT RECORD                  *         
*                             X'0A' = AGENCY RECORD                   *         
*                             X'0B' = BUYLINE  RECORD                 *         
*                             X'0C' = CONTRACT RECORD                 *         
*                             X'FD' = USE ABSOLUTE ADDRESS FOR DATA   *         
*                             X'FE' = FIELD CONSTANT: TO BE DEFINED   *         
*                             X'FF' = ONLY IN PROPRIETARY RECORDS:    *         
*                                     NO BUILD FOR RECORD TYPE        *         
*    2   ELEMENT         1    0     = USE IO AREA                     *         
*                             X'FF' = USE INDICATED ADDRESS           *         
*                             X'01' - X'FE' USE D(THIS ELT CODE)      *         
*    3   DISPLACEMENT    4    DISPLACEMENT INTO RECORD, OR            *         
*                             INDICATED ADDR, IF FLD#2 = X'FF'        *         
*    4   I/P FORMAT      2    'H '   = HEXIN                          *         
*                             'B '   = BINARY                         *         
*                             'E '   = EBCDIC/FIXED LENGTH            *         
*                             'EV'   = EBCDIC/VARIABLE LENGTH         *         
*                             'FX'   = FLAG, WHERE 'X' = FLAG VALUE   *         
*                                      SEE FIELD 10 FOR OUTPUT VALUES *         
*                             'DX'   = DATE, WHERE 'X' = DATCON FORM  *         
*    5   I/P LENGTH      2    LENGTH OF INPUT                         *         
*    6   O/P FORMAT      2    'H '   = HEXOUT                         *         
*                             'B '   = BINARY                         *         
*                             'E '   = EBCDIC                         *         
*                             ' L'   =    WITH LEADING ZEROS          *         
*                             ' T'   =    WITH TRAILING SPACES        *         
*                                                                     *         
*                             'DX'   = DATE, WHERE 'X' = DATCON FORM  *         
*    7   O/P LENGTH      2    LENGTH OF OUTPUT                        *         
*    8   O/P FIELD ID    4    ASSIGNED FIELD ID                       *         
*    9   SPECIAL RTNS    2    SPECIAL PROCESSING REQUIREMENTS         *         
*    10  FLAG VALUES     4    BYTE 1   =   VALUE IF BIT ON            *         
*                             BYTE 2   =   VALUE IF BIT OFF           *         
*                             BYTE 3   =   UNUSED                     *         
*                             BYTE 4   =   UNUSED                     *         
*    11  OPTION BITS     4    BYTE 1/X'80' - ELEMENT NEED NOT EXIST   *         
*                             SEE OPTION EQUATES BELOW                *         
*                                                                     *         
*                                                                     *         
*                                                                     *         
*                                                                     *         
*                                                                     *         
*                                                                     *         
*                                                                     *         
*                                                                     *         
***********************************************************************         
*        DISPLACEMENT EQUATES FOR TABLE                                         
DERECTYP EQU   0                   RECORD TYPE                                  
DEELT    EQU   1                   ELEMENT WITHIN RECORD                        
DERECDIS EQU   2                   D(INTO RECORD OR ELEMENT)                    
DEIPFORM EQU   6                   INPUT  FORMAT                                
DEIPLEN  EQU   8                   INPUT  LENGTH                                
DEOPFORM EQU   10                  OUTPUT FORMAT                                
DEOPLEN  EQU   12                  OUTPUT LENGTH                                
DEOPFID# EQU   14                  OUTFIELD FIELD ID #                          
DESPCRTN EQU   18                  SPECIAL ROUTINE FLAGS                        
DEFLGVAL EQU   20                  FLAG BYTE FIELD VALUES                       
DEOPTBIT EQU   24                  OPTION BITS FIELD VALUES                     
*                                                                               
***********************************************************************         
*        RECORD TYPE EQUATES                                                    
CONTROL  EQU   0                                                                
REP      EQU   1                                                                
STATION  EQU   2                                                                
OFFICE   EQU   4                                                                
SALESP   EQU   6                                                                
ADVERT   EQU   8                                                                
PROD     EQU   9                                                                
AGENCY   EQU   X'1A'               USING SECONDARY AGENCY RECORD                
BUY      EQU   X'0B'                                                            
CONTRACT EQU   X'0C'                                                            
DEFFIELD EQU   X'FE'               DEFINE SPECIAL FIELD: AUTOMATIC              
*                                     TRANSFER TO SPECIAL ROUTINE               
ABSFIELD EQU   X'FD'               USE ABSOLUTE FIELD FOR DATA                  
*                                                                               
***********************************************************************         
*        SPECIAL ROUTINE EQUATES                                                
PRODNMCD EQU   X'80'               CHECK FOR PRODUCT CODE/PRODUCT NAME          
NOSPECHR EQU   X'40'               STRIP SPEC CHARS FROM OUTPUT                 
SUBDARE  EQU   X'20'               USE SUB-AGENCIES IN AGY RECORD TO            
*                                     LOOK FOR X'41'/'51' DARE REC.             
*                                     ON FIND, USE THAT SUBAGENCY               
ESTPRIOR EQU   X'10'               CHECK RCONIEST IF RCONXEST NULL              
SUBBYLIN EQU   X'08'               RETRIEVE SUB BUYLINE # FOR LINE              
MGFLAG   EQU   X'04'               DETERMINE MAKEGOOD FLAG                      
TRANTYPE EQU   X'02'               TRANSACTION TYPE                             
*                                                                               
***********************************************************************         
*        OPTION BITS                                                            
*        BYTE  1                                                                
NOELTOK  EQU   X'80'               ELEMENT NEED NOT EXIST                       
JDSTIMO  EQU   X'40'               JDS FORMAT TIME                              
JDSDAYO  EQU   X'20'               JDS FORMAT DATE                              
BIASTIMO EQU   X'10'               BIAS FORMAT TIME                             
BIASDAYO EQU   X'08'               BIAS FORMAT DATE                             
*                                                                               
***********************************************************************         
DDSENT   EQU   *                                                                
HDHDR    DC    X'00'               HEADER ID                                    
         DC    X'00'                                                            
         DC    4X'00'                                                           
         DC    C'  '                                                            
         DC    AL2(0)                                                           
         DC    2C' '                                                            
         DC    AL2(4)                                                           
         DC    C'H000'             GENERIC: H-SERIES CODES                      
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
LDDSENT  EQU   *-DDSENT            L(DDSENT TABLE ENTRY)                        
HDCON#   DC    X'0C'               CONTRACT NUMBER                              
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKCON-RCONREC) DISPLACEMENT                               
         DC    C'H '                 I/P FORMAT                                 
         DC    AL2(4)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(8)                O/P LENGTH                                 
         DC    C'H010'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDREPID  DC    X'01'               REP ID                                       
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RREPKREP-RREPREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(2)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(2)                O/P LENGTH                                 
         DC    C'H020'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDREPNAM DC    X'01'               REP NAME                                     
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RREPNAME-RREPREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(33)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(33)               O/P LENGTH                                 
         DC    C'H030'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDSTA    DC    X'0C'               STATION CALL LETTERS                         
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKSTA-RCONREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(5)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(5)                O/P LENGTH                                 
         DC    C'H040'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDCONCDT DC    X'0C'               CONTRACT CREATE DATE                         
         DC    X'00'                                                            
         DC    AL4(RCONCREA-RCONREC)                                            
         DC    C'D'                DATE INPUT                                   
         DC    AL1(3)              FORMAT 3-CHAR BINARY                         
         DC    AL2(3)                                                           
         DC    C'D'                DATE OUTPUT                                  
         DC    AL1(0)              FORMAT YYMMDD                                
         DC    AL2(6)                                                           
         DC    C'H050'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HDVER#   DC    X'0C'               VERSION  NUMBER (REP)                        
         DC    X'20'                                                            
         DC    AL4(RCONSRV-RCONSEND)                                            
         DC    C'B '               BINARY                                       
         DC    AL2(1)                                                           
         DC    C'EL'               INCLUDE LEADING ZEROS                        
         DC    AL2(3)                                                           
         DC    C'H060'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HDCONDEC DC    X'0C'               DATE ORIGINALLY EC'D                         
*                                     DOES THIS INFO EXIST???                   
         DC    X'15'                                                            
         DC    AL4(RCONECDT-RCONECEL)                                           
         DC    C'D'                DATE INPUT                                   
         DC    AL1(2)              FORMAT 3-CHAR BINARY                         
         DC    AL2(2)                                                           
         DC    C'D'                DATE OUTPUT                                  
         DC    AL1(0)              FORMAT YYMMDD                                
         DC    AL2(6)                                                           
         DC    C'H070'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'80000000'           OPTION BITS                                
*                                     ELEMENT DOES NOT HAVE TO EXIST            
HDCONLEC DC    X'0C'               LAST DATE EC'D                               
         DC    X'15'                                                            
         DC    AL4(RCONECDT-RCONECEL)                                           
         DC    C'D'                DATE INPUT                                   
         DC    AL1(2)              FORMAT 3-CHAR BINARY                         
         DC    AL2(2)                                                           
         DC    C'D'                DATE OUTPUT                                  
         DC    AL1(0)              FORMAT YYMMDD                                
         DC    AL2(6)                                                           
         DC    C'H080'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'80000000'           OPTION BITS                                
*                                     ELEMENT DOES NOT HAVE TO EXIST            
HDEST#   DC    X'0C'               ESTIMATE NUMBER                              
         DC    X'A2'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONXEST-RCONIEL) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(10)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(10)               O/P LENGTH                                 
         DC    C'H090'               O/P FIELD ID #                             
*                                    SPECIAL ROUTINES                           
         DC    X'1000'             IF NULL OR BLANK, CHECK RCONIEST             
         DC    C'0000'                                                          
         DC    X'80000000'           OPTION BITS                                
*                                     ELEMENT DOES NOT HAVE TO EXIST            
HDAGYCOD DC    X'0C'               AGENCY CODE                                  
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKAGY-RCONREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(6)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(6)                O/P LENGTH                                 
         DC    C'H100'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDAGYNAM DC    X'1A'               AGENCY NAME                                  
         DC    X'1F'                 BASE OR ELEMENT CODE                       
         DC    AL4(RAG2NAM2-RAG2ELEM) DISPLACEMENT                              
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(33)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(33)               O/P LENGTH                                 
         DC    C'H110'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDAGYAD1 DC    X'1A'               AGENCY ADDRESS 1                             
         DC    X'20'                 BASE OR ELEMENT CODE                       
         DC    AL4(RAGY2AD1-RAGY2AE1) DISPLACEMENT                              
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(34)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(34)               O/P LENGTH                                 
         DC    C'H120'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDAGYAD2 DC    X'1A'               AGENCY ADDRESS 2                             
         DC    X'20'                 BASE OR ELEMENT CODE                       
         DC    AL4(RAGY2AD2-RAGY2AE1) DISPLACEMENT                              
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(34)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(34)               O/P LENGTH                                 
         DC    C'H130'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDAGYCTY DC    X'1A'               AGENCY CITY                                  
         DC    X'20'                 BASE OR ELEMENT CODE                       
         DC    AL4(RAGY2CTY-RAGY2AE1) DISPLACEMENT                              
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(20)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(20)               O/P LENGTH                                 
         DC    C'H140'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDAGYSTE DC    X'1A'               AGENCY STATE                                 
         DC    X'20'                 BASE OR ELEMENT CODE                       
         DC    AL4(RAGY2STE-RAGY2AE1) DISPLACEMENT                              
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(2)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(2)                O/P LENGTH                                 
         DC    C'H150'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDAGYZIP DC    X'1A'               AGENCY ZIP                                   
         DC    X'20'                 BASE OR ELEMENT CODE                       
         DC    AL4(RAGY2ZIP-RAGY2AE1) DISPLACEMENT                              
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(10)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(10)               O/P LENGTH                                 
         DC    C'H160'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDAGYPHN DC    X'1A'               AGENCY PHONE                                 
         DC    X'10'                 BASE OR ELEMENT CODE                       
         DC    AL4(RAGY2FON-RAGY2FXE) DISPLACEMENT                              
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(10)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(10)               O/P LENGTH                                 
         DC    C'H170'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDAGYFAX DC    X'1A'               AGENCY FAX                                   
         DC    X'10'                 BASE OR ELEMENT CODE                       
         DC    AL4(RAGY2FAX-RAGY2FXE) DISPLACEMENT                              
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(10)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(10)               O/P LENGTH                                 
         DC    C'H180'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDADVCOD DC    X'0C'               ADVERTISER CODE                              
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKADV-RCONREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(4)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(4)                O/P LENGTH                                 
         DC    C'H190'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDADVNAM DC    X'08'               ADVERTISER NAME                              
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RADVNAME-RADVREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(20)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(20)               O/P LENGTH                                 
         DC    C'H200'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDCLICOD DC    X'0C'               CLIENT CODE/DARE ORDERS                      
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKAGY-RCONREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(6)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(5)                O/P LENGTH                                 
         DC    C'H210'               O/P FIELD ID #                             
*                                    SPECIAL ROUTINES                           
         DC    X'2000'             DARE AGENCY CODE LOOKUP                      
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HDSALCOD DC    X'0C'               SALESPERSON CODE                             
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONSAL-RCONREC)  DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(3)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(3)                O/P LENGTH                                 
         DC    C'H220'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDSALNAM DC    X'06'               SALESPERSON NAME                             
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RSALNAME-RSALREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(20)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(20)               O/P LENGTH                                 
         DC    C'H230'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDSALPHN DC    X'06'               S/P PHONE                                    
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RSALTEL-RSALREC)  DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(12)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(10)               O/P LENGTH                                 
         DC    C'H240'               O/P FIELD ID #                             
         DC    X'4000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDSALFAX DC    X'06'               S/P FAX                                      
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RSALFAX-RSALREC)  DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(12)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(10)               O/P LENGTH                                 
         DC    C'H250'               O/P FIELD ID #                             
         DC    X'4000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDOFFCOD DC    X'0C'               OFFICE CODE                                  
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKOFF-RCONREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(2)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(2)                O/P LENGTH                                 
         DC    C'H260'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDOFFNAM DC    X'04'               OFFICE NAME                                  
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(ROFFNAME-ROFFREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(20)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(20)               O/P LENGTH                                 
         DC    C'H270'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDPROCAT DC    X'0C'               PRODUCT CATEGORY                             
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONCTGY-RCONREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(2)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(2)                O/P LENGTH                                 
         DC    C'H280'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDPRONAM DC    X'09'               PRODUCT NAME                                 
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RPRDNAME-RPRDREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(20)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(20)               O/P LENGTH                                 
         DC    C'H290'               O/P FIELD ID #                             
         DC    X'8000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDBYRNAM DC    X'0C'               PRODUCT NAME                                 
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONBUYR-RCONREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(20)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(20)               O/P LENGTH                                 
         DC    C'H300'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HDFLSTRT DC    X'0C'               FLIGHT START DATE                            
         DC    X'00'                                                            
         DC    AL4(RCONDATE-RCONREC)                                            
         DC    C'D'                DATE INPUT                                   
         DC    AL1(3)              FORMAT 3-CHAR BINARY                         
         DC    AL2(3)                                                           
         DC    C'D'                DATE OUTPUT                                  
         DC    AL1(0)              FORMAT YYMMDD                                
         DC    AL2(6)                                                           
         DC    C'H310'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HDFLEND  DC    X'0C'               FLIGHT END   DATE                            
         DC    X'00'                                                            
         DC    AL4(RCONDATE+3-RCONREC)                                          
         DC    C'D'                DATE INPUT                                   
         DC    AL1(3)              FORMAT 3-CHAR BINARY                         
         DC    AL2(3)                                                           
         DC    C'D'                DATE OUTPUT                                  
         DC    AL1(0)              FORMAT YYMMDD                                
         DC    AL2(6)                                                           
         DC    C'H320'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HDCONTYP DC    X'0C'               CONTRACT TYPE                                
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONTYPE-RCONREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(1)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(1)                O/P LENGTH                                 
         DC    C'H330'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HDNATLOC DC    X'0C'               CONTRACT TYPE                                
         DC    X'1E'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONRF1-RCONRFEL) DISPLACEMENT                               
         DC    C'F'                FLAG BYTE                                    
         DC    X'20'               LOCAL ORDER = X'20'                          
         DC    AL2(1)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(1)                O/P LENGTH                                 
         DC    C'H340'               O/P FIELD ID #                             
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'L 00'             LOCAL                                        
         DC    X'00000000'           OPTION BITS                                
HDHDRXFF DC    X'FFFF'             END OF SECTION DELIMITER                     
         SPACE 1                                                                
*                                  PROPRIETARY HEADER                           
PDHDR    DC    X'FF'               X'FF' = NO PROPRIETARY ENTRY                 
         DC    X'00'                                                            
         DC    4X'00'                                                           
         DC    C'  '                                                            
         DC    AL2(0)                                                           
         DC    2C' '                                                            
         DC    AL2(4)                                                           
         DC    C'I000'             PROPRIETARY: I-SERIES CODES                  
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
PDHDRXFF DC    X'FFFF'             END OF SECTION DELIMITER                     
         SPACE 1                                                                
*                                  HEADER COMMENT                               
HCHDR    DC    X'00'               HEADER ID                                    
         DC    X'00'                                                            
         DC    4X'00'                                                           
         DC    C'  '                                                            
         DC    AL2(0)                                                           
         DC    2C' '                                                            
         DC    AL2(4)                                                           
         DC    C'C000'             GENERIC: C-SERIES CODES                      
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HCCON#   DC    X'0C'               CONTRACT NUMBER                              
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKCON-RCONREC) DISPLACEMENT                               
         DC    C'H '                 I/P FORMAT                                 
         DC    AL2(4)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(8)                O/P LENGTH                                 
         DC    C'C010'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HCCOMMT  DC    X'0C'               HEADER COMMENT                               
         DC    X'02'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONCMNT-RCONCMCO) DISPLACEMENT                              
         DC    C'EV'                 I/P FORMAT - VARIABLE                      
         DC    AL2(60)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(60)               O/P LENGTH                                 
         DC    C'C020'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'80000000'           OPTION BITS                                
*                                     ELEMENT DOES NOT HAVE TO EXIST            
HCHDRXFF DC    X'FFFF'             END OF SECTION DELIMITER                     
         SPACE 1                                                                
*                                  PROPRIETARY HEADER COMMENT                   
PCHDR    DC    X'FF'               X'FF' = NO PROPRIETARY RECORD                
         DC    X'00'                                                            
         DC    4X'00'                                                           
         DC    C'  '                                                            
         DC    AL2(0)                                                           
         DC    2C' '                                                            
         DC    AL2(4)                                                           
         DC    C'D000'             PROPRIETARY: D-SERIES CODES                  
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
PCCON#   DC    X'0C'               CONTRACT NUMBER                              
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKCON-RCONREC) DISPLACEMENT                               
         DC    C'H '                 I/P FORMAT                                 
         DC    AL2(4)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(8)                O/P LENGTH                                 
         DC    C'D010'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
PCHDRXFF DC    X'FFFF'             END OF SECTION DELIMITER                     
         SPACE 1                                                                
*                                                                               
**BUY**                                                                         
HBHDR    DC    X'00'               BUYLINE                                      
         DC    X'00'                                                            
         DC    4X'00'                                                           
         DC    C'  '                                                            
         DC    AL2(0)                                                           
         DC    2C' '                                                            
         DC    AL2(4)                                                           
         DC    C'B000'             GENERIC: B-SERIES CODES                      
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HBCON#   DC    X'0C'               CONTRACT NUMBER                              
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKCON-RCONREC) DISPLACEMENT                               
         DC    C'H '                 I/P FORMAT                                 
         DC    AL2(4)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(8)                O/P LENGTH                                 
         DC    C'B010'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HBBUY#   DC    X'0B'               BUYLINE NUMBER                               
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RBUYKLIN-RBUYREC) DISPLACEMENT                               
         DC    C'B '                 I/P FORMAT                                 
         DC    AL2(1)                I/P LENGTH                                 
         DC    C'EL'                 O/P FORMAT                                 
         DC    AL2(3)                O/P LENGTH                                 
         DC    C'B020'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HBSUBBY# DC    X'FD'               SUB BUYLINE NUMBER: ABSOLUTE ADDRESS         
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(EC203BY2-LOCALWRK)   DISPLACEMENT                            
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(1)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(1)                O/P LENGTH                                 
         DC    C'B030'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HBMODCOD DC    X'0B'               MODIFICATION CODE                            
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RBUYCHGI-RBUYREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(2)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(2)                O/P LENGTH                                 
         DC    C'B040'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HBMGFLAG DC    X'FE'               MAKEGOOD FLAG: SPECIAL ROUTINE               
         DC    X'00'                                                            
         DC    AL4(0)                                                           
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(2)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(2)                O/P LENGTH                                 
         DC    C'B050'               O/P FIELD ID #                             
         DC    X'0400'               SPECIAL ROUTINES                           
*                                      DETERMINE MAKEGOOD FLAGS NEEDED          
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
*                                                                               
*   NEXT FIELD DOESN'T REALLY WORK.  UNTIL SUCH TIME AS WE KNOW                 
*        THAT A FIELD HAS BEEN ACTUALLY TRANSFERRED TO THE TRAFFIC              
*        SYSTEM, WE CAN'T DETERMINE IF THE CURRENT TRANSMITTING OF              
*        THAT LINE CONSTITUTES AN 'ADD' OR A 'CHANGE'                           
*                                                                               
HBTRANS  DC    X'0B'               TRANSACTION TYPE                             
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RBUYCHGI-RBUYREC) DISPLACEMENT                               
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(2)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(2)                O/P LENGTH                                 
         DC    C'B060'               O/P FIELD ID #                             
         DC    X'0200'               SPECIAL ROUTINES                           
*                                      INTERPRET ADD/CHANGE                     
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
HBTRLIN# DC    X'0B'               TRAFFIC SYSTEM LINE #                        
*                                    INFO DOES NOT EXIST AT PRESENT             
         DC    X'FF'               LOOK IN NON-EXISTENT ELT                     
         DC    AL4(0)                                                           
         DC    C'B '                 I/P FORMAT                                 
         DC    AL2(1)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(2)                O/P LENGTH                                 
         DC    C'B070'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'80000000'           OPTION BITS                                
*                                     ELEMENT DOES NOT HAVE TO EXIST            
HBDAYS   DC    X'FD'               DAYS OF ORDER: ABSOLUTE ADDRESS              
         DC    X'00'                                                            
         DC    AL4(EC203DAY-LOCALWRK)                                           
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(12)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(12)               O/P LENGTH                                 
         DC    C'B080'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'20000000'           OPTION BITS                                
*                                      JDS  FORMAT DAYS                         
HBSTDATE DC    X'FD'               START DATE: ABSOLUTE ADDRESS                 
         DC    X'00'                                                            
         DC    AL4(EC203STD-LOCALWRK)                                           
         DC    C'D'                DATE INPUT                                   
         DC    AL1(3)              FORMAT 3-CHAR BINARY                         
         DC    AL2(3)                                                           
         DC    C'D'                DATE OUTPUT                                  
         DC    AL1(0)              FORMAT YYMMDD                                
         DC    AL2(6)                                                           
         DC    C'B090'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HBENDATE DC    X'FD'               END   DATE: ABSOLUTE ADDRESS                 
         DC    X'00'                                                            
         DC    AL4(EC203END-LOCALWRK)                                           
         DC    C'D'                DATE INPUT                                   
         DC    AL1(3)              FORMAT 3-CHAR BINARY                         
         DC    AL2(3)                                                           
         DC    C'D'                DATE OUTPUT                                  
         DC    AL1(0)              FORMAT YYMMDD                                
         DC    AL2(6)                                                           
         DC    C'B100'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HBNOFWKS DC    X'FD'               NUMBER OF WEEKS: ABSOLUTE ADDRESS            
         DC    X'00'                                                            
         DC    AL4(NOFWKS-LOCALWRK)                                             
         DC    C'B '                 I/P FORMAT                                 
         DC    AL2(1)                I/P LENGTH                                 
         DC    C'EL'                 O/P FORMAT                                 
         DC    AL2(3)                O/P LENGTH                                 
         DC    C'B110'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HBLENGTH DC    X'FD'               SPOT LENGTH: ABSOLUTE ADDRESS                
         DC    X'00'                                                            
         DC    AL4(EC203LNS-LOCALWRK)                                           
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(5)                I/P LENGTH                                 
         DC    C'EL'                 O/P FORMAT                                 
         DC    AL2(5)                O/P LENGTH                                 
         DC    C'B120'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HBSTENTM DC    X'FD'               START/END TIME: ABSOLUTE ADDRESS             
         DC    X'00'                                                            
         DC    AL4(EC203ORT-LOCALWRK)                                           
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(11)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(11)               O/P LENGTH                                 
         DC    C'B130'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'10000000'           OPTION BITS                                
*                                      BIAS TIME FORMAT                         
HBSPTSWK DC    X'FD'               SPOTS/WEEK: ABSOLUTE ADDRESS                 
         DC    X'00'                                                            
         DC    AL4(SPOTSWK-LOCALWRK)                                            
         DC    C'B '                 I/P FORMAT                                 
         DC    AL2(1)                I/P LENGTH                                 
         DC    C'EL'                 O/P FORMAT                                 
         DC    AL2(3)                O/P LENGTH                                 
         DC    C'B140'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HBSPRATE DC    X'FD'               SPOT RATE: ABSOLUTE ADDRESS                  
         DC    X'00'                                                            
         DC    AL4(EC203RTE-LOCALWRK)                                           
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(9)                I/P LENGTH                                 
         DC    C'EL'                 O/P FORMAT                                 
         DC    AL2(9)                O/P LENGTH                                 
         DC    C'B150'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HBCALNDR DC    X'FD'               CALENDAR: ABSOLUTE ADDRESS                   
         DC    X'00'                                                            
         DC    AL4(EC203CAL-LOCALWRK)                                           
         DC    C'E '                 I/P FORMAT                                 
         DC    AL2(7)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(7)                O/P LENGTH                                 
         DC    C'B160'                                                          
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
HBHDRXFF DC    X'FFFF'             END OF SECTION DELIMITER                     
         SPACE                                                                  
**PROPRIETARY BUY**                PROPRIETARY BUYLINE                          
PBHDR    DC    X'FF'               X'FF' = NO PROPRIETARY RECORDS               
         DC    X'00'                                                            
         DC    4X'00'                                                           
         DC    C'  '                                                            
         DC    AL2(0)                                                           
         DC    2C' '                                                            
         DC    AL2(4)                                                           
         DC    C'A000'             PROPRIETARY: A-SERIES CODES                  
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
PBCON#   DC    X'0C'               CONTRACT NUMBER                              
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKCON-RCONREC) DISPLACEMENT                               
         DC    C'H '                 I/P FORMAT                                 
         DC    AL2(4)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(8)                O/P LENGTH                                 
         DC    C'A010'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
PBHDRXFF DC    X'FFFF'             END OF SECTION DELIMITER                     
         SPACE                                                                  
**PROPRIETARY BUY**                                                             
**BUY COMMENT**                                                                 
BCHDR    DC    X'00'               HEADER ID                                    
         DC    X'00'                                                            
         DC    4X'00'                                                           
         DC    C'  '                                                            
         DC    AL2(0)                                                           
         DC    2C' '                                                            
         DC    AL2(4)                                                           
         DC    C'M000'             GENERIC: M-SERIES CODES                      
         DC    X'0000'             SPECIAL ROUTINES                             
         DC    C'0000'                                                          
         DC    X'00000000'           OPTION BITS                                
BCCON#   DC    X'0C'               CONTRACT NUMBER                              
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(RCONKCON-RCONREC) DISPLACEMENT                               
         DC    C'H '                 I/P FORMAT                                 
         DC    AL2(4)                I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(8)                O/P LENGTH                                 
         DC    C'M010'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
BCCOMMT  DC    X'FD'               BUY COMMENT: ABSOLUTE ADDRESS                
         DC    X'00'                 BASE OR ELEMENT CODE                       
         DC    AL4(EC203CMT-LOCALWRK) DISPLACEMENT                              
         DC    C'EV'                 I/P FORMAT - VARIABLE                      
         DC    AL2(60)               I/P LENGTH                                 
         DC    C'E '                 O/P FORMAT                                 
         DC    AL2(60)               O/P LENGTH                                 
         DC    C'M020'               O/P FIELD ID #                             
         DC    X'0000'               SPECIAL ROUTINES                           
         DC    C'0000'               FLAG VALUES                                
         DC    X'00000000'           OPTION BITS                                
BCHDRXFF DC    X'FFFF'             END OF SECTION DELIMITER                     
         SPACE 1                                                                
**BUY COMMENT**                                                                 
