*          DATA SET REDEMPRC   AT LEVEL 002 AS OF 01/07/09                      
* DEMO CATEGORY PRECISION TABLE                                                 
* INCLUDED BY REEZP00                                                           
*                                                                               
DEC0TAB  DS    0XL3                                                             
         DC    C'TC',X'00'                                                      
         DC    C'TI',X'00'                                                      
         DC    C'TR',X'00'                                                      
         DC    C'TP',X'00'                                                      
         DC    C'TS',X'00'                                                      
         DC    C'TQ',X'00'                                                      
         DC    C'TX',X'00'                                                      
         DC    C'TE',X'00'                                                      
         DC    C'TD',X'00'                                                      
         DC    C'TT',X'00'         SPECIAL FOR REPPAK                           
         DC    C'PI',X'00'                                                      
         DC    C'PT',X'00'                                                      
         DC    C'PR',X'00'                                                      
         DC    C'PP',X'00'                                                      
         DC    C'PS',X'00'                                                      
         DC    C'PQ',X'00'                                                      
         DC    C'PX',X'00'                                                      
         DC    C'PD',X'00'                                                      
         DC    AL1(0)                                                           
*                                                                               
DEC1TAB  DS    0XL3                                                             
         DC    C'TC',X'01'                                                      
         DC    C'TI',X'01'                                                      
         DC    C'TR',X'01'                                                      
         DC    C'TP',X'01'                                                      
         DC    C'TS',X'01'                                                      
         DC    C'TQ',X'01'                                                      
         DC    C'TX',X'01'                                                      
         DC    C'TE',X'01'                                                      
         DC    C'TF',X'01'                                                      
         DC    C'TD',X'01'                                                      
         DC    C'TT',X'01'         SPECIAL FOR REPPAK                           
         DC    C'PI',X'01'                                                      
         DC    C'PT',X'01'                                                      
         DC    C'PR',X'01'                                                      
         DC    C'PP',X'01'                                                      
         DC    C'PS',X'01'                                                      
         DC    C'PQ',X'01'                                                      
         DC    C'PX',X'01'                                                      
         DC    C'PD',X'01'                                                      
         DC    AL1(0)                                                           
DEC2TAB  DS    0XL3                                                             
         DC    C'TC',X'01'                                                      
         DC    C'TI',X'01'                                                      
         DC    C'TR',X'02'                                                      
         DC    C'TP',X'01'                                                      
         DC    C'TS',X'01'                                                      
         DC    C'TQ',X'01'                                                      
         DC    C'TX',X'01'                                                      
         DC    C'TE',X'01'                                                      
         DC    C'TD',X'01'                                                      
         DC    C'TT',X'01'         SPECIAL FOR REPPAK                           
         DC    C'PI',X'01'                                                      
         DC    C'PT',X'01'                                                      
         DC    C'PR',X'02'                                                      
         DC    C'PP',X'01'                                                      
         DC    C'PS',X'01'                                                      
         DC    C'PQ',X'01'                                                      
         DC    C'PX',X'01'                                                      
         DC    C'PD',X'01'                                                      
         DC    AL1(0)                                                           
