*          DATA SET REDIFOFF   AT LEVEL 016 AS OF 02/14/07                      
*                                                                               
* NEW DIFFERENCES SWITCH OVER TABLE BY FIRST REVISION RECEIVED DATE             
* AND OFFICE COMBINATION                                                        
*                                                                               
DIFOFF   DS    0CL6                                                             
         DC    C'SJ',C'NY',X'D12E' SEP14/04                                     
         DC    C'SJ',C'MN',X'D12E' SEP14/04                                     
*                                                                               
         DC    C'BL',C'BO',X'D0D5' JUN21/04                                     
         DC    C'BL',C'CA',X'D0D5' JUN21/04                                     
         DC    C'BL',C'MI',X'D0D5' JUN21/04                                     
         DC    C'BL',C'FL',X'D0D5' JUN21/04                                     
*                                                                               
         DC    C'CB',C'07',X'D0D5' JUN21/04                                     
         DC    C'CB',C'08',X'D0D5' JUN21/04                                     
         DC    C'CB',C'BO',X'D0D5' JUN21/04                                     
         DC    C'CB',C'MI',X'D0D5' JUN21/04                                     
*                                                                               
         DC    C'FB',C'BO',X'D0D5' JUN21/04                                     
         DC    C'FB',C'CL',X'D0D5' JUN21/04                                     
         DC    C'FB',C'MI',X'D0D5' JUN21/04                                     
*                                                                               
         DC    C'PV',C'BO',X'D0D5' JUN21/04                                     
         DC    C'PV',C'CL',X'D0D5' JUN21/04                                     
         DC    C'PV',C'MI',X'D0D5' JUN21/04                                     
         DC    C'PV',C'FL',X'D0D5' JUN21/04                                     
*                                                                               
         DC    C'BL',C'DE',X'D0E6' JUL06/04                                     
         DC    C'BL',C'MN',X'D0E6' JUL06/04                                     
*                                                                               
         DC    C'CB',C'10',X'D0E6' JUL06/04                                     
         DC    C'CB',C'21',X'D0E6' JUL06/04                                     
         DC    C'CB',C'DE',X'D0E6' JUL06/04                                     
         DC    C'CB',C'MN',X'D0E6' JUL06/04                                     
*                                                                               
         DC    C'FB',C'DE',X'D0E6' JUL06/04                                     
         DC    C'FB',C'MN',X'D0E6' JUL06/04                                     
*                                                                               
         DC    C'PV',C'DE',X'D0E6' JUL06/04                                     
         DC    C'PV',C'MN',X'D0E6' JUL06/04                                     
*                                                                               
         DC    C'CQ',C'CH',X'D0EC' JUL12/04                                     
         DC    C'AM',C'CH',X'D0EC' JUL12/04                                     
         DC    C'SZ',C'CH',X'D0EC' JUL12/04                                     
         DC    C'PV',C'CH',X'D0EC' JUL12/04                                     
         DC    C'BL',C'CH',X'D0EC' JUL12/04                                     
         DC    C'FB',C'CH',X'D0EC' JUL12/04                                     
         DC    C'CB',C'CH',X'D0EC' JUL12/04                                     
*                                                                               
         DC    C'CQ',C'NY',X'D0F3' JUL19/04                                     
         DC    C'AM',C'NY',X'D0F3' JUL19/04                                     
         DC    C'SZ',C'NY',X'D0F3' JUL19/04                                     
         DC    C'PV',C'NY',X'D0F3' JUL19/04                                     
         DC    C'BL',C'NY',X'D0F3' JUL19/04                                     
         DC    C'FB',C'NY',X'D0F3' JUL19/04                                     
         DC    C'CB',C'NY',X'D0F3' JUL19/04                                     
*                                                                               
         DC    C'PV',C'PH',X'D0FA' JUL26/04                                     
         DC    C'BL',C'PH',X'D0FA' JUL26/04                                     
         DC    C'PV',C'AT',X'D0FA' JUL26/04                                     
         DC    C'BL',C'AT',X'D0FA' JUL26/04                                     
         DC    C'FB',C'PH',X'D0FA' JUL26/04                                     
         DC    C'FB',C'AT',X'D0FA' JUL26/04                                     
         DC    C'CB',C'PH',X'D0FA' JUL26/04                                     
         DC    C'CB',C'AT',X'D0FA' JUL26/04                                     
         DC    C'CB',C'05',X'D0FA' JUL26/04                                     
         DC    C'NB',C'PH',X'D0FA' JUL26/04                                     
         DC    C'NB',C'AT',X'D0FA' JUL26/04                                     
*                                                                               
         DC    C'PV',C'DA',X'D102' AUG02/04                                     
         DC    C'PV',C'HO',X'D102' AUG02/04                                     
         DC    C'PV',C'SL',X'D102' AUG02/04                                     
         DC    C'BL',C'DA',X'D102' AUG02/04                                     
         DC    C'BL',C'HO',X'D102' AUG02/04                                     
         DC    C'BL',C'SL',X'D102' AUG02/04                                     
         DC    C'FB',C'DA',X'D102' AUG02/04                                     
         DC    C'FB',C'HO',X'D102' AUG02/04                                     
         DC    C'FB',C'SL',X'D102' AUG02/04                                     
         DC    C'NB',C'DA',X'D102' AUG02/04                                     
         DC    C'NB',C'HO',X'D102' AUG02/04                                     
         DC    C'CB',C'09',X'D102' AUG02/04                                     
         DC    C'CB',C'DA',X'D102' AUG02/04                                     
         DC    C'CB',C'18',X'D102' AUG02/04                                     
*                                                                               
         DC    C'PV',C'LA',X'D109' AUG09/04                                     
         DC    C'BL',C'LA',X'D109' AUG09/04                                     
         DC    C'FB',C'LA',X'D109' AUG09/04                                     
         DC    C'CB',C'LA',X'D109' AUG09/04                                     
         DC    C'CB',C'19',X'D109' AUG09/04                                     
         DC    C'CB',C'02',X'D109' AUG09/04                                     
*                                                                               
         DC    C'PV',C'DV',X'D110' AUG09/04                                     
         DC    C'P9',C'NY',X'D110' AUG09/04                                     
         DC    C'BL',C'DV',X'D110' AUG09/04                                     
         DC    C'PV',C'PO',X'D110' AUG09/04                                     
         DC    C'BL',C'PO',X'D110' AUG09/04                                     
         DC    C'PV',C'SF',X'D110' AUG09/04                                     
         DC    C'BL',C'SF',X'D110' AUG09/04                                     
         DC    C'PV',C'SE',X'D110' AUG09/04                                     
         DC    C'BL',C'SA',X'D110' AUG09/04                                     
         DC    C'FB',C'SF',X'D110' AUG09/04                                     
         DC    C'FB',C'SE',X'D110' AUG09/04                                     
         DC    C'CB',C'SF',X'D110' AUG09/04                                     
         DC    C'CB',C'06',X'D110' AUG09/04                                     
         DC    C'NB',C'SF',X'D110' AUG09/04                                     
*                                                                               
         DC    X'FF'                                                            
