*          DATA SET REEZPMAPS  AT LEVEL 060 AS OF 06/20/02                      
*                                                                               
* ELEMENT HEADER ENTRY(MHELD DSECT)                                             
*   ELEMENT DATA ENTIRES(MDELD DSECT)                                           
*   X'00' END OF ELEMENT DATA MARKER                                            
* X'00' END OF HEADERS                                                          
*-------------------------------------------------------------------            
* HEADER MAPCODE EQUATES                                                        
*     HDRQ = RECIEVABLE MAP CODE                                                
*    DATAQ = SEND MAP CODE                                                      
*                                                                               
INITHDRQ EQU   1                                                                
LCONHDRQ EQU   3                                                                
DCONHDRQ EQU   4                                                                
RTGSHDRQ EQU   5                                                                
VHDRHDRQ EQU   6                                                                
**KSHDRQ EQU   7                                                                
STADATAQ EQU   8                                                                
BKSDATAQ EQU   9                                                                
DEMDATAQ EQU   10                                                               
SALDATAQ EQU   11                                                               
ADVDATAQ EQU   12                                                               
PRDDATAQ EQU   13                                                               
AGYDATAQ EQU   14                                                               
REPDATAQ EQU   15                                                               
CONDATAQ EQU   16                                                               
PRFDATAQ EQU   17                                                               
DCTDATAQ EQU   18                                                               
DSPDATAQ EQU   19                                                               
CTYDATAQ EQU   20                                                               
DPTDATAQ EQU   21                                                               
BUYDATAQ EQU   22                                                               
BDYDATAQ EQU   23                                                               
BDTDATAQ EQU   24                                                               
INVDATAQ EQU   26                                                               
*___________________________________________________________________            
* ONE OF THESE WILL BE SENT WITH EVERY TRANSACTION                              
*  IF THERE IS AN FE AT THE START AND A FD AT THE END OF A TRANSACTION          
*   THEN DON'T SEND ANY WARNING MESSAGE TO THE PC                               
*                                                                               
FVERHDRQ EQU   X'FE'               VERSION HEADER W/CHECK                       
FVE2HDRQ EQU   X'FD'               VERSION HEADER W/O CHECK                     
*___________________________________________________________________            
FAMAP    DS    0X                  FALINK MAPTABLE                              
*********************************************************************           
* SPECIAL FALINK HEADERS                                                        
*********************************************************************           
*--------------------------------------------------------------------           
* VERSION INFO W/CHECK FOR WARNINGS OR HIGH VERSION REQUIRED                    
*--------------------------------------------------------------------           
FVERREQ  DC    AL1(FVERREQD-*),AL2(FVERHDRQ),AL2(FVERREQX-FVERREQ)              
         DC    X'80'                                                            
FVERREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(FVERVERQ),C'VER# ',AL1(MDTHXQ),AL1(004)          
         DC    X'00'                                                            
FVERREQX EQU   *                                                                
*                                                                               
FVERVERQ EQU   1                                                                
*--------------------------------------------------------------------           
* VERSION INFO W/O CHECK FOR WARNINGS OR HIGH VERSION REQUIRED                  
*--------------------------------------------------------------------           
FVE2REQ  DC    AL1(FVE2REQD-*),AL2(FVE2HDRQ),AL2(FVE2REQX-FVE2REQ)              
         DC    X'80'                                                            
FVE2REQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(FVERVERQ),C'VER# ',AL1(MDTHXQ),AL1(004)          
         DC    X'00'                                                            
FVE2REQX EQU   *                                                                
*********************************************************************           
* RECEIVE HEADERS                                                               
*********************************************************************           
*--------------------------------------------------------------------           
* INITIAL DOWNLOAD REQUEST                                                      
*--------------------------------------------------------------------           
INITREQ  DC    AL1(INITREQD-*),AL2(INITHDRQ),AL2(INITREQX-INITREQ)              
         DC    X'80'                                                            
INITREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(INITSALQ),C'SALSP',AL1(MDTCHQ),AL1(003)          
         DC    X'00'                                                            
INITREQX EQU   *                                                                
         SPACE 1                                                                
INITSALQ EQU   1                                                                
INITRSTQ EQU   2                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* LIST CONTRACT DOWNLOAD REQUEST                                                
*--------------------------------------------------------------------           
LCONREQ  DC    AL1(LCONREQD-*),AL2(LCONHDRQ),AL2(LCONREQX-LCONREQ) '            
         DC    X'80'                                                            
LCONREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(LCSALQ),C'SAL  ',AL1(MDTCHQ),AL1(003)            
FLDLEN   EQU   *-LCONREQD                                                       
         DC    AL1(FLDLEN),AL2(LCSTAQ),C'STA  ',AL1(MDTCHQ),AL1(005)            
         DC    AL1(FLDLEN),AL2(LCFLTSTQ),C'FLTST',AL1(MDTJDQ),AL1(003)          
         DC    AL1(FLDLEN),AL2(LCFLTENQ),C'FLTEN',AL1(MDTJDQ),AL1(003)          
         DC    AL1(FLDLEN),AL2(LCAGYQ),C'AGY  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(LCAOFQ),C'AOF  ',AL1(MDTCHQ),AL1(002)            
         DC    AL1(FLDLEN),AL2(LCADVQ),C'ADV  ',AL1(MDTCHQ),AL1(004)            
         DC    X'00'                                                            
LCONREQX EQU   *                                                                
         SPACE 3                                                                
LCSALQ   EQU   1                                                                
LCSTAQ   EQU   2                                                                
LCFLTSTQ EQU   3                                                                
LCFLTENQ EQU   4                                                                
LCAGYQ   EQU   5                                                                
LCAOFQ   EQU   6                                                                
LCADVQ   EQU   7                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* RATING DATA  DOWNLOAD REQUEST                                                 
*--------------------------------------------------------------------           
RTGSREQ  DC    AL1(RTGSREQD-*),AL2(RTGSHDRQ),AL2(RTGSREQX-RTGSREQ) '            
         DC    X'80'                                                            
RTGSREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(RTRTSRVQ),C'RTSRV',AL1(MDTCHQ),AL1(001)          
         DC    AL1(FLDLEN),AL2(RTTPBKQ),C'TPBK ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(RTT4BKQ),C'T4BK ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(RTPVBKQ),C'PVBK ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(RTTPUPGQ),C'TPUPG',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(RTT4UPGQ),C'T4UPG',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(RTPVUPGQ),C'PVUPG',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(RTDEMOQ),C'DEMO ',AL1(MDTCHQ),AL1(000)           
*                                                                               
         DC    AL1(FLDLEN),AL2(RTSTAQ),C'STA  ',AL1(MDTCHQ),AL1(005)            
         DC    AL1(FLDLEN),AL2(RTDAYQ),C'DAY  ',AL1(MDTBIQ),AL1(001)            
         DC    AL1(FLDLEN),AL2(RTSTIMQ),C'S-TIM',AL1(MDTBIQ),AL1(002)           
         DC    AL1(FLDLEN),AL2(RTETIMQ),C'E-TIM',AL1(MDTBIQ),AL1(002)           
         DC    AL1(FLDLEN),AL2(RTXTIMQ),C'X-TIM',AL1(MDTBIQ),AL1(002)           
         DC    AL1(FLDLEN),AL2(RTDATEQ),C'DATE ',AL1(MDTJDQ),AL1(003)           
         DC    AL1(FLDLEN),AL2(RTEMRKQ),C'EMARK',AL1(MDTMDQ),AL1(000)           
         DC    X'00'                                                            
RTGSREQX EQU   *                                                                
         SPACE 3                                                                
RTRTSRVQ EQU   1                                                                
RTBOOKQ  EQU   2                                                                
RTTPBKQ  EQU   3                                                                
RTT4BKQ  EQU   4                                                                
RTPVBKQ  EQU   5                                                                
RTUPGQ   EQU   6                                                                
RTTPUPGQ EQU   7                                                                
RTT4UPGQ EQU   8                                                                
RTPVUPGQ EQU   9                                                                
RTDEMOQ  EQU   10                                                               
RTSTAQ   EQU   11                                                               
RTDAYQ   EQU   12                                                               
RTSTIMQ  EQU   13                                                               
RTETIMQ  EQU   14                  END TIME FOR PROGRAM                         
RTXTIMQ  EQU   15                  END TIME FOR ORBITS                          
RTDATEQ  EQU   16                  EFFECTIVE DATE(REPLACES END TIME)            
RTEMRKQ  EQU   17                  END OF REQUEST MARKER                        
         SPACE 3                                                                
*--------------------------------------------------------------------           
* VALIDATE HEADER REQUEST                                                       
*--------------------------------------------------------------------           
VHDRREQ  DC    AL1(VHDRREQD-*),AL2(VHDRHDRQ),AL2(VHDRREQX-VHDRREQ) '            
         DC    X'80'                                                            
VHDRREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(VBRTSRVQ),C'RTSRV',AL1(MDTCHQ),AL1(001)          
         DC    AL1(FLDLEN),AL2(VBBOOKQ),C'BOOK ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(VBUPGRDQ),C'UPGRD',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(VBDEMOQ),C'DEMO ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(VBUPGNMQ),C'UPGNM',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(VHSTAQ),C'STA  ',AL1(MDTCHQ),AL1(005)            
         DC    AL1(FLDLEN),AL2(VHADVQ),C'ADV  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(VHPRDQ),C'PRD  ',AL1(MDTCHQ),AL1(003)            
         DC    AL1(FLDLEN),AL2(VHAGYQ),C'AGY  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(VHAOFQ),C'AGYOF',AL1(MDTCHQ),AL1(002)            
         DC    AL1(FLDLEN),AL2(VHFLSQ),C'FLTST',AL1(MDTJDQ),AL1(000)            
         DC    AL1(FLDLEN),AL2(VHFLEQ),C'FLTEF',AL1(MDTJDQ),AL1(000)            
         DC    AL1(FLDLEN),AL2(VHCTYPQ),C'CTYP ',AL1(MDTCHQ),AL1(001)           
         DC    AL1(FLDLEN),AL2(VHDCTQ),C'DCTYP',AL1(MDTCHQ),AL1(002)            
         DC    AL1(FLDLEN),AL2(VHDSPQ),C'DSAL ',AL1(MDTCHQ),AL1(003)            
         DC    AL1(FLDLEN),AL2(VHSALQ),C'SAL  ',AL1(MDTCHQ),AL1(003)            
         DC    X'00'                                                            
VHDRREQX EQU   *                                                                
         SPACE 3                                                                
VBRTSRVQ EQU   1                                                                
VBBOOKQ  EQU   2                                                                
VBINBKQ  EQU   30                                                               
VBUPGRDQ EQU   3                                                                
VBNIUPGQ EQU   40                                                               
VBDEMOQ  EQU   4                                                                
VBUPGNMQ EQU   5                   UPGRADE NAME                                 
*                                                                               
VHSTAQ   EQU   10                                                               
VHADVQ   EQU   11                                                               
VHPRDQ   EQU   12                                                               
VHAGYQ   EQU   13                                                               
VHAOFQ   EQU   14                                                               
VHFLSQ   EQU   15                                                               
VHFLEQ   EQU   16                                                               
VHCTYPQ  EQU   17                                                               
VHDCTQ   EQU   18                                                               
VHDSPQ   EQU   19                                                               
VHSALQ   EQU   20                                                               
         SPACE 3                                                                
         EJECT                                                                  
*--------------------------------------------------------------------           
* DOWNLOAD CONTRACT HEADER FIELDS REQUEST                                       
*--------------------------------------------------------------------           
DCONREQ  DC    AL1(DCONREQD-*),AL2(DCONHDRQ),AL2(DCONREQX-DCONREQ) '            
         DC    X'80'                                                            
DCONREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(DCONCONQ),C'CON# ',AL1(MDTPKQ),AL1(005)          
         DC    AL1(FLDLEN),AL2(DCONBUYQ),C'BUYS ',AL1(MDTMDQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(DCONPSDQ),C'POSTS',AL1(MDTJDQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(DCONPEDQ),C'POSTE',AL1(MDTJDQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(DCONINVQ),C'INVS ',AL1(MDTMDQ),AL1(000)          
         DC    X'00'                                                            
DCONREQX EQU   *                                                                
         SPACE 1                                                                
DCONCONQ EQU   1                                                                
DCONBUYQ EQU   2                                                                
DCONPSDQ EQU   3                                                                
DCONPEDQ EQU   4                                                                
DCONINVQ EQU   5                                                                
         SPACE 3                                                                
         EJECT                                                                  
*********************************************************************           
* SEND HEADERS                                                                  
*********************************************************************           
*--------------------------------------------------------------------           
* STATION DATA                                                                  
*--------------------------------------------------------------------           
STADATA  DC    AL1(STADATAD-*),AL2(STADATAQ),AL2(STADATAX-STADATA)              
         DC    X'80'                                                            
STADATAD DS    0AL1                                                             
STASTAEL DC    AL1(FLDLEN),AL2(0001),C'STA  ',AL1(MDTCHQ),AL1(005)              
STACSTEL DC    AL1(FLDLEN),AL2(0002),C'CSTA ',AL1(MDTCHQ),AL1(005)              
STAMKTEL DC    AL1(FLDLEN),AL2(0003),C'MKT  ',AL1(MDTCHQ),AL1(000)              
STACHNEL DC    AL1(FLDLEN),AL2(0004),C'CHAN ',AL1(MDTCHQ),AL1(003)              
STAAFFEL DC    AL1(FLDLEN),AL2(0005),C'AFFIL',AL1(MDTCHQ),AL1(003)              
STABTYEL DC    AL1(FLDLEN),AL2(0006),C'BKTYP',AL1(MDTCHQ),AL1(001)              
STABKEL  DC    AL1(FLDLEN),AL2(0007),C'BOOK ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
STADATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* BOOK - CONTAINS BOOK INFO FOR AN INVENTORY ITEM/PROGRAM                       
*--------------------------------------------------------------------           
BKSDATA  DC    AL1(BKSDATAD-*),AL2(BKSDATAQ),AL2(BKSDATAX-BKSDATA)              
         DC    X'80'                                                            
BKSDATAD DS    0AL1                                                             
BKSPRGEL DC    AL1(FLDLEN),AL2(0001),C'PSEQ#',AL1(MDTPKQ),AL1(005)              
BKSSEQEL DC    AL1(FLDLEN),AL2(0002),C'BSEQ#',AL1(MDTBIQ),AL1(001)              
BKSUPGEL DC    AL1(FLDLEN),AL2(0003),C'USEQ#',AL1(MDTBIQ),AL1(001)              
BKSFOOEL DC    AL1(FLDLEN),AL2(0004),C'FLUFF',AL1(MDTBIQ),AL1(002)              
BKSFTNEL DC    AL1(FLDLEN),AL2(0005),C'FNOTE',AL1(MDTCHQ),AL1(000)              
BKSNAMEL DC    AL1(FLDLEN),AL2(0006),C'NAME ',AL1(MDTCHQ),AL1(000)              
BKSINVEL DC    AL1(FLDLEN),AL2(0007),C'ISINV',AL1(MDTMDQ),AL1(000)              
         DC    X'00'                                                            
BKSDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* DEMO - CONTAINS DEMO INFO FOR A BOOK                                          
*--------------------------------------------------------------------           
DEMDATA  DC    AL1(DEMDATAD-*),AL2(DEMDATAQ),AL2(DEMDATAX-DEMDATA)              
         DC    X'80'                                                            
DEMDATAD DS    0AL1                                                             
DEMSEQEL DC    AL1(FLDLEN),AL2(0001),C'SEQ# ',AL1(MDTBIQ),AL1(001)              
DEMRTGEL DC    AL1(FLDLEN),AL2(0002),C'RTG  ',AL1(MDTBIQ),AL1(004)              
DEMSHREL DC    AL1(FLDLEN),AL2(0003),C'SHARE',AL1(MDTBIQ),AL1(004)              
DEMLVLEL DC    AL1(FLDLEN),AL2(0004),C'LEVEL',AL1(MDTBIQ),AL1(004)              
DEMNAMEL DC    AL1(FLDLEN),AL2(0005),C'NAME ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
DEMDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* CONTRACT TYPE                                                                 
*--------------------------------------------------------------------           
CTYDATA  DC    AL1(CTYDATAD-*),AL2(CTYDATAQ),AL2(CTYDATAX-CTYDATA)              
         DC    X'80'                                                            
CTYDATAD DS    0AL1                                                             
CTYCTYEL DC    AL1(FLDLEN),AL2(0001),C'CTYPE',AL1(MDTCHQ),AL1(001)              
CTYDSCEL DC    AL1(FLDLEN),AL2(0002),C'DESC ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
CTYDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* DEVELOPMENTAL CONTRACT TYPE                                                   
*--------------------------------------------------------------------           
DCTDATA  DC    AL1(DCTDATAD-*),AL2(DCTDATAQ),AL2(DCTDATAX-DCTDATA)              
         DC    X'80'                                                            
DCTDATAD DS    0AL1                                                             
DCTCTYEL DC    AL1(FLDLEN),AL2(0001),C'DCTYP',AL1(MDTCHQ),AL1(002)              
DCTNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
DCTDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* REP COMPANY                                                                   
*--------------------------------------------------------------------           
REPDATA  DC    AL1(REPDATAD-*),AL2(REPDATAQ),AL2(REPDATAX-REPDATA)              
         DC    X'80'                                                            
REPDATAD DS    0AL1                                                             
REPNAMEL DC    AL1(FLDLEN),AL2(0001),C'NAME ',AL1(MDTCHQ),AL1(033)              
REPADDEL DC    AL1(FLDLEN),AL2(0002),C'ADDR ',AL1(MDTCHQ),AL1(033)              
REPDLREL DC    AL1(FLDLEN),AL2(0003),C'LOWRD',AL1(MDTBIQ),AL1(001)              
REPDHREL DC    AL1(FLDLEN),AL2(0004),C'HIRD ',AL1(MDTBIQ),AL1(001)              
         DC    X'00'                                                            
REPDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* ADVERTISER                                                                    
*--------------------------------------------------------------------           
ADVDATA  DC    AL1(ADVDATAD-*),AL2(ADVDATAQ),AL2(ADVDATAX-ADVDATA)              
         DC    X'80'                                                            
ADVDATAD DS    0AL1                                                             
ADVCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(004)              
ADVNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
ADVDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* PRODUCT                                                                       
*--------------------------------------------------------------------           
PRDDATA  DC    AL1(PRDDATAD-*),AL2(PRDDATAQ),AL2(PRDDATAX-PRDDATA)              
         DC    X'80'                                                            
PRDDATAD DS    0AL1                                                             
PRDCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(003)              
PRDNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
PRDIFFEL DC    AL1(FLDLEN),AL2(0003),C'IS_FF',AL1(MDTMDQ),AL1(000)              
         DC    X'00'                                                            
PRDDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* AGENCY                                                                        
*--------------------------------------------------------------------           
AGYDATA  DC    AL1(AGYDATAD-*),AL2(AGYDATAQ),AL2(AGYDATAX-AGYDATA)              
         DC    X'80'                                                            
AGYDATAD DS    0AL1                                                             
AGYCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(004)              
AGYOFFEL DC    AL1(FLDLEN),AL2(0002),C'OFFCE',AL1(MDTCHQ),AL1(002)              
AGYNAMEL DC    AL1(FLDLEN),AL2(0003),C'NAME ',AL1(MDTCHQ),AL1(000)              
AGYAD0EL DC    AL1(FLDLEN),AL2(0004),C'ADDR0',AL1(MDTCHQ),AL1(000)              
AGYAD1EL DC    AL1(FLDLEN),AL2(0005),C'ADDR1',AL1(MDTCHQ),AL1(000)              
AGYAD2EL DC    AL1(FLDLEN),AL2(0006),C'ADDR2',AL1(MDTCHQ),AL1(000)              
AGYAD3EL DC    AL1(FLDLEN),AL2(0007),C'ADDR3',AL1(MDTCHQ),AL1(000)              
AGYONMEL DC    AL1(FLDLEN),AL2(0008),C'OVNAM',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
AGYDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* SALESPERSON                                                                   
*--------------------------------------------------------------------           
SALDATA  DC    AL1(SALDATAD-*),AL2(SALDATAQ),AL2(SALDATAX-SALDATA)              
         DC    X'80'                                                            
SALDATAD DS    0AL1                                                             
SALCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(003)              
SALNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
SALTELEL DC    AL1(FLDLEN),AL2(0003),C'TEL# ',AL1(MDTCHQ),AL1(012)              
SALFAXEL DC    AL1(FLDLEN),AL2(0004),C'FAX# ',AL1(MDTCHQ),AL1(012)              
SALTEMEL DC    AL1(FLDLEN),AL2(0005),C'TEAMC',AL1(MDTCHQ),AL1(000)              
SALDIVEL DC    AL1(FLDLEN),AL2(0006),C'DIV  ',AL1(MDTCHQ),AL1(000)              
SALTNMEL DC    AL1(FLDLEN),AL2(0007),C'TEAMN',AL1(MDTCHQ),AL1(000)              
SALSTXEL DC    AL1(FLDLEN),AL2(0008),C'STAEX',AL1(MDTCHQ),AL1(005)              
SALEMLEL DC    AL1(FLDLEN),AL2(0009),C'EMAIL',AL1(MDTCHQ),AL1(000)              
SALOFFEL DC    AL1(FLDLEN),AL2(0010),C'OFF  ',AL1(MDTCHQ),AL1(002)              
SALOFNEL DC    AL1(FLDLEN),AL2(0011),C'OFFNM',AL1(MDTCHQ),AL1(020)              
SALMGREL DC    AL1(FLDLEN),AL2(0012),C'ISMGR',AL1(MDTMDQ),AL1(000)              
SALADDEL DC    AL1(FLDLEN),AL2(0013),C'ADDR ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
SALDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* DEVELOPMENT SALESPERSON                                                       
*--------------------------------------------------------------------           
DSPDATA  DC    AL1(DSPDATAD-*),AL2(DSPDATAQ),AL2(DSPDATAX-DSPDATA)              
         DC    X'80'                                                            
DSPDATAD DS    0AL1                                                             
DSPCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(003)              
DSPNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
DSPTELEL DC    AL1(FLDLEN),AL2(0003),C'TEL# ',AL1(MDTCHQ),AL1(012)              
DSPFAXEL DC    AL1(FLDLEN),AL2(0004),C'FAX# ',AL1(MDTCHQ),AL1(012)              
         DC    X'00'                                                            
DSPDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* CONTRACT DATA (NOT COVERED ELSE WHERE)                                        
*--------------------------------------------------------------------           
CONDATA  DC    AL1(CONDATAD-*),AL2(CONDATAQ),AL2(CONDATAX-CONDATA)              
         DC    X'80'                                                            
CONDATAD DS    0AL1                                                             
CONNUMEL DC    AL1(FLDLEN),AL2(0001),C'CON# ',AL1(MDTPKQ),AL1(005)              
CONFLSEL DC    AL1(FLDLEN),AL2(0002),C'FLTST',AL1(MDTJDQ),AL1(000)              
CONFLEEL DC    AL1(FLDLEN),AL2(0003),C'FLTEN',AL1(MDTJDQ),AL1(000)              
CONBYREL DC    AL1(FLDLEN),AL2(0004),C'BUYER',AL1(MDTCHQ),AL1(020)              
CONAGYEL DC    AL1(FLDLEN),AL2(0005),C'AGY  ',AL1(MDTCHQ),AL1(004)              
CONAOFEL DC    AL1(FLDLEN),AL2(0006),C'AGYOF',AL1(MDTCHQ),AL1(002)              
CONADVEL DC    AL1(FLDLEN),AL2(0007),C'ADV  ',AL1(MDTCHQ),AL1(004)              
CONPRDEL DC    AL1(FLDLEN),AL2(0008),C'PRD  ',AL1(MDTCHQ),AL1(020)              
CONDEMEL DC    AL1(FLDLEN),AL2(0009),C'DEMO ',AL1(MDTCHQ),AL1(006)              
CONDSPEL DC    AL1(FLDLEN),AL2(0010),C'DSAL ',AL1(MDTCHQ),AL1(003)              
CONSALEL DC    AL1(FLDLEN),AL2(0011),C'SAL  ',AL1(MDTCHQ),AL1(003)              
CONDCTEL DC    AL1(FLDLEN),AL2(0012),C'DCTYP',AL1(MDTCHQ),AL1(002)              
CONCTYEL DC    AL1(FLDLEN),AL2(0013),C'CTYP ',AL1(MDTCHQ),AL1(001)              
CONSTAEL DC    AL1(FLDLEN),AL2(0014),C'STA  ',AL1(MDTCHQ),AL1(005)              
         DC    X'00'                                                            
CONDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* PROFILE DATA                                                                  
*--------------------------------------------------------------------           
PRFDATA  DC    AL1(PRFDATAD-*),AL2(PRFDATAQ),AL2(PRFDATAX-PRFDATA)              
         DC    X'80'                                                            
PRFDATAD DS    0AL1                                                             
PRFCNT1L DC    AL1(FLDLEN),AL2(0001),C'CNT-1',AL1(MDTUSQ),AL1(004)              
PRFCNT2L DC    AL1(FLDLEN),AL2(0002),C'CNT-2',AL1(MDTUSQ),AL1(004)              
PRFEZP1L DC    AL1(FLDLEN),AL2(0003),C'EZP-1',AL1(MDTUSQ),AL1(004)              
PRFEZP2L DC    AL1(FLDLEN),AL2(0004),C'EZP-2',AL1(MDTUSQ),AL1(004)              
         DC    X'00'                                                            
PRFDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* DAYPART (FROM DAYPART ALL MENU DURING INIT REQUEST)                           
*--------------------------------------------------------------------           
DPTDATA  DC    AL1(DPTDATAD-*),AL2(DPTDATAQ),AL2(DPTDATAX-DPTDATA)              
         DC    X'80'                                                            
DPTDATAD DS    0AL1                                                             
DPTCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(000)              
DPTSNMEL DC    AL1(FLDLEN),AL2(0002),C'SNAME',AL1(MDTCHQ),AL1(000)              
DPTLNMEL DC    AL1(FLDLEN),AL2(0003),C'LNAME',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
DPTDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* BUY DETAILS                                                                   
*--------------------------------------------------------------------           
BUYDATA  DC    AL1(BUYDATAD-*),AL2(BUYDATAQ),AL2(BUYDATAX-BUYDATA)              
         DC    X'80'                                                            
BUYDATAD DS    0AL1                                                             
BUYMLNEL DC    AL1(FLDLEN),AL2(0001),C'MLINE',AL1(MDTBIQ),AL1(001)              
BUYLINEL DC    AL1(FLDLEN),AL2(0002),C'LINE ',AL1(MDTBIQ),AL1(001)              
BUYCOSEL DC    AL1(FLDLEN),AL2(0003),C'COST ',AL1(MDTBIQ),AL1(004)              
BUYTSPEL DC    AL1(FLDLEN),AL2(0004),C'TSPTS',AL1(MDTBIQ),AL1(002)              
BUYTCSEL DC    AL1(FLDLEN),AL2(0005),C'TCOST',AL1(MDTBIQ),AL1(004)              
BUYTWKEL DC    AL1(FLDLEN),AL2(0006),C'TWKS ',AL1(MDTBIQ),AL1(001)              
BUYSDYEL DC    AL1(FLDLEN),AL2(0007),C'SDAY ',AL1(MDTBIQ),AL1(001)              
BUYEDYEL DC    AL1(FLDLEN),AL2(0008),C'EDAY ',AL1(MDTBIQ),AL1(001)              
BUYMINEL DC    AL1(FLDLEN),AL2(0009),C'MIN  ',AL1(MDTMDQ),AL1(000)              
BUYLENEL DC    AL1(FLDLEN),AL2(0010),C'LEN  ',AL1(MDTBIQ),AL1(002)              
BUYDPTEL DC    AL1(FLDLEN),AL2(0011),C'DPT  ',AL1(MDTCHQ),AL1(001)              
BUYDALEL DC    AL1(FLDLEN),AL2(0012),C'DAILY',AL1(MDTMDQ),AL1(000)              
BUYSDTEL DC    AL1(FLDLEN),AL2(0013),C'SDATE',AL1(MDTBDQ),AL1(003)              
BUYEDTEL DC    AL1(FLDLEN),AL2(0014),C'EDATE',AL1(MDTBDQ),AL1(003)              
BUYCOMEL DC    AL1(FLDLEN),AL2(0015),C'COMM1',AL1(MDTCHQ),AL1(000)              
BUYPGMEL DC    AL1(FLDLEN),AL2(0016),C'PGM  ',AL1(MDTCHQ),AL1(000)              
BUYPDEMO DC    AL1(FLDLEN),AL2(0017),C'DEMO ',AL1(MDTCHQ),AL1(000)              
BUYPRTG  DC    AL1(FLDLEN),AL2(0018),C'RTG  ',AL1(MDTBIQ),AL1(004)              
         DC    X'00'                                                            
BUYDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* BUY DAY/TIME                                                                  
*--------------------------------------------------------------------           
BDYDATA  DC    AL1(BDYDATAD-*),AL2(BDYDATAQ),AL2(BDYDATAX-BDYDATA)              
         DC    X'80'                                                            
BDYDATAD DS    0AL1                                                             
BDYSDYEL DC    AL1(FLDLEN),AL2(0001),C'SDAY ',AL1(MDTBIQ),AL1(001)              
BDYEDYEL DC    AL1(FLDLEN),AL2(0002),C'EDAY ',AL1(MDTBIQ),AL1(001)              
BDYDAYEL DC    AL1(FLDLEN),AL2(0003),C'DAYS ',AL1(MDTBIQ),AL1(001)              
BDYSTMEL DC    AL1(FLDLEN),AL2(0004),C'STIM ',AL1(MDTBIQ),AL1(002)              
BDYETMEL DC    AL1(FLDLEN),AL2(0005),C'ETIM ',AL1(MDTBIQ),AL1(002)              
BDYDWTEL DC    AL1(FLDLEN),AL2(0006),C'DAYWT',AL1(MDTBIQ),AL1(001)              
         DC    X'00'                                                            
BDYDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* BUY EFFECTIVE DATE                                                            
*--------------------------------------------------------------------           
BDTDATA  DC    AL1(BDTDATAD-*),AL2(BDTDATAQ),AL2(BDTDATAX-BDTDATA)              
         DC    X'80'                                                            
BDTDATAD DS    0AL1                                                             
BDTSDTEL DC    AL1(FLDLEN),AL2(0001),C'SDATE',AL1(MDTJDQ),AL1(003)              
BDTEDTEL DC    AL1(FLDLEN),AL2(0002),C'EDATE',AL1(MDTJDQ),AL1(003)              
BDTWKSEL DC    AL1(FLDLEN),AL2(0003),C'WEEKS',AL1(MDTBIQ),AL1(001)              
BDTEWKEL DC    AL1(FLDLEN),AL2(0004),C'ALLWK',AL1(MDTMDQ),AL1(000)              
BDTAWKEL DC    AL1(FLDLEN),AL2(0005),C'ALTWK',AL1(MDTMDQ),AL1(000)              
BDTSPWEL DC    AL1(FLDLEN),AL2(0006),C'SP/WK',AL1(MDTBIQ),AL1(001)              
         DC    X'00'                                                            
BDTDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* INVOICE DETAILS                                                               
*--------------------------------------------------------------------           
INVDATA  DC    AL1(INVDATAD-*),AL2(INVDATAQ),AL2(INVDATAX-INVDATA)              
         DC    X'80'                                                            
INVDATAD DS    0AL1                                                             
INVDATE  DC    AL1(FLDLEN),AL2(0001),C'DATE ',AL1(MDTBDQ),AL1(003)              
INVTIME  DC    AL1(FLDLEN),AL2(0002),C'TIME ',AL1(MDTBIQ),AL1(002)              
INVLEN   DC    AL1(FLDLEN),AL2(0003),C'LEN  ',AL1(MDTBIQ),AL1(001)              
INVCOST  DC    AL1(FLDLEN),AL2(0004),C'COST ',AL1(MDTBIQ),AL1(004)              
         DC    X'00'                                                            
INVDATAX EQU   *                                                                
         SPACE 3                                                                
*END OF MAPTABLE ====================================================           
         DC    X'00'               EOT                                          
