*          DATA SET REGAVD5D   AT LEVEL 011 AS OF 02/16/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T813D5D      DATE 02/16/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
RNCSSTAH DS    CL8                                                              
RNCSSTA  DS    CL8      6   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A  P H             T        Y              
RNCFCODH DS    CL8                                                              
RNCFCOD  DS    CL8      9   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  P H             T        Y              
RNCFLENH DS    CL8                                                              
RNCFLEN  DS    CL4     10   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P H             T        Y              
RNCFQTRH DS    CL8                                                              
RNCFQTR  DS    CL5     11   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
RNCFDPTH DS    CL8                                                              
RNCFDPT  DS    CL3     12   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    2    4  A  P N             T        Y              
RNCTCODH DS    CL8                                                              
RNCTCOD  DS    CL8     15   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
RNCTLENH DS    CL8                                                              
RNCTLEN  DS    CL4     16   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
RNCTQTRH DS    CL8                                                              
RNCTQTR  DS    CL23    17   10   23  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18    2   15  A  P N             T        Y              
RNCRADJH DS    CL8                                                              
RNCRADJ  DS    CL11    18   18   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    20    2   22  A  P N             T        Y              
RNCSUPH  DS    CL8                                                              
RNCSUP   DS    CL1     20   25    1  A  U N             T        Y              
RNCENDH  DS    CL8                                                              
RNCEND   DS    CL1     20   79    1  A  P N             T        Y              
RNCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RNCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 376  BYTES                            
