*          DATA SET REGAVE3D   AT LEVEL 003 AS OF 03/12/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T813E3D      DATE 03/12/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
MINSSTAH DS    CL8                                                              
MINSSTA  DS    CL8      5   10    8  A  U N             T    I   Y   10         
MINSSTAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   23    4  A  P H             T        Y              
MINCODH  DS    CL8                                                              
MINCOD   DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   37    6  A  P H             T        Y              
MINLENH  DS    CL8                                                              
MINLEN   DS    CL4      5   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   52    7  A  P H             T        Y              
MINQTRH  DS    CL8                                                              
MINQTR   DS    CL5      5   60    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    9   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   31    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   51   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   73    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     8    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18     8   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     8   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   72    7  A  P N             T        Y              
MININV1H DS    CL8                                                              
MININV1  DS    CL5      9    2    5  A  P N             T        Y              
MINEFF1H DS    CL8                                                              
MINEFF1  DS    CL17     9    8   17  A  P N             T        Y              
MINDYT1H DS    CL8                                                              
MINDYT1  DS    CL18     9   26   18  A  P N             T        Y              
MINPRG1H DS    CL8                                                              
MINPRG1  DS    CL24     9   45   24  A  P N             T        Y              
MINCST1H DS    CL8                                                              
MINCST1  DS    CL7      9   72    7  A  U N             T        Y              
MININV2H DS    CL8                                                              
MININV2  DS    CL5     10    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    10    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    10   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    10   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    11    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    11   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    11   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    12    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    12   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    12   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    13    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    13   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    13   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    14    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    14   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    14   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    15    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    15   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    15   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    16    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    16   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    16   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    17    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    17   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    17   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    18    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    18   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    18   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    19    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    19   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    19   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    20    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    20   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    20   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    21    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    21   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    21   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    22    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    22   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    22   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    23    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    23   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    23   45   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   72    7  A  U N             T        Y              
MINTAGH  DS    CL8                                                              
MINTAG   DS    CL1     24    2    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2008 BYTES                            
