*          DATA SET REGAVD2D   AT LEVEL 006 AS OF 01/07/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T813D2D      DATE 01/07/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL74     7    2   74  A  P H             T        Y              
RNWINFOH DS    CL8                                                              
RNWINFO  DS    CL76     8    2   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    2   74  A  P H             T        Y              
RNWEFF1H DS    CL8                                                              
RNWEFF1  DS    CL8     10    2    8  A  P N             T        Y              
RNWCOS1H DS    CL8                                                              
RNWCOS1  DS    CL8     10   12    8  A  U N             T        Y              
RNWFTN1H DS    CL8                                                              
RNWFTN1  DS    CL25    10   22   25  A  U N             T        Y              
RNWEFF2H DS    CL8                                                              
RNWEFF2  DS    CL8     11    2    8  A  P N             T        Y              
RNWCOS2H DS    CL8                                                              
RNWCOS2  DS    CL8     11   12    8  A  U N             T        Y              
RNWFTN2H DS    CL8                                                              
RNWFTN2  DS    CL25    11   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    12   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    13   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    14   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    15   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    16   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    17   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    18   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    19   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    20   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    21   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    22   22   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   12    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    23   22   25  A  U N             T        Y              
RNWENDH  DS    CL8                                                              
RNWEND   DS    CL1     23   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    24    2   74  A  P H             T        Y              
RNWLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RNWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1256 BYTES                            
