*          DATA SET REGAVE4D   AT LEVEL 003 AS OF 11/02/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T813E4D      DATE 11/02/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
MINCODEH DS    CL8                                                              
MINCODE  DS    CL8      5   12    8  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
MINCOMMH DS    CL8                                                              
MINCOMM  DS    CL50     7   10   50  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL30     9    2   30  A  P N             T        Y              
MINYR1H  DS    CL8                                                              
MINYR1   DS    CL2     10    2    2  A  U N             T        Y              
MINLEN1H DS    CL8                                                              
MINLEN1  DS    CL4     10    9    4  A  U N             T        Y              
MINQTR1H DS    CL8                                                              
MINQTR1  DS    CL1     10   18    1  A  U N             T        Y              
MINQTR2H DS    CL8                                                              
MINQTR2  DS    CL1     10   22    1  A  U N             T        Y              
MINQTR3H DS    CL8                                                              
MINQTR3  DS    CL1     10   26    1  A  U N             T        Y              
MINQTR4H DS    CL8                                                              
MINQTR4  DS    CL1     10   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   30    1  A  U N             T        Y              
MINTAGH  DS    CL8                                                              
MINTAG   DS    CL1     24    2    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 984  BYTES                            
