*          DATA SET REGAVFAD   AT LEVEL 001 AS OF 02/15/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T813FAD      DATE 02/15/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     6   30   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     8    2   15  A  P H             T        Y              
DPTDTCH  DS    CL8                                                              
DPTDTC   DS    CL2      8   20    2  A  U N             T        Y   10         
DPTDTCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8   25    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  A  P H             T        Y              
DPTDTSH  DS    CL8                                                              
DPTDTS   DS    CL4      9   20    4  A  U N             T        Y   20         
DPTDTSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    10    2   15  A  P H             T        Y              
DPTDTLH  DS    CL8                                                              
DPTDTL   DS    CL16    10   20   16  L  U N             T        Y   30         
DPTDTLX  DS    CL8                                                              
DPTFLGH  DS    CL8                                                              
DPTFLG   DS    CL1     12   79    1  A  U N             T        Y              
DPTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 192  BYTES                            
