*          DATA SET REGAVD7D   AT LEVEL 001 AS OF 02/15/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T813D7D      DATE 02/15/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
INVSSTAH DS    CL8                                                              
INVSSTA  DS    CL8      5   10    8  A  U N             T    I   Y   10         
INVSSTAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
INVINVH  DS    CL8                                                              
INVINV   DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  A  P H             T        Y              
INVEFFH  DS    CL8                                                              
INVEFF   DS    CL17     5   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
INVSDPTH DS    CL8                                                              
INVSDPT  DS    CL6      7   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
INVSFLTH DS    CL8                                                              
INVSFLT  DS    CL6      7   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
INVICODH DS    CL8                                                              
INVICOD  DS    CL1      8   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
INVTDEFH DS    CL8                                                              
INVTDEF  DS    CL3      9   20    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     9   38   19  A  P N             T        Y              
INVTRANH DS    CL8                                                              
INVTRAN  DS    CL3      9   58    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    11    2   35  A  P N             T        Y              
INVEFFDH DS    CL8                                                              
INVEFFD  DS    CL17    11   38   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   17    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   36    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   14   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    14   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   66   11  A  P N             T        Y              
INVSDAYH DS    CL8                                                              
INVSDAY  DS    CL11    15    2   11  A  U N             T        Y              
INVSTMEH DS    CL8                                                              
INVSTME  DS    CL11    15   14   11  A  U N             T        Y              
INVPROGH DS    CL8                                                              
INVPROG  DS    CL27    15   26   27  A  U N             T        Y              
INVADAYH DS    CL8                                                              
INVADAY  DS    CL11    15   54   11  A  U N             T        Y              
INVATIMH DS    CL8                                                              
INVATIM  DS    CL11    15   66   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   14   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    16   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   14   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    17   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   14   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    18   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   14   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    19   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   14   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    20   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   14   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    21   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   14   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    22   26   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   54   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   66   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    24    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    24   26   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    24   47   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    24   67   11  A  P N             T        Y              
INVLSTH  DS    CL8                                                              
INVLST   DS    CL1     24   79    1  A  U N             T        Y              
INVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
INVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1528 BYTES                            
