*          DATA SET REGAVD8D   AT LEVEL 001 AS OF 02/15/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T813D8D      DATE 02/15/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
LINSSTAH DS    CL8                                                              
LINSSTA  DS    CL8      5   10    8  A  U N             T    I   Y   10         
LINSSTAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
LININVH  DS    CL8                                                              
LININV   DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  A  P H             T        Y              
LINEFFH  DS    CL8                                                              
LINEFF   DS    CL17     5   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LINOPTH  DS    CL8                                                              
LINOPT   DS    CL67     6   11   67  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74     8    2   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76     9    2   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    10    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    11    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    12    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    13    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    14    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    15    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    16    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    17    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    18    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    19    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    20    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    21    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    22    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    23    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    24    7   70  A  P N             T        Y              
LINTAGH  DS    CL8                                                              
LINTAG   DS    CL1     24   78    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1752 BYTES                            
