*          DATA SET REGENPBRD  AT LEVEL 015 AS OF 08/10/99                      
         TITLE 'REGENPBRB - DSECT FOR REGENPBR  - REP-TO-SPOT INFO '            
***********************************************************************         
*  REGENPBRB - DSECT TO SHOW REP-TO-SPOT INFORMATION                  *         
***********************************************************************         
*  MAY05/93 (BU ) --- ORIGINAL ENTRY                                  *         
*                                                                     *         
*                                                                     *         
*                                                                     *         
***********************************************************************         
PD       DSECT                     PRINT LINE DSECT                             
PRTLN    DS    0CL81                                                            
PLIN     DS    CL3      +0         LINE NUMBER                                  
*                                                                               
*  IF LINE CODE EXCEEDS 99, WILL ABUT A SECOND CHANGE CODE (AN                  
*     UNLIKELY SITUATION).   BILL UHR.  OCT/92                                  
         DS    CL1      +3                                                      
PDAY     DS    CL10     +4         DAYS                                         
         DS    CL1      +14                                                     
PTIM     DS    CL10     +15        TIMES                                        
         DS    CL1      +25                                                     
PLEN     DS    CL3      +26        LENGTH                                       
         DS    CL1      +29                                                     
PDAT     DS    CL11     +30        DATES                                        
         DS    CL1      +41                                                     
PNPW     DS    CL3      +42        NUMBER PER WEEK                              
         DS    CL1      +45                                                     
PRAT     DS    CL10     +46        RATE                                         
         DS    CL1      +56                                                     
PCLI     DS    CL3      +57        SPOTPAK CLIENT                               
         DS    CL1      +60                                                     
PPRD     DS    CL3      +61        SPOTPAK PRODUCT                              
         DS    CL1      +64                                                     
PEST     DS    CL3      +65        SPOTPAK ESTIMATE #                           
         DS    CL1      +68                                                     
PBY#     DS    CL3      +69        SPOTPAK BUYLINE #                            
         DS    CL1      +72                                                     
PDAT2    DS    CL6      +73        TRANSFER DATE                                
