*          DATA SET REGENBUY   AT LEVEL 002 AS OF 06/15/20                      
*                                                                               
*********************************************************************           
*                                                                   *           
*        REGENBUY --- REP CONTRACT BUY RECORD                       *           
*                                                                   *           
* ----------------------------------------------------------------- *           
* UPDATE HISTORY:                                                   *           
*                                                                   *           
* AUG12/91 (MRR) --- ADD PASSIVE KEY FOR BUYS WITH SPOTPAK DATA     *           
*                                                                   *           
* JUL20/92 (SKU) --- ADD COMMENT IN BUY CHANGE INDICATOR            *           
*                                                                   *           
* AUG04/92 (SKU) --- ADD FLAG FOR COMBO BUY PLACE HOLDER (0 SPOTS,  *           
*                    0 DOLLARS)                                     *           
*                                                                   *           
* JAN20/95 (BU ) --- ADD MAKEGOOD BUY MISSED ELEMENT (X'66'),       *           
*                    TRACE MISSED ELEMENT (X'76')                   *           
*                                                                   *           
* MAR03/95 (BU ) --- ADD MAKEGOOD SPLITOUT OF EFFECTIVE DATES       *           
*                    ELEMENT (X'56') - REPLACES THE X'06' ELEMENT   *           
*                                                                   *           
* MAY11/95 (BU ) --- ESTABLISH 'DAILY' INDICATOR WITHIN BUY REC     *           
*                                                                   *           
* JUL11/95 (BU ) --- ADD KATZ CONVERSION ELEMENT (X'C0') FOR        *           
*                    ORIGINAL LINE NUMBER REFERENCE.                *           
*                                                                   *           
* JUL13/95 (BU ) --- WARNING!!!  DO NOT USE AS AN ELEMENT NUMBER    *           
*                    X'33'!!  THIS IS USED AS AN INTERIM MAKEGOOD   *           
*                    ELEMENT NUMBER, AND IS BULK DELETED!!          *           
*                                                                   *           
* JUL18/95 (BU ) --- ADD ERROR DAY/TIME ELEMENTS FOR KATZ GARBAGE   *           
*                    WHICH CAN'T BE CONVERTED.                      *           
*                                                                   *           
* AUG11/95 (SKU) --- ADD EXTRA DESCRIPTION ELEMENT X'10'            *           
*                    PRIMARY PURPOSE IS TO ENABLE MCI/CAN           *           
*                                                                   *           
* MAY06/96 (BU ) --- CREDIT/CANCEL/TRADE/BONUS INDICATORS           *           
*                                                                   *           
* MAY27/98 (SKU) --- CREDIT AUDIT TRAIL                             *           
*                                                                   *           
* JUN04/98 (SKU) --- SAVE AGENCY DARE DEMO VALUES                   *           
*                                                                   *           
* SEP10/98 (SKU) --- MULTI-MULTI-MAKEGOOD                           *           
*                                                                   *           
* MAR08/99 (AST) --- ADDED X'20' PATTERN ELEMENT DSECT              *           
*                                                                   *           
* JAN13/00 (SKU) --- ADD FLAGS FOR NEW MAKEGOOD PROCESSING          *           
*                                                                   *           
* FEB25/00 (BU ) --- ADD 'TRADE' FLAG                               *           
*                                                                   *           
* OCT24/00 (RHV) --- SPORTS SPECTRUM FIELDS                         *           
*                                                                   *           
* NOV27/00 (SKU) --- MAKEGOOD SIBLING BUY LINK ELEMENT              *           
*                                                                   *           
* DEC19/00 (SKU) --- ADD PROGRAM CONCLUSION (CC) OVERRIDE FLAG      *           
*                                                                   *           
* JAN08/01 (SKU) --- ADD PROGRAM NAME ELEMENT                       *           
*                                                                   *           
* FEB02/01 (BU ) --- ADD TD/TC ELEMENTS (BUY + MG)                  *           
*                                                                   *           
* JUN05/01 (RHV) --- PATTERN FIELD +1 CHARACTER =10                 *           
*                                                                   *           
* SEP18/01 (BU ) --- PASSIVE KEY FOR SPECIAL BUY CODE               *           
*                                                                   *           
* APR18/02 (SKU) --- EXTEND LENGTH OF X'56' ELEMENT                 *           
*                                                                   *           
* MAR05/06 (BU ) --- ADD X'D0' MOD CODE TRAP ELEMENT                *           
*                                                                   *           
* JUN04/07 (SKU) ---                                                *           
*                    ***  END TOMBSTONE  ***                        *           
*********************************************************************           
*                                                                               
         SPACE 1                                                                
RBUYREC  DS    1000C                                                            
         ORG   RBUYREC                                                          
RBUYKEY  DS    0CL27     V         KEY                                          
RBUYKTYP DS    CL16      X'0B'     RECORD TYPE                                  
RBUYKTQ  EQU   X'0B'                                                            
*                                                                               
*                        X'0B01'   SHADOW BUY RECORD FOR DARE REVISION          
*                                                                               
RBUYKREP DS    CL2       AN        REP CODE                                     
RBUYKCON DS    CL4       UP        CONTRACT NUMBER (9'S COMP/REVERSED)          
RBUYKPLN DS    CL3       A         PLAN (PACKAGE) CODE (DEFAULT=3X'FF')         
RBUYKMLN DS    CL1       B         MASTER LINE NUMBER                           
*                                       (NORMALLY SAME AS LINE NUMBER           
*                                        BUT FOR MAKE-GOODS THIS REFERS         
*                                        TO MISSED LINE FOR PROPER              
*                                        SORTING SEQUENCE)                      
RBUYKLIN DS    CL1       B         LINE NUMBER                                  
* PLAN RECORD - LAST 2 BYTES OF KEY = 2X'FF'                                    
*                                                                               
         ORG   RBUYREC                                                          
*                                  PASSIVE KEY FOR BUYS WITH SPOT DATA          
RBY2KEY  DS    0CL27               KEY                                          
RBY2KTYP DS    CL9       X'9B'     NOTE: X'8B' ALREADY USED BY MARKET           
RBY2KREP DS    CL2       AN        REP CODE                                     
RBY2KADV DS    CL4       AN        REPPAK ADVERTISER CODE                       
RBY2KPRD DS    CL3       AN        REPPAK PRODUCT CODE                          
RBY2KCON DS    CL4       UP        CONTRACT NUMBER (9'S COMP/REVERSED)          
RBY2KPLN DS    CL3       A         PLAN (PACKAGE) CODE (DEFAULT=3X'FF')         
RBY2KMLN DS    CL1       B         MASTER LINE NUMBER                           
*                                       (NORMALLY SAME AS LINE NUMBER           
*                                        BUT FOR MAKE-GOODS THIS REFERS         
*                                        TO MISSED LINE FOR PROPER              
*                                        SORTING SEQUENCE)                      
RBY2KLIN DS    CL1       B         LINE NUMBER                                  
* PLAN RECORD - LAST 2 BYTES OF KEY = 2X'FF'                                    
*                                                                               
*                                  PASSIVE FOR SPECIALLY-CODED BUYS             
         ORG   RBUYREC                                                          
*                                                                               
RBY3KEY  DS    0CL27               KEY                                          
RBY3KTYP DS    CL11      X'9B01'   NOTE: TWO-BYTE KEY TYPE                      
RBY3KREP DS    CL2       AN        REP CODE                                     
RBY3KCOD DS    CL3       AN        BUY CODE: FROM REGENSPEC RECORD              
RBY3KCON DS    CL4       B         CONTRACT NUMBER                              
RBY3KCBL DS    CL1       B         BUYLINE  NUMBER                              
RBY3KFST DS    CL3       B         BUY REC: FLIGHT START DATE                   
RBY3KFEN DS    CL3       B         BUY REC: FLIGHT END DATE                     
*                                                                               
RBUYLEN  DS    CL2       B         RECORD LENGTH                                
RBUYCNTL DS    CL1       X         CONTROL BYTE                                 
*                                       X'80' = DELETED                         
*                                       X'40' = KEY CHANGE VOID                 
*                                               (PLAN OR MG CHANGE)             
RBUYLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
RBUYELEM DS    0C                  BUY DESCRIPTION ELEMENT                      
RBUYCODE DS    CL1       X'01'     ELEMENT CODE                                 
RBUYELLN DS    CL1       X'2B'     ELEMENT LENGTH                               
RBUYNW   DS    CL1       B         NUMBER PER WEEK                              
RBUYCOMB DS    XL1       B         COMBO BUY PLACE HOLDER                       
*                                  BIT      0 = N/A BUY     X'80'               
*                                  BITS 1-7   = # SPOTS IN                      
*                                               CORRESPONDING LINE              
RBUYCOS  DS    CL4       B         COST (2 DECIMALS)                            
RBUYCLS  DS    CL3       AN        CLASS                                        
RBUYSEC  DS    CL3       AN        SECTION                                      
RBUYCREA DS    CL3       B         BUY CREATION DATE-YMD                        
RBUYCARD DS    CL3       AN        CARD AND/OR UNITS                            
RBUYCHGD DS    CL3       B         LAST CHANGE DATE - YMD                       
RBUYKMOD DS    CL1       B         CONTRACT MODIFICATION NUMBER                 
RBUYCHGI DS    CL2       A         CHANGE INDICATOR                             
*                                       A=ADDED                                 
*                                       C=CANCELLED                             
*                                       D=DAYS CHANGED                          
*                                       E=EFFECTIVE DATES CHANGED               
*                                       F=FLIGHT NUMBER CHANGED                 
*                                       L=LENGTH CHANGED                        
*                                       M=MAKE-GOOD STATUS CHANGE               
*                                       O=ORDER COMMENTS CHANGED                
*                                       T=TIME CHANGED                          
*                                       S=SPOTS/WEEK CHANGED                    
*                                       P=PLAN, CLASS OR SECTION CHG            
*                                       R=RATE CHANGED                          
*                                       X=DELETE (NO PRINTING)                  
*                                       Z=COMMENTS CHANGE                       
*                                       *=MORE THAN 2 CODES CHANGED             
RBUYTSPT DS    CL2       B         TOTAL SPOTS                                  
RBUYTCOS DS    CL4       B         TOTAL COST                                   
RBUYTWKS DS    CL1       B         TOTAL WEEKS                                  
RBUYSTED DS    CL1       B         START-END DAY FOR ALL 02 ELEMENTS            
*                                  BITS 0-3=START DAY (MONDAY=1)                
*                                  BITS 4-7=END DAY   (SUNDAY=7)                
*                                  IF X'FF' KATZ ERROR:                         
*                                     SEE RBUYDYIN FIELD FOR ADD'L              
*                                        INFORMATION                            
RBUYDUR  DS    CL2       B         LENGTH IN SECONDS (X'80' = MINUTES)          
*                                  X'40' = SPORTS BUY                           
         ORG   RBUYDUR                                                          
RBUYSFG  DS    X                   X'40' ON=SPORTS BUY                          
RBUYSTYP DS    X                   SPORTS BUY TYPE                              
*                                  H = HARD SIGN                                
*                                  E = ELECTRONIC SIGN                          
*                                  V = VIRTUAL                                  
*                                  D = ENDORSEMENT                              
*                                  P = PROMOTION                                
*                                                                               
RBUYFLT  DS    C         B         FLIGHT CODE                                  
RBUYVER  DS    CL1       B         VERSION NUMBER                               
RBUYTYP  DS    CL1       AN        PROGRAM TYPE                                 
RBUYDPT  DS    CL1       A         DAYPART CODE                                 
RBUYRTS  DS    CL1       B         STATUS/TYPE FLAGS                            
*                                  BIT 1=REP-TO-SPOT FLIP/FLOP  X'80'           
*                                  BIT 2=BUY IS A COMBO         X'40'           
*                                  BIT 3=BUY IS A BONUS         X'20'           
*                                  BIT 4=BUY IS A PREEMPT/CREDITX'10'           
*                                  BIT 5=BUY IS A LATE RUN      X'08'           
*                                  BIT 6=BUY IS A LATE RUN WITH X'04            
*                                          BONUS. BIT 3 IS ALSO X'04'           
*                                          ON IF THIS IS THE    X'04'           
*                                          BONUS PART OF THE LR X'04'           
*                                  BIT 7=BUY IS A REPLACEMENT NAX'02'           
*                                  BIT 8=BUY SPOTS WERE ZEROED  X'01'           
*                                        BY CONTRACT PROFILE 36 X'01'           
*                                        OR MANUALLY            X'01'           
RBUYAGBL DS    XL1       B         AGENCY ORDER BUYLINE NUMBER                  
RBUYFLG2 DS    CL1                 X'80'  =  'DAILY' ORDER                      
*                                  X'40'  =  ADDED BY SFM BUYCOPY               
*                                  X'20'  =  CONVERSION 'CANCL' ORDER           
*                                  X'10'  =  DELETED BUYLINE                    
*                                  X'08'  =  CANCELLED BUYLINE                  
*                                  X'04'  =  CREDIT                             
*                                  X'02'  =  TRADE                              
*                                  X'01'  =  BONUS                              
         SPACE 1                                                                
RBUYDYEL DS    0C        V         BUY DAY-TIME ELEMENT(S) FOR A WEEK           
RBUYDYCD DS    CL1       X'02'     ELEMENT CODE                                 
RBUYDYLN DS    CL1       B         ELEMENT LENGTH                               
RBUYDYIN DS    CL1       B         START-END DAY INDICATOR                      
*                                  BITS 0-3=START DAY (MONDAY=1)                
*                                  BITS 4-7=END DAY   (SUNDAY=7)                
*                                  IF X'FF' KATZ ERROR:                         
*                                     DISPLAY CONTENTS OF X'22' FOR             
*                                        RBUYDYIN AND RBUYDAYS                  
RBUYDAYS DS    CL1       B         DAY(S)                                       
*                                  BIT 0=CC OVERRIDE   X'80'                    
*                                  BIT 1=MONDAY        X'40'                    
*                                  BIT 2=TUESDAY       X'20'                    
*                                  BIT 3=WEDNESDAY     X'10'                    
*                                  BIT 4=THURSDAY      X'08'                    
*                                  BIT 5=FRIDAY        X'04'                    
*                                  BIT 6=SATURDAY      X'02'                    
*                                  BIT 7=SUNDAY        X'01'                    
RBUYDYT1 DS    CL2       B         0-2400 START TIME FOR RBUYDAYS               
*                                  IF X'FFFF' AND RBUYDYT2 X'FFFF'              
*                                     'SPORTS SPECTRUM BUY'                     
*                                     THERE IS NO DAY/TIME DATA                 
RBUYDYT2 DS    CL2       B         0-2400 END TIME FOR RBUYDAYS                 
*                                  IF X'FF' KATZ ERROR:                         
*                                     DISPLAY CONTENTS OF X'32' FOR             
*                                        RBUYDYT1 AND RBUYDYT2                  
*                                  SEE 'SPORTS SPECTRUM' NOTE IN                
*                                     FIELD RBUYDYT1                            
RBUYDYWT DS    CL1       B         WEIGHTING FACTOR (NO. SPOTS) IN THIS         
*                                       DAY-TIME PERIOD                         
**********************************************************************          
*                                                                               
*   X'22' AND X'32' ELEMENTS:  CONTAIN DISPLAY DEFAULTS FOR INDICATED           
*        FIELDS.  THE VALUES IN THESE FIELDS WOULD NOT CONVERT, AND             
*        MUST THEREFORE BE CONTAINED WITHIN THE RECORD FOR REDISPLAY.           
*        THEY WILL FAIL EDITING WITHIN THE DDS SYSTEM, AND REQUIRE              
*        CORRECTION, AT WHICH TIME THE RECORD WILL BE PROPERLY UP-              
*        DATED.                                                                 
*                                                                               
         SPACE 1                                                                
RBYKZER1 DS    0C        V         KATZ ERROR DAYS DISPLAY ELT                  
RBYKZ1CD DS    CL1       X'22'     ELEMENT CODE                                 
RBYKZ1LN DS    CL1       B         ELEMENT LENGTH (12 CHARS)                    
RBYKZ1DY DS    CL10                DAY FIELD FROM KATZ RECORD                   
         SPACE 1                                                                
RBYKZER2 DS    0C        V         KATZ ERROR TIME DISPLAY ELT                  
RBYKZ2CD DS    CL1       X'32'     ELEMENT CODE                                 
RBYKZ2LN DS    CL1       B         ELEMENT LENGTH (13 CHARS)                    
RBYKZ2TM DS    CL11                TIME FIELD FROM KATZ RECORD                  
**********************************************************************          
         SPACE 1                                                                
RBUYDTEL DS    0C        V         BUY EFFECTIVE DATE ELEMENT(S)                
RBUYDTCD DS    CL1       X'03'     ELEMENT CODE                                 
RBUYDTLN DS    CL1       B         ELEMENT LENGTH                               
RBUYDTST DS    CL3       B         START DATE (YMD) = 1ST DAY IN WEEK 1         
* PLAN RECORD DATE ELEMENT ENDS HERE WITH MONDAY WEEK DATE                      
RBUYDTED DS    CL3       B         END DATE (YMD) = END DAY IN END WEEK         
RBUYDTIN DS    CL1       B         DATE INDICATOR BYTE                          
*                                  X'80' = RUNS EVERY WEEK                      
*                                  X'40' = RUNS EVERY OTHER WEEK                
*                                  X'01' = NPW OVERRIDE                         
RBUYDTNW DS    CL1       B         NUMBER PER WEEK (USUALLY=RBUYNW)             
RBUYDTWK DS    CL1       B         NO. OF WEEKS                                 
         SPACE 1                                                                
**********************************************************************          
RMGCHKEL DS    0C        V                                                      
         DS    CL1       X'33'     MAKEGOOD CHECK ELEMENT CODE                  
*                                                                               
*   USED WITHIN MAKEGOOD PROCESSING.  SHOULD NEVER APPEAR IN AN                 
*        ACTUAL RECORD.  DO NOT USE THIS AS A CODE FOR ANY OTHER                
*        PURPOSES, BECAUSE DATA WILL BE DELETED BY MAKEGOOD CHECK.              
*                                                                               
**********************************************************************          
         SPACE 1                                                                
RBUYCMEL DS    0C        V         BUY COMMENT ELEMENT(S)                       
RBUYCMCD DS    CL1       X'04'     ELEMENT CODE                                 
RBUYCMLN DS    CL1       B         ELEMENT LENGTH                               
RBUYCMNT DS    0C        AN        EACH BUY COMMENT ELEMENT CAN                 
*                                  CONTAIN UP TO 60 CHARACTERS                  
         SPACE 1                                                                
RBUYMGEL DS    0C        V         BUY MAKE-GOOD REFERENCE ELEMENT(S)           
RBUYMGCD DS    CL1       X'05'     ELEMENT CODE                                 
RBUYMGLN DS    CL1       B         ELEMENT LENGTH                               
RBUYMGLI DS    CL1       B         LINE NUMBER OF MISSED SPOT                   
RBUYMGD1 DS    CL3       B         MISSED DATE (YMD) -START OF WEEK             
RBUYMGD2 DS    CL3       B         MISSED DATE (YMD) -END OF WEEK               
*                                       CAN BE = 3X'00'                         
RBUYMGSP DS    CL1       B         MISSED NUMBER OF SPOTS                       
*                                                                               
*                                  ELEMENT EXPANSION                            
*                                                                               
RBUYMGNW DS    CL1       B         NUMBER OF WEEKS MISSED                       
RBUYMGFG DS    CL1       B         FLAGS                                        
*                                  X'80' = ALTERNATING WEEKS                    
RBUYMGLQ EQU   *-RBUYMGEL          LENGTH OF NEW ELEMENT 9/10/98                
         SPACE 1                                                                
RBUYMSEL DS    0C        V         BUY MISSED ELEMENT(S)                        
RBUYMSCD DS    CL1       X'06'     ELEMENT CODE                                 
RBUYMSLN DS    CL1       B                                                      
RBUYMSDT DS    CL3       B         MISSED DATE - YMD                            
RBUYMSLI DS    CL1       B         MAKE-GOOD LINE NUMBER                        
RBUYMSSP DS    CL1       B         MISSED NUMBER OF SPOTS                       
         SPACE 1                                                                
*                                                                               
********************************************************************            
*   NOTE RE:  MG SPLITOUT BUY MISSED ELEMENT                       *            
*   NEW MAKEGOODS HAVE THE MISSED SPOT REMOVED FROM THE TARGET BUY *            
*   AND THE BUY FLIGHT BROKEN INTO COMPONENTS.  THIS PERMITS THE   *            
*   DISPLAY OF EXACTLY WHAT THE FLIGHT LOOKS LIKE.  THE ORIGINAL   *            
*   METHOD HAD THE MISSED SPOT DEFINED IN THE X'06' ELEMENT, AND   *            
*   THE MISSED SPOT WAS THEN SUBTRACTED FROM THE TOTAL # SPOTS.    *            
*   THE X'06' HAS BECOME THE X'56', WHICH CONTAINS ALL THE INFO,   *            
*   BUT IS NOT SUBTRACTED.  IT PROVIDES THE MEANS OF DELETING THE  *            
*   MAKEGOOD, AND REINSERTING THE SPOT AS NEEDED.  BUYS CREATED    *            
*   BEFORE THE MAKEGOOD SPLITOUT CONTINUE TO FUNCTION AS THEY      *            
*   DID PREVIOUSLY.                                                *            
*                                                                  *            
********************************************************************            
RBYMGSEL DS    0C        V         MG SPLITOUT BUY MISSED ELEMENT(S)            
RBYMGSCD DS    CL1       X'56'     ELEMENT CODE                                 
RBYMGSLN DS    CL1       B                                                      
RBYMGSDT DS    CL3       B         MISSED DATE - YMD                            
RBYMGSLI DS    CL1       B         MAKE-GOOD LINE NUMBER                        
RBYMGSSP DS    CL1       B         MISSED NUMBER OF SPOTS                       
*                                                                               
RBYMGSFG DS    X                   MISC. FLAGS                                  
*                                  X'80' = CREATED BY REPLACEMENT OFFER         
         SPACE 1                                                                
RBMGMSEL DS    0C        V         MAKEGOOD BUY MISSED ELEMENT(S)               
RBMGMSCD DS    CL1   +0  X'66'     ELEMENT CODE                                 
RBMGMSLN DS    CL1   +1  B                                                      
RBMGMSGD DS    XL2   +2  C         X'11' RECORD GROUP CODE                      
RBMGMSR# DS    CL2   +4  B         X'11' RECORD BUY#/SUB#                       
RBMGMMUL DS    CL1   +6  B         X'11' MULTI-LINE COUNTER                     
RBMGMSDT DS    CL3   +7  B         MISSED DATE - YMD                            
RBMGMSLI DS    CL1   +10 B         MAKE-GOOD LINE NUMBER                        
RBMGMSSP DS    CL1   +11 B         MISSED NUMBER OF SPOTS                       
         SPACE 1                                                                
RBMTMSEL DS    0C        V         MAKEGOOD BUY MISSED ELEMENT(S)               
RBMTMSCD DS    CL1   +0  X'76'     ELEMENT CODE                                 
RBMTMSLN DS    CL1   +1  B                                                      
RBMTMSGD DS    XL2   +2  C         X'11' RECORD GROUP CODE                      
RBMTMSR# DS    CL2   +4  B         X'11' RECORD BUY#/SUB#                       
RBMTMMUL DS    CL1   +6  B         X'11' MULTI-LINE COUNTER                     
RBMTMSDT DS    CL3   +7  B         MISSED DATE - YMD                            
RBMTMSLI DS    CL1   +10 B         MAKE-GOOD LINE NUMBER                        
RBMTMSSP DS    CL1   +11 B         MISSED NUMBER OF SPOTS                       
         SPACE 1                                                                
RBUYCREL DS    0C        V         CREDIT ELEMENT FOR MISSED SPOT               
RBUYCRCD DS    CL1       X'07'     ELEMENT CODE                                 
RBUYCRLN DS    CL1       B         ELEMENT LENGTH                               
RBUYCRDT DS    CL3       B         MISSED DATE                                  
RBUYCRLI DS    CL1       B         CREDIT-LINE NUMBER                           
RBUYCRSP DS    CL1       B         NO. OF SPOTS MISSED                          
         SPACE 1                                                                
RBUYSPEL DS    0C        V         SPOTPAK INTERFACE ELEMENT                    
RBUYSPCD DS    CL1       X'08'     ELEMENT CODE                                 
RBUYSPLN DS    CL1       B, X'30'  ELEMENT LENGTH                               
RBUYSPAG DS    CL2       AN        SPOTPAK AGENCY POWER CODE                    
RBUYSPMD DS    CL1       AN        SPOTPAK MEDIA CODE                           
RBUYSPCL DS    CL3       AN        SPOTPAK CLIENT CODE                          
RBUYSPPD DS    CL3       AN        SPOTPAK PRODUCT CODE                         
RBUYSPES DS    CL1       B         SPOTPAK ESTIMATE NUMBER                      
RBUYSPPP DS    CL3       AN        SPOTPAK PIGGY PRODUCT CODE                   
RBUYSPP1 DS    CL1       B         SPOTPAK PRODUCT 1 SPLIT                      
RBUYSPP2 DS    CL1       B         SPOTPAK PRODUCT 2 SPLIT                      
RBUYSPL# DS    CL1       B         SPOTPAK BUYLINE NUMBER                       
RBUYSPST DS    CL5       AN        STATION CALL LETTERS                         
RBUYSADV DS    CL4       AN        REPPAK ADVERTISER CODE                       
RBUYSPRD DS    CL3       AN        REPPAK PRODUCT CODE                          
RBUYSPDT DS    CL3       B         SPOTPAK TRANSFER DATE                        
RBUYSPTM DS    CL4       B         SPOTPAK TRANSFER TIME                        
         DS    CL12                SPARE                                        
         SPACE 1                                                                
*                                                                               
* DARE DEMO ELEMENT                                                             
* ELEMENT CONTAINS VARIABLE NUMBER OF DEMO CATEGORY/VALUES                      
*                                                                               
RBUYDMEL DS    0C        V         DARE DEMO VALUE ELEMENT                      
RBUYDMCD DS    CL1       X'0D'     ELEMENT CODE                                 
RBUYDMCQ EQU   X'0D'                                                            
RBUYDMLN DS    CL1       B         VARIABLE LENGTH                              
*                                                                               
* VARIABLE NUMBER OF DEMO CATEGORIES AND VALUES                                 
*                                                                               
RBUYDMCV DS    0XL11                                                            
RBUYDMCT DS    XL3       B         DEMO CATEGORY                                
RBUYDMDM DS    XL4       PWOS      1 IMPLIED DECIMAL, IMP'S IN 1000'S           
*                                  4X'FF' MEANS VALUE NOT PROVIDED              
RBUYDM2M DS    XL4       PWOS      PREVIOUS VALUE                               
*                                  4X'FF' MEANS VALUE NOT PROVIDED              
*                                                                               
* REP DEMO ELEMENT                                                              
* REP'S DEMO VALUES OVERRIDE DARE AGENCY'S DEMO VALUES                          
* ELEMENT CONTAINS VARIABLE NUMBER OF DEMO CATEGORY/VALUES                      
*                                                                               
RBUYRDEL DS    0C        V         REP DEMO VALUE ELEMENT                       
RBUYRDCD DS    CL1       X'0E'     ELEMENT CODE                                 
RBUYRDCQ EQU   X'0E'                                                            
RBUYRDLN DS    CL1       B         LENGTH                                       
*                                                                               
* VARIABLE NUMBER OF DEMO CATEGORIES AND VALUES                                 
*                                                                               
RBUYRDCV DS    0XL11                                                            
RBUYRDCT DS    XL3       B         DEMO CATEGORY                                
RBUYRDDM DS    XL4       PWOS      1 IMPLIED DECIMAL, IMP'S IN 1000'S           
*                                  4X'FF' MEANS VALUE NOT PROVIDED              
RBUYRD2M DS    XL4       PWOS      PREVIOUS VALUE                               
*                                  4X'FF' MEANS VALUE NOT PROVIDED              
*                                                                               
*                                                                               
* X'10' ELEMENT - MISC. FLAGS                                                   
*                                                                               
RBUYXXEL DS    0C        V         EXTRA DESCRIPTION ELEMENT                    
RBUYXXCD DS    CL1       X'10'     ELEMENT CODE                                 
RBUYXXCQ EQU   X'10'                                                            
RBUYXXLN DS    CL1       B         ELEMENT LENGTH                               
RBUYXXMD DS    CL1       B         CONTRACT MOD# AT BUY CREATION                
RBUYXXVR DS    CL1       B         CONTRACT VER# AT BUY CREATION                
RBUYXXFG DS    X                   FLAGS                                        
*                                  X'80' CREATED BY BUY TEMPLATE                
*                                  X'40' CREATED BY COST OVERRIDE BUYS          
*                                  X'20' THIS IS AN AGENCY MAKEGOOD             
*                                  X'10' CREATED BY CONFLICT END DATE           
RBUYXXB2 DS    CL1                 VERSION NUMBER X'B2'/X'B3' ADDED             
         DS    CL3                 SPARE                                        
RBUYXXLQ EQU   *-RBUYXXEL                                                       
*                                                                               
* X'16' CREDIT AUDIT ELEMENT                                                    
*                                                                               
RBUYCAEL DS    0C        V         CREDIT AUDIT ELEMENT                         
RBUYCACD DS    CL1       X'16'     ELEMENT CODE                                 
RBUYCACQ EQU   X'16'                                                            
RBUYCALN DS    CL1       B         LENGTH                                       
RBUYCASD DS    XL3                 START DATE                                   
RBUYCAED DS    XL3                 END DATE                                     
RBUYCANW DS    X                   NUMBER OF WEEKS CREDITED                     
RBUYCASP DS    XL1                 NUMBER OF SPOTS CREDITED                     
RBUYCACT DS    XP(DT02)L2          ELEMENT CREATION DATE                        
RBUYCAFL DS    X                   FLAG                                         
*                                  X'80' = CREDIT IS ALTERNATING WEEKS          
*                                  X'40' = REPLACEMENT OFFER CREDIT             
RBUYCALQ EQU   *-RBUYCAEL                                                       
*                                                                               
         SPACE 1                                                                
* X'20' PATTERN ELEMENT                                                         
*                                                                               
RBUYPTEL DS    0C        V         PATTERN ELEMENT                              
RBUYPTCD DS    CL1       X'20'     ELEMENT CODE                                 
RBUYPTEQ EQU   X'20'                                                            
RBUYPTLN DS    CL1       B         ELEMENT LENGTH                               
RBUYPTPT DS    CL10      B         PATTERN                                      
RBUYPTNT DS    CL15      B         NOTATION                                     
RBUYPTFL DS    CL1                 FLAG BYTE                                    
*                                  X'80' = USE START/END TIMES FROM             
*                                          SELL PATTERN                         
RBUYPTLQ EQU   *-RBUYPTEL                                                       
*                                                                               
*                                                                               
* X'21' PROGRAM ELEMENT                                                         
*                                                                               
RBUYPGEL DS    0C        V         PROGRAM ELEMENT                              
RBUYPGCD DS    CL1       X'21'     ELEMENT CODE                                 
RBUYPGEQ EQU   X'21'                                                            
RBUYPGLN DS    CL1       B         ELEMENT LENGTH                               
RBUYPGM  DS    0C        B         PROGRAM (MX 34 CHAR)                         
*                                                                               
*                                                                               
* X'1D' DARE ELEMENT                                                            
*                                                                               
RBUYDREL DS    0C        V         DARE ELEMENT                                 
RBUYDRCD DS    CL1       X'1D'     ELEMENT CODE                                 
RBUYDRCQ EQU   X'1D'                                                            
RBUYDRLN DS    CL1       B         LENGTH                                       
RBUYDRLK DS    CL1       B         ORIGINAL DARE LINK                           
RBUYDRDT DS    XL3                 TODAY                                        
RBUYDRXL DS    CL2                 XML DARE LINK                                
RBUYDRLQ EQU   *-RBUYDREL                                                       
*                                                                               
* MAKEGOOD SIBLING BUY LINK ELEMENT                                             
* THIS ELEMENT DESCRIBES WHICH OTHER BUYS WERE CREATED WITH THIS BUY            
* AS A RESULT OF APPLYING A MAKEGOOD OFFER.                                     
*                                                                               
* ELEMENT LENGTH IS VARIABLE                                                    
*                                                                               
RBUYSLEL DS    0C        V         MAKEGOOD SIBLING LINK ELEMENT                
RBUYSLCD DS    CL1       X'26'     ELEMENT CODE                                 
RBUYSLCQ EQU   X'26'                                                            
RBUYSLLN DS    CL1       B         LENGTH                                       
RBUYSLLK DS    0X        B         LIST OF SIBLING MAKEGOOD BUY LINKS           
*                                  (SORTED)                                     
*                                                                               
RBUYMDEL DS    0C        V         SAVED MOD CODE ELEMENT                       
RBUYMDCD DS    CL1       X'27'     ELEMENT CODE                                 
RBUYMDCQ EQU   X'27'                                                            
RBUYMDLN DS    CL1       B         LENGTH                                       
RBUYMD1  DS    X         B                                                      
RBUYMD2  DS    X         B         SPARE                                        
*                                                                               
*                                                                               
*                                                                               
*  TD/TC BUY DATA ELEMENT: COLUMBINE DATA                                       
*                                                                               
RBUYTDEL DS    0C        V         TD/TC BUY DATA ELEMENT                       
RBUYTDCD DS    CL1       X'40'     ELEMENT CODE                                 
RBUYTDCQ EQU   X'40'                                                            
RBUYTDLN DS    CL1       B         LENGTH (ORIG= 20 BYTES)                      
RBUYTDGP DS    XL2       B         GROUP:  000-999 OR X'FFFF' = BLANK           
RBUYTDTP DS    XL1       B         TYPE :  0-9 OR X'FF' = BLANK                 
RBUYTDPS DS    XL2       B         PROD SEP:   000-099 OR 999                   
RBUYTDAS DS    XL2       B         ADV  SEP:   000-099 OR 999                   
RBUYTDS# DS    XL1       B         SEC#:  0-9 OR X'FF' = BLANK                  
RBUYTDCL DS    XL2       B         CLASS:  NO EDIT                              
RBUYTDST DS    XL2       B         START TIME                                   
RBUYTDET DS    XL2       B         END   TIME                                   
RBUYTDPU DS    XL1       B         PLOT UNIT:  00-04 OR 99                      
         DS    XL3                 SPARE                                        
*                                                                               
*                                                                               
*  TD/TC BUY MAKEGOOD DATA ELEMENT: COLUMBINE DATA                              
*                                                                               
RBUYTCEL DS    0C        V         TD/TC BUY M/G DATA ELEMENT                   
RBUYTCCD DS    CL1       X'41'     ELEMENT CODE                                 
RBUYTCCQ EQU   X'41'                                                            
RBUYTCLN DS    CL1       B         LENGTH (ORIG= 16 BYTES)                      
RBUYTCDT DS    XL3       B         MG DATE                                      
RBUYTCC# DS    XL4       B         CSI CON#:   0000-9999                        
RBUYTCCL DS    XL2       B         CSI LINE:   'A '-'Z ' OR 'AA'-'ZZ'           
RBUYTCML DS    XL2       B         MASTER CSI LINE: SAME COMMENT                
RBUYTCMS DS    XL1       B         MASTER CSI SUBLN: 00-98                      
RBUYTCOP DS    XL1       B         OPEN FLAG:  X,Y,N                            
         DS    XL1                 SPARE                                        
*                                                                               
*                                                                               
*  TD/TC BUY DATA ELEMENT: JDS/2000  DATA                                       
*                                                                               
RBYJTDEL DS    0C        V         TD/TC BUY DATA ELEMENT                       
RBYJTDCD DS    CL1       X'42'     ELEMENT CODE                                 
RBYJTDCQ EQU   X'42'                                                            
RBYJTDLN DS    CL1       B         LENGTH (ORIG= 16 BYTES)                      
RBYJTDPR DS    XL1       C         PRIORITY: R,X,1-9, X'FF' = BLANK             
RBYJTDPC DS    XL2       C         PROGRAM CODE: X'FF' = BLANK                  
*                                     0-9, A-Z                                  
RBYJTDST DS    XL2       B         START TIME                                   
RBYJTDET DS    XL2       B         END   TIME                                   
RBYJTDPL DS    XL3       C         PLAN:  NO VALIDATION                         
RBYJTDL# DS    XL1       B         M/G TRAFFIC LINE NUMBER                      
         DS    XL3                 SPARE                                        
*                                                                               
*                                                                               
*                                                                               
RBUYECEL DS    0C        V         EC HISTORY ELEMENT                           
RBUYECCD DS    CL1       X'45'     ELEMENT CODE                                 
RBUYECCQ EQU   X'45'                                                            
RBUYECLN DS    CL1       B         LENGTH                                       
RBUYECED DS    XL2                 DATE 1ST EC'D                                
RBUYECDD DS    XL2                 DATE MARKED DNT                              
RBUYECLQ EQU   *-RBUYECEL                                                       
*                                                                               
RBYSCDEL DS    0C        V         SPECIAL BUY CODE ELEMENT                     
RBYSCDCD DS    CL1       X'5F'     ELEMENT CODE                                 
RBYSCDLN DS    CL1                 ELEMENT LENGTH                               
RBYSCDBC DS    CL3                 BUY CODE                                     
         DS    CL3                 SPARE                                        
RBYSCDLQ EQU   *-RBYSCDEL                                                       
*                                                                               
RBYMGLEL DS    0C        V         SPECIAL MAKEGOOD LINK ELEMENT                
RBYMGLCD DS    CL1       X'69'     ELEMENT CODE                                 
RBYMGLLN DS    CL1                 ELEMENT LENGTH                               
RBYMGLGC DS    CL2                 OFFER GROUP CODE                             
RBYMGLLQ EQU   *-RBYMGLEL                                                       
*                                                                               
RBUYSBEL DS    0C        V         SPORTS BUY DESCRIPTIVE CMTS                  
RBUYSBCD DS    CL1       X'81/82'  ELEMENT CODE 1ST=81 2ND=82                   
RBUYSBLN DS    CL1       B         ELEMENT LENGTH                               
RBUYSBDC DS    0C        AN        DESC CAN BE UP TO 40 CHARACTERS              
*                                                                               
RBUYOCEL DS    0C        V         BUY ORDER COMMENT ELEMENT                    
RBUYOCCD DS    CL1       X'84'     ELEMENT CODE                                 
RBUYOCLN DS    CL1       B         ELEMENT LENGTH                               
RBUYOCID DS    CL1       X         X'80' REP INPUT COMMENT                      
*                                  0  STATION INPUT COMMENT                     
RBUYOCNT DS    0C        AN        COMMENT CAN BE UP TO 60 CHARACTERS           
*                                                                               
* COPY OF X'02' ELEMENTS:RBUYDYEL                                               
*                                                                               
RBY2DYEL DS    0C        V         BUY DAY-TIME ELEMENT(S) FOR A WEEK           
RBY2DYCD DS    CL1       X'B2'     ELEMENT CODE                                 
RBY2DYLN DS    CL1       B         ELEMENT LENGTH                               
*                                                                               
* COPY OF X'03' ELEMENTS:RBUYDTEL                                               
*                                                                               
RBY2DTEL DS    0C        V         BUY EFFECTIVE DATE ELEMENT(S)                
RBY2DTCD DS    CL1       X'B3'     ELEMENT CODE                                 
RBY2DTLN DS    CL1       B         ELEMENT LENGTH                               
*                                                                               
RBUYKTZ0 DS    0C        V         KATZ CONVERSION ELEMENT (PRIMARY)            
RBUYKTCD DS    CL1       X'C0'     ELEMENT CODE                                 
RBUYKTLN DS    CL1       B         ELEMENT LENGTH                               
RBUYKTBL DS    CL2       X         ORIGINAL BUYLINE NUMBER                      
*                                                                               
RBUYMCEL DS    0C        V         MOD CODE TRAP ELEMENT                        
RBUYMCCD DS    CL1       X'D0'     ELEMENT CODE                                 
RBUYMCLN DS    CL1       B         ELEMENT LENGTH                               
RBUYMCVR DS    CL1       X         BUY VERSION NUMBER                           
RBUYMCMO DS    CL2       C         BUY MOD CODES                                
*                                                                               
RBUYEDEL DS    0C                  EDI ELEMENT (KATZ INTERFACE)                 
RBUYEDCD DS    CL1       X'ED'     ELEMENT CODE                                 
RBUYEDLN DS    CL1                 ELEMENT LENGTH                               
RBUYEDDP DS    CL2                 DAYPART CODE                                 
RBUYEDLQ EQU   *-RBUYEDEL                                                       
*                                                                               
RBUYFAEL DS    0C                  TEMPORARY ELEMENT FOR 0B01 RECORD            
RBUYFACD DS    CL1       X'FA'     ELEMENT CODE                                 
RBUYFALN DS    CL1                 ELEMENT LENGTH                               
RBUYFADP DS    XL1                 THE EXISTENCE OF THIS ELEMENT TELLS          
*                                  REROM22 TO SKIP TSAR PROCESSING FOR          
*                                  THIS 0B01 RECORD                             
RBUYFALQ EQU   *-RBUYFAEL                                                       
*                                                                               
* NOTE: ELEM CODE X'FC' USED FOR RECORD AUDIT ELEMENT 'REGENAUD'                
*                                                                               
         ORG                                                                    
