*          DATA SET REGENGRP   AT LEVEL 003 AS OF 06/11/20                      
*              STATION GROUP/SUB-GROUP RECORD                                   
         SPACE 1                                                                
RGRPREC  DS    0C        V         RECORD                                       
RGRPKEY  DS    0CL27     V         KEY                                          
RGRPKTYP DS    CL23      X'07'     RECORD TYPE                                  
RGRPKTQ  EQU   X'07'                                                            
RGRPKREP DS    CL2       AN        REP CODE                                     
RGRPKGRP DS    CL2       AN        GROUP/SUB-GROUP CODE                         
RGRPLEN  DS    CL2       B         RECORD LENGTH                                
RGRPCNTL DS    CL1       X         CONTROL BYTE                                 
RGRPLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
RGRPELEM DS    0C                  GROUP ELEMENT                                
RGRPCODE DS    CL1       X'01'     ELEMENT CODE                                 
RGRPELLN DS    CL1       B         ELEMENT LENGTH                               
RGRPNAME DS    CL10      AN        GROUP NAME                                   
RGRPSBNM DS    CL10      AN        SUBGROUP NAME                                
RGRPPROF DS    CL30      AN        PROFILE (DEFAULT=C'0')                       
         DS    CL20      -         SPARE                                        
