*          DATA SET REGENCON   AT LEVEL 024 AS OF 09/14/20                      
*                                                                               
***********************************************************************         
*                                                                     *         
*      REGENCON - REP CONTRACT RECORD LAYOUT                          *         
*                                                                     *         
*  -----------------------------------------------------------------  *         
*                                                                     *         
*  FEB23/98 (BU ) ---  AS WE ARE RUNNING OUT OF PASSIVE POINTER       *         
*         RECORD CODES, CONTRACT RECORDS NEEDING NEW CODES WILL NOW   *         
*         USE ** SUBTYPES **.  CONTRACT RECORD CODE 'AB' IS TO BE     *         
*         USED, WITH SUBTYPES NUMBERED BEGINNING WITH X'01'           *         
*                                                                     *         
*  -----------------------------------------------------------------  *         
*  UPDATE HISTORY:                                                    *         
*  MAR09/92 (BU ) --- ADD X'23' ELEMENT FOR FORECAST DOLLARS          *         
*                                                                     *         
*  MAR17/92 (BU ) --- EXPAND X'12' SAR ELEMENT FOR 'PENDING'          *         
*                                                                     *         
*  JUN24/92 (BU/SK) - ADD X'17' ELEMENT FOR COMBO CONTRACT CONTROL    *         
*                                                                     *         
*  JUL01/92 (BU ) --- ADD X'06' (RCONSPEL) FLAG FOR 'AUTO-CLOSE DATE' *         
*                                                                     *         
*  OCT05/92 (BU ) --- ADD X'06' (RCONSPEL) FLAG FOR 'PERCENTS ARE     *         
*                     STORED, NOT DOLLARS' AND FLAG FOR 'REP'D        *         
*                     STATION'S DOLLARS ARE OVERRIDDEN'               *         
*                     MOVE AUTO-CLOSE DATE TO NEW X'08' ELEMENT,      *         
*                     ADD 'TRUE ACTIVITY DATE' AND X'06' ELEMENT      *         
*                     REP'D STATION OVERRIDE DOLLARS                  *         
*                                                                     *         
*  JUL22/93 (SKU) --- ADD NOT PENDING FLAG TO RCONMODR                *         
*                                                                     *         
*  JUL26/93 (BU ) --- ADD CONFLICT CODE X'13' ELEMENT FOR EC:BIAS     *         
*                                                                     *         
*  AUG18/93 (BU ) --- ADD CONFLICT CODE X'13' ELEMENT FOR EC:JDS/200  *         
*                     ADD EC CONTROL ELEMENT X'15'                    *         
*                                                                     *         
*                                                                     *         
*  JAN28/94 (BU ) --- ADD DEVELOPMENTAL/INVOICE # X'18' ELEMENT       *         
*                                                                     *         
*  MAY10/94 (SKU) --- ADD NEW SPL FORECAST/BUDGET $ X'09' ELEMENT     *         
*                                                                     *         
*  JUN01/94 (SKU) --- ADD DARE X'1D' ELEMENT                          *         
*                                                                     *         
*  OCT17/94 (SKU) --- ADD LAST 3 VERSION DATES FOR REP AND STATION    *         
*                                                                     *         
*  MAR02/95 (SKU) --- INCREMENT X'20' ELEMENT TO INCLUDE REP VERSION#S*         
*                     SHORTEN X'9F' ELEMENT BY REMOVING SPARES        *         
*                                                                     *         
*  APR11/95 (SKU) --- ADD PIGGY/PARTNER PROD TO EI CODES              *         
*                                                                     *         
*  MAY03/95 (BU ) --- ADD X'25' HIATUS DATE ELEMENT                   *         
*                                                                     *         
*  JUN07/95 (BU ) --- CORRECT DOCUMENTATION FOR X'20' ELEMENT TO      *         
*                     SHOW LENGTH OF X'29' (41 CHARS)                 *         
*                                                                     *         
*  JUL20/95 (BU ) --- USE RCONMODR BIT AS 'CONVERTED CONTRACT' FLAG   *         
*                                                                     *         
*  JUL24/95 (BU ) --- ADD X'71/72/73' ELTS AS KATZ ADDRESS ELTS       *         
*                                                                     *         
*  AUG16/95 (SKU) --- ADD MAKEGOOD SEND INFO ELEMENT                  *         
*                                                                     *         
*  OCT06/95 (BU ) --- ADD NEW 'RIS' PASSIVES                          *         
*                                                                     *         
*  NOV08/95 (BU ) --- ADD NEW EC X'16' ELEMENTS                       *         
*                                                                     *         
*  NOV16/95 (BU ) --- USE SPARE BYTE IN X'1F' FOR CONVERSION #        *         
*                                                                     *         
*  NOV27/95 (BU ) --- ADD EXPANSION ELT FOR KATZ ACTUALIZATION        *         
*                                                                     *         
*  DEC06/95 (SKU) --- ADD SECONDS TO THE 'MGS' MAKEGOOD SEND TIME     *         
*                                                                     *         
*  DEC08/95 (BU ) --- KATZ AGY/ADV SWITCH FLAGS VALUES                *         
*                                                                     *         
*  JAN23/96 (JRD) --- ADD PROPOSAL EXPANSION ELEMENTS X'40' & X'41'   *         
*                      ADD FLAG TO SAR ELEMENT TO INDICATE PRO EXP.   *         
*                                                                     *         
*  FEB05/96 (BU ) --- ADD EDI ELEMENT 'ED'                            *         
*                                                                     *         
*  FEB21/96 (JRD) --- ADD DAYPART FLAGS TO X'41' ELEMENT              *         
*                                                                     *         
*  MAR6/96  (PXZ) --- ADD X'A3' SONNET ELEMENT                                  
*                                                                               
*  MAR26/96 (JRD) --- CHANGE RSARXCTO TO RSARFL2 AND 2 BYTES SPARE    *         
*                                                                     *         
*  MAR29/96 (RHV) --- ADD X'22' MOD DATE/TIME ELEMENT                 *         
*                                                                     *         
*  APR18/96 (PXZ) --- X'8F' KEY                                       *         
*                                                                     *         
*  MAY09/96 (PXZ) --- X'A3' SONNET ELEMENT CHANGED / 8F KEY CHANGED   *         
*           (SKU) --- MOVE ESTIMATE NUMBER TO A LARGER FIELD          *         
*                                                                     *         
*  MAY10/96 (WSB) --- ADD X'26' HIATUS COMMENT ELEM.  ADD ALT VERS OF *         
*                     X'25' HIAT DATE ELEM IF CON NOT LINKED TO DARE  *         
*                                                                     *         
*  JUN10/96 (PXZ) --- X'A3' ELEM ADJUSTED                             *         
*                                                                     *         
*  AUG20/96 (RHV) --- X'2A' MOVE HISTORY ELEMENT BORN                 *         
*                                                                               
*  JAN20/97 (PXZ) --- X'9D' NEW PASSIVE POINTER FOR RIS/PRODUCT       *         
*                                                                               
*  JAN22/97 (SKU) --- X'1C' NEW TAKEOVER DARE ELEMENT                 *         
*                                                                     *         
*  JAN24/97 (PXZ) --- X'9D' ADJUSTED                                  *         
*                                                                     *         
*  JAN31/97 (BU ) ---                                                 *         
*                                                                     *         
*  APR16/97 (RHV) --- PASSIVE PTR X'9E' ADDED (MOVE HISTORY)          *         
*                                                                     *         
*  SEP15/97 (JRD) --- X'53' ALTERNATE BUCKET ELEMENTS                 *         
*                                                                     *         
*  OCT01/97 (SKU) --- ADD DARE SPOT COUNTING ELEMENT                  *         
*                                                                     *         
*  OCT??/97 (BU ) --- ADD X'54' INVOICE ELEMENT/ADDED BY INV PROG     *         
*                                                                     *         
*  NOV03/97 (JRD) --- ADD X'A4' ALTERNATE CALENDAR ELEMENT            *         
*                                                                     *         
*  FEB23/98 (BU ) --- ADD X'AB01' PASSIVE POINTER                     *         
*                                                                     *         
*  SEP02/98 (JRD) --- NEW SONNET ELEMENTS X'A3'   X'A4'               *         
*                                                                     *         
*  MAY27/99 (ROB) --- NEW SONNET 9F KEY                               *         
*                                                                     *         
*  SEP24/99 (BU ) --- X'2E' HISTORY TAKEOVER ELEMENT                  *         
*                                                                     *         
*  OCT21/99 (BU ) --- X'9B' HISTORY TAKEOVER ELEMENT                  *         
*                                                                     *         
*  JAN24/00 (SKU) --- ADD BYTE TO RANDOM FLAG FOR HIGHEST BUY NUMBER  *         
*                                                                     *         
*  JAN26/00 (BU ) --- BACK BILLING HISTORY ELEMENT                    *         
*                                                                     *         
*  FEB25/00 (BU ) --- ADD TRADE BUCKETS (EST=X'63', INV=X'64')        *         
*                                                                     *         
*  MAR24/00 (BU ) --- ADD ALT CALENDAR TRADE BUCKETS                  *         
*                     (EST=X'83', INV=X'84')                          *         
*                                                                     *         
*  JUL19/00 (JRD) --- ADD EZPOST ACTIVITY ELEMENT (X'A7')             *         
*                                                                     *         
*  SEP05/00 (BU ) --- ADD NEW TRADE ELEMENT (X'3F')                   *         
*                                                                     *         
*  SEP18/01 (BU ) --- ADD NEW 'TEMPORARY' BUYCODE ELEMENT (SEE NOTES  *         
*                     WITHIN ELEMENT FOR EXPLANATION)                 *         
*                                                                     *         
*  NOV30/01 (BU ) --- ADD RCONRPSP (PAY S/P CODE) TO 1E ELEMENT       *         
*                                                                     *         
*  JAN14/03 (BU ) --- ADD PASSIVE FOR TRAFFIC NUMBER FOR EZPOST       *         
*                                                                     *         
*  JUN06/05 (BU ) --- ADD MEDIA OCEAN PARALLEL PROCESS ELEMENT        *         
*                                                                     *         
*  AUG03/05 (BU ) --- ADD ALT CAL INITIALIZER 'A4' ELT FIELD LABEL    *         
*                                                                     *         
*  JUN04/10 (KUI) --- ADD SCRIPT UPLOAD ELEMENT AND PASSIVE KEY       *         
*                                                                     *         
*  MAY16/13 (KUI) --- X'A7' EZPOST ACTIVITY ELEMENT NO LONGER UPDATED *         
*                                                                     *         
*                     ***  END TOMBSTONE  ***                         *         
***********************************************************************         
*              CONTRACT RECORD (KEYS)                                           
         SPACE 1                                                                
RCONREC  DS    1000C               RECORD                                       
         ORG   RCONREC                                                          
RCONKEY  DS    0CL27     V         KEY                                          
RCONKTYP DS    CL2       X'0C'     RECORD TYPE                                  
RCONKTQ  EQU   X'0C'                                                            
RCONKREP DS    CL2       AN        REP CODE                                     
RCONKGRP DS    CL2       AN        STATION GROUP/SUBGROUP                       
RCONKSTA DS    CL5       A         STATION CALL LETTERS                         
RCONKOFF DS    CL2       AN        OFFICE CODE                                  
RCONKAGY DS    CL4       AN        AGENCY CODE                                  
RCONKAOF DS    CL2       AN        AGENCY OFFICE                                
RCONKADV DS    CL4       AN        ADVERTISER                                   
RCONKCON DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONPTYP DS    CL21      X'8C'     PASSIVE POINTER 1                            
RCONPTQ  EQU   X'8C'                                                            
RCONPREP DS    CL2       AN        REP CODE                                     
RCONPCON DS    CL4       UP        CONTRACT NUMBER (9'S COMPLEMENT)             
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONQTYP DS    CL2       X'9C'     PASSIVE POINTER 2                            
RCONQTQ  EQU   X'9C'                                                            
RCONQREP DS    CL2       AN        REP CODE                                     
RCONQOFF DS    CL2       AN        OFFICE CODE                                  
RCONQGRP DS    CL2       AN        STAION GROUP/SUBGROUP                        
RCONQSTA DS    CL5       A         STATION CALL LETTERS                         
RCONQADV DS    CL4       AN        ADVERTISER CODE                              
RCONQAGY DS    CL4       AN        AGENCY CODE                                  
RCONQAOF DS    CL2       AN        AGENCY OFFICE                                
RCONQCON DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCON9DK  DS    0CL27     V         X'9D' PASSIVE POINTER (RIS PROD)             
RCON9DTP DS    CL1       X'9D'     RECORD TYPE                                  
RCON9DQ  EQU   X'9D'                                                            
RCON9DRP DS    CL2       AN        REP CODE                                     
RCON9DST DS    CL5       A         STATION CALL LETTERS                         
RCON9DDV DS    CL4       AN        ADVERTISER                                   
RCON9DPR DS    CL9       AN        PRODUCT NAME                                 
         DS    CL2       AN        SPARE                                        
RCON9DCN DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCON9BK  DS    0CL27     V         X'9B' PASSIVE POINTER (TKO HISTORY)          
RCON9BTP DS    CL12      X'9B'     RECORD TYPE                                  
RCON9BQ  EQU   X'9B'                                                            
RCON9BRP DS    CL2       AN        REP CODE                                     
RCON9BST DS    CL5       AN        STATION                                      
RCON9BSR DS    CL2       AN        SOURCE REP CODE                              
RCON9BDT DS    CL2       X         NO DATE IN THIS KEY                          
RCON9BSC DS    CL4       AN        SOURCE CONTRACT NUMBER                       
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCON9EK  DS    0CL27     V         X'9E' PASSIVE POINTER (MOVE HISTORY)         
RCON9ETP DS    CL12      X'9E'     RECORD TYPE                                  
RCON9EQ  EQU   X'9E'                                                            
RCON9ERP DS    CL2       AN        REP CODE                                     
RCON9EST DS    CL5       AN        STATION                                      
RCON9ESR DS    CL2       AN        SOURCE REP CODE                              
RCON9EDT DS    CL2       X         MOVE ACTIVITY DATE (COMPRESSED)              
RCON9ESC DS    CL4       AN        SOURCE CONTRACT NUMBER                       
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONPCTP DS    CL10      X'AB01'   PASSIVE POINTER                              
RCONPCQ  EQU   X'AB'                                                            
RCONPCRP DS    CL2       AN        REP CODE                                     
RCONPCAG DS    CL4       AN        AGENCY CODE                                  
RCONPCAD DS    CL4       AN        ADVERTISER CODE                              
RCONPCPC DS    CL3       AA        PRODUCT CODE                                 
RCONPCCN DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONRTYP DS    CL1       X'AC'     PASSIVE POINTER 3                            
RCONRTQ  EQU   X'AC'                                                            
RCONRREP DS    CL2       AN        REP CODE                                     
RCONROFF DS    CL2       AN        OFFICE CODE                                  
RCONRTEM DS    CL2       AN        TEAM CODE                                    
RCONRSAL DS    CL3       AN        SALESMAN'S INITIALS (LAST,FIRST,MID)         
RCONRSTA DS    CL5       A         STATION CALL LETTERS                         
RCONRAGY DS    CL4       AN        AGENCY CODE                                  
RCONRADV DS    CL4       AN        ADVERTISER CODE                              
RCONRCON DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONTTYP DS    X         X'AD'     PASSIVE POINTER FOR DARE TAKEOVER            
RCONTTQ  EQU   X'AD'                                                            
         DS    CL11                SPARE                                        
RCONTREP DS    CL2       AN        REP CODE                                     
RCONTSTA DS    CL5       AN        STATION CALL LETTERS                         
RCONTOLD DS    XL4       UP        PREVIOUS CONTRACT NUMBER                     
RCONTCON DS    XL4       UP        CURRENT CONTRACT NUMBER                      
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONCUTP DS    X         X'AE'     SCRIPT CONTRACT UPLOAD PASSIVE KEY           
RCONCUQ  EQU   X'AE'                                                            
         DS    CL5                 SPARE                                        
RCONCURP DS    CL2       AN        REP CODE                                     
RCONCUST DS    CL5       AN        STATION CALL LETTERS                         
RCONCUT# DS    CL10      AN        TRAFFIC ORDER NUMBER                         
RCONCUC# DS    XL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
*                                                                               
* USE TO KEEP TRACK OF LATEST CONTRACT UPLOADED                                 
*                                                                               
RCONC1TP DS    X         X'AE'     SCRIPT CONTRACT UPLOAD PASSIVE KEY           
RCONC1SP DS    X         X'01'     SUBTYPE TO KEEP TRACK OF LAST ADDED          
         DS    CL4                 SPARE                                        
RCONC1RP DS    CL2       AN        REP CODE                                     
         DS    CL15                SPARE                                        
RCONC1C# DS    XL4       UP        CONTRACT NUMBER (9'S COMPLEMENT)             
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONDTYP DS    CL2       X'BC'     PASSIVE POINTER 4                            
RCONDTQ  EQU   X'BC'                                                            
RCONDREP DS    CL2       AN        REP CODE                                     
RCONDCTG DS    CL2       AN        CATEGORY CODE                                
RCONDOFF DS    CL2       AN        OFFICE CODE                                  
RCONDSTA DS    CL5       A         STATION CALL LETTERS                         
RCONDAGY DS    CL4       AN        AGENCY CODE                                  
RCONDAOF DS    CL2       AN        AGENCY OFFICE CODE                           
RCONDADV DS    CL4       AN        ADVERTISER CODE                              
RCONDCON DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONDATP DS    XL1       X'BD'     PASSIVE POINTER FOR DARE                     
RCONDAQ  EQU   X'BD'                                                            
         DS    XL1                 SPARE                                        
RCONDARP DS    CL2       AN        REP CODE                                     
RCONDAAG DS    CL4       A         AGENCY                                       
RCONDAAO DS    CL2       A         AGENCY OFFICE                                
RCONDAAD DS    CL4       A         ADVERTISER                                   
RCONDAST DS    CL5       A         STATION                                      
RCONDAFS DS    CL2       B         FLIGHT START : COMPRESSED                    
RCONDAFE DS    CL2       B         FLIGHT END : COMPRESSED                      
RCONDACN DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONCSTP DS    XL1       X'BF'     PASSIVE POINTER FOR CODESWIT                 
RCONCSQ  EQU   X'BF'                                                            
         DS    XL1                 SPARE                                        
RCONCSRP DS    CL2       AN        REP CODE                                     
RCONCSAG DS    CL4       A         AGENCY                                       
RCONCSAO DS    CL2       A         AGENCY OFFICE                                
RCONCSAD DS    CL4       A         ADVERTISER                                   
RCONCSST DS    CL5       A         STATION                                      
RCONCSOF DS    CL2       A         OFFICE                                       
RCONCSFE DS    CL2       B         FLIGHT END : COMPRESSED                      
RCONCSCN DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONSTYP DS    CL1       X'CC'     PASSIVE POINTER 5                            
RCONSTQ  EQU   X'CC'                                                            
RCONSREP DS    CL2       AN        REP CODE                                     
RCONSSTA DS    CL5       A         STATION CALL LETTERS                         
RCONSOFF DS    CL2       AN        OFFICE CODE                                  
RCONSTEM DS    CL2       AN        DIVISION/TEAM CODE                           
RCONSSAL DS    CL3       AN        SALESPERSON INITIALS (L,F,M)                 
RCONSADV DS    CL4       AN        ADVERTISER CODE                              
RCONSAGY DS    CL4       AN        AGENCY CODE                                  
RCONSCON DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONBTYP DS    CL5       X'DC'     PASSIVE POINTER 6                            
RCONBTQ  EQU   X'DC'                                                            
RCONBREP DS    CL2       AN        REP CODE                                     
RCONBADV DS    CL4       AN        ADVERTISER CODE                              
RCONBDTE DS    CL3       B         DATE BOP ADDED/CHANGED                       
RCONBREF DS    CL4       UP        REFERENCE CONTRACT NUMBER                    
RCONBSTA DS    CL5       AN        STATION CALL LETTERS                         
RCONBCON DS    CL4       UP        CONTRACT NUMBER                              
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCONATYP DS    CL21      X'EC'     PASSIVE POINTER 7 (SAR)                      
RCONATQ  EQU   X'EC'                                                            
RCONAREP DS    CL2       AN        REP CODE                                     
RCONACON DS    CL4       UP        CONTRACT NO. (9'S COMP. REVERSE ORD)         
*                                                                               
         EJECT                                                                  
         SPACE 1                                                                
         ORG   RCONREC                                                          
RCON8TYP DS    CL1   +0     X'8D'  PASSIVE POINTER 8D                           
RCON8TQ  EQU   X'8D'                                                            
RCON8REP DS    CL2   +1            REP CODE                                     
         DS    CL5   +3            X'00'                                        
RCON8FST DS    CL2   +8            FLIGHT START: COMPRESSED                     
RCON8FEN DS    CL2   +10           FLIGHT END  : COMPRESSED                     
RCON8CON DS    CL4   +12           CONTRACT NO                                  
RCON8RID DS    CL1   +16           RECORD ID                                    
*                                  1  =  AGENCY / ADVERTISER                    
*                                  2  =  SALESPERSON/CONTRACT TYPE/             
*                                        GROUP-SUBG/CATEGORY/TEAM               
*                                  3  =  OFFICE(SLS)/DEMO/CREATION              
RCON8AGY DS    CL6   +17           AGENCY                                       
RCON8ADV DS    CL4   +23           ADVERTISER                                   
         ORG   RCON8AGY                                                         
RCON8SLS DS    CL3   +17           SALESPERSON                                  
RCON8CTP DS    CL1   +20           CONTRACT TYPE                                
RCON8GSG DS    CL2   +21           GROUP SUB-GROUP                              
RCON8CTG DS    CL2   +23           CATEGORY                                     
RCON8TM  DS    CL2   +25           TEAM                                         
         ORG   RCON8AGY                                                         
RCON8DOF DS    CL2   +17           OFFICE (SALESPERSON)                         
RCON8DMO DS    CL3   +19           TARGET DEMO                                  
RCON8DCD DS    CL2   +22           CREATION DATE                                
         DS    CL3   +24           SPARE                                        
*                                                                               
                                                                                
*                                                                               
         ORG   RCONREC                                                          
RCON8ETP DS    CL1   +0     X'8E'  PASSIVE POINTER 8E                           
RCON8EQ  EQU   X'8E'                                                            
RCON8ERP DS    CL2   +1            REP CODE                                     
RCON8EST DS    CL5   +3            STATION                                      
RCON8EFS DS    CL2   +8            FLIGHT START: COMPRESSED                     
RCON8EFE DS    CL2   +10           FLIGHT END  : COMPRESSED                     
RCON8ECN DS    CL4   +12           CONTRACT NO                                  
RCON8EID DS    CL1   +16           RECORD ID                                    
*                                  1  =  AGENCY / ADVERTISER                    
*                                  2  =  SALESPERSON/CONTRACT TYPE/             
*                                        GROUP-SUBG/CATEGORY/TEAM               
*                                  3  =  OFFICE(SLS)/DEMO/CREATION              
RCON8EAG DS    CL6   +17           AGENCY                                       
RCON8EAV DS    CL4   +23           ADVERTISER                                   
         ORG   RCON8EAG                                                         
RCON8ESP DS    CL3   +17           SALESPERSON                                  
RCON8ECP DS    CL1   +20           CONTRACT TYPE                                
RCON8EGS DS    CL2   +21           GROUP SUB-GROUP                              
RCON8ECG DS    CL2   +23           CATEGORY                                     
RCON8ETM DS    CL2   +25           TEAM                                         
         ORG   RCON8EAG                                                         
RCON8EOF DS    CL2   +17           OFFICE (SALESPERSON)                         
RCON8EMO DS    CL3   +19           TARGET DEMO                                  
RCON8ECD DS    CL2   +22           CREATION DATE                                
         DS    CL3   +24           SPARE                                        
*                                                                               
                                                                                
                                                                                
         ORG   RCONREC                                                          
RCON8FTP DS    CL1   +0     X'8F'  PASSIVE POINTER 8F (NAT'L ORDERS)            
RCON8FQ  EQU   X'8F'                                                            
RCON8FRP DS    CL2   +1            REP CODE                                     
RCON8FSA DS    CL5   +3            STATION                                      
RCON8FDT DS    CL2   +8            CREATE DATE                                  
RCON8FIN DS    CL3   +10           IN BOX ID                                    
RCON8FCN DS    CL4   +13           CONTRACT NUMBER                              
         DS    CL10  +17           SPARE                                        
*                                                                               
                                                                                
         ORG   RCONREC                                                          
RCON9FTP DS    CL1   +0     X'9F'  PASSIVE PTR 9F (NBC LOCAL ORDERS)            
RCON9FRP DS    CL2   +1            REP CODE                                     
RCON9FSA DS    CL5   +3            STATION                                      
RCON9FDT DS    CL2   +8            CREATE DATE                                  
RCON9FIN DS    CL3   +10           IN BOX ID                                    
RCON9FCN DS    CL4   +13           CONTRACT NUMBER                              
         DS    CL10  +17           SPARE                                        
*                                                                               
         ORG   RCONREC                                                          
RCONA2TP DS    CL12  +0   X'A201'  PASSIVE PTR 2A01 (TAKEOVER)                  
RCONA2Q  EQU   X'A2'                                                            
RCONA2RP DS    CL2   +12           REP CODE                                     
RCONA2ST DS    CL5   +14           STATION                                      
RCONA2SR DS    CL2   +19           SOURCE REP CODE                              
         DS    CL2   +21           DATE (EMPTY)                                 
RCONA2CN DS    CL4   +23           CONTRACT NUMBER                              
*                                                                               
         ORG   RCONREC                                                          
RCONBBTP DS    CL12  +0   X'A202'  PASSIVE PTR 2A02 (TAKEOVER/BB)               
RCONBBRP DS    CL2   +12           REP CODE                                     
RCONBBST DS    CL5   +14           STATION                                      
RCONBBSR DS    CL2   +19           SOURCE REP CODE                              
         DS    CL2   +21           DATE (EMPTY)                                 
RCONBBCN DS    CL4   +23           CONTRACT NUMBER                              
*                                                                               
         ORG   RCONREC                                                          
RCONTNTP DS    CL11  +0   X'A203'  PASSIVE PTR 2A03 (TRAFFIC NUMBER)            
RCONTNRP DS    CL2   +11           REP CODE                                     
RCONTNT# DS    CL10  +13           TRAFFIC NUMBER                               
RCONTNCN DS    CL4   +23           CONTRACT NUMBER                              
*                                                                               
*                                                                               
RCONLEN  DS    CL2       B         RECORD LENGTH                                
RCONCNTL DS    CL1       X         CONTROL BYTE                                 
*                                  X'80' = DELETED                              
*                                  X'02' = SAR REPORT INDICATOR                 
*                                  X'01' = COMPRESSED                           
RCONLINK DS    CL4       B         LINK ADDRESS                                 
         EJECT                                                                  
*              CONTRACT RECORD (ELEMENTS)                                       
         SPACE 1                                                                
RCONELEM DS    0C                  CONTRACT DESCRIPTION ELEMENT                 
RCONCODE DS    CL1       X'01'     ELEMENT CODE                                 
RCONELLN DS    CL1       B         ELEMENT LENGTH                               
RCONBUYR DS    CL20      AN        AGENCY BUYER                                 
RCONPRD  DS    CL3       AN        PRODUCT CODE (OR SPACES)                     
RCONTEM  DS    CL2       AN        SALES TEAM                                   
RCONSAL  DS    CL3       AN        SALESMAN CODE                                
RCONDATE DS    CL6       B         START END DATES (YMD)                        
RCONMOD  DS    CL1       B         MODIFICATION NUMBER                          
RCONMODD DS    CL3       B         DATE OF LAST MODIFICATION (YMD)              
RCONMODR DS    CL2       B         (LAST) MODIFICATION REASON                   
*                                       X'8000'=K HEADLINE CHANGE               
*                                       X'4000'=BUY CHANGE                      
*                                       X'2000'=RESET/BUY LINE 1                
*                                                     ADDED                     
*                                       X'1000'=NOT PENDING/BUY LINE            
*                                                     HAS BEEN ADDED            
*                                       X'0800'=K IS/WAS A TAKEOVER             
*                                       X'0400'=K ADDED BY SFM BUYCOPY          
*                                       X'0200'=K ADDED BY AUTOGEN              
*                                                                               
*                                       X'0080'=ACE CONTRACT                    
*                                       X'0040'=GRAPHNET CONTRACT               
*                                       X'0020'=MON DATA HAS BEEN ADDED         
*                                       X'0010' =CONVERTED CONTRACT             
*                                       X'0008' =KATZ AGENCY SWITCHED           
*                                                  REQUIRES X'0010'             
*                                       X'0004' =KATZ ADVERT SWITCHED           
*                                                  REQUIRES X'0010'             
*                                       X'0002' =KATZ ACTUALIZED ORDER          
*                                       X'0001' =KATZ HOUSE ACCT                
RCONCREA DS    CL3       B         CREATION OR BUYLN 1 ADDED DATE (YMD)         
RCONRTGS DS    CL1       A         RATING SERVICE                               
*                                       A=ARB                                   
*                                       N=NSI                                   
*                                       S=SRC                                   
*                                       B=BIR  RADIO ONLY                       
*                                       T=TRC  RADIO ONLY                       
*                                       M=MTD  RADIO ONLY                       
*                                       R=RAM  RADIO ONLY                       
*                                       X'00' = NONE                            
RCONRMON DS    CL1       B         RATING MONTH                                 
RCONINVD DS    CL3       B         LAST INVOICE CHANGE DATE                     
RCONWKS  DS    CL1       B         NUMBER OF WEEKS IN CONTRACT                  
RCONHDRD DS    CL3                 HEADER CREATION DATE -YMD                    
RCONTYPE DS    CL1       A         CONTRACT TYPE                                
*                                  X'00' = REGULAR                              
*                                  C'N'  = NETWORK                              
*                                                                               
RCONRESD DS    CL3       B         LAST RESET DATE                              
RCONCTGY DS    CL2       AN        CATEGORY CODE                                
         SPACE 1                                                                
RCONCMEL DS    0C        V         CONTRACT COMMENT ELEMENT                     
RCONCMCO DS    CL1       X'02'     ELEMENT CODE                                 
RCONCMLN DS    CL1       B         ELEMENT LENGTH                               
RCONCMNT DS    0C        AN        EACH CONTRACT COMMENT ELEMENT CAN            
*                                  CONTAIN UP TO 60 CHARACTERS                  
         SPACE 1                                                                
RCONBKEL DS    0C        V         CONTRACT BUCKET ELEMENT                      
RCONBKCO DS    CL1       X'03'     ELEMENT CODE                                 
RCONBKLN DS    CL1       B         ELEMENT LENGTH                               
RCONBKYR DS    CL1       B         BUCKET YEAR                                  
RCONBKMN DS    CL1       B         BUCKET MONTH                                 
RCONBKWK DS    CL2       B         COMPRESSED WEEK COMMENCING DATE              
*                                  (MON)  WHEN ACTIVITY TOOK PLACE              
RCONBKAM DS    CL4       B         AMOUNT                                       
         SPACE 1                                                                
*                                                                               
*    FORECAST DOLLAR ELEMENT:  ADDED MARCH/92.  BILL UHR                        
*                                                                               
RCONFCEL DS    0C        V         CONTRACT FORECAST ELEMENT                    
RCONFCCO DS    CL1       X'23'     ELEMENT CODE                                 
RCONFCLN DS    CL1       B         ELEMENT LENGTH                               
RCONFCYR DS    CL1       B         BUCKET YEAR                                  
RCONFCMN DS    CL1       B         BUCKET MONTH                                 
RCONFCWK DS    CL2       B         COMPRESSED WEEK COMMENCING DATE              
*                                  (MON)  WHEN ACTIVITY TOOK PLACE              
RCONFCAM DS    CL4       B         AMOUNT                                       
         SPACE 1                                                                
*                                                                               
* ALTERNATE CALENDER BUCKET ELEMENT                                             
*                                                                               
RCONABEL DS    0C        V             CONTRACT ALTERNATE $ ELEMENT             
RCONABCO DS    CL1       X'53'         ELEMENT CODE                             
RCONABLN DS    CL1       B             ELEMENT LENGTH                           
RCONABYR DS    CL1       B             BUCKET YEAR                              
RCONABMN DS    CL1       B             BUCKET MONTH                             
RCONABWK DS    CL2       B             COMPRESSED WEEK COMMENCING DATE          
*                                      (MON)  WHEN ACTIVITY TOOK PLACE          
RCONABAM DS    CL4       B             AMOUNT                                   
         SPACE 1                                                                
*                                                                               
* TRADE BUCKET ELEMENT                                                          
*                                                                               
RCONTEEL DS    0C        V             CONTRACT TRADE ESTIMATE ELT              
RCONTECO DS    CL1       X'63'         ELEMENT CODE                             
RCONTELN DS    CL1       B             ELEMENT LENGTH                           
RCONTEYR DS    CL1       B             BUCKET YEAR                              
RCONTEMN DS    CL1       B             BUCKET MONTH                             
RCONTEWK DS    CL2       B             COMPRESSED WEEK COMMENCING DATE          
*                                      (MON)  WHEN ACTIVITY TOOK PLACE          
RCONTEAM DS    CL4       B             AMOUNT                                   
         SPACE 1                                                                
*                                                                               
* ALTERNATE CALENDAR TRADE BUCKET ELEMENT                                       
*                                                                               
RCONATEL DS    0C        V             ALT CAL TRADE ESTIMATE ELT               
RCONATCO DS    CL1       X'83'         ELEMENT CODE                             
RCONATLN DS    CL1       B             ELEMENT LENGTH                           
RCONATYR DS    CL1       B             BUCKET YEAR                              
RCONATMN DS    CL1       B             BUCKET MONTH                             
RCONATWK DS    CL2       B             COMPRESSED WEEK COMMENCING DATE          
*                                      (MON)  WHEN ACTIVITY TOOK PLACE          
RCONATAM DS    CL4       B             AMOUNT                                   
         SPACE 1                                                                
***********************************************************************         
*                                                                               
*    EXPANSION DOLLAR ELEMENT:  ADDED NOV27/95.  BILL UHR                       
*                                                                               
XCONXPEL DS    0C        V         CONTRACT EXPANSION ELEMENT                   
XCONXPCO DS    CL1       X'33'     ELEMENT CODE                                 
XCONXPLN DS    CL1       B         ELEMENT LENGTH                               
XCONXPYR DS    CL1       B         BUCKET YEAR                                  
XCONXPMN DS    CL1       B         BUCKET MONTH                                 
XCONXPWK DS    CL2       B         COMPRESSED WEEK COMMENCING DATE              
*                                  (MON)  WHEN ACTIVITY TOOK PLACE              
XCONXPAM DS    CL4       B         AMOUNT                                       
         SPACE 1                                                                
RCONSTEL DS    0C        V         CONTRACT STATION AMOUNT ELEMENT              
RCONSTCO DS    CL1       X'04'     ELEMENT CODE                                 
RCONSTLN DS    CL1       B         ELEMENT LENGTH                               
RCONSTYR DS    CL1       B         YEAR OF SERVICE                              
RCONSTMN DS    CL1       B         MONTH OF SERVICE                             
RCONSTWK DS    CL2       B        COMPRESSED WEEK COMMENCING DATE               
*                                  (MON) WHEN ACTIVITY TOOK PLACE               
RCONSTAM DS    CL4       B         STATION AMOUNT                               
         SPACE 1                                                                
*                                                                               
***********************************************************************         
*     ALTERNATE INVOICE AMOUNT ELEMENT                                          
*        BUCKETS CREATED BY OPTION WITHIN 'INV' PROGRAM                         
*                                                                               
*                                                                               
RCONSAEL DS    0C        V         CONTRACT STATION AMOUNT ELEMENT              
RCONSACO DS    CL1       X'54'     ELEMENT CODE                                 
RCONSALN DS    CL1       B         ELEMENT LENGTH                               
RCONSAYR DS    CL1       B         YEAR OF SERVICE                              
RCONSAMN DS    CL1       B         MONTH OF SERVICE                             
RCONSAWK DS    CL2       B        COMPRESSED WEEK COMMENCING DATE               
*                                  (MON) WHEN ACTIVITY TOOK PLACE               
RCONSAAM DS    CL4       B         STATION AMOUNT                               
***********************************************************************         
*     TRADE INVOICE AMOUNT ELEMENT                                              
*        BUCKETS CREATED BY OPTION WITHIN 'INV' PROGRAM                         
*                                                                               
*                                                                               
RCONTIEL DS    0C        V         CONTRACT TRADE INVOICE ELEMENT               
RCONTICO DS    CL1       X'64'     ELEMENT CODE                                 
RCONTILN DS    CL1       B         ELEMENT LENGTH                               
RCONTIYR DS    CL1       B         YEAR OF SERVICE                              
RCONTIMN DS    CL1       B         MONTH OF SERVICE                             
RCONTIWK DS    CL2       B        COMPRESSED WEEK COMMENCING DATE               
*                                  (MON) WHEN ACTIVITY TOOK PLACE               
RCONTIAM DS    CL4       B         STATION AMOUNT                               
***********************************************************************         
*     ALTERNATE CALENDAR TRADE INVOICE AMOUNT ELEMENT                           
*        BUCKETS CREATED BY OPTION WITHIN 'INV' PROGRAM                         
*                                                                               
*                                                                               
RCONAIEL DS    0C        V         ALT CAL TRADE INVOICE ELEMENT                
RCONAICO DS    CL1       X'84'     ELEMENT CODE                                 
RCONAILN DS    CL1       B         ELEMENT LENGTH                               
RCONAIYR DS    CL1       B         YEAR OF SERVICE                              
RCONAIMN DS    CL1       B         MONTH OF SERVICE                             
RCONAIWK DS    CL2       B        COMPRESSED WEEK COMMENCING DATE               
*                                  (MON) WHEN ACTIVITY TOOK PLACE               
RCONAIAM DS    CL4       B         STATION AMOUNT                               
***********************************************************************         
         SPACE 1                                                                
RCONEXEL DS    0C        V         CONTRACT EXPANSION ELEMENT                   
RCONEXCO DS    CL1       X'05'     ELEMENT CODE                                 
RCONEXLN DS    CL1       B         ELEMENT LENGTH                               
RCONEXPR DS    CL20      AN        PRODUCT NAME (RCONPRD=SPACES)                
         SPACE 1                                                                
RCONSPEL DS    0C                  SPL(TV)/EPL(RADIO) ELEMENT                   
RCONSPCO DS    CL1       X'06'     ELEMENT CODE                                 
RCONSPLN DS    CL1       B         ELEMENT LENGTH                               
RCONSPYR DS    CL1       B         REPORTING YEAR                               
RCONSPMN DS    CL1       B         REPORTING MONTH                              
*                                  IF RCONSPES X'08':                           
*                                     DATE = 2 BYTES COMPRESSED                 
*                                  ELSE                                         
*                                     DATE = OLD FORMAT                         
*                                                                               
RCONSPES DS    CL1       B         X'01' DATA IS ESTIMATED                      
*                                  X'02' DATA IS NUMBER OF SPOTS                
*                                  X'04' DATA = PERCENTAGES, NOT                
*                                        DOLLARS IN MINI-ELEMENTS               
*                                  X'08' DATE = NEW FORMAT:  TWO                
*                                        BYTES (COMPRESSED)                     
*                                  X'10' SPL/EPL DATA ALTERED                   
*                                  X'20' REP'D STATION'S DOLLARS                
*                                        ARE OVERRIDDEN BY VALUE                
*                                        IN X'08' ELEMENT                       
*                                  X'40' REP'D STATION'S DOLLARS                
*                                        ARE ZERO - VALUE IN X'08'              
*                                        ELEMENT IS TOTAL BUDGET                
*                        ---->>>>> X'20' & X'40' MUTUALLY EXCLUSIVE             
*                                  X'80' STATION WON 100 P/C OF MARKET          
RCONSPDT DS    CL3       B         ENTRY DATE                                   
RCONSPNU DS    CL1       B         NUMBER OF MINI ELEMENTS                      
         DS    0C                  START OF MINI ELEMENT                        
RCONSPST DS    CL5       AN        STATION CALL LETTERS                         
RCONSPAM DS    CL4       B         SPL/EPL AMOUNT:  FORMAT OF CONTENTS          
*                                    DEPENDS ON FLAG IN 'RCONSPES'              
         SPACE 1                                                                
RCONSMEL DS    0C        V         SPL(TV)/EPL(RADIO) COMMENT ELEMENT           
RCONSMCO DS    CL1       X'07'     ELEMENT CODE                                 
RCONSMLN DS    CL1       B         ELEMENT LENGTH                               
RCONSMNT DS    0C        AN        EACH SPL/EPL COMMENT ELEMENT CAN             
*                                  CONTAIN UP TO 65 CHARACTERS                  
         SPACE 1                                                                
RCONACEL DS    0C                  AUTO-CLOSE/TRUE ACTIVITY DATE ELT            
RCONACCO DS    CL1       X'08'     ELEMENT CODE                                 
RCONACLN DS    CL1       B         ELEMENT LENGTH                               
RCONACAC DS    CL3       B         AUTO-CLOSE DATE                              
RCONACTA DS    CL3       B         TRUE ACTIVITY DATE                           
RCONAC$$ DS    CL4       B         IF RCONSPES=X'20' REP'D STATION'S            
*                                       DOLLARS ARE OVERRIDDEN                  
*                                  IF RCONSPES=X'40' REP'D STATION'S            
*                                       DOLLARS ARE ZERO, VALUE IS              
*                                       TOTAL BUDGET                            
         SPACE 1                                                                
RCONSXEL DS    0C                  EXTRA SPL ELEMENT                            
RCONSXCO DS    CL1       X'09'     ELEMENT CODE                                 
RCONSXLN DS    X         B         ELEMENT LENGTH                               
RCONSXFD DS    XL4                 FORECAST $                                   
RCONSXBD DS    XL4                 BUDGET $                                     
RCONSXFG DS    X                   VARIOUS FLAGS                                
*                                  X'40' - $0 FORECAST ENTERED                  
*                                  X'20' - $0 BUDGET ENTERED                    
RCONSXLQ EQU   *-RCONSXEL          ELEMENT LENGTH EQUATE                        
         SPACE 1                                                                
RCONSRNM DS    0C        V         SPL(TV)/EPL(RADIO) BOOK RENAME EL            
RCONSRCO DS    CL1       X'0B'     ELEMENT CODE                                 
RCONSRLN DS    CL1       B         ELEMENT LENGTH                               
RCONSRLS DS    0C        AN        BOOK RENAME LIST                             
         SPACE 1                                                                
RCONBPEL DS    0C        V         BOP ELEMENT                                  
RCONBPCO DS    CL1       X'10'     ELEMENT CODE                                 
RCONBPLN DS    CL1       B         ELEMENT LENGTH                               
RCONBPDT DS    CL3       B         DATE BOP ADDED/CHANGED                       
RCONBPRF DS    CL4       UP        REFERENCE CONTRACT NUMBER                    
RCONBPTM DS    CL20      AN        PREFERRED TIMES                              
RCONBPOB DS    CL20      AN        BUYING OBJECTIVES                            
RCONBPDM DS    CL20      AN        DEMOGRAPHICS                                 
*                                                                               
*     ***** RCONBPDM NOTES *****                                                
*   1) JUST TEXT ON OLD CON (PRE 09JAN91 K'S)                                   
*   2) IF FIRST BYTE IS X'FF', IT HAS                                           
*      BEEN VALIDATED BY DEMOVAL, USE                                           
*      DEMOCON TO DISPLAY/PRINT.  SEE                                           
*      RECNT27 FOR EXAMPLE                                                      
*                                                                               
RCONBPMK DS    CL5       AN        MARKET - ONLY 3 USED 6/86                    
*                                                                               
RCONBPCL DS    CL5       AN        COMMERCIAL LENGTH - NOT USED 6/86            
*                                                                               
*        FOLLOWING UNUSED BYTES ARE USED FOR KATZ CONVERSION.  WHEN             
*        AN UNRECOGNIZED DEMOGRAPHIC IS ENCOUNTERED, THE DEMO IS SET            
*        TO 'HOMES' AND THE ORIGINAL KATZ CODE IS SAVED HEREIN.                 
*                                                                               
         ORG   RCONBPCL                                                         
RCONKTDM DS    CL2                 UNRECOGNIZED KATZ DEMO                       
         DS    CL3                                                              
*                                                                               
RCONBRPT DS    CL1       A         BOP REPORT (Y OR N) - NOT USED 6/86          
RCONBAWK DS    CL1       B         AIR WEEKS                                    
RCONBORD DS    CL1       A         ORDER PLACED?  Y OR N (DEFAULT)              
RCONBBKS DS    CL6       AN        BOOKS                                        
RCONBMER DS    CL1       A         MERCHANDISING? Y OR N (DEFAULT)              
RCONBBKT DS    CL1       A         BOOK TYPE                                    
         SPACE 1                                                                
RCONBCEL DS    0C        V         BOP COMMENT ELEMENT                          
RCONBCCO DS    CL1       X'11'     ELEMENT CODE                                 
RCONBCLN DS    CL1       B         ELEMENT LENGTH                               
RCONBCOM DS    0C        AN        BOP COMMENTS                                 
         SPACE 1                                                                
RSAREL   DS    0C        V         SAR ELEMENT                                  
RSARCO   DS    CL1       X'12'     ELEMENT CODE                                 
RSARLEN  DS    CL1       B         ELEMENT LENGTH (120)                         
RSAREDT  DS    CL3       B         ENTRY DATE                                   
RSARDEM  DS    CL24      V         DEMOS   (SEE AVAIL) (8 AT 3 BYTES)           
RSARSRC  DS    CL1       C         SOURCE  (SEE AVAIL)                          
RSARBKS  DS    CL18      V         BOOKS   (SEE AVAIL)                          
RSARWKS  DS    CL1       B         WEEKS   (SEE AVAIL)                          
RSARRFRM DS    CL12      X         SECONDS (SEE AVAIL) (6 AT 2 BYTES)           
RSARDPT  DS    CL18      C         UP TO 6 (1-BYTE DAY-PART CODE                
*                                  FOLLOWED BY 2-BYTE COST PER PT AMT           
*                                  OLD WAY-UP TO 6 3 BYTE DPT CODE /            
*                                  NO CPP AMT(BOTH WAYS STILL APPLY)            
RSARBUD  DS    CL18      V         UP TO 6 3-BYTE BUDGET FIELDS                 
*                                  BYTE 1  X'80' REP ESTIMATE (OLD)             
*                                          X'40' DATA IS PER WEEK               
*                                  BYTES   2-3   2 BYTE GRP BUDGET              
RSARBWKS DS    CL8       X         BITS 1-64 ACTIVE WEEKS                       
RSARSHR  DS    CL1       B         SHARE                                        
RSARRDT  DS    CL3       B         RESOLUTION DATE                              
RSARBGT  DS    XL4       X         BUDGET FIELD -NBC ONLY                       
RSARGIND DS    XL1       X         INDICATES GRP W OR T (NBC ONLY)              
RSARGTOT DS    XL3       X         TOTAL GRP'S (NBC ONLY)                       
RSARCTOT DS    XL3       X         TOTAL CPP'S (NBC ONLY)                       
         SPACE 1                                                                
*                                                                               
*   NEW/EXPANDED SAR ELEMENT FOR FORECASTING/RRG REPORTING                      
*       ADDED MAR17/92 (BILL UHR):  REDEFINES X'12' ELEMENT                     
*       BY ADDING ADDITIONAL FIELDS                                             
*                                                                               
RSARXEL  DS    0C        V         EXPANDED SAR ELEMENT                         
RSARXCO  DS    CL1       X'12'     ELEMENT CODE                                 
RSARXLEN DS    CL1       B         ELEMENT LENGTH (128)                         
RSARXEDT DS    CL3       B         ENTRY DATE                                   
RSARXDEM DS    CL24      V         DEMOS   (SEE AVAIL) (8 AT 3 BYTES)           
RSARXSRC DS    CL1       C         SOURCE  (SEE AVAIL)                          
RSARXBKS DS    CL18      V         BOOKS   (SEE AVAIL)                          
RSARXWKS DS    CL1       B         WEEKS   (SEE AVAIL)                          
RSARXRFR DS    CL12      X         SECONDS (SEE AVAIL) (6 AT 2 BYTES)           
RSARXDPT DS    CL18      C         UP TO 6 (1-BYTE DAY-PART CODE                
*                                  FOLLOWED BY 2-BYTE COST PER PT AMT           
*                                  OLD WAY-UP TO 6 3 BYTE DPT CODE /            
*                                  NO CPP AMT(BOTH WAYS STILL APPLY)            
RSARXBUD DS    CL18      V         UP TO 6 3-BYTE BUDGET FIELDS                 
*                                  BYTE 1  X'80' REP ESTIMATE (OLD)             
*                                          X'40' DATA IS PER WEEK               
*                                  BYTES   2-3   2 BYTE GRP BUDGET              
RSARXBWK DS    CL8       X         BITS 1-64 ACTIVE WEEKS                       
RSARXSHR DS    CL1       B         SHARE                                        
RSARXRDT DS    CL3       B         RESOLUTION DATE                              
RSARXBGT DS    XL4       B         FORECASTING BUDGET:  SPREAD ACROSS           
*                                       CONTRACT FLIGHT INTO X'23'              
*                                       FORECASTING BUCKETS                     
RSARXGIN DS    XL1       X         INDICATES GRP W OR T (NBC ONLY)              
RSARXGTO DS    XL3       X         TOTAL GRP'S (NBC ONLY)                       
RSARXCTO DS    XL3       X         TOTAL CPP'S (NBC ONLY)                       
         ORG   RSARXCTO                                                         
*     ******* END OF ORIGINAL X'12' ELEMENT *******                             
*                                                                               
         DS    XL2                 SPARE                                        
RSARXFL2 DS    XL1       B         VARIOUS FLAGS 2                              
*                                  X'80'  - MARKET BUDGET = 'BONUS'             
*                                  X'40'  -   "      "    = 'TRADE'             
*                                  X'20'  -   "      "    = 'DR'                
*                                  X'10'  -   "      "    = 'ORDER'             
*                                  X'08'  -   "      "    = 'PP'                
*                                  X'04'  -   "      "    = 'GEN AVAIL'         
*                                                                               
RSARXFLG DS    XL1       B         VARIOUS FLAGS                                
*                                  X'80'  - BUDGET $$ = MARKET  $$              
*                                    ALL $$ ARE MARKET $$ NOW!!                 
*                                  X'40'  - $0 BUDGET ENTERED                   
*                                  X'20'  - 0% SHARE GOAL ENTERED               
*                                  X'10'  - $$ FLAGGED AS 'FORECAST'            
*                                    IGNORED IF BUYS OR SPL EXIST!              
*                                  X'08'  - FORECAST ORDER - FORCE              
*                                     TO SAR/SPL SCREEN ONLY!                   
*                                  X'04'  - PROPOSAL EXPANSION USED             
*                                  X'02'  - READY TO BOOK                       
*                                                                               
RSARXSHG DS    XL1       B         SHARE GOAL                                   
RSARXPEN DS    CL3       B         PENDING AS-OF DATE                           
RSARXLAD DS    CL3                 LAST ACTIVITY DATE                           
RSARXLTH EQU   *-RSARXEL           ELEMENT LENGTH                               
*                                                                               
*     ***********************************************                           
*                                                                               
RCONCCEL DS    0C        V         CONFLICT CODE EC:BIAS ELEMENT                
RCONCCCO DS    CL1       X'13'     ELEMENT CODE                                 
RCONCCLN DS    CL1       B         ELEMENT LENGTH                               
RCONCCPR DS    CL3       AN        PRODUCT CODE (001-999)                       
RCONCCAD DS    CL3       AN        ADVERT  CODE (001-999)                       
RCONCCCD DS    XL1       AN        CROSS DAY (DEFAULT = MONDAY)                 
*                                  BIT 0=SPARE         X'80'                    
*                                  BIT 1=MONDAY        X'40'                    
*                                  BIT 2=TUESDAY       X'20'                    
*                                  BIT 3=WEDNESDAY     X'10'                    
*                                  BIT 4=THURSDAY      X'08'                    
*                                  BIT 5=FRIDAY        X'04'                    
*                                  BIT 6=SATURDAY      X'02'                    
*                                  BIT 7=SUNDAY        X'01'                    
RCONCCDF DS    XL1                 CROSS-DAY DEFAULT                            
RCONCCAR DS    CL1       AN        AREA:    N,L,R,O                             
RCONCCOT DS    CL1       AN        ORDER TYPE:  1-9  (DEF = 5)                  
RCONCCL1 EQU   *-RCONCCEL          LENGTH IF NO CATEGORY CODE                   
RCONCCCT DS    CL6       AN        CATEGORY CODE (SIX CHARS)                    
RCONCCL2 EQU   *-RCONCCEL          LENGTH IF CATEGORY CODE                      
*                                                                               
*     ***********************************************                           
*                                                                               
*     JDS/2000 ELEMENT FOR ELECTRONIC CONTRACTING                               
*        ALL FIELDS INITIALIZED TO SPACES, EXCEPT FOR                           
*        RCONCJBC, WHICH IS SET TO BINARY ZERO.                                 
*                                                                               
RCONCJEL DS    0C        V         CONFLICT CODE EC:JDS/2000 ELEMENT            
RCONCJCO DS    CL1       X'13'     ELEMENT CODE                                 
RCONCJLN DS    CL1       B         ELEMENT LENGTH (29)                          
RCONCJRC DS    CL2       AN        RATE CARD                                    
RCONCJBC DS    CL3       B         BILLING CUSTOMER # (0-999999)                
*                                     OR BINARY ZERO                            
RCONCJCY DS    CL1       AN        BILLING CYCLE ('E' OR 'W')                   
RCONCJRV DS    CL1       AN        REVENUE CATEGORY (A-Z)                       
RCONCJTF DS    CL1       AN        TRADE FLAG:  ('X' OR X'40')                  
RCONCJP1 DS    CL2       AN        PRODUCT CATEGORY CODE # 1                    
RCONCJP2 DS    CL2       AN        PRODUCT CATEGORY CODE # 2                    
RCONCJCT DS    CL1       AN        COOP TYPE (1, 2, OR 3)                       
RCONCJCS DS    CL3       AN        CONTRACT SEPARATION                          
*                                    STORE AS TOTAL MINUTES                     
*                                    DEFAULT DISPLAY IS HH:MM UNLESS            
*                                    HB=X'80' WHERE MMMM WILL BE DISP.          
RCONCJSH DS    CL1       AN        SPECIAL HANDLING (A-Z)                       
RCONCJIC DS    CL1       AN        INVOICE COMMENTS ('Y' OR X'40')              
RCONCJIM DS    CL2       AN        INVOICE MESSAGE CODE                         
RCONCJST DS    CL1       AN        SALES TAX CODE   (A-Z)                       
RCONCJNR DS    CL1       AN        NRL  ('N', 'R', OR 'L')                      
RCONCJTO DS    CL6       AN        TRAFFIC ORDER NUMBER                         
*                                                                               
*     ***********************************************                           
*                                                                               
RCONAVEL DS    0C        V         AVAIL ELEMENT                                
RCONAVCO DS    CL1       X'14'     ELEMENT CODE                                 
RCONAVLN DS    CL1       B         ELEMENT LENGTH (12)                          
RCONAVBD DS    CL4       B         BUDGET                                       
RCONAVNM DS    CL2       B         NUMBER OF AVAILS                             
RCONAVKP DS    CL1       B         Y=KEEP CONTRACT AND AVAIL                    
         DS    CL3       B         SPARE - BINARY ZEROS                         
*                                                                               
*     ***********************************************                           
*                                                                               
RCONECEL DS    0C        V         EC CONTROL ELEMENT                           
RCONECCO DS    CL1       X'15'     ELEMENT CODE                                 
RCONECLN DS    CL1       B         ELEMENT LENGTH (20)                          
RCONECDT DS    CL2       B         DATE LAST EC'D: COMPRESSED                   
RCONECCT DS    CL2       B         TOTAL # OF EC'S                              
RCONECTM DS    CL2       B         TIME LAST EC'D:                              
RCONECDS DS    CL2       B         DATE LAST STORED (COMPRESSED)                
RCONECTS DS    CL4       C         TIME LAST STORED (HHMM EBCDIC)               
RCONECDX DS    CL2       B         DATE LAST XFERRED (COMPRESSED)               
RCONECTX DS    CL4       C         TIME LAST XFERRED (HHMM EBCDIC)              
*                                                                               
*     ***********************************************                           
*                                                                               
RCONE2EL DS    0C        V         EC CONTROL ELEMENT                           
RCONE2CO DS    CL1       X'16'     ELEMENT CODE                                 
RCONE2LN DS    CL1       B         ELEMENT LENGTH (18)                          
RCONE2DS DS    CL2       B         DATE LAST STORED (COMPRESSED)                
RCONE2TS DS    CL6       C         TIME LAST STORED (HHMMSS EBCDIC)             
RCONE2DX DS    CL2       B         DATE LAST SENT   (COMPRESSED)                
RCONE2TX DS    CL6       C         TIME LAST SENT   (HHMMSS EBCDIC)             
*                                                                               
*     ***********************************************                           
*                                                                               
RCONCBEL DS    0C                  COMBO CONTRACT CONTROL ELEMENT               
RCONCBO  DS    CL1       X'17'     ELEMENT CODE                                 
RCONCBLN DS    CL1       B         ELEMENT LENGTH                               
*                                                                               
*  FOLLOWING ELEMENTS OCCUR FROM 1 TO N TIMES, DEPENDING ON NUMBER              
*   OF STATIONS IN THE COMBO ORDER                                              
*                                                                               
RCONCBST DS    CL5       C         STATION CALL LETTERS + MEDIA                 
RCONCBCN DS    XL4       H         CONTRACT NUMBER                              
RCONCBEN EQU   *                                                                
*                                                                               
****     *********  END OF ELEMENT  ********   ****                             
*                                                                               
*     ***********************************************                           
*                                                                               
RCONDVEL DS    0C                  DEVELOPMENTAL/INVOICE # ELEMENT              
RCONDVO  DS    CL1       X'18'     ELEMENT CODE                                 
RCONDVLN DS    CL1       B         ELEMENT LENGTH                               
*                                                                               
RCONDVSP DS    CL3       A/N       DEVELOPMENTAL SALESPERSON CODE               
RCONDVCT DS    CL2       A/N       DEVELOPMENTAL CONTRACT TYPE CODE             
RCONDVI# DS    XL1       B         NUMBER OF INVOICE ELEMENTS                   
*                                                                               
*    FOLLOWING 6-BYTE COMBINATION OF FIELDS OCCURS N TIMES, DEPENDING           
*       UPON THE VALUE IN 'RCONDVI#'.  UNTIL SUCH TIME AS THE                   
*       RETENTION OF INVOICE NUMBERS IS IMPLEMENTED, 'RCONDVI#' WILL            
*       BE ZERO (0).                                                            
*                                                                               
RCONDVIL DS    X         B         LENGTH OF ENTRY (3+LEN OF INV #)             
RCONDVID DS    XL2       B         INVOICE DATE: YM                             
RCONDVIN DS    0X        A/N       INVOICE NUMBER (UP TO 10 CHARS)              
*                                                                               
*    AT THIS TIME, IT IS ASSUMED THAT THE INVOICE NUMBER WILL BE                
*       A PURELY NUMERIC ITEM.  IF IT IS OTHERWISE, SOME OTHER                  
*       ARRANGEMENT WILL HAVE TO BE MADE.                                       
*                                                                               
         SPACE 1                                                                
*                                                                               
**********************************************************************          
*                                                                               
RCONTKEL DS    0C                  TAKEOVER DARE ELEMENT                        
RCONTKCD DS    X         X'1C'     ELEMENT CODE                                 
RCONTKLN DS    X         B         ELEMENT LENGTH                               
RCONTKRP DS    CL2                 PREVIOUS REP CODE                            
RCONTKCN DS    XL4       PWOS      PREVIOUS CONTRACT NUMBER                     
RCONTKDT DS    XL2       B         TAKEOVER DATE                                
RCONTKTM DS    XL3       B         TAKEOVER TIME                                
RCONTKRC DS    CL10                ID OF SENDER (AGENCY)                        
RCONTKRT DS    CL16                AGENCY RETURN TO SENDER INFO                 
RCONTKAR DS    CL5                 AGENCY ROUTING CODE (FOR JDS ONLY)           
RCONTKFG DS    X         B         FLAGS                                        
RCONTKLQ EQU   *-RCONTKEL          LENGTH                                       
         SPACE 1                                                                
*                                                                               
**********************************************************************          
*                                                                               
RCONDREL DS    0C                  DARE AGENCY ORDER ELEMENT                    
RCONDRCD DS    X         X'1D'     ELEMENT CODE                                 
RCONDRLN DS    X         B         ELEMENT LENGTH                               
RCONDRFG DS    CL1       B         DARE FLAGS                                   
*                                  X'80'  =  LINKED TO AGENCY ORDER             
*                                  X'40'  =  APPROVED: BUYS GENERATED           
*                                  X'20'  =  REJECTED                           
*                                  X'10'  =  RECALLED                           
*                                  X'08'  =  SCHEDULE TYPE IS DAILY             
*                                  X'04'  =  KATZ EDI ORDER                     
*                                  X'02'  =  KATZ EDI 1 SHOT CONVERSION         
*                                  X'01'  =  TAKEOVER DARE ORDER                
RCONDRLK DS    XL4       PWOS      AGY ORDER NUMBER                             
RCONDRDD DS    CL2       B         DATE DELIVERED (COMPRESSED)                  
RCONDRTD DS    CL2       C         TIME DELIVERED (HHMM:  HEXIN)                
RCONDRDA DS    CL2       B         DATE APPROVED  (COMPRESSED)                  
RCONDRTA DS    CL2       C         TIME APPROVED  (HHMM:  HEXIN)                
RCONDRDR DS    CL2       B         DATE REJECTED  (COMPRESSED)                  
RCONDRTR DS    CL2       C         TIME REJECTED  (HHMM:  HEXIN)                
RCONDRLQ EQU   *-RCONDREL          LENGTH                                       
RCONDRF2 DS    X         B         MORE DARE FLAGS                              
*                                  X'80'  =  ORDER IS VARIOUS                   
*                                  X'40'  =  ORDER IS BRAND                     
*                                  X'20'  =  VARIOUS ORDER CONFIRMED            
*                                  X'10'  =  ORDER IS TRUE POOL                 
*                                  X'08'  =  ORDER WAS 'REMOVED'                
*                                  X'04'  =  MANUAL REVISION                    
*                                  X'02'  =  REVISION CANCELLED                 
*                                  X'01'  =  LINK TO XML ORDER                  
RCONDRVN DS    XL4                 VARIOUS ORDER NUMBER IF BRAND                
RCONDRCN DS    XL4                 CONTRACT # LINKED TO VARIOUS ORD             
RCONDRRV DS    X                   REVISION NUMBER                              
RCONDRSF DS    XL1                 SPECIAL FLAGS                                
*                                  X'80'  = SPECIAL ONE TIME FIX FLAG           
*                                           FOR FIXING DARE PURGE PROB          
RCONDL2Q EQU   *-RCONDREL          NEW LENGTH FOR EXPANSION                     
*                                                                               
*                                                                               
*                                                                               
RCONRFEL DS    0C                  RANDOM FLAG ELEMENT                          
RCONRFCD DS    CL1       X'1E'     ELEMENT CODE                                 
RCONRFLN DS    CL1                 ELEMENT LENGTH                               
*                                                                               
RCONRF1  DS    XL1                 FLAG BYTE 1                                  
*                                   X'80' TEAM OVERRIDE                         
*                                   X'40' PROPOSER WAS HERE                     
*                                   X'20' LOCAL ORDER                           
*                                   X'10' ADDED BY REREPBB                      
*                                         (NBC BACK BILLING UPLOAD)             
*                                   X'08' TRADE ORDER                           
*                                   X'04' #MON WAS USED                         
*                                                                               
RCONRF2  DS    XL1                 FLAG BYTE 2                                  
*        ALL SPARE                                                              
*                                                                               
RCONRF3  DS    XL1                 FLAG BYTE 3                                  
*        ALL SPARE                                                              
*                                                                               
RCONRFLT DS    CL6       B         REVISED START END DATES (YMD)                
RCONRBHI DS    X                   HIGHEST BUY # FOR THIS CONTRACT              
* NOT YET IMPLEMENTED!                                                          
RCONRPSP DS    CL3                 PAY S/P CODE                                 
RCONRSPO DS    CL2                 PAY S/P OFFICE CODE                          
*                                                                               
RCONR#MO DS    XL1                 NUMBER OF AVAILABLE MAKEGOOD OFFERS          
*                                                                               
         DS    4C                  SPARE                                        
RCONRFLQ EQU   *-RCONRFEL          ELEM LENGTH                                  
**********************************************************************          
*                                                                               
* WARNING: THE 1F ELEMENT IS ONLY GENERATED FOR ONLINE CONTRACTS                
RCONXEL  DS    0C                  EXTENDED DESCRIPTION ELEMENT                 
         DS    CL1       X'1F'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH (24)                          
RCONASOF DS    XL2                 TRUE AS OF DATE - COMPRESSED                 
RCONMON  DS    XL2                 AS OF DATE (MONDAY)- COMPRESSED              
RCONCONF DS    XL1       X         X'80' - NOT CONFIRMED                        
*                                  X'40' - CONFIRMED NOW                        
*                                  X'20' - CONFIRMED PREVIOUSLY                 
*                                  X'10' - PENDING CONF (PENDCF)                
*                                  X'08' - STATION CONF (STACF)                 
RCONSTAT DS    CL1                 STATUS                                       
*                                  X'01'- LAST CONF BY BATCH CONFIRM            
*                                  X'02'- DON'T SEND (#DS) BUYS ALLOWED         
*                                  X'04'- SPARE                                 
*                                  X'08'- SELWIN HAS BEEN HERE                  
RCONTRF  DS    CL10      A/N       TRAFFIC NUMBER                               
RCONTOT  DS    CL4       B         TOTAL (2 DECIMALS)                           
RCONKZC# DS    CL1       B         KATZ CONVERSION NUMBER                       
RCONCFX# DS    XL1       B         CFX MOD NUMBER                               
*                                  X'00' = NOT CFX'ED                           
*                                  X'FF' = CFX'ED AT MOD NUM 0                  
*                                  ALL ELSE IS ACTUAL CFX'ED MOD NUM            
         SPACE 1                                                                
*                                                                               
RCONSEND DS    0C                  ELEMENT FOR SEND INFO                        
RCONSNCO DS    CL1       X'20'     ELEMENT CODE                                 
RCONSNLN DS    CL1                 LENGTH (OLD=30, NEW=35)                      
*                                          NEWEST=41                            
RCONSSID DS    CL2                 REP SENDING ID                               
RCONSENF DS    CL1                 X'80' LAST SENT BY REP                       
*                                  X'40' LAST SENT BY STATION                   
*                                  X'20' REP VERSION NO. NOT ADVANCED           
*                                  X'10' STA VERSION NO. NOT ADVANCED           
*                                  X'08' SAR/BOP INFO UPDATED                   
*                                  X'04' SPL/EPL INFO UPDATED                   
*                                  X'02' LAST CONF BY STATION                   
*                                  X'01' LAST DONE BY REP (TAKEOVER)            
RCONSRV  DS    CL1                 REP VERSION NUMBER                           
RCONSRDT DS    CL2                 DATE REP SENT ORDER                          
RCONSRTI DS    CL6                 TIME REP SENT ORDER                          
RCONSSV  DS    CL1                 STATION VERSION NUMBER                       
RCONSSDT DS    CL2                 DATE STATION SENT ORDER                      
RCONSSTI DS    CL6                 TIME STATION SENT ORDER                      
*                                                                               
* THE FOLLOWING WAS THE DSECT PRIOR TO ENABLING STATION MULTI-SENDS             
*                                                                               
RCONSRD1 DS    XL2                 REP VERSION DATE (< RCONSRD2)                
RCONSRD2 DS    XL2                 REP VERSION DATE (< RCONSRD3)                
RCONSRD3 DS    XL2                 REP VERSION DATE (MOST CURRENT)              
*                                                                               
RCONSSD1 DS    XL2                 STA VERSION DATE (< RCONSSD2)                
RCONSSV1 DS    X                   STA VERSION NUMBER                           
RCONSSD2 DS    XL2                 STA VERSION DATE (< RCONSSD3)                
RCONSSV2 DS    X                   STA VERSION NUMBER                           
RCONSSD3 DS    XL2                 STA VERSION DATE (MOST CURRENT)              
RCONSSV3 DS    X                   STA VERSION NUMBER                           
RCONSNLQ EQU   *-RCONSEND          ELEM LEN PRIOR TO STA MULTI-SEND             
*                                                                               
* THE FOLLOWING KEEPS TRACK OF LAST 3 VERSION DATES AS WELL AS THE              
* VERSION NUMBERS CORRESPONDING TO THESE DATES FOR BOTH STA AND REP             
*                                                                               
         ORG   RCONSSD1                                                         
RCONSRV1 DS    X                   REP VERSION NUMBER                           
RCONSRV2 DS    X                   REP VERSION NUMBER                           
RCONSRV3 DS    X                   REP VERSION NUMBER                           
*                                                                               
RCONS2D1 DS    XL2                 STA VERSION DATE (< RCONSSD2)                
RCONS2D2 DS    XL2                 STA VERSION DATE (< RCONSSD3)                
RCONS2D3 DS    XL2                 STA VERSION DATE (MOST CURRENT)              
RCONS2V1 DS    X                   STA VERSION NUMBER                           
RCONS2V2 DS    X                   STA VERSION NUMBER                           
RCONS2V3 DS    X                   STA VERSION NUMBER                           
RCONSN2Q EQU   *-RCONSEND          ELEMENT LENGTH                               
*                                                                               
RCONSRVF DS    X                   REP FIRST SEND VERSION NUMBER                
RCONSRDF DS    XL2                 REP FIRST SEND DATE                          
RCONSSVF DS    X                   STA FIRST SEND VERSION NUMBER                
RCONSSDF DS    XL2                 STA FIRST SEND DATE                          
RCONSN3Q EQU   *-RCONSEND          MOST CURRENT ELEMENT LENGTH                  
         SPACE 1                                                                
RCONMGEL DS    0C                  MAKEGOOD OFFERS SEND ELEMENT                 
RCONMGCD DS    CL1       X'21'     ELEMENT CODE                                 
RCONMGLN DS    CL1                 ELEMENT LENGTH                               
RCONMGFG DS    X                   STATUS/FLAGS                                 
*                                  X'80': MG OFFER WIP, VERS# BUMPED            
*                                  X'40': LAST SENT BY REP                      
*                                  X'20': LAST SENT BY STA                      
RCONMGDT DS    XL2                 DATE LAST SENT (COMPRESSED)                  
RCONMGTM DS    XL3                 TIME LAST SENT                               
RCONMGCT DS    XL1                 OUTSTANDING MAKEGOOD OFFERS EXISTS           
*                                  X'80' = MG EXISTS (FOR RIS KEYS)             
         DS    XL2                 SPARE                                        
RCONMGLQ EQU   *-RCONMGEL          ACTUAL ELEMENT LENGTH                        
*                                                                               
* NEW MG SEND ELEMENT HAS SEPARATE REP MG SEND DATE/TIME BELOW AND              
* STATION SEND DATE/TIME IN RCONMGDT/RCONMGTM ABOVE                             
*                                                                               
RCONRMDT DS    XL2                 REP DATE LAST SENT (COMPRESSED)              
RCONRMTM DS    XL3                 REP TIME LAST SENT                           
RCONXMGQ EQU   *-RCONMGEL          NEW ELEMENT LENGTH                           
         SPACE 1                                                                
RMODELEM DS    0C        X'22'     MOD DATE/TIME ELEM                           
RMODELCD DS    CL1                 ELEMENT CODE                                 
RMODELLN DS    CL1                 ELEMENT LENGTH                               
RMODEL1M DS    CL1                 MOST RECENT MOD#                             
RMODEL1V DS    CL1                 MOST RECENT MOD CONFIRMED AT V#              
RMODEL1D DS    CL2                 MOST RECENT MOD DATE                         
RMODEL1T DS    CL6                 MOST RECENT MOD TIME                         
RMODEL2M DS    CL1                 2ND RECENT MOD#                              
RMODEL2V DS    CL1                 2ND RECENT MOD CONFIRMED AT V#               
RMODEL2D DS    CL2                 2ND RECENT MOD DATE                          
RMODEL2T DS    CL6                 2ND RECENT MOD TIME                          
RMODEL3M DS    CL1                 3RD RECENT MOD#                              
RMODEL3V DS    CL1                 3RD RECENT MOD CONFIRMED AT V#               
RMODEL3D DS    CL2                 3RD RECENT MOD DATE                          
RMODEL3T DS    CL6                 3RD RECENT MOD TIME                          
RMODELLQ EQU   *-RMODELEM                                                       
         SPACE 1                                                                
*********************************************************************           
** NOTE: THE HIATUS DATE ELEMENT CAN BE IN ONE OF 2 FORMS.  IF THE              
** CONTRACT IS LINKED TO DARE, THERE ARE MULTIPLE COMPRESSED DATES.             
** IF IT IS NOT, THEN THERE ARE MULTIPLE 3 BYTE ENTRIES CONSISTING OF           
** A COMPRESSED DATE AND A ONE BYTE NUMBER OF DAYS THAT THE HIATUS              
** LASTS FROM THE START DATE (DOESN'T INCLUDE START DATE)                       
RCONHIEL DS    0C                  HIATUS DATE ELEMENT                          
RCONHICO DS    CL1       X'25'     ELEMENT CODE                                 
RCONHILN DS    CL1                 ELEMENT LENGTH                               
RCONHIDT DS    CL2                 VARIABLE NUMBER OF COMPRESSED DATES          
         ORG   RCONHIDT                                                         
RCONHISD DS    CL2                 COMPRESSED START DATE                        
RCONHIND DS    CL1                 NUMBER OF DAYS FROM START DATE               
         SPACE 1                                                                
RCONHCEL DS    0C                  HIATUS COMMENT ELEMENT                       
RCONHCCO DS    CL1       X'26'     ELEMENT CODE                                 
RCONHCLN DS    CL1                 ELEMENT LENGTH                               
RCONHCCM DS    0C                  VARIABLE LENGTH COMMENT                      
         SPACE 1                                                                
RCONKAEL DS    0C                  KATZ ACTUALIZATION ELEMENT                   
RCONKACO DS    CL1       X'27'     ELEMENT CODE                                 
RCONKALN DS    CL1                 ELEMENT LENGTH                               
RCONKALM DS    CL2                 LAST MONTH ACTUALIZED:  YM BINARY            
RCONKADA DS    CL2                 DATE OF ACTUALIZATION:  YMD COMP             
         SPACE 1                                                                
*********************************************************************           
* PROPOSAL EXPANSION ELEMENTS                                                   
*    X'40'  ELEMENT IS FOR BOOKS                                                
*    X'41'  ELEMENT IS FOR DAYPARTS/CPP'S                                       
*                                                                               
RCPRBKEL DS    0C                  REP PROPOSAL BOOK ELEMENT                    
RCPRBKCO DS    CL1                 ELEMENT CODE                                 
RCPRBKEQ EQU   X'40'                                                            
RCPRBKLN DS    CL1                 ELEMENT LENGTH                               
RCPRBKOQ EQU   *-RCPRBKEL          OVERHEAD                                     
RCPRBKBK DS    0CL5                A(FIRST BOOK)                                
*                               ZERO IN FIRST BYTE INDICATES BOOK               
*                               NON-ZERO IDICATES USER DEFINED LABEL            
*                                                                               
RCPRDPEL DS    0C                  REP PROPOSAL DAYPART/CPP ELEMENT             
RCPRDPCO DS    CL1                 ELEMENT CODE                                 
RCPRDPEQ EQU   X'41'                                                            
RCPRDPLN DS    CL1                 ELEMENT LENGTH                               
RCPRDPOX EQU   *-RCPRDPEL          OLD OVERHEAD                                 
RCPRDPFL DS    CL1                 FLAGS                                        
RCPRDPMQ EQU   X'80'                 -  USES DAYPART MENU                       
*                                                                               
RCPRDPOQ EQU   *-RCPRDPEL          OVERHEAD                                     
RCPRDPDP DS    0CL(1+4)            A(FIRST DAYPART/CPP PAIR)                    
*                               1 BYTE DDAYPART                                 
*                               4 BYTES CPP                                     
*                                                                               
         SPACE 1                                                                
RCONMMEL DS    0C                  MOVE HISTORY/TAKEOVER ELEMENT                
RCONMMCD DS    CL1       X'2A'     ELEMENT CODE                                 
RCONMMLN DS    CL1                 ELEMENT LENGTH                               
RCONMMDT DS    XL2                 DATE MOVED/TAKEN OVER                        
RCONMMOC DS    CL4                 ORIGINAL K NUMBER                            
RCONMMOR DS    CL2                 ORIGINAL REP CODE                            
RCONMMLQ EQU   *-RCONMMEL                                                       
         SPACE 1                                                                
RCON16EL DS    0C                  STATION CLOSEOUT RE16 HISTORY ELEM           
RCON16CD DS    CL1       X'2B'     ELEMENT CODE                                 
RCON16LN DS    CL1                 ELEMENT LENGTH                               
RCON16DT DS    XL2                 ACTIVITY DATE                                
RCON16LQ EQU   *-RCON16EL                                                       
         SPACE 1                                                                
RCON2CEL DS    0C                  MOVE HISTORY/BACKBILL ELEMENT                
RCON2CCD DS    CL1       X'2C'     ELEMENT CODE                                 
RCON2CLN DS    CL1                 ELEMENT LENGTH                               
RCON2CDT DS    XL2                 DATE MOVED/TAKEN OVER                        
RCON2COC DS    CL4                 ORIGINAL K NUMBER                            
RCON2COR DS    CL2                 ORIGINAL REP CODE                            
RCON2CLQ EQU   *-RCON2CEL                                                       
         SPACE 1                                                                
*                                                                               
* DARE SPOT COUNT ELEMENT                                                       
*                                                                               
RCON2DEL DS    0C                                                               
RCON2DCD DS    CL1       X'2D'     ELEMENT CODE                                 
RCON2DLN DS    CL1                 ELEMENT LENGTH                               
RCON2DDT DS    XL2                 DATE OF FIRST CONFIRMATION                   
*                                                                               
* FOLLOWING 2 FIELDS TAKEN FROM RDARTSPT AND RDARTDOL IN X'41' RECORD           
*                                                                               
RCON2DTS DS    XL3       B         TOTAL SPOTS AT FIRST CONFIRMATION            
RCON2DTD DS    XL6       PACKED    TOTAL DOLLARS AT FIRST CONFIRMATION          
RCON2DLQ EQU   *-RCON2DEL                                                       
*                                                                               
RCON2EEL DS    0C                  MOVE HISTORY/TAKEOVER ELEMENT                
RCON2ECD DS    CL1       X'2E'     ELEMENT CODE                                 
RCON2ELN DS    CL1                 ELEMENT LENGTH                               
RCON2EDT DS    XL2                 DATE MOVED/TAKEN OVER                        
RCON2EED DS    CL3                 EFFECTIVE DATE                               
         DS    CL5                 SPARE                                        
RCON2ELQ EQU   *-RCON2EEL                                                       
         SPACE 1                                                                
*                                                                               
RCONRER  DS    0C                  NEW EXCLUDE RER ELEMENT                      
         DS    CL1       X'2F'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH (18)                          
RCONXRER DS    CL2                 DATE EXCLUDED (COMPRESSED)                   
RCONURER DS    CL2                 DATE UNEXCLUDED (COMPRESSED)                 
RCONFRER DS    CL1                 EXCLUDE RER FLAG                             
*                                  X'00' DON'T EXCLUDE CONTRACT                 
*                                  X'01' EXCLUDE CONTRACT                       
         DS    CL11                SPARE BYTES                                  
*                                                                               
*                                                                               
RCONWCEL DS    0C                  WEB CONFIRM FLAG ELEMENT                     
RCONWCCD DS    CL1       X'30'     ELEMENT CODE                                 
RCONWCLN DS    CL1                 ELEMENT LENGTH                               
RCONWCFG DS    XL1                 FLAG                                         
*                                  X'80' = STACF (WEB CONFIRMED)                
*                                  SET ONLY IF ACTIVE EDI ORDER LINKED          
RCONWCDT DS    XL2                 STACF DATE                                   
RCONWCTM DS    XL3                 STACF TIME                                   
RCONWCLQ EQU   *-RCONWCEL                                                       
*                                                                               
RCONCUEL DS    0C                  SCRIPT CONTRACT UPLOAD ELEMENT               
RCONCUCD DS    CL1       X'3C'     ELEMENT CODE                                 
RCONCULN DS    CL1                 ELEMENT LENGTH                               
RCONCUAL DS    CL10                STATION ALIAS                                
RCONCUW# DS    CL10                TRAFFIC ORDER NUMBER                         
RCONCUCT DS    X                   UPLOAD COUNTER                               
RCONCU1D DS    XL2                 1ST UPLOAD DATE                              
RCONCU1T DS    XL2                 1ST UPLOAD TIME                              
*                                  LAST 3 UPLOAD DATE/TIME                      
RCONCU2D DS    XL2                                                              
RCONCU2T DS    XL2                                                              
RCONCU3D DS    XL2                                                              
RCONCU3T DS    XL2                                                              
RCONCU4D DS    XL2                 MOST RECENT UPLOAD DATE                      
RCONCU4T DS    XL2                 MOST RECENT UPLOAD TIME                      
RCONCUMD DS    XL2                 #MON DATE (MANUAL RCU)                       
RCONCUMT DS    XL2                 #MON TIME (MANUAL RCU)                       
RCONCUMA DS    XL2                 #MON ACTIVITY DATE ENTERED                   
RCONCULQ EQU   *-RCONCUEL          NEW ELEMENT LENGTH                           
*                                                                               
RCONTRDE DS    0C                  TRADE ELEMENT                                
         DS    CL1       X'3F'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH (12)                          
RCONTRD$ DS    CL4                 TRADE CONTRACT TOTAL (2 DECIMAL)             
         DS    CL6                 SPARE BYTES                                  
*                                                                               
*********************************************************************           
*   'TEMPORARY' BUY CODE ELEMENT                                                
*        X'5F' ELEMENT IS AN ELEMENT THAT WILL NEVER BE IN ANY                  
*        RECORD.  IT WILL BE USED IN REREPRG02 WHEN BUCKETS ARE                 
*        GENERATED ON THE FLY FROM SPECIALLY-CODED BUY RECORDS                  
*        TO CARRY THE CODE FROM THE BUY(S) INTO THE RRG PROCESSING              
*        CYCLE.                                                                 
*                                                                               
RCONBUEL DS    0C                  KATZ ADVERT NAME FROM RECORD                 
RCONBUCO DS    CL1       X'5F'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONBUCD DS    3C                  SPECIAL BUY CODE FROM BUY REC                
RCONBUA1 DS    2C                  SPECIAL BUY ATTRIBUTE # 1                    
RCONBUA2 DS    2C                  SPECIAL BUY ATTRIBUTE # 2                    
RCONBUA3 DS    2C                  SPECIAL BUY ATTRIBUTE # 3                    
         DS    CL1                 SPARE                                        
         SPACE 1                                                                
*********************************************************************           
*   KATZ CICS EDI STORAGE ELEMENT                                               
*        X'6D' ELEMENT CONTAINS ORIGINAL KATZ MOD/VERSION INFO                  
*                                                                               
RCONCIEL DS    0C                  KATZ MOD/VERSION FROM RECORD                 
RCONCICO DS    CL1       X'6D'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONCIRF DS    CL43                CICS EDI REFERENCE ELEMENT                   
         SPACE 1                                                                
*********************************************************************           
*   KATZ MOD/VERSION STORAGE ELEMENT                                            
*        X'6E' ELEMENT CONTAINS ORIGINAL KATZ MOD/VERSION INFO                  
*                                                                               
RCONMVEL DS    0C                  KATZ MOD/VERSION FROM RECORD                 
RCONMVCO DS    CL1       X'6E'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONMVTP DS    CL2                 KCXTYPE FIELD                                
RCONMVLT DS    CL2                 KLSTXMIT FIELD                               
         SPACE 1                                                                
*********************************************************************           
*   KATZ ADVERTISER ELEMENTS:                                                   
*        X'6F' ELEMENT IS ADVERTISER NAME FROM RECORD                           
*                                                                               
RCONKFEL DS    0C                  KATZ ADVERT NAME FROM RECORD                 
RCONKFCO DS    CL1       X'6F'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONKFNM DS    0C                  UP TO 30 CHARS                               
         SPACE 1                                                                
*********************************************************************           
*   KATZ ADDRESS ELEMENTS:                                                      
*        FIRST ELEMENT IS AGENCY NAME FROM RECORD                               
*        NEXT 3 ELEMENTS ARE 3 LINES OF ADDRESS TO APPEAR ON ANY                
*        PAPERWORK, RATHER THAN ADDRESS FROM AGENCY RECORD.  THIS               
*        WAS NECESSITATED BY THE LACK OF AGENCY/OFFICE INFORMATION              
*        DIFFERENTIATING MAILING ADDRESSES DURING THE KATZ CONTRACT             
*        CONVERSIONS.                                                           
*                                                                               
RCONK0EL DS    0C                  KATZ AGENCY NAME FROM RECORD                 
RCONK0CO DS    CL1       X'70'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONK0NM DS    0C                  UP TO 30 CHARS                               
         SPACE 1                                                                
RCONK1EL DS    0C                  KATZ ADDRESS LINE 1                          
RCONK1CO DS    CL1       X'71'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONK1AD DS    0C                  UP TO 30 CHARS                               
         SPACE 1                                                                
RCONK2EL DS    0C                  KATZ ADDRESS LINE 2                          
RCONK2CO DS    CL1       X'72'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONK2AD DS    0C                  UP TO 30 CHARS                               
         SPACE 1                                                                
RCONK3EL DS    0C                  KATZ ADDRESS LINE 3                          
RCONK3CO DS    CL1       X'73'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONK3AD DS    0C                  UP TO 30 CHARS                               
         SPACE 1                                                                
**********************************************************************          
RCONK4EL DS    0C                  KATZ MASTER CONTRACT ELEMENT                 
RCONK4CO DS    CL1       X'74'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH (VARIABLE)                    
RCONK4MC DS    CL7                 MASTER CONTRACT NUMBER                       
RCONK4PP DS    CL3                 POINT PERSON CODE                            
RCONK4PN DS    CL1                 POINT PERSON NAME                            
         SPACE 1                                                                
RCONK5EL DS    0C                  KATZ POINT PERSON PHONE NUMBER               
RCONK5CO DS    CL1       X'75'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH (VARIABLE)                    
RCONK5PH DS    CL10                POINT PERSON PHONE NUMBER                    
         SPACE 1                                                                
**********************************************************************          
         SPACE 1                                                                
RCONK6EL DS    0C                  PETRY ORIGINAL CATEGORY CODE                 
RCONK6CO DS    CL1       X'76'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH (VARIABLE)                    
RCONK6CT DS    CL4                 CATEGORY CODE                                
         SPACE 1                                                                
**********************************************************************          
         SPACE 1                                                                
RCONK7EL DS    0C                  PETRY ORIGINAL MOD/VERSION INFO              
RCONK7CO DS    CL1       X'77'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONK7CT DS    CL4                 CONTROL                                      
RCONK7MD DS    CL4                 MOD #                                        
RCONK7VR DS    CL4                 VERSION                                      
RCONK7EF DS    CL4                 EOP FLAGS                                    
         SPACE 1                                                                
**********************************************************************          
RCONROEL DS    0C                  REP ORDER COMMENT                            
RCONROCO DS    CL1       X'82'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONROCM DS    0C                  EACH CAN BE UP TO 60 CHARS                   
         SPACE 1                                                                
RCONSOEL DS    0C                  STATION ORDER COMMENT                        
RCONSOCO DS    CL1       X'92'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONSOCM DS    0C                  EACH CAN BE UP TO 60 CHARS                   
         SPACE 1                                                                
RCONXOEL DS    0C                  SA EMAIL OVERRIDE                            
         DS    CL1       X'9E'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONXOSA DS    0C                  SALES ASSISTANT EMAIL                        
         SPACE 1                                                                
RCONXXEL DS    0C                  EXTRA DESCRIPTION ELEMENT                    
         DS    CL1       X'9F'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH (40) WAS 80                   
RCONXADV DS    CL10      AN        STATION ADVERTISER CODE                      
RCONXAGY DS    CL10      AN        STATION AGENCY CODE                          
RCONXAST DS    CL9       AN        SALES ASSISTANT                              
         DS    CL9                 SPARE                                        
         SPACE 1                   THIS ELEMENT TIES TO THE '9F'                
RCONOREL DS    0C                  SALESPERSON/SALES OFFICE ELEMENT             
         DS    CL1       X'A0'     ELEMENT CODE                                 
         DS    CL1                 ELEMENT LENGTH                               
RCONOOFF DS    CL6       AN        STATION OFFICE CODE                          
RCONOSAL DS    CL6       AN        STATION SALESPERSON CODE                     
         DS    CL10      AN        SPARE                                        
RCONOEQU EQU   *-RCONOREL          SOFT LENGTH                                  
         SPACE 1                                                                
RUNIEL   DS    0C                  UNI SUPPLEMENTARY WORKSHEET ELEMENT          
RUNICO   DS    CL1       X'A1'     ELEMENT CODE                                 
RUNILEN  DS    CL1                 ELEMENT LENGTH                               
RUNICSH  DS    XL1                 CASH                                         
RUNITRDE DS    XL1                 TRADE                                        
RUNINON  DS    XL1                 NON-CM                                       
RUNIPAMT DS    CL3                 PPC                                          
RUNISAMT DS    CL3                 SPC                                          
RUNIBILL DS    CL1                 BILLING (STANDARD,CALENDAR,WEEKLY)           
RUNILOC  DS    XL1                 1=LOCAL,2=NATIONAL,3=LOPOL,4=NAPOL           
RUNISPTP DS    CL1                 PRINT SPOT PRICES?                           
RUNIMPRD DS    CL1                 MULTI-PRODUCT?                               
RUNISEPI DS    CL1                 SEPARATE INVOICES?                           
RUNIRMK  DS    0XL4                REMARK NUMBER                                
RUNIRMK1 DS    XL1                                                              
RUNIRMK2 DS    XL1                                                              
RUNIRMK3 DS    XL1                                                              
RUNIRMK4 DS    XL1                                                              
         DS    CL8                 SPARE                                        
         SPACE 1                                                                
RCONIEL  DS    0CL32               EASI CODE ELEMENT                            
RCONICD  DS    CL1       X'A2'     ELEMENT CODE                                 
RCONILN  DS    CL1       X'20'     ELEMENT LENGTH                               
RCONIADV DS    CL4                 ADVERTISER CODE                              
RCONIPRD DS    CL4                 PRODUCT CODE                                 
RCONIEST DS    CL4                 ESTIMATE                                     
*                                  CHECK RCONXEST IF RCONIEST                   
*                                  CONTAINS NULLS OR BLANKS                     
*                                  NEW INPUTS WILL MIGRATE TO RCONXEST          
RCONIPR2 DS    CL4                 PIGGY/PARTNER PRODUCT CODE                   
RCONXEST DS    CL10                ESTIMATE (EXPANDED FIELD)                    
         DS    XL4                 SPARE                                        
*                                                                               
* SONNET WORKING ELEMENT                                                        
*                                                                               
RCONSON  DS    0C                  SONNET ELEMENT                               
RCONSONE DS    CL1       X'A3'     ELEMENT CODE                                 
RCONSONL DS    CL1                 ELEMENT LENGTH (VARIABLE)                    
RCONSDTE DS    CL2                 DATE ELEM CREATED                            
RCONSRVR DS    CL1                 REP SENT VERSION NUMBER                      
RCONSONS DS    CL1                 STATUS X'01'=ORDER SENT BY REP               
*                                  STATUS X'02'=MKGD SENT BY REP                
*                                  STATUS X'03'=EC                              
*                                                                               
RCONSNST DS    CL1                 X'FF' - COMPLETED SONNET CYCLE               
         DS    CL3                 SPARE                                        
RCONSOVQ EQU   *-RCONSON                                                        
*                                  MAX NUMBER OF MINI ELEMS = 10                
RCONSONM DS    0CL6                MEMBER MINI ELEM                             
         DS    CL3       A         MEMBER ID                                    
         DS    CL2                 DATE ADDED (BLANK = AWAITING THIS            
*                                              MEMBERS APPROVAL)                
         DS    CL1                 Y/N = APPROVED/NOT APPROVED                  
         SPACE 1                                                                
*                                                                               
* SONNET COMMENT ELEMENT                                                        
*                                                                               
RCONSCEL DS    0C                  SONNET COMMENT ELEMENT                       
RCONSCCO DS    CL1       X'A5'     ELEMENT CODE                                 
RCONSCLN DS    CL1                 ELEMENT LENGTH (VARIABLE)                    
RCONSCOV EQU   *-RCONSCEL          ELEMENT OVERHEAD                             
RCONSCCM DS    0C                  START OF COMMENT TEXT                        
         SPACE 1                                                                
*                                                                               
* ALTERNATE CALENDER ELEMENT                                                    
*                                                                               
RCONAXEL DS    0C        V             ALTERNATE CALENDAR ELEMENT               
RCONAXCO DS    CL1       X'A4'         ELEMENT CODE                             
RCONAXLN DS    CL1       B             ELEMENT LENGTH                           
RCONAXFL DS    CL1       B             FLAGS                                    
*                        X'80'         USES REP LEVEL CALENDAR                  
*                        X'40'         USES STATION LEVEL CALENDAR              
*                        X'01'         RECORD WAS INITIALIZED                   
*                                                                               
RCONAXID DS    CL3       B             PWOS DATE OF INITIAZER RUN               
RCONAXTG DS    CL1       B             CREATION INFORMATION                     
*                        X'80'         CREATED BY HIST / ACAL                   
         DS    CL08      B             SPARE                                    
RCONAXLQ EQU   *-RCONAXEL                                                       
         SPACE 1                                                                
*                                                                               
* CONTRACT COVERSHEET LINK ELEMENT                                              
*                                                                               
RCONCVEL DS    0C        V         CONTRACT COVERSHEET LINK ELEMENT             
RCONCVCD DS    CL1       X'A6'     ELEMENT CODE                                 
RCONCVLN DS    CL1                 ELEMENT LENGTH                               
RCONCVNM DS    CL8                 COVERSHEET NAME                              
*                                     NAMED:  IDENTIFIER                        
*                                  CONTRACT:                                    
*                                     HIGH ORDER BYTE = X'FF'                   
*                                     LOW-ORDER 4 BYTES = CON#                  
         DS    CL10                SPARE                                        
RCONCVLQ EQU   *-RCONCVEL                                                       
         SPACE 1                                                                
*                                                                               
* STARTING 5/20/13 THIS ELEMENT NO LONGER UPDATED BY REEZP00 (SKUI)             
*                                                                               
* EZ-POST ACTIVITY ELEMENT                                                      
*                                                                               
RCONEZEL DS    0C        V         EZ-POST ACTIVITY ELEMENT                     
RCONEZCD DS    CL1       X'A7'     ELEMENT CODE                                 
RCONEZLN DS    CL1                 ELEMENT LENGTH                               
RCONEZNM DS    XL2                 NUMBER OF DOWNLOADS                          
RCONEZ1D DS    XL3                 JULIAN DATE OF 1ST DOWNLOAD                  
RCONEZLD DS    XL3                 JULIAN DATE OF LAST DOWNLOAD                 
         DS    CL10                SPARE                                        
RCONEZLQ EQU   *-RCONEZEL                                                       
         SPACE 1                                                                
*                                                                               
* MEDIA OCEAN PARALLEL PROCESS ELEMENT                                          
*                                                                               
RCONMOEL DS    0C        V         MEDIA OCEAN PARALLEL PROCESS ELT             
RCONMOCD DS    CL1       X'A8'     ELEMENT CODE                                 
RCONMOLN DS    CL1                 ELEMENT LENGTH                               
RCONMOV# DS    CL1                 ELEMENT VERSION NUMBER                       
RCONMOC# DS    XL10                MEDIA OCEAN CONTRACT NUMBER                  
         DS    XL19                SPARE                                        
RCONMOLQ EQU   *-RCONMOEL                                                       
         SPACE 1                                                                
*                                                                               
* STATION USERNAME ELEMENT         0-1 OF SUCH ELEMENT MAY PRESENT              
* IF USER NAME IS X'00' IT MEANS IT HAS BEEN BLANKED OUT                        
*                                                                               
RCONSUEL DS    0C        V         STATION USERNAME ELEMENT                     
RCONSUCD DS    CL1       X'A9'     ELEMENT CODE                                 
RCONSUEQ EQU   X'A9'               ELEMENT CODE                                 
RCONSULN DS    CL1                 ELEMENT LENGTH                               
RCONSUDT DS    XL3                 LAST CHANGED DATE                            
         DS    XL5                 SPARE                                        
RCONSUOQ EQU   *-RCONSUEL          LENGTH OF OVERHEAD                           
RCONSUNM DS    0CL30               START OF STATION USERNAME (1-30)             
*                                                                               
* STATION USER E-MAIL ADDRESS      0-1 OF SUCH ELEMENT MAY PRESENT              
* IF E-MAIL ADDRESS IS X'00' IT MEANS IT HAS BEEN BLANKED OUT                   
*                                                                               
RCONSEEL DS    0C        V         STATION USER E-MAIL ADDRESS ELEMENT          
RCONSECD DS    CL1       X'AA'     ELEMENT CODE                                 
RCONSEEQ EQU   X'AA'               ELEMENT CODE                                 
RCONSELN DS    CL1                 ELEMENT LENGTH                               
RCONSEDT DS    XL3                 LAST CHANGED DATE                            
         DS    XL5                 SPARE                                        
RCONSEOQ EQU   *-RCONSEEL          LENGTH OF OVERHEAD                           
RCONSEML DS    0CL60               START OF STATION E-MAIL (1-60)               
*                                                                               
**********************************************************************          
*                                                                               
* AGENCY DARE DEMO CATEGORIES                                                   
*                                                                               
**********************************************************************          
*                                                                               
RCONDDEL DS    0C                  AGENCY DARE AGENCY DEMO CATEGORIES           
RCONDDCD DS    X         X'DD'     ELEMENT CODE                                 
RCONDDLN DS    X         B         VARIABLE ELEMENT LENGTH                      
RCONDDCT DS    0XL3      B         DEMO CATEGORY                                
*                                                                               
         SPACE 1                                                                
RCONEDEL DS    0CL06               EDI ELEMENT (KATZ INTERFACE)                 
RCONEDCD DS    CL1       X'ED'     ELEMENT CODE                                 
RCONEDLN DS    CL1       X'06'     ELEMENT LENGTH                               
RCONEDMD DS    CL1                 EDI MOD #                                    
RCONEDDT DS    CL3                 DATE OF MOD #                                
         SPACE 1                                                                
*                                                                               
* NOTE: ELEM CODE X'FC' USED FOR RECORD AUDIT ELEMENT 'REGENAUD'                
*                                                                               
*        *END RCONREC*                                                          
*                                                                               
