*          DATA SET REGENREP   AT LEVEL 012 AS OF 01/02/85                      
*              REP RECORD                                                       
         SPACE 1                                                                
RREPREC  DS    0C        V         RECORD                                       
RREPKEY  DS    0CL27     V         KEY                                          
RREPKTYP DS    CL25      X'01'     RECORD TYPE                                  
RREPKREP DS    CL2       AN        REP CODE                                     
RREPLEN  DS    CL2       B         RECORD LENGTH                                
RREPCNTL DS    CL1       X         CONTROL BYTE                                 
RREPLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
RREPELEM DS    0C                  REP ELEMENT                                  
RREPCODE DS    CL1       X'01'     ELEMENT CODE                                 
RREPELLN DS    CL1       B         ELEMENT LENGTH                               
RREPNAME DS    CL33      AN        REP NAME                                     
RREPADDR DS    CL33      AN        REP ADDRESS                                  
RREPSHRT DS    CL20      AN        REP SHORT NAME                               
RREPABBR DS    CL7       AN        REP ABBREVIATION                             
RREPPROF DS    CL30      AN        PROFILE (DEFAULT=C'0')                       
RREPSPLM DS    CL3       B         SPL MONTH OVERRIDE                           
RREPSPLE DS    CL3       B         OVERRIDE END DATE                            
RREPPAR  DS    CL2                 PARENT REP FOR INVENTORY RECORDS             
RREPFMON DS    CL1       B         FISCAL START MONTH (JAN=1, FEB=2)            
         DS    CL11      -         SPARE                                        
