*          DATA SET REGENCTG   AT LEVEL 003 AS OF 08/11/20                      
*              CATEGORY RECORD                                                  
RCTGREC  DS    0C        V         RECORD                                       
RCTGKEY  DS    0CL27     V         KEY                                          
RCTGKTYP DS    CL23      X'0F'     RECORD TYPE                                  
RCTGKTQ  EQU   X'0F'                                                            
RCTGKREP DS    CL2       AN        REP CODE                                     
RCTGKCTG DS    CL2       AN        CATEGORY CODE                                
RCTGLEN  DS    CL2       B         RECORD LENGTH                                
RCTGCNTL DS    CL1       X         CONTROL BYTE                                 
RCTGLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
RCTGELEM DS    0C                  CATEGORY ELEMENT                             
RCTGCODE DS    CL1       X'01'     ELEMENT CODE                                 
RCTGELLN DS    CL1       B         ELEMENT LENGTH                               
RCTGCLSS DS    CL2       AN        CLASS                                        
RCTGNAME DS    CL30      AN        CATEGORY NAME                                
RCTGPROF DS    CL30      AN        PROFILE (DEFAULT=C'0')                       
         DS    CL30      -         SPARE                                        
