*          DATA SET REGENPGTX  AT LEVEL 005 AS OF 06/19/96                      
*              PROGRAM EXCEPTION  RECORD                                        
         SPACE                                                                  
RPGTREC  DS    1000C               RECORD                                       
         ORG   RPGTREC                                                          
RPGTKEY  DS    0CL27     V         KEY                                          
RPGTKTYP DS    CL24      X'25'     RECORD TYPE                                  
RPGTKREP DS    CL2       AN        REP CODE                                     
RPGTKPGT DS    CL1       X         PROGROM EXCEPTION CODE                       
         SPACE                                                                  
RPGTLEN  DS    CL2       B         RECORD LENGTH                                
RPGTCNTL DS    CL1       X         CONTROL BYTE                                 
RPGTLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE                                                                  
RPGTELEM DS    0C                  DAYPART ELEMENT                              
RPGTCODE DS    CL1       X'01'     ELEMENT CODE                                 
RPGTELLN DS    CL1       B         ELEMENT LENGTH                               
RPGTNAME DS    CL12      AN        PRG EXC. NAME                                
         DS    CL6                 SPARE                                        
