*          DATA SET REGENFLD   AT LEVEL 012 AS OF 05/08/96                      
* TABLE USED BY RELFM01 AND ???????, RELINK BOTH IF CHANGED                     
*                                                                               
* FIELD CODE LETTER                                                             
*                                                                               
FLDTAB   DS    0CL2                                                             
         DC    C'A',AL1(33)             REP NAME                                
         DC    C'B',AL1(20)             REP OFFICE ADDRESS 1                    
         DC    C'C',AL1(34)             REP OFFICE ADDRESS 2                    
         DC    C'D',AL1(33)             REAL REP NAME                           
         DC    C'E',AL1(L'RAGYNAM2)     AGENCY NAME(LONG)                       
         DC    C'F',AL1(20)             BUYER NAME                              
         DC    C'G',AL1(L'RAGY2AD1)     AGENCY ADDRESS 1                        
         DC    C'H',AL1(L'RAGY2AD2)     AGENCY ADDRESS 2                        
         DC    C'I',AL1(36)             AGENCY ADDRESS 3                        
         DC    X'FF'                                                            
