*          DATA SET REGENDART  AT LEVEL 081 AS OF 10/03/02                      
*              DARE DATA BASE RECORDS                                           
***********************************************************************         
* HISTORY OF CHANGES                                                  *         
***********************************************************************         
* 28JUL94 (BU )   ---  ADD 'SOFT/HARD' DELETE BYTES TO RECORDS        *         
*                                                                     *         
* 21DEC94 (BU )   ---  ADD WEEKLY/DAILY FLAG TO BUY DETAIL            *         
*                                                                     *         
* 04JAN95 (SKU)   ---  ADD VIEWED OR PRINTED ACTIVITY ELEMENT         *         
*                                                                     *         
* 22MAR95 (SKU)   --- ADD X'51' REC FOR CONFIRMED ORDERS. A COPY OF   *         
*                     X'41' HEADER REC IS KEPT FOR ROUTING INFO, ETC  *         
*                     FOR FUTURE MAKEGOOD OFFERS                      *         
*                     ALSO CREATED ACTIVITY ELEMENT                   *         
*                                                                     *         
* 22JUN95 (SKU)   --- ADD RECALL DATE/TIME STAMPING                   *         
*                                                                     *         
* 15FEB96 (BU )   --- ADD EDI ELEMENT 'ED' TO HEADER RECORD           *         
*                                                                     *         
* 03MAR97 (SKU)   --- VARIOUS/TRUE POOL ORDERS SUPPORT                *         
*                                                                     *         
* 24SEP97 (SKU)   --- AGENCY REVISION SUPPORT                         *         
*                                                                     *         
* 20APR98 (SKU)   --- DARE DEMOS                                      *         
*                                                                     *         
* 27SEP01 (SKU)   --- ADD HISTORY/AUDIT TRAIL RECORD                  *         
*                                                                     *         
* 10JUL02 (SKU)   --- ADD BUY CHANGE COMMENT ELEMENT                  *         
*                      ***  END TOMBSTONE  ***                        *         
***********************************************************************         
         SPACE 1                                                                
RDARREC  DS    0C        V         RECORD                                       
RDARKEY  DS    0CL27     V         KEY                                          
RDARKTYP DS    X         X'41'     RECORD TYPE                                  
*                        X'51'     HEADER REC FOR CONFIRMED DARE ORDERS         
RDARKSTY DS    X         X'01'     SUB TYPE - ORIGINAL APPROVED COPY            
         DS    XL5                                                              
RDARKREP DS    CL2       AN        REP CODE                                     
RDARKSTA DS    CL6       AN        STATION CODE                                 
RDARKAGY DS    CL3       AN        AGENCY CODE                                  
RDARKAOF DS    CL2       AN        AGENCY OFFICE                                
RDARKORD DS    CL4       H         ORDER NUMBER:  HEX EQUIVALENT                
RDARKRT  DS    CL1       B         RECORD TYPE                                  
*                                  X'10' = AGENCY HEADER                        
*                                  X'15' = HIATUS COMMENT (OPTIONAL)            
*                                  X'20' = STANDARD COMMENT (OPTIONAL)          
*                                  X'30' = ORDER COMMENT    (OPTIONAL)          
*                                  X'35' = PRODUCTS FOR VARIOUS ORDER           
*                                  X'40' = BUY                                  
*                                  X'50' = AGENCY TRAILER                       
*                                  X'60' = AGENCY/REP EQUIV RECORD              
*                                  X'70' = HISTORY/AUDIT TRAIL RECORD           
RDARKSEQ DS    CL1       B         RECORD SEQUENCE                              
*                                     ZERO FOR ALL TYPES EXCEPT                 
*                                        BUYS: LINE NUMBER FROM                 
*                                           BUYHDR RECORD                       
*                                        VARIOUS: BRAND ORDER                   
RDARKSRT DS    CL1       B         SUBRECORD TYPE                               
*                                     ZERO FOR ALL TYPES EXCEPT                 
*                                        BUYS:                                  
*                                  X'00' = BUY HEADER                           
*                                  X'10' = BUY ORBITS                           
*                                  X'20' = BUY COMMENTS                         
*                                  X'30' = BUY DETAILS                          
*                                                                               
         ORG   RDARKEY                                                          
REDIKEY  DS    0CL27               PASSIVE KEY FOR EDI/DARE ORDERS              
REDIKTYP DS    X                                                                
REDIKTYQ EQU   X'E1'               KEY TYPE                                     
         DS    XL13                SPARE                                        
REDIKREP DS    CL2                 REP                                          
REDIKACT DS    C                   ACTION CODE: A=APPROVE, C=CONFIRM            
REDIKCON DS    XL4       PWOS      CONTRACT NUMBER                              
REDIKDTE DS    XL3                 DATE: YYMMDD                                 
REDIKTIM DS    XL3                 TIME: HHMMSS                                 
*                                                                               
RDARLEN  DS    CL2       B         RECORD LENGTH                                
RDARCNTL DS    CL1       X         CONTROL BYTE                                 
RDARLINK DS    CL4       B         LINK ADDRESS                                 
*                                                                               
*********************************************************************           
*                                                                   *           
*        AGENCY HEADER RECORD:  RECORD TYPE X'10'                   *           
*                                                                   *           
*********************************************************************           
*                                                                               
RDARELEM DS    0C                  AGENCY HEADER ELEMENT                        
RDARCODE DS    CL1       X'01'     ELEMENT CODE                                 
RDARELLN DS    CL1       B         ELEMENT LENGTH                               
RDARVER# DS    CL1       AN        DATA VERSION NUMBER                          
RDARSNDR DS    CL10                ID OF SENDER                                 
RDARRCVR DS    CL10                ID OF RECEIVER                               
RDARDATE DS    XL2       B         TWO-BYTE COMPRESSED DATE                     
RDARTIME DS    XL2       B         TIME                                         
RDARMEDI DS    CL1                 MEDIA                                        
RDAREST# DS    CL3       B         ESTIMATE NUMBER                              
RDARESDS DS    CL32                ESTIMATE DESCRIPTION                         
RDARESST DS    CL2       B         ESTIMATE START - 2BYTE, COMPRESSED           
RDARESEN DS    CL2       B         ESTIMATE END   - 2BYTE, COMPRESSED           
RDARREP# DS    CL4       B         HEX REP CON NUMBER                           
RDARRTS  DS    CL16      AN        'RETURN TO SENDER' INFO                      
RDARCORT DS    CL1       A         C=CASH, T= TRADE                             
RDARAGNM DS    CL40      AN        AGENCY NAME                                  
RDARAGAD DS    CL40      AN        AGENCY ADDRESS                               
RDARBUYC DS    CL3       AN        BUYER CODE                                   
RDARBUYR DS    CL24                BUYER NAME                                   
RDARBTEL DS    CL10                BUYER TELEPHONE                              
RDARBXTN DS    CL6                 BUYER EXTENSION                              
RDARBSTS DS    CL1                 STATUS OF ORDER                              
*                                  R  =  REJECTED                               
*                                  A  =  APPROVED                               
*                                  C  =  RECALLED                               
RDARMISC DS    CL1                 MISCELLANEOUS FLAGS                          
*                                  X'80' - ORD RESENT                           
*                                  X'40' - ORD APPROVED AT LEAST ONCE           
*                                  X'20' - ORD HAS NOTDARE STATUS               
*                                  X'10' - ORD IS VARIOUS                       
*                                  X'08' - ORD IS BRAND                         
*                                  X'04' - ORD IS CONFIRMED VARIOUS             
*                                  X'02' - IF VARIOUS ORDER, ALL BRANDS         
*                                          ARE CONFIRMED. FLAG ONLY IN          
*                                          THE X'41' RECORD                     
*                                  X'01' - COMPARISON B/T OLD,NEW ORD           
*                                          IS DONE, DO NOT COMP AGAIN           
RDARDELS DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
*                                  X'20' = RECALL CANCELLED (DELETES)           
*                                                                               
RDARRNUM DS    XL1       B         REVISION NUMBER, 0=ORIGINAL ORDER            
*                                                                               
RDARAGLN EQU   *-RDARELEM          L(AGENCY RECORD)                             
*                                                                               
RDARCLEM DS    0C                  DESCRIPTIVE ELEMENT # 2                      
RDARCLCD DS    XL1       X'02'     ELEMENT CODE                                 
RDARCLEN DS    XL1       B         ELEMENT LENGTH                               
RDARCLI  DS    CL6       AN        CLIENT/ADVERTISER                            
RDARCLNM DS    CL34                CLIENT NAME                                  
RDARPRD1 DS    CL4       AN        PRODUCT CODE 1                               
RDARPRN1 DS    CL34                PRODUCT NAME 1                               
RDARPRD2 DS    CL4       AN        PRODUCT CODE 2                               
RDARPRN2 DS    CL34                PRODUCT NAME 2                               
RDARTDEM DS    CL8                 TARGET DEMO                                  
RDARCLLN EQU   *-RDARCLEM          ELEMENT LENGTH                               
*                                                                               
RDARDMEL DS    0C                  TARGET DEMOS                                 
RDARDMCD DS    XL1       X'03'     ELEMENT CODE                                 
RDARDMLN DS    XL1       B         ELEMENT LENGTH                               
RDARDEM1 DS    CL4                 DEMO VALUE 1                                 
RDARDEM2 DS    CL4                 DEMO VALUE 2                                 
RDARDEM3 DS    CL4                 DEMO VALUE 3                                 
RDARDEM4 DS    CL4                 DEMO VALUE 4                                 
RDARDMLQ EQU   *-RDARDMEL                                                       
*                                                                               
* POINTPERSON (IT'S REALLY SALESPERSON) ELEMENT                                 
*                                                                               
RDARPPEL DS    0C                  POINTPERSON ELEMENT                          
RDARPPCD DS    XL1       X'0A'     ELEMENT CODE                                 
RDARPPLN DS    XL1       B         ELEMENT LENGTH                               
RDARPPRP DS    CL2                 POINTPERSON REP CODE                         
RDARPPSP DS    CL3                 POINTPERSON CODE                             
RDARPPLQ EQU   *-RDARPPEL                                                       
*                                                                               
*                                                                               
RDARBREM DS    0C                  BRAND DESCRIPTION ELEMENT                    
RDARBRCD DS    XL1       X'0B'     ELEMENT CODE                                 
RDARBRLN DS    XL1       B         ELEMENT LENGTH                               
RDARBRVN DS    XL4                 VARIOUS ORDER NUMBER                         
         DS    X                   SPARE                                        
RDARBRLQ EQU   *-RDARBREM                                                       
*                                                                               
RDARFLEM DS    0C                  MISC. FLAGS ELEMENT                          
RDARFLCD DS    XL1       X'0F'     ELEMENT CODE                                 
RDARFLLN DS    XL1       B         ELEMENT LENGTH                               
RDARFLG1 DS    XL1                 X'80' = AMEND                                
*                                  X'01' = UNWIRED                              
         DS    XL7                 SPARE                                        
RDARFLLQ EQU   *-RDARFLEM                                                       
*                                                                               
RDARRCEM DS    0C                  REJECTION COMMENT ELEMENT                    
RDARRCCD DS    XL1       X'10'     ELEMENT CODE                                 
RDARRCEN DS    XL1       B         ELEMENT LENGTH (VARIABLE)                    
RDARRCCM DS    CL1       B         REJECTION COMMENT                            
*                                                                               
RDARRTEM DS    0C                  REJECTION DATE/TIME ELEMENT                  
RDARRTCD DS    XL1       X'20'     ELEMENT CODE                                 
RDARRTEN DS    XL1                 ELEMENT LENGTH (6)                           
RDARRTDT DS    CL2                 REJECTION DATE (COMPRESSED)                  
RDARRTTM DS    CL2                 REJECTION TIME (HEXIN)                       
*                                                                               
RDARVPEM DS    0C                  DATE/TIME OF FIRST VIEWED/PRINTED            
RDARVPCD DS    XL1       X'30'     ELEMENT CODE                                 
RDARVPLN DS    XL1                 ELEMENT LENGTH                               
RDARVPDT DS    XL2                 VIEWED/PRINTED DATE (COMPRESSED)             
RDARVPTM DS    XL2                 VIEWED/PRINTED TIME (HEXIN)                  
RDARVPLQ EQU   *-RDARVPEM                                                       
*                                                                               
RDARRKEM DS    0C                  REKALL DATE/TIME ELEMENT                     
RDARRKCD DS    XL1       X'40'     ELEMENT CODE                                 
RDARRKLN DS    XL1                 ELEMENT LENGTH                               
RDARRKDT DS    XL2                 RECALLED DATE (COMPRESSED)                   
RDARRKTM DS    XL2                 RECALLED TIME (HEXIN)                        
RDARRKLQ EQU   *-RDARRKEM                                                       
*                                                                               
RDAREDEM DS    0C                  EDI ELEMENT                                  
RDAREDCD DS    XL1       X'ED'     ELEMENT CODE                                 
RDAREDLN DS    XL1                 ELEMENT LENGTH                               
RDAREDTY DS    XL1                 ED RECORD TYPE                               
         DS    CL1                 SPARE                                        
RDAREDDT DS    CL80                EDI DATA                                     
RDAREDLQ EQU   *-RDAREDEM                                                       
*                                                                               
*********************************************************************           
*                                                                   *           
*    *** FOR CONFIRMED DARE RECORD TYPE X'51' ONLY ***              *           
*        ACTIVITY ELEMENT TO RECORD DATE/TIME STAMP                 *           
*                                                                   *           
*********************************************************************           
*                                                                               
RDARCFEM DS    0C                  DATE/TIME OF CREATION                        
RDARCFCD DS    XL1       X'F1'     ELEMENT CODE                                 
RDARCFLN DS    XL1                 ELEMENT LENGTH                               
RDARCFDT DS    XL2                 DATE (COMPRESSED)                            
RDARCFTM DS    XL2                 TIME (HEXIN)                                 
RDARCFLQ EQU   *-RDARCFEM                                                       
*                                                                               
*********************************************************************           
*                                                                   *           
*        HIATUS   COMMENT RECORD (OPTIONAL):  RECORD TYPE X'15'     *           
*                                                                   *           
*********************************************************************           
RDARHIEL DS    0C                  DESCRIPTIVE ELEMENT:  STD COMMENT            
RDARHICD DS    CL1       X'01'     ELEMENT CODE                                 
RDARHILN DS    CL1       B         ELEMENT LENGTH                               
RDARHIDL DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
         DS    XL1                 SPARE                                        
*                                                                               
RDARHIE2 DS    0C                  HIATUS ELEMENT:  VARIABLE NUMBER             
*                                     OF ELEMENTS                               
RDARHIC2 DS    CL1       X'02'     ELEMENT CODE                                 
RDARHIL2 DS    CL1       B         VARIABLE ELEMENT LENGTH                      
RDARHIDT DS    CL2                 HIATUS DATE (COMPRESSED)                     
*                                                                               
*                                                                               
*********************************************************************           
*                                                                   *           
*        STANDARD COMMENT RECORD (OPTIONAL):  RECORD TYPE X'20'     *           
*                                                                   *           
*********************************************************************           
RDARELE2 DS    0C                  DESCRIPTIVE ELEMENT:  STD COMMENT            
RDARCOD2 DS    CL1       X'01'     ELEMENT CODE                                 
RDARELL2 DS    CL1       B         ELEMENT LENGTH                               
RDARELDL DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
*                                                                               
RDARSCEL DS    0C                  STANDARD COMMENT ELEMENT                     
*                                     1 PER COUNT IN RDARSCCT                   
RDARSCCD DS    CL1       X'02'     ELEMENT CODE                                 
RDARSCLN DS    CL1       B         VARIABLE ELEMENT LENGTH                      
RDARSCCM DS    CL1       AN        COMMENT (VARIABLE)                           
*                                                                               
*                                                                               
*********************************************************************           
*                                                                   *           
*        ORDER    COMMENT RECORD (OPTIONAL):  RECORD TYPE X'30'     *           
*                                                                   *           
*********************************************************************           
RDARELE3 DS    0C                  DESCRIPTIVE ELEMENT:  ORD COMMENT            
RDARCOD3 DS    CL1       X'01'     ELEMENT CODE                                 
RDARELL3 DS    CL1       B         ELEMENT LENGTH                               
RDARORDL DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
*                                                                               
RDAROREL DS    0C                  ORDER    COMMENT ELEMENT                     
*                                     1 PER COUNT IN RDARORCT                   
RDARORCD DS    CL1       X'02'     ELEMENT CODE                                 
RDARORLN DS    CL1       B         VARIABLE ELEMENT LENGTH                      
RDARORCM DS    CL1       AN        COMMENT (VARIABLE)                           
*                                                                               
*                                                                               
*********************************************************************           
*                                                                   *           
*        VARIOUS PRODUCT RECORD:  RECORD TYPE X'35'                 *           
*                                                                   *           
*********************************************************************           
         ORG   RDARELEM                                                         
RDARPDEL DS    0C                  DESCRIPTIVE ELEMENT:  VARIOUS PRD            
RDARPDCD DS    XL1       X'01'     ELEMENT CODE                                 
RDARPDLN DS    XL1       B         ELEMENT LENGTH                               
RDARPDDL DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
RDARPDFG DS    XL1                 FLAGS                                        
*                                  X'80' = BRAND ORDER IS CONFIRMED             
*                                  X'40' = BRAND ORDER RECEIVED BY REP          
         DS    XL1       B         SPARE                                        
RDARPDC1 DS    CL4                 PRODUCT CODE 1                               
RDARPDN1 DS    CL34                PRODUCT NAME 1                               
RDARPDC2 DS    CL4                 PRODUCT CODE 2                               
RDARPDN2 DS    CL34                PRODUCT NAME 2                               
RDARPDON DS    XL4                 ORDER NUMBER OF THIS BRAND                   
RDARPDLQ EQU   *-RDARPDEL                                                       
*                                                                               
*                                                                               
*********************************************************************           
*                                                                   *           
*        BUY HEADER RECORD:     RECORD TYPE     = X'40'             *           
*                               RECORD SEQUENCE = BUYLINE ID        *           
*                               SUBRECORD TYPE  = X'00'             *           
*                                                                   *           
*********************************************************************           
RDARBYEL DS    0C                  DESCRIPTIVE ELEMENT:  BUY ELEMENT            
RDARBYCD DS    CL1       X'01'     ELEMENT CODE                                 
RDARBYLN DS    CL1       B         ELEMENT LENGTH                               
RDARBYRO DS    CL7       AN        BUY ROTATION                                 
RDARBYRS DS    CL1       AN        BUY ROTATION START DAY                       
RDARBYST DS    CL2       B         START TIME                                   
RDARBYET DS    CL2       B         END   TIME                                   
RDARBYSL DS    CL2       B         TOTAL SPOT LENGTH                            
RDARBYSU DS    CL1       AN        LENGTH UNITS:  S=SECS*, M=MINS               
RDARBYPN DS    CL34      AN        PROGRAM NAME                                 
RDARBYCO DS    XL4       B         COST, WITH PENNIES                           
RDARBYCQ DS    CL1       AN        SPECIAL RATE CODE                            
RDARBYTS DS    CL2       B         PRODUCT TIME SHARE                           
RDARBYOL EQU   *-RDARBYEL          OLD LENGTH                                   
RDARBYDL DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
RDARBYLE EQU   *-RDARBYEL          ELEMENT LENGTH                               
*                                                                               
RDARRVEL DS    0C                  REVISION LINK ELEMENT                        
RDARRVCD DS    CL1       X'10'     ELEMENT CODE                                 
RDARRVLN DS    CL1       B         ELEMENT LENGTH                               
RDARRVBY DS    XL1       B         AGENCY BUY LINK                              
*                                  IF THIS IS AN AGENCY MAKEGOOD BUY,           
*                                  TELL US WHICH TARGET AGENCY BUY THIS         
*                                  BUY MAKES GOOD AGAINST                       
         DS    XL2                 SPARE                                        
RDARRVLE EQU   *-RDARRVEL          ELEMENT LENGTH                               
*                                                                               
RDARBMEL DS    0C                  BUY DEMO ELEMENT                             
RDARBMCD DS    CL1       X'20'     ELEMENT CODE                                 
RDARBMLN DS    CL1       B         ELEMENT LENGTH                               
RDARBDM1 DS    CL7                 DEMO VALUE 1                                 
RDARBDM2 DS    CL7                 DEMO VALUE 2                                 
RDARBDM3 DS    CL7                 DEMO VALUE 3                                 
RDARBDM4 DS    CL7                 DEMO VALUE 4                                 
RDARBMLQ EQU   *-RDARBMEL          ELEMENT LENGTH                               
*********************************************************************           
*                                                                   *           
*        BUY ORBIT  RECORD:     RECORD TYPE     = X'40'             *           
*                               RECORD SEQUENCE = BUYLINE ID        *           
*                               SUBRECORD TYPE  = X'10',(X'11',ETC) *           
*                                                                   *           
*********************************************************************           
RDAROBEL DS    0C                  DESCRIPTIVE ELEMENT:  ORBIT RECD             
RDAROBCD DS    XL1       X'01'     ELEMENT CODE                                 
RDAROBLN DS    XL1       B         ELEMENT LENGTH                               
RDAROBDL DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
         DS    XL1       B         SPARE                                        
*                                                                               
RDAROEEL DS    0C                  ORBIT ELEMENT                                
RDAROECD DS    XL1       X'02'     ELEMENT CODE                                 
RDAROELN DS    XL1       B         ELEMENT LENGTH                               
RDAROERO DS    CL7       AN        ORBIT ROTATION DAYS                          
RDAROESD DS    CL1       AN        ORBIT START DAY                              
RDAROEST DS    CL2       B         ORBIT START TIME                             
RDAROEET DS    CL2       B         ORBIT END   TIME                             
RDAROEPP DS    CL14                ORBIT POSITION PROGRAM                       
RDAROELE EQU   *-RDAROEEL          ELEMENT LENGTH                               
*                                                                               
*********************************************************************           
*                                                                   *           
*        BUY COMMENT RECORD:    RECORD TYPE     = X'40'             *           
*                               RECORD SEQUENCE = BUYLINE ID        *           
*                               SUBRECORD TYPE  = X'20',(X'21',ETC) *           
*                                                                   *           
*********************************************************************           
RDARCMEL DS    0C                  DESCRIPTIVE ELEMENT:  COMMENT RECD           
RDARCMCD DS    XL1       X'01'     ELEMENT CODE                                 
RDARCMLN DS    XL1       B         ELEMENT LENGTH                               
RDARCMDL DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
         DS    XL1       B         SPARE                                        
*                                                                               
RDARCTEL DS    0C                  COMMENT ELEMENT                              
RDARCTCD DS    XL1       X'02'     ELEMENT CODE                                 
RDARCTLN DS    XL1       B         ELEMENT LENGTH                               
RDARCTCM DS    CL1       AN        COMMENT (VARIABLE LENGTH)                    
*                                                                               
* COMMENT IS GENERATED AUTOMATICALLY IF CHANGE IS DETECTED FROM A               
* PREVIOUS VERSION OF ORDER                                                     
*                                                                               
RDARCHEL DS    0C                  BUY CHANGE COMMENT ELEMENT                   
RDARCHCD DS    XL1       X'10'     ELEMENT CODE                                 
RDARCHLN DS    XL1       B         ELEMENT LENGTH                               
RDARCHTP DS    XL1       B         CHANGE TYPE                                  
RDARDTMQ EQU   1                   DAY/TIME                                     
RDARLENQ EQU   2                   LENGTH                                       
RDARRATQ EQU   3                   RATE/SPOT                                    
RDARSPTQ EQU   4                   SPOT/WK                                      
RDARPRGQ EQU   5                   PROGRAM NAME                                 
RDARDEMQ EQU   6                   DEMO                                         
RDARDATQ EQU   7                   DATE                                         
RDARDT2Q EQU   8                   DATE2                                        
RDARNBYQ EQU   9                   NEW BUY LINE                                 
RDARCHCM DS    CL1       AN        COMMENT (VARIABLE LENGTH)                    
*                                                                               
         ORG   RDARCHCM                                                         
RDARCHSD DS    XL2                 COMPRESSED START DATE                        
RDARCHED DS    XL2                 COMPRESSED END DATE                          
RDARCHSP DS    XL2                 NUMBER OF SPOTS ADDED/REMOVED                
*                                                                               
*********************************************************************           
*                                                                   *           
*        BUY DETAIL  RECORD:    RECORD TYPE     = X'40'             *           
*                               RECORD SEQUENCE = BUYLINE ID        *           
*                               SUBRECORD TYPE  = X'30',(X'31',ETC) *           
*                                                                   *           
*********************************************************************           
RDARBDEL DS    0C                  DESCRIPTIVE ELEMENT:  BUY DETAIL             
RDARBDCD DS    XL1       X'01'     ELEMENT CODE                                 
RDARBDLN DS    XL1       B         ELEMENT LENGTH                               
RDARBDDL DS    XL1                 SOFT/HARD DELETE FLAGS                       
*                                  X'80' = SOFT DELETE                          
*                                  X'40' = HARD DELETE                          
RDARBDFL DS    XL1                 X'80'  = DAILY                               
*                                                                               
RDARBUEL DS    0C                  BUY DETAIL ELEMENT                           
RDARBUCD DS    XL1       X'02'     ELEMENT CODE                                 
RDARBULN DS    XL1       B         ELEMENT LENGTH                               
RDARBU$$ DS    CL4       B         SPOT COST WITH PENNIES                       
RDARBUSD DS    XL2       B         START DATE: COMPRESSED FORMAT                
RDARBUWK DS    XL1       B         NUMBER OF WEEKS                              
RDARBUSW DS    XL1       B         SPOTS PER WEEK                               
RDARBULE EQU   *-RDARBUEL          ELEMENT LENGTH                               
*                                                                               
*********************************************************************           
*                                                                   *           
*        AGENCY   TRAILER RECORD           :  RECORD TYPE X'50'     *           
*                                                                   *           
*********************************************************************           
         ORG   RDARELEM                                                         
RDARELE9 DS    0C                  DESCRIPTIVE ELEMENT:  AGENCY TRLR            
RDARCOD9 DS    CL1       X'01'     ELEMENT CODE                                 
RDARELL9 DS    CL1       B         ELEMENT LENGTH                               
*                                                                               
RDARTSPT DS    CL3       B         TOTAL NUMBER OF SPOTS                        
RDARTDOL DS    XL6       PACKED    TOTAL DOLLARS - PACKED DUE TO                
*                                     SIZE OF ORIGINATING FIELD                 
RDAR#REC DS    XL3       B         NUMBER OF RECORDS                            
RDARLTLR EQU   *-RDARELE9          LENGTH OF ELEMENT                            
*                                                                               
*********************************************************************           
*                                                                   *           
*        AGENCY/REP EQUIV RECORD           :  RECORD TYPE X'60'     *           
*                                                                   *           
*********************************************************************           
RDARELEQ DS    0C                  DESCRIPTIVE ELEMENT:  EQUIV TRLR             
RDARCODQ DS    CL1       X'01'     ELEMENT CODE                                 
RDARELLQ DS    CL1       B         ELEMENT LENGTH                               
         DS    CL2                 SPARE                                        
*                                                                               
*                                  EQUIVALENCY ELEMENT                          
RDAREQIV DS    CL1       X'02'     ELEMENT CODE                                 
RDAREQLQ DS    CL1       B         ELEMENT LENGTH                               
*                                  LENGTH DEPENDENT UPON NUMBER OF              
*                                     REP BUYLINES ASSOCIATED                   
RDAREQMS DS    XL2                 MISCELLANEOUS FLAGS                          
RDAREQAG DS    XL1                 AGENCY BUYLINE NUMBER                        
RDAREQRP DS    XL1                 REP BUYLINE NUMBER (VARIABLE)                
*                                                                               
*********************************************************************           
*                                                                   *           
* AGENCY HISTORY/AUDIT TRAIL RECORD        :  RECORD TYPE X'70'     *           
*                                                                   *           
*********************************************************************           
*                                                                               
RDARHSEM DS    0C                  DARE HISTORY                                 
RDARHSCD DS    XL1       X'50'     ELEMENT CODE                                 
RDARHSLN DS    XL1                 ELEMENT LENGTH                               
RDARHSDT DS    XL2                 DATE (COMPRESSED)                            
RDARHSTM DS    XL3                 TIME (HHMMSS)                                
*                                                                               
RDARHSER DS    XL2                 ERROR CODE                                   
         ORG   RDARHSER+1                                                       
RDARHSAC DS    X                   ACTION                                       
*                                  VALID ACTION: RDARHSER IS X'FF',THEN         
DHNEWQ   EQU   C'O'                O=NEW ORDER                                  
DHRESENQ EQU   C'S'                S=RESENT                                     
DHRECALQ EQU   C'C'                C=RECALL                                     
DHREJECQ EQU   C'R'                R=REJECT                                     
DHAPPROQ EQU   C'A'                A=APPROVE                                    
DHCONFIQ EQU   C'F'                F=CONFIRM                                    
DHDELNOT EQU   C'D'                D=DELIVERY NOTIFICATION                      
*                                                                               
RDARHSVR DS    X                   VERSION NUMBER/AGENCY CHANGES                
RDARHSLQ EQU   *-RDARHSEM                                                       
*                                                                               
*                                                                               
