*          DATA SET REGENSTA   AT LEVEL 126 AS OF 09/02/20                      
*                                                                               
**********************************************************************          
*                                                                    *          
*       REGENSTA --- REP STATION FILE RECORD                         *          
*                                                                    *          
* ------------------------------------------------------------------ *          
* UPDATE HISTORY:                                                    *          
*                                                                    *          
* MAY03/89 (MRR) --- ADD FOLLOWING FIELDS TO THE X'08' ELEMENT:      *          
*                      1) REP DESTINATION                            *          
*                      2) REP WORKSHEET INDICATOR                    *          
*                      3) FAX NUMBER                                 *          
*                      4) STATION INTERFACE CODE                     *          
*                                                                    *          
* JUN12/89 (MRR) --- FIX REP DESTINATION ID                          *          
*                                                                    *          
* 11/14/89  PJS  --- ADDED DESTINATION FORMAT CONTRACT FILTER FIELD. *          
*                                                                    *          
* 14FEB90  (EFJ) --- ADD EASI OPTION TO X'08' ELEMENT                *          
*                                                                    *          
* 27FEB90  (EFJ) --- CHANGE EASI OPTION TO RSTAOPT4, REMOVING TWX    *          
*                    TO BE DONE BY EXTERN                            *          
*                                                                    *          
* JUN13/90 (MRR) --- ADD MARKET CODE TO X'08' ELEMENT                *          
*                                                                    *          
* 27MAR91  (EFJ) --- ADD NEW FIELDS TO X'08' ELEM (FL2,TZ,OPT,LUID)  *          
*                                                                    *          
* 01APR91  (EFJ) --- APRIL FOOLS                                     *          
*                    ADD X'0A' ELEM - NEW COMBINED STATION ELEM      *          
*                                                                    *          
* DEC23/91 (MRR) --- >ADD X'82' PASSIVE STATION KEY FOR RRGON        *          
*                                                                    *          
* 27FEB92  (SKU) --- NEW OPTION TO PRINT AGY, ADV AND TRAF# IN K     *          
*                                                                    *          
* MAR03/92 (MRR) --- ADD LIABILITY POSITION FIELD                    *          
*                                                                    *          
* AUG28/92 (BU ) --- ADD 'PREFERRED STATION' INDICATOR FOR COMBO     *          
*                    ORDER DESTINATION                               *          
*                                                                    *          
* MAR24/93 (SKU) --- IF PREFERRED STATION INDICATOR IS C'-', THE     *          
*                    STATION IS NONE PARTICIPATING                   *          
*                                                                    *          
* APR23/93 (SKU) --- ADD STATION ACTIVITY ELEMENT                    *          
*                                                                    *          
* NOV09/93 (BU ) --- ADD ENTRY DATE TO COMBO STATION ELEMENT         *          
*                                                                    *          
* NOV22/93 (BU ) --- ADD STATION COMMENTS FOR ACCOUNTING/70 REPORTS  *          
*                                                                    *          
* MAY12/94 (SKU) --- ADD OPTION 9: FORCE SPL BEFORE SEND             *          
*                                                                    *          
* JUL27/95 (BU ) --- ADD BIT FOR 'KATZ CONVERTED STATION' TO         *          
*                      RSTAXOPT IN X'08' ELT                         *          
*                                                                    *          
* AUG09/95 (BU ) --- ADD X'21' ELT TO CONTAIN KATZ CONVERT DATA      *          
*                    ADD X'22' ELT TO CONTAIN OLD STATION INFO       *          
*                                                                    *          
* APR10/96 (WSB) --- ADD OPTION 9(+10): IF ON, CHECK EOP CODES       *          
*                                                                    *          
* APR17/96 (WSB) --- ADD X'0C' ELT TO CONTAIN FORMER REP/NEW REP     *          
*                                                                    *          
* OCT02/96 (SKU) --- ADD ANOTHER FAX NUMBER FOR FAXING WORKSHEETS    *          
*                                                                    *          
* JUN05/97 (BU ) --- ADD X'23' ELT TO CONTAIN CLOESOUT ACTIVITY INFO *          
*                                                                    *          
* DEC20/97 (BU ) --- ADD PASSIVES FOR X'83' COMBO AND MARKET NAME    *          
*                                                                    *          
* JAN06/98 (BU ) --- ADD PASSIVE X'83' FOR OWNER                     *          
*                                                                    *          
* AUG06/98 (JRD) --- ADD X'51'-X'53' MASTER LEVEL CONTROL ELEMS      *          
*                                                                    *          
* SEP17/98 (JRD) --- ADD X'8304' OWNER/MARKET KEY                    *          
*                                                                    *          
* OCT13/98 (JRD) --- ADD X'49' OWNER HISTORY ELEMENT                 *          
*                                                                    *          
* DEC15/98 (JRD) --- ADD X'48' INVENTORY BOOK LIST LINK ELEMENT      *          
*                                                                    *          
* MAR08/99 (AST) --- RSTAOPT5 STATION PROFILE, FORCES SECTION INPUT  *          
*                                                                    *          
* FEB22/00 (BU ) --- TAKE OVER INVENTORY FLAG                        *          
*                                                                    *          
* DEC20/00 (BU ) --- ADD 'X'0F'' ELT FOR ID NUM AND PASSIVE KEY      *          
*                                                                    *          
* FEB06/02 (BU ) --- ADD 'X'8307' PASSIVE KEY FOR SIGNON             *          
*                                                                    *          
* MAR22/02 (BU ) --- ADD X'25' EMAIL ELEMENT TO RECORD               *          
*                                                                    *          
* JUL26/02 (BU ) --- ADD DEMO MARKET CODE                            *          
*                                                                    *          
* NOV13/02 (BU ) --- ADD PASSIVE FOR UNIQUE ID NUMBER                *          
*                                                                    *          
* JUN26/03 (BU ) --- ADD X'2B' UNIQUE ID CHANGE HIST ELT             *          
*                                                                    *          
* OCT07/03 (BU ) --- ADD PASSIVE FOR PERSONAL ID                     *          
*                                                                    *          
* OCT09/03 (BU ) --- PROFILE FLAG FOR HFS RMP STATION                *          
*                                                                    *          
* NOV24/03 (BU ) ---                                                 *          
*                                                                    *          
* JAN07/05 (BU ) --- ADD 'ALIAS' ELEMENT                             *          
*                                                                    *          
* JUN24/05 (BU ) --- ADD 'STATION BY OFFICE' ELEMENT (X'2D')         *          
*                                                                    *          
* JUL21/05 (BU ) --- ADD 'STATION BY OFFICE' ELEMENT (X'2E')         *          
*                         FOR PROPOSER                               *          
*                                                                    *          
* SEP09/05 (BU ) --- ADD AGENCY-OFFICE PROFILE TO RSTAOPTC FOR       *          
*                    GENERIC EC SPEC                                 *          
*                                                                    *          
* SEP14/05 (BU ) --- ADD DARE ORIGL ORDER BUYLINE BREAKOUT OPTION    *          
*                    TO RSTAOPTC FOR UNIVISION                       *          
*                                                                    *          
* SEP28/05 (BU ) --- ADD MQUEUE OPTION FOR ELECTRONIC CONTRACT       *          
*                    TO RSTAOPTC                                     *          
*                                                                    *          
* OCT17/05 (BU ) --- ADD '2F' MQUEUE ELEMENT                         *          
*                                                                    *          
* JUL02/07 (HQ ) --- REUSE 28 BYTES OF RSTAPROF FOR PROFILE BYTES    *          
*                                                                    *          
* JUL12/07 (BU ) --- STAD SCREEN:  DISPLAY CLOSED BY 'MQ INVOICE'    *          
*                                                                    *          
* JUL25/07 (BU ) --- CREATE STAPRO ELEMENT (3A) TO INCLUDE CUTOFF    *          
*                    DATE: 2E ELEMENT WILL BE AGED OUT.              *          
*                                                                    *          
* AUG04/10 (SMY) --- CREATE 'STATION ALIASES' ELEMENT (3B) FOR RCU   *          
*                    AND 'STATION ALIAS' PASSIVE KEY (830A) FOR RCU  *          
*                                                                    *          
* JAN26/11 (SKU) --- ADD OPTIONS FOR UNIVISION ROLLBACK              *          
*                                                                    *          
* NOV14/11 (SMY) --- USE ANOTHER PROFILE BYTE IN RSTAPROF (RSTAP5)   *          
*                                                                    *          
* MAR17/17 (SKU) --- ADD PROFILE FOR STATIONS USING WIDE ORBIT FORMAT*          
*                                                                    *          
*                    ***  END TOMBSTONE  ***                         *          
*HERE*****************************************************************          
         SPACE 1                                                                
RSTAREC  DS    1000C               RECORD                                       
         ORG   RSTAREC                                                          
RSTAKEY  DS    0CL27     V         KEY                                          
RSTAKTYP DS    CL20      X'02'     RECORD TYPE                                  
RSTAKTQ  EQU   X'02'                                                            
RSTAKPQ  EQU   X'42'               STA PREV COPY                                
RSTAKREP DS    CL2       AN        REP CODE                                     
RSTAKSTA DS    CL5       A         CALL LETTERS (A=AM F=FM BLANK=TV)            
         ORG   RSTAKEY                                                          
RST2KEY  DS    0CL27     V         PASSIVE KEY                                  
RST2KTYP DS    CL17      X'82'     RECORD TYPE                                  
RST2KTQ  EQU   X'82'                                                            
RST2KSTA DS    CL5       AN        CALL LETTERS + BAND                          
RST2KEND DS    CL3       DATE      LEAVE DATE (ZERO MEANS ACTIVE)               
RST2KREP DS    CL2       AN        REP CODE                                     
*                                                                               
         ORG   RSTAKEY                                                          
RST3KEY  DS    0CL27     V         PASSIVE KEY                                  
RST3KTYP DS    CL01      X'83'     RECORD TYPE                                  
RST3KTQ  EQU   X'83'                                                            
RST3KSTP DS    CL14      X'01'     RECORD SUBTYPE:CHILD/PARENT XREF             
RST3KREP DS    CL2       AN        REP CODE                                     
RST3KCST DS    CL5       AN        CHILD STATION: CALL LETTERS + BAND           
RST3KPST DS    CL5       AN        PARNT STATION: CALL LETTERS + BAND           
*                                                                               
         ORG   RSTAKEY                                                          
RST4KEY  DS    0CL27     V         PASSIVE KEY                                  
RST4KTYP DS    CL01      X'83'     RECORD TYPE                                  
RST4KSTP DS    CL01      X'02'     RECORD SUBTYPE: MKT NAME SEQUENCE            
RST4KREP DS    CL2       AN        REP CODE                                     
RST4KMKT DS    CL18      AN        MARKET NAME                                  
RST4KSTA DS    CL5       AN        STATION: CALL LETTERS + BAND                 
*                                                                               
         ORG   RSTAKEY                                                          
RST5KEY  DS    0CL27     V         PASSIVE KEY                                  
RST5KTYP DS    CL01      X'83'     RECORD TYPE                                  
RST5KSTP DS    CL16      X'03'     RECORD SUBTYPE: OWNER SEQUENCE               
RST5KREP DS    CL2       AN        REP CODE                                     
RST5KOWN DS    CL3       AN        OWNER  NAME                                  
RST5KSTA DS    CL5       AN        STATION: CALL LETTERS + BAND                 
*                                                                               
         ORG   RSTAKEY                                                          
RST6KEY  DS    0CL27     V         PASSIVE KEY                                  
RST6KTYP DS    CL01      X'83'     RECORD TYPE                                  
RST6KSTP DS    CL12      X'04'     RECORD SUBTYPE: OWNER/MKT SEQ.               
RST6KREP DS    CL2       AN        REP CODE                                     
RST6KOWN DS    CL3       AN        OWNER  NAME                                  
RST6KMKT DS    CL4       AN        MARKET CODE                                  
RST6KSTA DS    CL5       AN        STATION: CALL LETTERS + BAND                 
*                                                                               
         ORG   RSTAKEY                                                          
RST7KEY  DS    0CL27     V         PASSIVE KEY                                  
RST7KTYP DS    CL01      X'83'     RECORD TYPE                                  
RST7KSTP DS    CL20      X'05'     RECORD SUBTYPE: ID NUMBER                    
RST7KOWN DS    CL4       B         ID NUMBER                                    
RST7KREP DS    CL2       AN        REP CODE                                     
*                                                                               
         ORG   RSTAKEY                                                          
RST8KEY  DS    0CL27     V         PASSIVE KEY                                  
RST8KTYP DS    CL01      X'83'     RECORD TYPE                                  
RST8KSTP DS    CL15      X'06'     RECORD SUBTYPE: MARKET CODE                  
RST8KREP DS    CL2       AN        REP CODE                                     
RST8KMKT DS    CL4       B         MARKET CODE                                  
RST8KSTA DS    CL5       B         STATION CALL LETTERS                         
*                                                                               
         ORG   RSTAKEY                                                          
RST9KEY  DS    0CL27     V         PASSIVE KEY                                  
RST9KTYP DS    CL01      X'83'     RECORD TYPE                                  
RST9KSTP DS    CL17      X'07'     RECORD SUBTYPE: SIGNON ID                    
RST9KREP DS    CL2       AN        REP CODE                                     
RST9KSIG DS    CL2       AN        SIGNON ID                                    
RST9KSTA DS    CL5       B         STATION CALL LETTERS                         
*                                                                               
         ORG   RSTAKEY                                                          
RSTUKEY  DS    0CL27     V         PASSIVE KEY                                  
RSTUKTYP DS    CL01      X'83'     RECORD TYPE                                  
RSTUKSTP DS    CL13      X'08'     RECORD SUBTYPE: UNIQUE ID                    
RSTUKREP DS    CL2       AN        REP CODE                                     
RSTUKUID DS    CL6       AN        UNIQUE ID                                    
RSTUKSTA DS    CL5       B         STATION CALL LETTERS                         
*                                                                               
         ORG   RSTAKEY                                                          
RSTPKEY  DS    0CL27     V         PASSIVE KEY                                  
RSTPKTYP DS    CL01      X'83'     RECORD TYPE                                  
RSTPKSTP DS    CL3       X'09'     RECORD SUBTYPE: PERSONAL ID                  
RSTPKREP DS    CL2       AN        REP CODE                                     
RSTPKSID DS    CL8       AN        SIGN ON CODE                                 
RSTPKUID DS    CL8       AN        PERSONAL ID                                  
RSTPKSTA DS    CL5       B         STATION CALL LETTERS                         
*                                                                               
         ORG   RSTAKEY                                                          
RSTLKEY  DS    0CL27     V         PASSIVE KEY                                  
RSTLKTYP DS    CL01      X'83'     RECORD TYPE                                  
RSTLKSTP DS    CL9       X'0A'     RECORD SUBTYPE: UNIQUE ALIAS                 
RSTLKREP DS    CL2       AN        REP CODE                                     
RSTLKSAL DS    CL10      AN        UNIQUE (WITHIN REP) STATION ALIAS            
RSTLKSTA DS    CL5       AN        STATION CALL LETTERS                         
*                                                                               
RSTALEN  DS    CL2       B         RECORD LENGTH                                
RSTACNTL DS    CL1       X         CONTROL BYTE                                 
RSTALINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
RSTAELEM DS    0C                  STATION ELEMENT                              
RSTACODE DS    CL1       X'01'     ELEMENT CODE                                 
RSTAELLN DS    CL1       B         ELEMENT LENGTH                               
RSTAMKT  DS    CL20      AN        MARKET                                       
RSTACHAN DS    CL2       B         CHANNEL                                      
RSTAAFFL DS    CL3       AN        AFFILIATION (ABC,CBS,NBC,IND)                
RSTASTRT DS    CL3       B         DATE OF JOINING (YMD)                        
RSTAEND  DS    CL3       B         DATE OF LEAVING (YMD) OR ZERO                
RSTAGRUP DS    CL2       AN        STATION GROUP/SUB-GROUP                      
RSTAPROF DS    0CL28     AN        28 PROFILES                                  
RSTAP1   DS    CL1       AN        PROFILE 1: UN-PROTECT TRAFFIC # ON           
*                                             CONTRACT ORD SCREEN               
RSTAP2   DS    CL1       AN        PROFILE 2: PREVENT REP USER FROM             
*                                             SENDING TO THIS STATION           
RSTAP3   DS    CL1       AN        PROFILE 3: RETAIN ORS FOR 48 HRS             
*                                                                               
RSTAP4   DS    CL1       AN        PROFILE 4: PREVENT CFX ACTION                
*                                             FOR THIS STATION                  
RSTAP5   DS    CL1       AN        PROFILE 5: Y=INCLUDE BUYLINE DEMO            
*                                          VALUES ON CONTRACT PAPERWORK         
RSTAP6   DS    CL1       AN        PROFILE 6: Y=USE NEW URL (RURLSTX)           
*                                                                               
RSTAP7   DS    CL1       AN        PROFILE 7: SUPPRESS OFFER IN STK             
*                                                                               
RSTAP8   DS    CL1       AN        PROFILE 8: USE WIDE ORBIT FORMAT             
*                                                                               
         DS    CL20      AN        SPARE PROFILE BYTES, USED BY RELFM14         
RSTACLDT DS    CL2       B         LATEST INVOICE CLOSE DATE (YM)               
RSTASTAT DS    CL1       B         STATION STATUS                               
*                                  X'80' BOP CHECK OVERRIDE (RADIO)             
*                                  X'40' CONTRACT LOCKOUT                       
*                                  X'20' ACCESS TO NEW AVAILS (12/6/82)         
*                                     NO LONGER USED!!!                         
*                                  X'10' SAR SCHED GRPS MANDATORY 8/84          
*                                  X'08' DON'T SEND CONTRACT TO STATION         
*                                  X'04' PRINT CHANGES ONLY                     
*                                  X'02' DON'T SEND '#DS' BUYLINES              
RSTATVB  DS    CL2       AN        TVB CODE                                     
RSTAFLGS DS    CL1                 MISCELLANEOUS FLAGS                          
*                                  X'80' TAKE OVER INVOICE DATA                 
RSTARANK DS    CL1       AN        MARKET RANK CODE                             
RSTAAUTH DS    CL6       AN        SYSTEM AUTHORIZATIONS                        
RSTATRAF DS    CL1       AN        TRAFFIC SYSTEM                               
*                                     B=BIAS                                    
*                                     C=COLUMBINE                               
*                                     J=JDS                                     
*                                     K=KAMAN                                   
*                                     M=MARKETRON                               
*                                     R=REP                                     
RSTAOWN  DS    CL3       AN        OWNER                                        
RSTALIAB DS    CL1       A         LIABILITY POSITION CODE                      
RSTAHIST DS    XP(DT02)L2          HISTORICAL TAKEOVER DATE: COMP               
         SPACE 1                                                                
RSTAMKEL DS    0C                  ELEMENT FOR OTHER STATIONS IN MKT            
RSTAMKCO DS    CL1       X'02'     ELEMENT CODE                                 
RSTAMKLN DS    CL1       B         ELEMENT LENGTH                               
RSTAMKST DS    CL5       AN        CALL LETTERS                                 
RSTAMKAF DS    CL3       AN        AFFILIATION                                  
         DS    CL5                 SPARE                                        
         SPACE 1                                                                
RSTACEL  DS    0C                  STATION COMMENT ELEMENT                      
RSTACCOD DS    CL1       X'03'     ELEMENT CODE                                 
RSTACLEN DS    CL1       B         ELEMENT LENGTH                               
RSTACTYP DS    CL1       C         COMMENT TYPE (M=MANUAL,L=LIBRARY)            
         DS    CL1       -         SPARE                                        
RSTACCMT DS    0C        AN        COMMENT                                      
RSTACNUM DS    CL2       X         LIBRARY NUMBER                               
         SPACE 1                                                                
RSTAOTEL DS    0C                  OFFICE/TEAM ELEMENT                          
RSTAOTCO DS    CL1       X'04'     ELEMENT CODE                                 
RSTAOTLN DS    CL1       B         ELEMENT LENGTH                               
RSTAOTOF DS    CL2       AN        OFFICE CODE                                  
RSTAOTTM DS    CL2       AN        TEAM CODE (1ST BYTE DIVISION)                
         DS    CL5                 SPARE                                        
         SPACE 1                                                                
RSTAXEL  DS    0C                  EXTENDED DESCRIPTION ELEMENT                 
         DS    CL1       X'05'     ELEMENT CODE                                 
         DS    CL1                 LENGTH (20)                                  
RSTARSO  DS    CL8       AN        RECEIVING SIGN ON CODE                       
RSTARID  DS    CL2       B         RECEIVING ID                                 
         DS    CL8                 SPARE                                        
         SPACE 1                                                                
RSTASOEL DS    0C                  ELEMENT FOR VALID SIGN ON ID'S               
         DS    CL1       X'06'     ELEMENT CODE                                 
         DS    CL1                 LENGTH (17)                                  
RSTASO   DS    CL8       AN        SIGN ON CODE                                 
RSTASID  DS    CL2       B         SIGN ON ID                                   
         DS    CL5                 SPARE                                        
         SPACE 1                                                                
RSTATWXL DS    0C                  TWX ELEMENT                                  
         DS    CL1       X'07'     ELEMENT CODE                                 
         DS    CL1                 LENGTH (64)                                  
RSTATWX  DS    CL20      AN        TWX NUMBER                                   
RSTATWAB DS    CL20      AN        TWX ANSWER BACK CODE                         
RSTATWID DS    CL4       AN        TWX STATION ID                               
         DS    CL18                SPARE                                        
         SPACE 1                                                                
RSTAXXEL DS    0C                  EXTRA DESCRIPTION ELEMENT                    
         DS    CL1       X'08' +00 ELEMENT CODE                                 
         DS    CL1             +01 LENGTH (80)                                  
*                                                                               
RSTAOPTS DS    0CL9      AN    +02 OPTIONS                                      
RSTAOPT1 DS    CL1       AN #1 +02 SUPPRESS CONFIRMED WORKSHEETS                
RSTAOPT2 DS    CL1       AN #2 +03 SPACING - DEFAULT IS DOUBLE SPACE            
*                                      Y=TRIPLE SPACE FOR NON-GRAPH             
*                                      Y=SINGLE SPACE FOR GRAPHNET              
RSTAOPT3 DS    CL1       AN #3 +04 Y=#DS (DON'T SEND) BUYLINES ALLOWED          
RSTAOPT4 DS    CL1          #4 +05 Y=EASI AGENCY                                
RSTAOPT5 DS    CL1          #5 +06 DARE REVISION OVERRIDE                       
RSTAOPT6 DS    CL1          #6 +07 UNI STATUS FOR STATION                       
RSTAOPT7 DS    CL1          #7 +08 Y=PRINT AGY, ADV AND TRAF# ON K              
RSTAOPT8 DS    CL1          #8 +09 Y=FORCE SPL, IF MISSING, BEFORE SEND         
RSTAOPT9 DS    CL1       AN #9 +10 Y=CHECK EOP CODES                            
*                                                                               
RSTAORDS DS    CL8             +11 REP OFFICE DESTINATION CODE                  
RSTAORID DS    CL2             +19 REP OFFICE DESTINATION ID                    
RSTAOFAX DS    CL13            +21 STATION FAX NUMBER                           
*                                  THREE FORMATS MAY BE ENTERED:                
*                                  1ST 3 BYTES = 'MB='                          
*                                     MAILBOX W/NEXT 8 NUMERIC                  
*                                  1ST BYTE = X'00' = INTERNAT'L, W/            
*                                     2ND BYTE = INTERNAT'L CODE                
*                                     3RD BYTE = LEN OF PHONE NUMBER            
*                                     4TH - 11TH BYTES = PACKED NUMBER          
*                                  NON-ZERO, AND NOT ABOVE IS                   
*                                     STANDARD FAX NUMBER                       
RSTAOSI  DS    CL10            +34 STATION INTERFACE CODE                       
RSTARWS  DS    CL1             +44 REP WORKSHEET CODE                           
RSTAWSCF DS    CL1             +45 WORKSHEET CONTRACT FILTER (C/U/B)            
RSTAMKTC DS    CL4             +46 MARKET RECORD CODE (X'2B' REC)               
RSTAAFL2 DS    CL3             +50 SECONDARY AFFILIATE                          
RSTATZ   DS    CL2             +53 TIME ZONE                                    
RSTAXOPT DS    CL1             +55 X'80' = ELECTRONIC CON (1=YES,0=NO)          
*                                  X'40' = INVOICE (1=YES,0=NO)                 
*                                  X'20' = KATZ CONVERTED STATION               
*                                  X'10' = LOCAL E/C (1=YES, 0=NO)              
RSTALUID DS    CL8             +56 LUID                                         
RSTAOPTA DS    XL1             +64 ADDITIONAL OPTION BITS                       
*     X'80' - (#10) - STD CMT REQ ON K FOR ADD/CHNG/SEND                        
*     X'40' - (#11) - OVERRIDE PROF#31 'REVISION' ON PAPERWORK                  
*     X'20' - (#12) - STATION PARTICIPATES IN ALTERNATE CALENDAR                
*     X'10' - (#13) - NON COMPETITIVE STATION                                   
*     X'08' - (#14) - OVERRIDE PROF#35 BUY ORD CMT NOT REQ                      
*     X'04' - (#15) - DO NOT PERMIT TAKEOVER FOR THIS STATION                   
*     X'02' - (#16) - ADDTIONAL WORKSHEET FAX TO STATION                        
*     X'01' - (#17) - BIAS EC STATION:  USE IN PLACE OF TRAFFIC ID              
*                     FOR EC TRANSFER                                           
*                                                                               
RSTAOFX2 DS    XL13             +65                                             
RSTAOPTB DS    XL1              +78 ADDITIONAL OPTION BITS 2                    
*     X'80' - (#18) - REP MUST ENTER SECTION CODE ON BUYS                       
*     X'40' - (#19) - PATTERN/NOTATION ON BUY SCREEN                            
*     X'20' - (#20) - USE EC CHANGES VERSION                                    
*     X'10' - (#21) - EDICT = ENCODA OVERRIDE                                   
*     X'08' - (#22) - STATION CONFIRMS VIA WEB                                  
*     X'04' - (#23) - DO NOT FAX ORDER                                          
*     X'02' - (#24) - EXCLUDE DEMO CATEGORY/VALUE ON STATION ORD WKSHT          
*                     AND DSM SCREEN                                            
*     X'01' - (#25) - USE HFS FOR RMP OUTPUT (BUHR: OCT09/03)                   
RSTAOPTC DS    XL1               +79 ADDITIONAL OPTION BITS 3                   
*                     SPECIAL OPTSON STAD SCREEN                                
*     X'80' - (#01) - EC FROM REP SIDE PERMITTED                                
*     X'40' - (#02) - STATION DO NOT RECEIVE EMAIL ON REP SEND                  
*     X'20' - (#03) - GENERIC EC (7F): SEND 6-CHAR AGENCY-OFFICE                
*     X'10' - (#04) - ORIGINAL BUY BREAKOUT FOR DARE ORDERS                     
*     X'08' - (#05) - MQUEUE OPTION (NOT SENT VIA EDICT / OTHER)                
*     X'04' - (#06) - STATION IS MEDIA OCEAN SOM USER                           
*     X'02' - (#07) - STATION SET TO MO 3.0?                                    
*     X'01' - (#08) - STATION SET TO STX 1.X?                                   
         SPACE 1                                                                
RSTAAFEL DS    0C                  COMBINED STATION ELEMENT                     
         DS    CL1       X'09'     ELEMENT CODE                                 
         DS    CL1                 LENGTH(10)                                   
RSTAAM   DS    CL4                 AM STATION                                   
RSTAFM   DS    CL4                 FM STATION                                   
         SPACE 1                                                                
RSTACSEL DS    0C                  COMBINED STATION ELEMENT (1 EACH)            
         DS    CL1       X'0A'     ELEMENT CODE                                 
RSTACSLN DS    CL1                 LENGTH(7=OLD)(8=NEW)(10=NEW/NEW)             
RSTACS   DS    CL5                 COMBINED STATION                             
RSTACPRF DS    CL1                 PREFERRED STATION IF '*' (LEN=8/10)          
*                                  NON-PARTICIPANT IF '-' (LEN=8/10)            
RSTACDTE DS    XP(DT02)L2          ENTRY DATE:  COMPRESSED FORMAT               
*                                                                               
         SPACE 1                                                                
RSTACMEL DS    0C                  STATION COMMENT ELEMENT                      
RSTACMEC DS    CL1                 ELEMENT CODE                                 
RSTACMEQ EQU   X'0B'                                                            
RSTACMLN DS    X                   ELEMENT LENGTH (VARIABLE)                    
RSTACMCM DS    0C                  STATION COMMENT                              
*                                                                               
         SPACE 1                                                                
RSTAFNEL DS    0C                  FORMER REP/NEW REP ELEMENT                   
RSTAFNEC DS    CL1       X'0C'     ELEMENT CODE                                 
RSTAFNLN DS    CL1                 LENGTH(8)                                    
RSTAFNFO DS    CL3                 FORMER REP                                   
RSTAFNNE DS    CL3                 NEW REP                                      
         SPACE 1                                                                
RSTAJLEL DS    0C                  JOIN/LEAVE REPORT DATE ELT                   
RSTAJLEC DS    CL1       X'0D'     ELEMENT CODE                                 
RSTAJLLN DS    CL1                 LENGTH                                       
RSTAJOIN DS    CL2                 JOIN  REPORT DATE (YM BINARY)                
RSTALEAV DS    CL2                 LEAVE REPORT DATE (YM BINARY)                
*                                                                               
         SPACE 1                                                                
RSTAINEL DS    0C                  ID NUMBER ELT W/SPARE                        
RSTAINEC DS    CL1       X'0F'     ELEMENT CODE                                 
RSTAINLN DS    CL1                 LENGTH                                       
RSTAINID DS    CL4                 ID NUMBER: BINARY                            
         DS    CL6                 SPARE                                        
*                                                                               
         SPACE 1                                                                
RSTADTEL DS    0C                  MISC DATA ELT W/SPARE                        
RSTADTEC DS    CL1       X'10'     ELEMENT CODE                                 
RSTADTLN DS    CL1                 LENGTH                                       
RSTADTCE DS    CL2                 CONTRACT END DATE:  MON/YEAR BINRY           
         DS    CL12                SPARE                                        
         SPACE 1                                                                
RSTADMEL DS    0C                  DEMO MARKET CODE ELT W/SPARE                 
RSTADMEC DS    CL1       X'11'     ELEMENT CODE                                 
RSTADMLN DS    CL1                 LENGTH                                       
RSTADMCD DS    XL3                 DEMO MARKET CODE                             
*                                  IF FIRST BYTE IS X'00', THIS                 
*                                     IS A NUMERIC CODE                         
*                                  ELSE                                         
*                                     THIS IS AN ALPHANUM CODE                  
         DS    CL3                 SPARE                                        
*                                                                               
         SPACE 1                                                                
RSTPDTEL DS    0C                  PERSONAL ID ELEMENT                          
RSTPDTEC DS    CL1       X'13'     ELEMENT CODE                                 
RSTPDTLN DS    CL1                 LENGTH                                       
RSTADTPI DS    CL8                 PERSONAL ID                                  
         SPACE 1                                                                
RSTALIEL DS    0C                  ALIAS ELEMENT                                
RSTALIEC DS    CL1       X'15'     ELEMENT CODE                                 
RSTALILN DS    CL1                 LENGTH: VARIABLE                             
RSTALIAS DS    CL1       VAR       ALIAS:  LEN VARIES ON INPUT                  
         SPACE 1                                                                
RSTAKZEL DS    0C                  KATZ REPORT DATA                             
RSTAKZEC DS    CL1       X'21'     ELEMENT CODE                                 
RSTAKZLN DS    CL1                 LENGTH                                       
RSTAKZVP DS    CL1                 REGIONAL VP                                  
RSTAKZSP DS    CL1                 SPECIALIST                                   
RSTAKZDV DS    CL1                 DIVISION                                     
RSTAKZST DS    CL1                 MARKET STATUS                                
RSTAKZFR DS    CL2                 FROM REP                                     
RSTAKZTR DS    CL2                 TO   REP                                     
*                                                                               
RSTAOSEL DS    0C                  KATZ OLD STATION ELEMENT                     
RSTAOSEC DS    CL1       X'22'     ELEMENT CODE                                 
RSTAOSLN DS    CL1                 LENGTH                                       
RSTAOSST DS    CL5                 OLD STATION CALL LETTERS                     
RSTAOSDT DS    CL2                 AS OF DATE                                   
*                                                                               
RSTACOEL DS    0C                  CLOSEOUT ACTIVITY INFO ELEMENT               
RSTACOEC DS    CL1       X'23'     ELEMENT CODE                                 
RSTACOLN DS    CL1                 LENGTH                                       
RSTACODT DS    CL3                 CLOSEOUT DATE                                
RSTACOFL DS    CL2                 CLOSEOUT FLAGS                               
*                                  X'80' - CLOSED BY TAPE ACTUALIZER            
*                                  X'40' - CLOSED BY INVOICE PROGRAM            
*                                  X'20' - CLOSED BY RE16 REPORT                
*                                  X'10' - CLOSED BY FILE PROGRAM               
*                                  X'08' - CLOSED BY MQ INVOICE                 
RSTACOLU DS    CL8                 LUID OF LAST ACTIVITY                        
RSTACOXT DS    CL5                 SPARE                                        
*                                                                               
RSTAEML  DS    0C                  EMAIL ELEMENT (1 PER ADDRESS)                
RSTAEMC  DS    CL1       X'25'     ELEMENT CODE                                 
RSTAEMLN DS    CL1                 LENGTH: VARIABLE, BASED ON ADDRESS           
RSTAFLG  DS    CL1                 FLAG:                                        
RSTAFLGQ EQU   X'80'               = USE EMAIL ADDRESS                          
RSTAADD  DS    CL1                 EMAIL ADDRESS (VARIABLE BASED ON             
*                                    INPUT FROM STATION REC SCREEN)             
RSTACTEL DS    0C                  STATION ACTIVITIES ELEMENT                   
RSTACTEC DS    CL1                 ELEMENT CODE                                 
RSTACTEQ EQU   X'F1'                                                            
RSTACTLN DS    X                   ELEMENT LENGTH                               
RSTACTAD DS    CL3                 DATE ADDED(BINARY)                           
RSTACTAI DS    CL8                 TERMINAL ID THAT ADDED RECORD                
RSTACTCD DS    CL3                 DATE LAST CHANGED(BINARY)                    
RSTACTCI DS    CL8                 TERMINAL ID THAT MADE LAST CHANGE            
RSTACTCN DS    X                   NUMBER OF LAST CHANGE                        
RSTACTSP DS    CL3                 SPARE                                        
RSTACTLQ EQU   *-RSTACTEL          LENGTH EQUATE                                
*-----------------------------------                                            
         ORG   RSTAKEY                                                          
RSTABLEL DS    0H                  INVENTORY BOOK LIST ELEMENT                  
RSTABLEC DS    CL1                 ELEMENT CODE                                 
RSTABLEQ EQU   X'48'                                                            
RSTABLLN DS    CL1                 ELEMENT LENGTH                               
RSTABLTG DS    CL8                 NAME TAG OF LINKED RECORD                    
RSTABLTS DS    CL10                LIST OF 1 CHAR BOOKTYPES TO INCLUDE          
         DS    CL4                 SPARE                                        
RSTABLLQ EQU   *-RSTABLEL          LENGTH OF ELEMENT                            
*-----------------------------------                                            
         ORG   RSTAKEY                                                          
RSTAHOEL DS    0H                  OWNER HISTORY ELEMENT                        
RSTAHOEC DS    CL1                 ELEMENT CODE                                 
RSTAHOEQ EQU   X'49'                                                            
RSTAHOLN DS    CL1                 ELEMENT LENGTH                               
RSTAHOWN DS    CL3                 OWNER CODE PURGED VIA REPORT                 
RSTAHODT DS    CL3                 DATE OF RUN                                  
         DS    CL3                 SPARE                                        
RSTAHOLQ EQU   *-RSTAHOEL          LENGTH OF ELEMENT                            
         ORG   RSTAKEY                                                          
*                                                                               
* THESE ELEMENTS APPEAR ONLY AT THE MASTER LEVEL AND ARE ORG'D TO               
*    RSTAKEY SO AS NOT TO MESS UP STORAGE IN VARIOUS PROGRAMS                   
*                                                                               
* IF ANY OF THESE ELEMENTS ARE IN THE STATION RECORD, RELDCPTR WILL             
*  SKIP PASSIVE POINTER GENERATION                                              
*                                                                               
* THE X'51' - IS THE CURRENTLY ACTIVE REP                                       
* THE X'52' - IS THE PREVIOUSLY ACTIVE REP                                      
* THE X'53' - ARE FOR THE HISTORY ELEMENTS                                      
*                                                                               
* ALL THREE ELEMENTS USE THE SAME DSECT                                         
*                                                                               
RSTAMCEL DS    0C                  MASTER CONTROL ELEMENTS                      
RSTAMCEC DS    CL1                 ELEMENT CODE                                 
RSTAMCCQ EQU   X'51'               CURRENT REP ELEMENT                          
RSTAMCPQ EQU   X'52'               PREVIOUS REP ELEMENT                         
RSTAMCHQ EQU   X'53'               HISTORY REP ELEMENT                          
RSTAMCLN DS    CL1                 ELEMENT LENGTH                               
RSTAMCRC DS    CL2                 REPCODE                                      
RSTAMCJD DS    CL3                 JOIN DATE                                    
RSTAMCLD DS    CL3                 LEAVE DATE                                   
         DS    CL20                SPARE                                        
RSTAMCLQ EQU   *-RSTAMCEL          LENGTH OF ELEMENT                            
         SPACE 1                                                                
RSTAUIEL DS    0C                  UNIQUE ID ELEMENT                            
RSTAUIEC DS    CL1       X'2A'     ELEMENT CODE                                 
RSTAUILN DS    CL1                 LENGTH                                       
RSTAUIST DS    CL6                 UNIQUE ID                                    
RSTAUIDT DS    CL4                 SPARE                                        
*                                                                               
         SPACE 1                                                                
RSTAUHEL DS    0C                  UNIQUE ID CHANGE HIST ELT                    
RSTAUHEC DS    CL1       X'2B'     ELEMENT CODE                                 
RSTAUHLN DS    CL1                 LENGTH                                       
RSTAUHDT DS    CL3                 DATE CHANGED                                 
RSTAUHST DS    CL6                 UNIQUE ID                                    
RSTAUHLU DS    CL8                 LUID OF CHANGER                              
         DS    CL5                 SPARE                                        
*                                                                               
         SPACE 1                                                                
RSTAETEL DS    0C                  ETRANS VENDOR ELEMENT                        
RSTAETEC DS    CL1       X'2C'     ELEMENT CODE                                 
RSTAETLN DS    CL1                 LENGTH                                       
RSTAETDT DS    CL3                 DATE CHANGED                                 
RSTAETVN DS    CL8                 VENDOR IDENTIFICATION                        
*                                  DEFAULT  =  TVSCAN                           
*                                  TVSCAN                                       
*                                  1DOMAIN                                      
RSTAETLU DS    CL8                 LUID OF CHANGER                              
         DS    CL3                 SPARE                                        
*                                                                               
         SPACE 1                                                                
RSTAOFEL DS    0C                  STATION BY OFFICE ELEMENT                    
RSTAOFCD DS    CL1       X'2D'     ELEMENT CODE                                 
RSTAOFLN DS    CL1                 LENGTH (MIN = 15, MAX = 93)                  
*                                  MIN = 1  OFFICE                              
*                                  MAX = 40 OFFICES                             
RSTAOFDT DS    CL3                 DATE CHANGED                                 
RSTAOFLU DS    CL8                 LUID OF CHANGER                              
RSTAOFFC DS    CL2                 OFFICE CODE (VARIABLE NUMBER)                
*                                                                               
         SPACE 1                                                                
RSTAPFEL DS    0C                  STATION BY OFFICE FOR PROPOSER ELT           
RSTAPFCD DS    CL1       X'2E'     ELEMENT CODE                                 
RSTAPFLN DS    CL1                 LENGTH (MIN = 15, MAX = 93)                  
*                                  MIN = 1  OFFICE                              
*                                  MAX = 40 OFFICES                             
RSTAPFDT DS    CL3                 DATE CHANGED                                 
RSTAPFLU DS    CL8                 LUID OF CHANGER                              
RSTAPFFC DS    CL2                 OFFICE CODE                                  
*                                                                               
         SPACE 1                                                                
RSTAMQEL DS    0C                  MQUEUE DATE ELEMENT                          
RSTAMQCD DS    CL1       X'2F'     ELEMENT CODE                                 
RSTAMQLN DS    CL1                 LENGTH (56)                                  
RSTAMQDT DS    CL3                 DATE CHANGED                                 
RSTAMQLU DS    CL8                 LUID OF CHANGER                              
RSTAMQRT DS    CL16                MQUEUE ROUTING                               
RSTAMQSP DS    CL20                MQUEUE SPECIAL                               
         DS    CL7                 SPARE                                        
*                                                                               
         SPACE 1                                                                
RSTCPFEL DS    0C                  STATION BY OFFICE FOR PROPOSER ELT           
*                                     NEW FORMAT:  WITH DATES                   
RSTCPFCD DS    CL1       X'3A'     ELEMENT CODE                                 
RSTCPFLN DS    CL1                 LENGTH                                       
*                                  MIN = 1  OFFICE                              
*                                  MAX = 40 OFFICES                             
RSTCPFDT DS    CL3                 DATE CHANGED                                 
RSTCPFLU DS    CL8                 LUID OF CHANGER                              
RSTCPODT DS    0CL5                OFFICE / DATE PAIR (VARIABLE #)              
RSTCPFFC DS    CL2                 OFFICE CODE                                  
RSTCPDAT DS    CL3                 CUTOFF DATE FOR OFFICE                       
*                                                                               
         SPACE 1                                                                
RSTALEL  DS    0C                  STATION ALIASES ELEMENT                      
RSTALCD  DS    CL1                 ELEMENT CODE                                 
RSTALEQ  EQU   X'3B'                                                            
RSTALLN  DS    X                   ELEMENT LENGTH                               
RSTALA1  DS    CL10                STATION ALIAS 1                              
RSTALA2  DS    CL10                STATION ALIAS 2                              
RSTALA3  DS    CL10                STATION ALIAS 3                              
RSTALA4  DS    CL10                STATION ALIAS 4                              
RSTALA5  DS    CL10                STATION ALIAS 5                              
RSTALDT  DS    CL3                 DATE CHANGED                                 
*        DS    CL8                 SPARE                                        
RSTALLQ  EQU   *-RSTALEL           LENGTH EQUATE                                
*                                                                               
         ORG                                                                    
