*          DATA SET REGENMKG   AT LEVEL 120 AS OF 09/02/20                      
*                                                                               
*********************************************************************           
*                                                                   *           
*        REGENMKG --- REP CONTRACT SHADOW MAKEGOOD BUY RECORD       *           
*                                                                   *           
* ----------------------------------------------------------------- *           
* UPDATE HISTORY:                                                   *           
* FEB02/95 (BU ) ---  ADD OFFICE/STATION/\ALESPERSON TO KEY.        *           
*                     ADD GROUP COMMENT RECORD/KEY.                 *           
*                                                                   *           
* MAR06/95 (BU ) ---  AMEND KEY TO AA,AB,AC....AZ,BA,BB... FORMAT   *           
*                                                                   *           
* SEP08/95 (SKU) ---  RESTRUCTURE HEADER RECORD                     *           
*                                                                   *           
* OCT03/95 (SKU) ---  RESTRUCTURE KEY                               *           
*                                                                   *           
* DEC06/95 (SKU) ---  MOVE AND INCLUDE SECONDS FOR LAST ACTIVITY    *           
*                     TIME AND LAST RECALL/REJECT TIME              *           
*                                                                   *           
* OCT10/96 (SKU) --- ADD FLAGS FOR BONUSES AND PREEMPTS             *           
*                                                                   *           
* AUG14/97 (SKU) --- EXTEND AUDIT ELEMENT TO SUPPORT ERROR          *           
*                                                                   *           
* APR06/98 (SKU) --- ADD SALESPERSON TO ENABLE OFFICE SWITCH        *           
*                                                                   *           
* NOV16/98 (BU ) --- ADD S/P-TEAM, PLUS ALL SWITCH FIELDS           *           
*                                                                   *           
* MAY12/03 (SKU) --- ADD SELF-APPLY SUPPORT                         *           
*                                                                   *           
* AUG07/13 (SKU) --- ADD PASSIVES FOR RIS LISTING                   *           
*                     ***  END TOMBSTONE  ***                       *           
*********************************************************************           
*                                                                               
         SPACE 1                                                                
RMKGREC  DS    1000C                                                            
         ORG   RMKGREC                                                          
RMKGKEY  DS    0CL27     V         KEY                                          
RMKGKTYP DS    CL1       X'11'     RECORD TYPE                                  
RMKGKTQ  EQU   X'11'                                                            
         DS    CL5                 SPARE                                        
RMKGKREP DS    CL2       AN        REP CODE                                     
RMKGKOFF DS    CL2                 OFFICE CODE                                  
RMKGKSTA DS    CL5                 STATION CALL LETTERS                         
RMKGKCON DS    CL4       UP        CONTRACT NUMBER (9'S COMP/REVERSED)          
RMKGKGRP DS    0XL2                MAKE-GOOD GROUP IDENTIFIER                   
RMKGKGR1 DS    CL1                 FIRST  CHARACTER OF GROUP                    
RMKGKGR2 DS    CL1                 SECOND CHARACTER OF GROUP                    
*                                                                               
*        GROUP COMMENT RECORD KEY ENDS AT THIS POINT.  REMAINDER OF             
*              KEY IS X'00'.                                                    
*                                                                               
RMKGKPLN DS    CL3       A         PLAN (PACKAGE) CODE (DEFAULT=3X'FF')         
*                                                                               
* NOTE: NEW MULTI-MISSED LINE MAKEGOOD OFFERS WILL SET THE FOLLOWING            
*       BYTE TO ZERO                                                            
RMKGKMLN DS    CL1       B         MASTER LINE NUMBER                           
*                                       (NORMALLY SAME AS LINE NUMBER           
*                                        BUT FOR MAKE-GOODS THIS REFERS         
*                                        TO MISSED LINE FOR PROPER              
*                                        SORTING SEQUENCE)                      
*                                                                               
RMKGKLIN DS    CL1       B         MAKEGOOD OFFER NUMBER                        
*                                                                               
* PLAN RECORD - MASTER LINE/LINE NUMBER = X'FF'                                 
*                                                                               
RMKGKRTY DS    CL1       B         RECORD TYPE:                                 
*                                  CASE 1:                                      
*                                  X'00' = SINGLE LINE OFFER                    
*                                  CASE 2:                                      
*                                  X'01'                                        
*                                  X'02'                                        
*                                  X'03' = OFFERING 'ALL' LINES                 
*                                  CASE 3:                                      
*                                  X'11'                                        
*                                  X'12'                                        
*                                  X'13' = OFFERING 'CHOICE' LINES              
*                                          NEED TO CHECK THE X'20'              
*                                          ELEMENT TO SEE WHICH LINE            
*                                          (IF AT ALL) IS SELECTED              
*                                                                               
         ORG   RMKGREC                                                          
RMGSPTYP DS    CL2       X'A001'   RECORD TYPE /                                
RMGSPTQ  EQU   X'A0'                                                            
RMGSPREP DS    CL2       AN        REP CODE                                     
RMGSPSAL DS    CL3                 S/P CODE                                     
RMGSPSTA DS    CL5                 STATION CALL LETTERS                         
RMGSPCON DS    CL4       UP        CONTRACT NUMBER (9'S COMP)                   
RMGSPADV DS    CL4                 ADVERTISER                                   
RMGSPGRP DS    0XL2                MAKE-GOOD GROUP IDENTIFIER                   
RMGSPGR1 DS    CL1                 FIRST  CHARACTER OF GROUP                    
RMGSPGR2 DS    CL1                 SECOND CHARACTER OF GROUP                    
RMGSPDAT DS    XL2                 FIRST OFFERED DATE COMPRESSED                
RMGSPWIP DS    XL1                 WIP STATUS (RMKGSFG2)                        
*                                                                               
* NOTE: THE X'02' BIT IS BEING USED TO INDICATE SELF-APPLY INSTEAD              
* OF "PLEASE ADVISE". IF RMGF3SAQ IS ON IN RMKGSFG3, THIS BIT WILL              
* BE SET IN RMGSPSTT                                                            
*                                                                               
RMGSPSTT DS    CL1                 OFFER STATUS (RMKGSCST)                      
*                                                                               
RMKGSLFQ EQU   X'02'                                                            
*                                                                               
RMGSPDST DS    CL1                 DARE  STATUS (RMKGSFG1)                      
*                                                                               
         ORG   RMKGREC                                                          
RMGDSTYP DS    CL2       X'A002'   RECORD TYPE /                                
RMGDSREP DS    CL2       AN        REP CODE                                     
RMGDSDSL DS    CL3                 DEV S/P CODE                                 
RMGDSSTA DS    CL5                 STATION CALL LETTERS                         
RMGDSCON DS    CL4       UP        CONTRACT NUMBER (9'S COMP)                   
RMGDSADV DS    CL4                 ADVERTISER                                   
RMGDSGRP DS    0XL2                MAKE-GOOD GROUP IDENTIFIER                   
RMGDSGR1 DS    CL1                 FIRST  CHARACTER OF GROUP                    
RMGDSGR2 DS    CL1                 SECOND CHARACTER OF GROUP                    
RMGDSDAT DS    XL2                 FIRST OFFERED DATE COMPRESSED                
RMGDSWIP DS    XL1                 WIP STATUS                                   
RMGDSSTT DS    CL1                 OFFER STATUS                                 
RMGDSDST DS    CL1                 DARE  STATUS (RMKGSFG1)                      
*                                                                               
         ORG   RMKGREC                                                          
RMKG2TYP DS    CL2       X'A011'   RECORD TYPE /                                
         DS    CL7                 SPARE                                        
RMKG2REP DS    CL2       AN        REP CODE                                     
RMKG2SP  DS    CL3                 S/P CODE                                     
RMKG2TEM DS    CL2                 TEAM CODE                                    
RMKG2STA DS    CL5                 STATION CALL LETTERS                         
RMKG2CON DS    CL4       UP        CONTRACT NUMBER (9'S COMP/REVERSED)          
RMKG2GRP DS    0XL2                MAKE-GOOD GROUP IDENTIFIER                   
RMKG2GR1 DS    CL1                 FIRST  CHARACTER OF GROUP                    
RMKG2GR2 DS    CL1                 SECOND CHARACTER OF GROUP                    
*                                                                               
         ORG   RMKGREC                                                          
RMKG3TYP DS    CL2       X'A111'   RECORD TYPE /                                
RMKG3TQ  EQU   X'A1'                                                            
         DS    CL7                 SPARE                                        
RMKG3REP DS    CL2       AN        REP CODE                                     
RMKG3TEM DS    CL2                 TEAM CODE                                    
RMKG3SP  DS    CL3                 S/P CODE                                     
RMKG3STA DS    CL5                 STATION CALL LETTERS                         
RMKG3CON DS    CL4       UP        CONTRACT NUMBER (9'S COMP/REVERSED)          
RMKG3GRP DS    0XL2                MAKE-GOOD GROUP IDENTIFIER                   
RMKG3GR1 DS    CL1                 FIRST  CHARACTER OF GROUP                    
RMKG3GR2 DS    CL1                 SECOND CHARACTER OF GROUP                    
*                                                                               
RMKGLEN  DS    CL2       B         RECORD LENGTH                                
RMKGCNTL DS    CL1       X         CONTROL BYTE                                 
*                                       X'80' = DELETED                         
*                                       X'40' = KEY CHANGE VOID                 
*                                               (PLAN OR MG CHANGE)             
RMKGLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
RMKGELEM DS    0C                  BUY DESCRIPTION ELEMENT                      
RMKGCODE DS    CL1       X'01'     ELEMENT CODE                                 
RMKGELLN DS    CL1       X'2B'     ELEMENT LENGTH                               
RMKGNW   DS    CL1       B         NUMBER PER WEEK                              
RMKGCOMB DS    XL1       B         COMBO BUY PLACE HOLDER                       
*                                  BIT      0 = N/A BUY     X'80'               
*                                  BITS 1-7   = # SPOTS IN                      
*                                               CORRESPONDING LINE              
RMKGCOS  DS    CL4       B         COST (2 DECIMALS)                            
RMKGCLS  DS    CL3       AN        CLASS                                        
RMKGSEC  DS    CL3       AN        SECTION                                      
RMKGCREA DS    CL3       B         BUY CREATION DATE-YMD                        
RMKGCARD DS    CL3       AN        CARD AND/OR UNITS                            
RMKGCHGD DS    CL3       B         LAST CHANGE DATE - YMD                       
RMKGKMOD DS    CL1       B         CONTRACT MODIFICATION NUMBER                 
RMKGCHGI DS    CL2       A         CHANGE INDICATOR                             
*                                       A=ADDED                                 
*                                       C=CANCELLED                             
*                                       D=DAYS CHANGED                          
*                                       E=EFFECTIVE DATES CHANGED               
*                                       F=FLIGHT NUMBER CHANGED                 
*                                       L=LENGTH CHANGED                        
*                                       M=MAKE-GOOD STATUS CHANGE               
*                                       O=ORDER COMMENTS CHANGED                
*                                       T=TIME CHANGED                          
*                                       S=SPOTS/WEEK CHANGED                    
*                                       P=PLAN, CLASS OR SECTION CHG            
*                                       R=RATE CHANGED                          
*                                       X=DELETE (NO PRINTING)                  
*                                       Z=COMMENTS CHANGE                       
*                                       *=MORE THAN 2 CODES CHANGED             
RMKGTSPT DS    CL2       B         TOTAL SPOTS                                  
RMKGTCOS DS    CL4       B         TOTAL COST                                   
RMKGTWKS DS    CL1       B         TOTAL WEEKS                                  
RMKGSTED DS    CL1       B         START-END DAY FOR ALL 02 ELEMENTS            
*                                  BITS 0-3=START DAY (MONDAY=1)                
*                                  BITS 4-7=END DAY   (SUNDAY=7)                
RMKGDUR  DS    CL2       B         LENGTH IN SECONDS (IF HIGH ORDER BIT         
*                                  ON THEN THIS IS MINUTES)                     
RMKGFLT  DS    C         B         FLIGHT CODE                                  
RMKGVER  DS    CL1       B         VERSION NUMBER                               
RMKGTYP  DS    CL1       AN        PROGRAM TYPE                                 
RMKGDPT  DS    CL1       A         DAYPART CODE                                 
RMKGRTS  DS    CL1       B         STATUS/TYPE FLAGS                            
*                                  BIT 1=REP-TO-SPOT FLIP/FLOP    X'80'         
*                                  BIT 2=BUY IS A COMBO           X'40'         
*                                  BIT 3=BUY IS A BONUS           X'20'         
*                                  BIT 4=MKGD OFFER IS A PREEMPT  X'10'         
*                                  BIT 5=MKGD OFFER IS A LATE RUN X'08'         
*                                  BIT 6=MKGD OFFER IS A LATE RUN X'04'         
*                                        WITH BONUS. BIT 3 IS     X'04'         
*                                        ALSO ON IF THIS IS THE   X'04'         
*                                        BONUS PORTION OF THE LR  X'04'         
*                                  BIT 7=MKGD IS A REPLACEMENT NA X'02'         
*                                  BIT 8=BUY SPOTS WERE ZEROED    X'01'         
*                                        OUT BY CONTRACT PROFILE  X'01'         
*                                        36 OR MANUALLY                         
RMKGAGBL DS    XL1       B         AGENCY ORDER BUYLINE NUMBER                  
         DS    CL1                 SPARE HERE BUT IN USED IN REGENBUY           
*                                                                               
*********************************************************************           
*                                                                   *           
*  GROUP COMMENT RECORD:  X'01' ELEMENT WILL BE DIFFERENT, WITH     *           
*  STATUS FLAGS AND DATE/TIME STAMPS.                               *           
*                                                                   *           
*                                                                   *           
*********************************************************************           
*                                                                               
         ORG   RMKGELEM                                                         
RMKGSDEM DS    0C                  GROUP STATUS DESCRIPTION ELEMENT             
RMKGSECD DS    CL1       X'01'     ELEMENT CODE                                 
RMKGSELN DS    CL1       X         ELEMENT LENGTH (VARIABLE)                    
RMKGSCST DS    CL1       C         CURRENT STATUS OF GROUP                      
RMKGSAPQ EQU   X'80'               X'80' =  GROUP APPLIED                       
RMKGSBOQ EQU   X'40'               X'40' =  GROUP BACKED OUT                    
RMKGSRCQ EQU   X'20'               X'20' =  GROUP RECALLED                      
RMKGSRJQ EQU   X'10'               X'10' =  GROUP REJECTED                      
RMKGSCNQ EQU   X'08'               X'08' =  GROUP CANCELLED                     
RMKGSRVQ EQU   X'04'               X'04' =  GROUP REVISED                       
RMKGSPAQ EQU   X'02'               X'02' =  ON=PLS ADVISE/OFF=ASSUME OK         
RMKGSCRQ EQU   X'01'               X'01' =  ON=CREATED BY REP/OFF=STATN         
*                                                                               
RMKGSFG1 DS    CL1                 GROUP CURRENT STATUS DARE FLAG               
*                                                                               
* THE FOLLOWING ARE BITS THAT INDICATE THE CURRENT STATUS OF THE MKG            
* THEREFORE, ONLY *ONE* OF THE FOLLOWING BITS WILL BE ON AT ANY TIME            
* TO GET A HISTORY OF THE ACTIONS EXECUTED ON THE MKG, SEE RMKGATEM             
*                                                                               
RMGF1MER EQU   X'80'               X'80' = DARE MAKEGOOD ERROR REC'D            
RMGF1MSN EQU   X'40'               X'40' = DARE MAKEGOOD SENT                   
RMGF1MAR EQU   X'20'               X'20' = DARE MKGD APPROVAL RECEIVED          
RMGF1MRR EQU   X'10'               X'10' = DARE MKGD REJECTION RECEIVED         
RMGF1MCF EQU   X'08'               X'08' = DARE MAKEGOOD APPLIED                
RMGF1MCN EQU   X'04'               X'04' = DARE MAKEGOOD CANCELLED              
RMGF1MCR EQU   X'02'               X'02' = DARE MKGD RESENT                     
RMGF1MCM EQU   X'01'               X'01' = DARE MKGD CANCEL WITH MORE           
*                                                                               
RMKGSCVR DS    X         B         CURRENT VERSION NUMBER                       
*                                                                               
* THE FOLLOWING DATE AND TIME STAMPS ARE FOR ACTIONS BETWEEN THE REP            
* AND STATION WITHIN THE CONTRACT PROGRAM ONLY                                  
*                                                                               
RMKGSMOD DS    X                   CONTRACT MODIFICATION NUMBER                 
*                                                                               
RMKGSFG2 DS    X                   CHANGE STATUS                                
*                                                                               
RMGF2RPQ EQU   X'80'               REP CHANGED/IS CHANGING THIS OFFER           
RMGF2STQ EQU   X'40'               STA CHANGED/IS CHANGING THIS OFFER           
RMGF2WPQ EQU   X'01'               OFFER IS IN WIP                              
*                                                                               
RMKGSFG3 DS    X                   STATUS FLAG 3                                
RMGF3SAQ EQU   X'80'               REP PERFORMED A SELF-APPLY                   
RMGF3ARQ EQU   X'40'               APPROVAL RECEIVED AFTER SELF-APPLY           
*                                                                               
RMKGSCRD DS    XL2                 CREATION DATE (COMPRESSED)                   
RMKGFOFD DS    XL2                 FIRST OFFERED DATE (COMPRESSED)              
RMKGSLAD DS    XL2                 LAST ACTIVITY DATE (COMPRESSED)              
         DS    XL2                 SPARE                                        
RMKGSEXD DS    XL2                 EXPIRATION DATE (COMPRESSED)                 
RMKGSLRD DS    XL2                 LAST RECALL/REJECT DATE (COMPRESSED)         
         DS    XL2                 SPARE                                        
RMKGAPMN DS    X                   MOD NUM AT APPLY STEP                        
RMKGDARN DS    XL4       PWOS      AGENCY DARE ORDER NUMBER                     
*                                                                               
RMKGSCRT DS    XL3                 CREATION TIME (HHMMSS)                       
RMKGSLAT DS    XL3                 LAST ACTIVITY TIME (HHMMSS)                  
RMKGSLRT DS    XL3                 LAST RECALL/REJECT TIME (HHMMSS)             
*                                                                               
*                                                                               
* OLDER MAKEGOOD OFFER RECORDS DO NOT HAVE SALESPERSON CODE STORED HERE         
* IN THAT CASE, A SWITCH BY REREPSW02 WILL *NOT* CHANGE THIS RECORD             
*                                                                               
*  NOTE:  THIS S/P FIELD NOT USED.  NEW SWITCH ELEMENT USED INSTEAD             
*                                                                               
         DS    CL3                 SALESPERSON CODE                             
RMKGSAL  DS    CL3  *** THIS FIELD IS DEAD! DON'T USE IT ***                    
         DS    XL7                 SPARE                                        
RMKGSELQ EQU   *-RMKGSDEM                                                       
*********************************************************************           
*                                                                   *           
*  FOR DARE ORDERS ONLY:                                            *           
*  GROUP COMMENT RECORD:  X'02' ELEMENT WILL BE THE AUDIT TRAIL     *           
*  ELEMENT CONTAINS ACTION, VERSION, DATE AND TIME STAMPS.          *           
*                                                                   *           
*********************************************************************           
*                                                                               
RMKGATEM DS    0C                  DARE MAKEGOOD AUDIT TRAIL ELEMENT            
RMKGATCD DS    CL1       X'02'     ELEMENT CODE                                 
RMKGATLN DS    CL1       X         ELEMENT LENGTH (VARIABLE)                    
RMKGATDT DS    XL2       X         DATE (COMPRESSED)                            
RMKGATTM DS    XL3       X         TIME (HHMMSS)                                
RMKGATVR DS    XL1       X         VERSION                                      
RMKGATAT DS    CL1       X         ACTION                                       
*                                  X'80' = DARE MAKEGOOD ERROR REC'D            
*                                  X'40' = DARE MAKEGOOD SENT                   
*                                  X'20' = DARE MKGD APPROVAL RECEIVED          
*                                  X'10' = DARE MKGD REJECTION RECEIVED         
*                                  X'08' = DARE MAKEGOOD CONFIRMED              
*                                  X'04' = DARE MAKEGOOD CANCELLED              
*                                  X'02' = DARE MKGD CANCELLED W/RESENT         
*                                  X'01' = DARE MKGD CANW/MORE (RECALL)         
*                                  X'00' = DARE MKGD DELNOT RECEIVED            
RMKGATLQ EQU   *-RMKGATEM                                                       
RMKGATFG DS    X                   FLAGS                                        
*                                  X'80' = OFFER WAS SELF APPLIED               
*                                  X'40' = AUTO MKGROK GENERATED                
RMKGATEN DS    XL2                 ERROR NUMBER                                 
RMKGAL2Q EQU   *-RMKGATEM          NEW LENGTH FOR ERROR SUPPORT                 
RMKGABNM DS    XL20                BUYER NAME, IF SELF-APPLY OFFER              
RMKGAL3Q EQU   *-RMKGATEM          NEW LENGTH FOR BUYER NAME SUPPORT            
         EJECT                                                                  
*********************************************************************           
*                                                                   *           
*  FOR DARE ORDERS ONLY:                                            *           
*  GROUP COMMENT RECORD:  X'05' ELEMENT WILL BE THE REJECT COMMENT  *           
*  ELEMENT                                                          *           
*                                                                   *           
*********************************************************************           
*                                                                               
RMKGRCEM DS    0C                  DARE REJECT COMMENT ELEMENT                  
RMKGRCCD DS    CL1       X'05'     ELEMENT CODE                                 
RMKGRCLN DS    CL1       X         ELEMENT LENGTH (VARIABLE)                    
RMKGRCCM DS    XL1       X         VARIABLE COMMENT                             
*                                                                               
*********************************************************************           
*                                                                   *           
*  GROUP COMMENT RECORD:  X'10' ELEMENT WILL BE DIFFERENT, WITH     *           
*  COMMENT ADDED TO IT AS A VARIABLE LENGTH FIELD.                  *           
*                                                                   *           
*                                                                   *           
*********************************************************************           
RMKGGCEM DS    0C                  GROUP COMMENT DESCRIPTION ELEMENT            
RMKGGCCD DS    CL1       X'10'     ELEMENT CODE                                 
RMKGGCLN DS    CL1       X         ELEMENT LENGTH (VARIABLE)                    
RMKGGCCM DS    0C        C         COMMENT (VARIABLE LENGTH)                    
*********************************************************************           
*                                                                   *           
*                                                                   *           
*                                                                   *           
*********************************************************************           
*                                                                               
         SPACE 1                                                                
RMKGDYEL DS    0C        V         BUY DAY-TIME ELEMENT(S) FOR A WEEK           
RMKGDYCD DS    CL1       X'02'     ELEMENT CODE                                 
RMKGDYLN DS    CL1       B         ELEMENT LENGTH                               
RMKGDYIN DS    CL1       B         START-END DAY INDICATOR                      
*                                  BITS 0-3=START DAY (MONDAY=1)                
*                                  BITS 4-7=END DAY   (SUNDAY=7)                
RMKGDAYS DS    CL1       B         DAY(S)                                       
*                                  BIT 0=SPARE         X'80'                    
*                                  BIT 1=MONDAY        X'40'                    
*                                  BIT 2=TUESDAY       X'20'                    
*                                  BIT 3=WEDNESDAY     X'10'                    
*                                  BIT 4=THURSDAY      X'08'                    
*                                  BIT 5=FRIDAY        X'04'                    
*                                  BIT 6=SATURDAY      X'02'                    
*                                  BIT 7=SUNDAY        X'01'                    
RMKGDYT1 DS    CL2       B         0-2400 START TIME FOR RBUYDAYS               
RMKGDYT2 DS    CL2       B         0-2400 END TIME FOR RMKGDAYS                 
RMKGDYWT DS    CL1       B         WEIGHTING FACTOR (NO. SPOTS) IN THIS         
*                                       DAY-TIME PERIOD                         
         SPACE 1                                                                
RMKGDTEL DS    0C        V         BUY EFFECTIVE DATE ELEMENT(S)                
RMKGDTCD DS    CL1       X'03'     ELEMENT CODE                                 
RMKGDTLN DS    CL1       B         ELEMENT LENGTH                               
RMKGDTST DS    CL3       B         START DATE (YMD) = 1ST DAY IN WEEK 1         
* PLAN RECORD DATE ELEMENT ENDS HERE WITH MONDAY WEEK DATE                      
RMKGDTED DS    CL3       B         END DATE (YMD) = END DAY IN END WEEK         
RMKGDTIN DS    CL1       B         DATE INDICATOR BYTE                          
*                                  X'80' = RUNS EVERY WEEK                      
*                                  X'40' = RUNS EVERY OTHER WEEK                
*                                  X'01' = NPW OVERRIDE                         
RMKGDTNW DS    CL1       B         NUMBER PER WEEK (USUALLY=RBUYNW)             
RMKGDTWK DS    CL1       B         NO. OF WEEKS                                 
         SPACE 1                                                                
RMKGCMEL DS    0C        V         BUY COMMENT ELEMENT(S)                       
RMKGCMCD DS    CL1       X'04'     ELEMENT CODE                                 
RMKGCMLN DS    CL1       B         ELEMENT LENGTH                               
RMKGCMNT DS    0C        AN        EACH BUY COMMENT ELEMENT CAN                 
*                                  CONTAIN UP TO 60 CHARACTERS                  
         SPACE 1                                                                
RMKGMGEL DS    0C        V         BUY MAKE-GOOD REFERENCE ELEMENT(S)           
RMKGMGCD DS    CL1       X'05'     ELEMENT CODE                                 
RMKGMGLN DS    CL1       B         ELEMENT LENGTH                               
RMKGMGLI DS    CL1       B         LINE NUMBER OF MISSED SPOT                   
RMKGMGD1 DS    CL3       B         MISSED DATE (YMD) -START OF WEEK             
RMKGMGD2 DS    CL3       B         MISSED DATE (YMD) -END OF WEEK               
*                                       CAN BE = 3X'00'                         
RMKGMGSP DS    CL1       B         MISSED NUMBER OF SPOTS                       
*                                                                               
*                                  ELEMENT EXPANSION                            
*                                                                               
RMKGMGNW DS    CL1       B         NUMBER OF WEEKS MISSED                       
RMKGMGFG DS    CL1       B         FLAGS                                        
*                                  X'80' = ALTERNATING WEEKS                    
RMKGMGLQ EQU   *-RMKGMGEL          LENGTH OF NEW ELEMENT 12/7/98                
         SPACE 1                                                                
RMKGMSEL DS    0C        V         BUY MISSED ELEMENT(S)                        
RMKGMSCD DS    CL1       X'06'     ELEMENT CODE                                 
RMKGMSLN DS    CL1       B                                                      
RMKGMSDT DS    CL3       B         MISSED DATE - YMD                            
RMKGMSLI DS    CL1       B         MAKE-GOOD LINE NUMBER                        
RMKGMSSP DS    CL1       B         MISSED NUMBER OF SPOTS                       
         SPACE 1                                                                
RMKGCREL DS    0C        V         CREDIT ELEMENT FOR MISSED SPOT               
RMKGCRCD DS    CL1       X'07'     ELEMENT CODE                                 
RMKGCRLN DS    CL1       B         ELEMENT LENGTH                               
RMKGCRDT DS    CL3       B         MISSED DATE                                  
RMKGCRLI DS    CL1       B         CREDIT-LINE NUMBER                           
RMKGCRSP DS    CL1       B         NO. OF SPOTS MISSED                          
         SPACE 1                                                                
RMKGSPEL DS    0C        V         SPOTPAK INTERFACE ELEMENT                    
RMKGSPCD DS    CL1       X'08'     ELEMENT CODE                                 
RMKGSPLN DS    CL1       B, X'30'  ELEMENT LENGTH                               
RMKGSPAG DS    CL2       AN        SPOTPAK AGENCY POWER CODE                    
RMKGSPMD DS    CL1       AN        SPOTPAK MEDIA CODE                           
RMKGSPCL DS    CL3       AN        SPOTPAK CLIENT CODE                          
RMKGSPPD DS    CL3       AN        SPOTPAK PRODUCT CODE                         
RMKGSPES DS    CL1       B         SPOTPAK ESTIMATE NUMBER                      
RMKGSPPP DS    CL3       AN        SPOTPAK PIGGY PRODUCT CODE                   
RMKGSPP1 DS    CL1       B         SPOTPAK PRODUCT 1 SPLIT                      
RMKGSPP2 DS    CL1       B         SPOTPAK PRODUCT 2 SPLIT                      
RMKGSPL# DS    CL1       B         SPOTPAK BUYLINE NUMBER                       
RMKGSPST DS    CL5       AN        STATION CALL LETTERS                         
RMKGSADV DS    CL4       AN        REPPAK ADVERTISER CODE                       
RMKGSPRD DS    CL3       AN        REPPAK PRODUCT CODE                          
RMKGSPDT DS    CL3       B         SPOTPAK TRANSFER DATE                        
RMKGSPTM DS    CL4       B         SPOTPAK TRANSFER TIME                        
         DS    CL12                SPARE                                        
***********************************************************************         
*        PASSIVE KEY/SWITCH FIELDS ELEMENTS                                     
*        SALESPERSON/TEAM INFORMATION                                           
***********************************************************************         
RMKGXEL  DS    XL1                 ELEMENT CODE                                 
RMKGXELQ EQU   X'0A'                                                            
RMKGXLEN DS    XL1                                                              
*                                                                               
RMKGXSAL DS    CL3   RCONSAL       SALESPERSON CODE - ALL FOR THIS              
RMKGXOFF DS    CL2   RCONKOFF      OFFICE CODE                                  
RMKGXTEM DS    CL2   RCONTEM       SALES TEAM                                   
RMKGXSTA DS    CL5   RCONKSTA      PRIMARY STATION CALL LETTERS                 
RMKGXADV DS    CL4   RCONKADV      ADVERTISER CODE                              
RMKGXAGY DS    CL4   RCONKAGY      AGENCY CODE                                  
RMKGXAOF DS    CL2   RCONKAOF      AGENCY OFFICE CODE                           
RMKGXGRP DS    CL2   RCONKGRP      STATION GROUP/SUBGROUP                       
RMKGXDSP DS    CL3   RCONDVSP      DEVELOPEMENTAL SALESPERON CODE               
RMKGXDCT DS    CL2   RCONDVCT      DEVELOPEMENTAL CONTRACT TYPE                 
RMKGXFLT DS    CL6   RCONDATE      FLIGHT START & END DATES                     
RMKGXLNQ EQU   *-RMKGXEL           L'ELEMENT                                    
***********************************************************************         
         SPACE 1                                                                
RMKGCDEL DS    0C        V         MAKEGOOD CONTROL DESCRIPT ELEMENT            
RMKGCDCD DS    CL1       X'10'     ELEMENT CODE                                 
RMKGCDLN DS    CL1       B         ELEMENT LENGTH                               
RMKGCDDT DS    CL2       C         DATE ENTERED                                 
RMKGCDDU DS    CL2       C         DATE LAST UPDATED                            
RMKGCDTM DS    CL2       B         TIME ENTERED      :  HHMM                    
RMKGCDTU DS    CL2       B         TIME LAST UPDATED :  HHMM                    
RMKGCDDS DS    CL1       C         DESCRIPTION:  VARIABLE LENGTH                
         SPACE 1                                                                
RMKGDCEL DS    0C        V         DETAIL COMMENT ELEMENT                       
RMKGDCCD DS    CL1       X'11'     ELEMENT CODE                                 
RMKGDCLN DS    CL1       B         ELEMENT LENGTH (VARIABLE)                    
RMKGDCCM DS    CL1       C         COMMENT (VARIABLE)                           
         SPACE 1                                                                
*                                                                               
*                                                                               
* REP DEMO ELEMENT                                                              
* REP'S DEMO VALUES OVERRIDE DARE AGENCY'S DEMO VALUES                          
*                                                                               
RMKGDMEL DS    0C        V         REP DEMO VALUE ELEMENT                       
RMKGDMCD DS    CL1       X'0E'     ELEMENT CODE                                 
RMKGDMCQ EQU   X'0E'                                                            
RMKGDMLN DS    CL1       B         LENGTH                                       
*                                                                               
* VARIABLE NUMBER OF DEMO CATEGORIES AND VALUES                                 
*                                                                               
RMKGDMCV DS    0XL11                                                            
RMKGDMCT DS    XL3       B         DEMO CATEGORY                                
RMKGDMDM DS    XL4       PWOS      1 IMPLIED DECIMAL, IMP'S IN 1000'S           
*                                  4X'FF' MEANS VALUE NOT PROVIDED              
RMKGDM2M DS    XL4       PWOS      PREVIOUS VALUE                               
*                                  4X'FF' MEANS VALUE NOT PROVIDED              
*                                                                               
*                                                                               
RMKGSTEL DS    0C        V         STATUS CONTROL ELEMENT                       
RMKGSTCD DS    CL1       X'20'     ELEMENT CODE                                 
RMKGSTLN DS    CL1       B         ELEMENT LENGTH                               
RMKGSTCH DS    XL1       X         CHOSEN INDICATOR                             
*                                  X'00'  =  NOT CHOSEN (IF                     
*                                     PARTICIPATING IN AN 'OR' OFFER)           
*                                  X'01'  =  CHOSEN (IF PARTIC-                 
*                                     IPATING IN AN 'OR' OFFER)                 
*                                  OTHERS????                                   
RMKGSTST DS    CL1       C         STATUS                                       
*                                  A  =  APPLIED                                
*                                  B  =  BACKED OUT                             
*                                  C  =  CANCELLED                              
*                                  R  =  REJECTED:  DON'T APPLY                 
*                                  OTHERS????                                   
RMKGSTL# DS    XL1       B         LINE NUMBER GENERATED FOR M/G                
         DS    CL5       C         SPARE                                        
*                                                                               
* X'21' PROGRAM ELEMENT                                                         
*                                                                               
RMKGPGEL DS    0C        V         PROGRAM ELEMENT                              
RMKGPGCD DS    CL1       X'21'     ELEMENT CODE                                 
RMKGPGEQ EQU   X'21'                                                            
RMKGPGLN DS    CL1       B         ELEMENT LENGTH                               
RMKGPGM  DS    0C        B         PROGRAM (MX 34 CHAR)                         
*                                                                               
         SPACE 1                                                                
RMKGOCEL DS    0C        V         BUY ORDER COMMENT ELEMENT                    
RMKGOCCD DS    CL1       X'84'     ELEMENT CODE                                 
RMKGOCLN DS    CL1       B         ELEMENT LENGTH                               
RMKGOCID DS    CL1       X         X'80' REP INPUT COMMENT                      
*                                  0  STATION INPUT COMMENT                     
RMKGOCNT DS    0C        AN        COMMENT CAN BE UP TO 60 CHARACTERS           
         SPACE 1                                                                
         ORG                                                                    
