*          DATA SET REGENTER   AT LEVEL 003 AS OF 04/09/97                      
*              TERRITORY RECORD                                                 
RTERREC  DS    0C        V         RECORD                                       
RTERKEY  DS    0CL27     V         KEY                                          
RTERKTYP DS    CL23      X'3D'     RECORD TYPE                                  
RTERKTYQ EQU   X'3D'               RECORD TYPE EQUATE                           
RTERKREP DS    CL2       AN        REP CODE                                     
RTERKTER DS    CL2       AN        TERRITORY CODE                               
RTERLEN  DS    CL2       B         RECORD LENGTH                                
RTERCNTL DS    CL1       X         CONTROL BYTE                                 
RTERLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
RTERELEM DS    0C                  CLASS ELEMENT                                
RTERCODE DS    CL1       X'01'     ELEMENT CODE                                 
RTERELLN DS    CL1       B         ELEMENT LENGTH                               
RTERNAME DS    CL30      AN        TERRITORY NAME                               
RTERPROF DS    CL30      AN        PROFILE (DEFAULT=C'0')                       
         DS    CL30      -         SPARE                                        
