*          DATA SET REGENPBYDS AT LEVEL 004 AS OF 01/23/91                      
         TITLE 'REGENPBYD - DSECTS FOR REGENPBY'                                
PD       DSECT                     PRINT LINE DSECT                             
PRTLN    DS    0CL81                                                            
PCHG     DS    CL2                 CHANGE CODES                                 
         DS    CL1                                                              
PLIN     DS    CL3                 LINE NUMBER                                  
         DS    CL1                                                              
PDAY     DS    CL12                DAYS                                         
         DS    CL1                                                              
PTIM     DS    CL11                TIMES                                        
         DS    CL1                                                              
PLEN     DS    CL3                 LENGTH                                       
         DS    CL1                                                              
PDAT     DS    CL12                DATES                                        
         DS    CL1                                                              
PCLS     DS    CL3                 CLASS                                        
         DS    CL1                                                              
PSEC     DS    CL3                 SECTION                                      
         DS    CL1                                                              
PPLN     DS    CL3                 PLAN                                         
         DS    CL1                                                              
PNPW     DS    CL3                 NUMBER PER WEEK                              
         DS    CL1                                                              
PRAT     DS    CL10                RATE                                         
         DS    CL1                                                              
PTOT     DS    CL3                 TOTAL SPOTS                                  
         DS    CL1                                                              
PTYP     DS    CL1                 TYPE                                         
