*          DATA SET REGENPRO   AT LEVEL 010 AS OF 06/15/98                      
*              PROPOSAL RECORDS                                                 
***********************************************************************         
* HISTORY OF CHANGES                                                            
***********************************************************************         
* 23AUG96 (JRD)   ---  MERGED NEW BOOK ELEMENT(REPRONBK)                        
* 19DEC95 (WH )   ---  COMBINING HEADER & DETAIL INTO ONE HUGE RECORD           
*   OCT95 (WH )   ---  NEW RECORD TYPE                                          
*                                                                               
*  RECORD X'4301' IS THE SELLERS WORKSHEET ON THE MAINFRAME                     
*                     COVERED IN THIS REGENPRO                                  
*  RECORD X'4302' IS THE SELLERS WORKSHEET FORE WINDOWS                         
*                     COVERED IN REGENSLW                                       
*                                                                               
*                      ***  END TOMBSTONE  ***                                  
***********************************************************************         
MAXWKS   EQU   14                  MAXIMUM NUMBER OF WEEKS                      
         EJECT                                                                  
***********************************************************************         
* PROPOSAL RECORD                                                               
***********************************************************************         
RPROHDRD DSECT                                                                  
RPROKEY  DS    0CL27               KEY                                          
RPROKMST DS    0CL19               *** MASTER KEY FOR MINIO                     
*------------*                                                                  
* ACTIVE KEY *                                                                  
*------------*                                                                  
RPROKTYP DS    XL1                 RECORD CODE X'4301'                          
RPROKTYQ EQU   X'43'                                                            
RPROKSTY DS    XL1                                                              
RPROKSBQ EQU   X'01'                                                            
         DS    XL5                 SPARE                                        
RPROKRCD DS    CL2                 REP CODE (POWER CODE)                        
RPROKCON DS    XL4                 CONTRACT NUMBER (9'S COMPLEMENT)             
RPROKPRO DS    XL1                 PROPOSAL NUMBER (X'FF' COMPLEMENT)           
         DS    XL5                 SPARE                                        
*----------------------------------*                                            
* SALESPERSON/STATION PASSIVE KEY *                                             
*----------------------------------*                                            
         ORG   RPROKEY                                                          
RPROPTYP DS    XL1                 RECORD CODE X'C301'                          
RPROPTYQ EQU   X'C3'                                                            
RPROPSTY DS    XL1                                                              
RPROPSBQ EQU   X'01'                                                            
RPROPRCD DS    CL2                 REP CODE (POWER CODE)                        
RPROPSAL DS    CL3                 SALESPERSON CODE                             
RPROPSTA DS    XL5                 PRIMARY STATION CALL LETTERS                 
RPROPCON DS    XL4                 CONTRACT NUMBER (9'S COMPLEMENT)             
RPROPPRO DS    XL1                 PROPOSAL NUMBER (X'FF' COMPLEMENT)           
         DS    XL2                 SPARE                                        
*----------------------------------*                                            
* OFFICE/SALESPERSON PASSIVE KEY *                                              
*----------------------------------*                                            
         ORG   RPROKEY                                                          
RPROOTYP DS    XL1                 RECORD CODE X'C302'                          
RPROOTYQ EQU   X'C3'                                                            
RPROOSTY DS    XL1                                                              
RPROOSBQ EQU   X'02'                                                            
RPROORCD DS    CL2                 REP CODE (POWER CODE)                        
RPROOOFF DS    CL2                 OFFICE                                       
RPROOSAL DS    CL3                 SALESPERSON CODE                             
         DS    XL3                 SPARE                                        
RPROOCON DS    XL4                 CONTRACT NUMBER (9'S COMPLEMENT)             
RPROOPRO DS    XL1                 PROPOSAL NUMBER (X'FF' COMPLEMENT)           
         DS    XL2                 SPARE                                        
*--------------------*                                                          
* MINIO EMLEMENT KEY *                                                          
*--------------------*                                                          
RPROKMEL DS    XL8                 *** ELEMENT KEY FOR MINIO                    
*                                                                               
RPROKCTL DS    XL1                 CONTROL BYTE                                 
RPROKDA  DS    XL4                 DISK ADDRESS                                 
*                                                                               
         ORG   RPROKCTL                                                         
RPRORLEN DS    XL2                 RECORD LENGTH                                
RPRORSTA DS    XL1                 STATUS BYTES                                 
RPRORLNK DS    XL4                 LINK ADDRESS                                 
*                                                                               
RPROR1ST DS    0C                  A(FIRST ELEMENT)                             
***********************************************************************         
* DESCRIPTION ELEMENT                                                           
***********************************************************************         
RPRDSELD DSECT                                                                  
RPRDSEL  DS    X                   ELEMENT CODE                                 
RPRDSELQ EQU   X'01'                                                            
RPRDSLEN DS    X                   ELEMENT LENGTH                               
*                                  ** MINIO ELEMENT KEY **                      
         DS    XL7                 SPARE FOR MINIO                              
*                                                                               
RPRDSOPT DS    X                   OPTIONS                                      
RPRDSOTX EQU   X'80'                - TEXT FROM INVENTORY WILL DISPLAY          
RPRDSODC EQU   X'40'                - DEMO DECIMAL PRECISION                    
*                                     OTHERWISE REPORT FIRST DAYPART            
RPRDSSEC DS    XL6                 SECONDS LIST                                 
RPRDSSDT DS    XL3                 SUBMIT DATE (PWOS JULIAN)                    
RPRDSSTM DS    XL2                 SUBMIT TIME (MILITARY)                       
RPRDSFTM DS    X                   FETCH METHOD                                 
RPRDSFAQ EQU   C'A'                RETURN ALL MATCHES                           
RPRDSFFQ EQU   C'F'                RETURN UNDER FIRST DAYPART                   
RPRDSFPQ EQU   C'P'                RETURN UNDER PRIMARY DAYPART                 
RPRDSBTP DS    X                   BOOK TYPE - FOR DISPLAY                      
RPRDSBIQ EQU   C'I'                INVENTORY BOOKS                              
RPRDSBTQ EQU   C'T'                TIME PERIOD BOOKS                            
RPRDSBPQ EQU   C'P'                PAV BOOKS                                    
RPRDSBYQ EQU   C'4'                TYPICAL TIME PERIOD BOOKS                    
RPRDSSAL DS    CL3                 SALESPERSON CODE                             
RPRDSFLG DS    X                   FLAGS                                        
RPRDSSTA EQU   X'80'               STATION ACCESS ALLOWED                       
         DS    XL5                 SPARE                                        
RPRDSLNQ EQU   *-RPRDSELD          L(ELEMENT)                                   
***********************************************************************         
* PASSIVE KEY/SWITCH FIELDS ELEMENTS                                            
***********************************************************************         
RPRSWELD DSECT                                                                  
RPRSWEL  DS    XL1                 ELEMENT CODE                                 
RPRSWELQ EQU   X'02'                                                            
RPRSWLEN DS    XL1                                                              
*                                  ** MINIO ELEMENT KEY **                      
         DS    XL7                 SPARE FOR MINIO                              
*                                                                               
RPRSWSAL DS    CL3   RCONSAL       SALESPERSON CODE - ALL FOR THIS              
RPRSWOFF DS    CL2   RCONKOFF      OFFICE CODE                                  
RPRSWTEM DS    CL2   RCONTEM       SALES TEAM                                   
RPRSWSTA DS    CL5   RCONKSTA      PRIMARY STATION CALL LETTERS                 
RPRSWADV DS    CL4   RCONKADV      ADVERTISER CODE                              
RPRSWAGY DS    CL4   RCONKAGY      AGENCY CODE                                  
RPRSWAOF DS    CL2   RCONKAOF      AGENCY OFFICE CODE                           
RPRSWGRP DS    CL2   RCONKGRP      STATION GROUP/SUBGROUP                       
RPRSWDSP DS    CL3   RCONDVSP      DEVELOPEMENTAL SALESPERON CODE               
RPRSWDCT DS    CL2   RCONDVCT      DEVELOPEMENTAL CONTRACT TYPE                 
RPRSWFLT DS    CL6   RCONDATE      FLIGHT START & END DATES                     
RPRSWLNQ EQU   *-RPRSWELD          L'ELEMENT                                    
***********************************************************************         
* ACTIVITY DATE ELEMENTS                                                        
***********************************************************************         
RPRACELD DSECT                                                                  
RPRACEL  DS    XL1                 ELEMENT CODE                                 
RPRACELQ EQU   X'03'                                                            
RPRACLEN DS    XL1                                                              
*                                  ** MINIO ELEMENT KEY **                      
RPRACTYP DS    XL1                 DATE TYPE                                    
RPRACADD EQU   1                   PROPOSAL ADD DATE                            
RPRACPHC EQU   2                   PROPOSAL HEADER CHANGE                       
         DS    CL6                 SPARE                                        
RPRACFLG DS    XL1                 FLAGS                                        
RPRACFAS EQU   X'80'                - DATE ASSUMED                              
RPRACDAT DS    CL3                 DATE                                         
RPRACLNQ EQU   *-RPRACELD                                                       
***********************************************************************         
* COMMENT ELEMENTS                                                              
***********************************************************************         
RPRCMELD DSECT                                                                  
RPRCMEL  DS    XL1                 ELEMENT CODE                                 
RPRCMELQ EQU   X'05'                                                            
RPRCMLEN DS    XL1                                                              
*                                  ** MINIO ELEMENT KEY **                      
RPRCMLIN DS    XL1                 COMMENT LINE NUMBER                          
         DS    CL6                 SPARE                                        
*                                                                               
RPRCMOVQ EQU   *-RPRCMELD          L(OVERHEAD NEFORE THE COMMENT TEXT)          
*                                                                               
RPRCMTXT DS    0C                  A(1ST CHARACTER IN COMMENT TEXT)             
***********************************************************************         
* BOOK ELEMENT                                                                  
***********************************************************************         
RPRBKELD DSECT                                                                  
RPRBKEL  DS    X                   ELEMENT CODE                                 
RPRBKELQ EQU   X'10'                                                            
RPRBKLEN DS    X                   ELEMENT LENGTH                               
*                                  ** MINIO ELEMENT KEY **                      
RPRBKIOR DS    XL1                 INTERNAL ORDER                               
         DS    XL6                 SPARE FOR MINIO                              
*                                                                               
RPRBKDOR DS    XL1                 DISPLAY ORDER                                
*                                                                               
*           BREAKDOWN FOR THE 3 BYTE BOOK BINARY                                
RPRBKSTT DS    X                   BOOK BYTE 1                                  
RPRBKSSP EQU   X'80'                - SUPPRESS CPP/CPM                          
RPRBKSRC EQU   X'40'                - 0=ARB,1=NSI                               
RPRBKSES EQU   X'20'                - ESTIMATED                                 
RPRBKSNT EQU   X'10'                - NETWORK                                   
RPRBKSTP EQU   X'08'                - TIME PERIOD                               
RPRBKSPJ EQU   X'04'                - PROJECTED                                 
RPRBKST2 EQU   X'02'                - TIME PERIOD X'02'                         
RPRBKSSD EQU   X'01'                - SPANISH DEMOS (SRC)                       
RPRBKBYM DS    XL2                 BOOK BYTES 2 & 3: YEAR/MONTH                 
*                                                                               
RPRBKFLG DS    X                   STATUS FLAGS                                 
RPRBKFFT EQU   X'80'                - FETCHED FOR THIS BOOK ALREADY             
RPRBKPFT EQU   X'01'                - PRIME BOOK FETCH COMPLETED                
*                                                                               
RPRBKBKT DS    CL1                 SPECIAL BOOK TYPE                            
RPRBKFIL DS    CL1                 BOOK SOURCE FILE                             
RPRBKINQ EQU   C'I'                INVENTORY                                    
RPRBKTPQ EQU   C'T'                TIME PERIOD                                  
RPRBKT4Q EQU   C'4'                TYPICAL TIME PERIOD(4 WK AVG)                
RPRBKPAQ EQU   C'P'                PROGRAM AVERAGE                              
         DS    XL3                 SPARE                                        
RPRBKOVQ EQU   *-RPRBKELD          L(ELEMENT IF NOT USER-DEFINED)               
*                                                                               
RPRBKUDF DS    CL5                 THE USER-DEFINED NAME OF THE BOOK            
RPRBKBKS DS    XL1                 ACTIVE BOOKS (X'80'=1 X'40'=2 ETC)           
RPRBKBTY DS    XL1                 BOOK TYPE FOR HUT,PUT,HPT BOOK               
RPRBKTYP DS    XL1                 01=HOMES 02=RATING 03=HUT/PUT                
*                                  04=INDEX 05=SVI  C'T,R..'=DEMO INDEX         
*                                           06=HPT                              
RPRBKDCT DS    XL1                 SPECIFIC DEMO CATEGORY                       
*                                  C'P'=PUT WHEN RPRBKTYP=03                    
RPRBKOPS DS    0CL8                LIST OF OPERANDS                             
RPRBKOP1 DS    CL2                 THESE ARE EITHER 2 BYTE NUMERIC              
RPRBKOP2 DS    CL2                 FIELDS OR BOOK EXPRESSION (Y/M)              
RPRBKOP3 DS    CL2                                                              
RPRBKOP4 DS    CL2                                                              
*                                                                               
RPRBKXBK DS    CL(2*3)            EXTRA SOURCE BOOKS                            
*                                                                               
         DS    XL3                 SPARE                                        
RPRBKUOQ EQU   *-RPRBKELD          L(OVERHEAD IN ELEM IF USER-DEFINED)          
RPRBKUPG DS    0C                  COPY OF THE UPGRADE EXPRESSION               
***********************************************************************         
* BOOK EXTENSION ELEMENT                                                        
***********************************************************************         
RPRBXELD DSECT                                                                  
RPRBXEL  DS    X                   ELEMENT CODE                                 
RPRBXELQ EQU   X'11'                                                            
RPRBXLEN DS    X                   ELEMENT LENGTH                               
*                                  ** MINIO ELEMENT KEY **                      
RPRBXIOR DS    XL1                 INTERNAL ORDER OF BOOK                       
         DS    XL6                 SPARE FOR MINIO                              
*                                                                               
RPRBXFLG DS    XL1                                                              
RPRBXDPT DS    CL8                 ASSOCIATED DAYPARTS                          
         DS    XL10                                                             
RPRBXLNQ EQU   *-RPRBXELD                                                       
***********************************************************************         
* DEMO ELEMENT                                                                  
***********************************************************************         
RPRDMELD DSECT                                                                  
RPRDMEL  DS    X                   ELEMENT CODE                                 
RPRDMELQ EQU   X'20'                                                            
RPRDMLEN DS    X                   ELEMENT LENGTH                               
*                                  ** MINIO ELEMENT KEY **                      
RPRDMIOR DS    XL1                 INTERNAL ORDER                               
         DS    XL6                 SPARE FOR MINIO                              
*                                                                               
RPRDMDOR DS    XL1                 DISPLAY ORDER                                
RPRDMSRC DS    C                   SOURCE                                       
*                                                                               
*           BREAKDOWN FOR THE 3 BYTE DEMO BINARY                                
RPRDMBY1 DS    X                   DEMO BYTE 1                                  
RPRDMB1S EQU   X'80'                 - SUPPRESS CPP/CPM                         
RPRDMB1P EQU   X'40'                 - PRIME                                    
RPRDMBY2 DS    C                   DEMO BYTE 2                                  
RPRDMB2T EQU   C'T'                  - TSA                                      
RPRDMB2D EQU   C'D'                  - DMA                                      
RPRDMB2R EQU   C'R'                  - RATING                                   
RPRDMB2S EQU   C'S'                  - SHR                                      
RPRDMB2P EQU   C'P'                  - PUT                                      
RPRDMB2U EQU   C'U'                  - UNV                                      
RPRDMBY3 DS    X                   DEMO BYTE 3 - DEMO CATEGORY NUMBER           
*                                                                               
RPRDMFLG DS    XL1                 FLAGS                                        
RPRDMFFT EQU   X'80'                 - FETCHED                                  
*                                                                               
RPRDMLNQ EQU   *-RPRDMELD                                                       
***********************************************************************         
* STATION ELEMENT                                                               
***********************************************************************         
RPRSTELD DSECT                                                                  
RPRSTEL  DS    X                   ELEMENT CODE                                 
RPRSTELQ EQU   X'30'                                                            
RPRSTLEN DS    X                   ELEMENT LENGTH                               
*                                  ** MINIO ELEMENT KEY **                      
RPRSTICD DS    XL1                 INTERNAL CODE FOR STATION                    
         DS    XL6                 SPARE FOR MINIO                              
*                                                                               
RPRSTSTA DS    CL5                 STATION EBCDIC (BLANK PADDED)                
RPRSTFLG DS    XL1                 STATUS FLAGS                                 
RPRSTFFT EQU   X'80'                - FETCHED FOR THIS STATION ALREADY          
RPRSTSTL EQU   X'40'                - FETCH FOR SATELLITE STATION               
         DS    XL2                 SPARE                                        
RPRSTLNQ EQU   *-RPRSTELD                                                       
***********************************************************************         
* HIATUS ELEMENT                                                                
***********************************************************************         
RPRHIELD DSECT                                                                  
RPRHIEL  DS    X                   ELEMENT CODE                                 
RPRHIELQ EQU   X'40'                                                            
RPRHILEN DS    X                   ELEMENT LENGTH                               
*                                  ** MINIO ELEMENT KEY **                      
         DS    XL7                 SPARE FOR MINIO                              
*                                                                               
RPRHIOVQ EQU   *-RPRHIELD          L(ELEMENT WITHOUT DATES)                     
RPRHIDTS DS    0XL3                A(1ST PWOS JULIAN DATE)                      
***********************************************************************         
* DAYPART ELEMENT                                                               
***********************************************************************         
RPRDPELD DSECT                                                                  
RPRDPEL  DS    X                   ELEMENT CODE                                 
RPRDPELQ EQU   X'50'                                                            
RPRDPLEN DS    X                   ELEMENT LENGTH                               
*                                  ** MINIO ELEMENT KEY **                      
RPRDPSEQ DS    X                   INTERNAL ORDER NUMBER                        
         DS    XL6                 SPARE                                        
*                                                                               
RPRDPDPT DS    C                   DAY PART CODE (M=MNG D=DAY E=ELY             
*                                     R=ENW A=ACC T=LNW L=LTE W=WKD             
*                                     K=KID N=NWS P=PRI V=MOV S=SPE             
*                                     J=SPO O=SPS U=COM X=LOC Y=OTH)            
RPRDPDAY DS    X                   BIT 0=SPARE 1=MON 2=TUE ... 7=SUN            
RPRDPSTM DS    XL2                 START TIME 0-2400  (NONE IF NULLS)           
RPRDPETM DS    XL2                 END   TIME 0-2400        " "                 
RPRDPSDT DS    XL3                 START DATE PWOS JULIAN   " "                 
RPRDPEDT DS    XL3                 END   DATE PWOS JULIAN   " "                 
RPRDPTAB DS    XL4                 TAB (CPP)                                    
RPRDPFLG DS    XL1                 STATUS FLAGS                                 
RPRDPFFT EQU   X'80'                - THIS DAYPART ELEM ALREADY FETCHED         
RPRDPFMN EQU   X'40'                - DAYPART MENU (NOT HARD-CODED TBL)         
RPRDPFAI EQU   X'20'                - ALL INVENTORY TEXT TO BE PRINTED          
RPRDPLNQ EQU   *-RPRDPELD                                                       
***********************************************************************         
* COST HEADER ELEMENT                                                           
***********************************************************************         
RPRCHELD DSECT                                                                  
RPRCHEL  DS    XL1                 ELEMENT CODE                                 
RPRCHELQ EQU   X'51'                                                            
RPRCHLEN DS    XL1                                                              
*                                  ** MINIO ELEMENT KEY **                      
RPRCHSEQ DS    X                   INTERNAL ORDER NUMBER                        
         DS    XL6                 SPARE                                        
*                                                                               
RPRCHBK  DS    XL1                 INTERNAL ORDER # OF BOOK                     
RPRCHRTC DS    CL4                 RATE CARD (1ST HALF OF NEW NAME)             
RPRCHSLN DS    XL1                 SECONDS LENGTH                               
RPRCHQTR DS    XL1                 QUARTER                                      
RPRCHYR  DS    XL1                 YEAR                                         
RPRCHFLG DS    XL1                 FLAGS                                        
RPRCHFTC EQU   X'80'               FETCHED                                      
RPRCHNEW EQU   X'40'               NEW RATECARD                                 
RPRCHTGP DS    XL3                 TOTAL GRPS - 79992 MAX                       
RPRCHPBC DS    XL1                 PERCENT BASE COST(COST 1)                    
RPRCHRT2 DS    XL4                 2ND HALF OF NEW RATECARD NAME                
         DS    XL2                 SPARE                                        
RPRCHOVQ EQU   *-RPRCHELD          L'ELEMENT W/O LABEL                          
RPRCHLBL DS    0C                  LABEL                                        
***********************************************************************         
* COST GOAL LINE ELEMENT                                                        
***********************************************************************         
RPRCGELD DSECT                                                                  
RPRCGEL  DS    XL1                 ELEMENT CODE                                 
RPRCGELQ EQU   X'52'                                                            
RPRCGLEN DS    XL1                                                              
*                                  ** MINIO ELEMENT KEY **                      
RPRCGCHP DS    XL1                 COST HEADER PAGE IO #                        
RPRCGDPT DS    CL1                 DAYPART                                      
         DS    XL5                 SPARE                                        
*                                                                               
RPRCGDOR DS    XL1                 DISPLAY ORDER #                              
RPRCGPDP DS    XL1                 % DAYPART                                    
RPRCGGRP DS    XL2                 GRP - 9999 MAX                               
RPRCGCPP DS    XL4                 BUYER CPP - 99999.99 MAX                     
         DS    XL5                 SPARE                                        
RPRCGLNQ EQU   *-RPRCGELD          L'ELEMENT                                    
         EJECT                                                                  
***********************************************************************         
* DETAIL DESCRIPTION ELEMENT  (MASTER OF THE CLUSTER)                           
***********************************************************************         
RPRDTELD DSECT                                                                  
RPRDTEL  DS    XL1                 ELEMENT CODE                                 
RPRDTELQ EQU   X'60'                                                            
RPRDTLEN DS    XL1                                                              
*                                  ** MINIO ELEMENT KEY **                      
RPRDTSTA DS    XL1                 STATION INTERNAL CODE                        
RPRDTDPT DS    CL1                 DAYPART CODE                                 
RPRDTDAY DS    XL1                 BIT 0=SPARE 1=MON .. 7=SUN                   
RPRDTTIM DS    XL2                 START TIME SHIFTED 4 BITS WITH THE           
*                                    # 1/4 HRS IN LAST 4 BITS                   
RPRDTSEQ DS    XL1                 SEQUENCE NUMBER                              
         DS    XL1                 SPARE                                        
*                                                                               
RPRDTFL1 DS    XL1                 FLAG                                         
RPRDTF1H EQU   X'80'                - HIDDEN LINE                               
RPRDTINM DS    CL4                 INVENTORY NUMBER                             
RPRDTSTM DS    XL2                 START TIME                                   
RPRDTETM DS    XL2                 END   TIME                                   
RPRDTTAB DS    XL4                 TAB (CPP) FOR THIS DETAIL                    
RPRDTSC1 DS    XL4                 COST 1 SUBMITTED                             
RPRDTNC1 DS    XL4                 COST 1 NEGOTIATED                            
RPRDTPRG DS    XL2                 PROGRAM # (LINK TO PROGRAM ELEM)             
RPRDTBKS DS    XL1                 BIT 0=SPARE 1=BK1 .. 7=BK7                   
*                                    IF BIT IS ON, BOOK IS SUPPRESSED           
RPRDTTSP DS    XL2                 TOTAL NUMBER OF SPOTS                        
RPRDTEFF DS    XL3                 EFFECTIVE DATE (PWOS JULIAN)                 
RPRDTEEF DS    XL3                 END EFFECTIVE DATE (PWOS JULIAN)             
RPRDTSLN DS    XL1                 SECONDS LENGTH                               
RPRDTOVQ EQU   *-RPRDTELD          L(ELEMENT WITHOUT ANY WEEKS)                 
*                                                                               
RPRDTWKS DS    0XL(MAXWKS)         SPOTS PER WEEK (1 BYTE/WEEK)                 
***********************************************************************         
* DETAIL SUPPLEMENTAL DAY/TIME ELEMENT (DAY/TIMES 2-8)                          
***********************************************************************         
RPRDYELD DSECT                                                                  
RPRDYEL  DS    XL1                 ELEMENT CODE                                 
RPRDYELQ EQU   X'61'                                                            
RPRDYLEN DS    XL1                                                              
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRDYOVQ EQU   *-RPRDYELD          L(ELEMENT WITHOUT ANY DAY/TIMES)             
RPRDYDTM DS    0XL5                A(1ST DAY/TIME)                              
***********************************************************************         
* DETAIL SUPPLEMENTAL PROGRAM ELEMENT (PROGRAMS 2-8)                            
***********************************************************************         
RPRPRELD DSECT                                                                  
RPRPREL  DS    XL1                 ELEMENT CODE                                 
RPRPRELQ EQU   X'62'                                                            
RPRPRLEN DS    XL1                                                              
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRPROVQ EQU   *-RPRPRELD          L(ELEMENT WITHOUT ANY PROGRAM CODES)         
RPRPRPRG DS    0XL2                PROGRAM # (LINK TO PROGRAM ELEM)             
***********************************************************************         
* DETAIL SUPPLEMENTAL COST ELEMENT (USED FOR QUARTERLY AMOUNTS)                 
***********************************************************************         
RPRCSELD DSECT                                                                  
RPRCSEL  DS    XL1                 ELEMENT CODE                                 
RPRCSELQ EQU   X'63'                                                            
RPRCSLEN DS    XL1                                                              
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRCSSC2 DS    XL4                 COST 2 SUBMITTED                             
RPRCSNC2 DS    XL4                 COST 2 NEGOTIATED                            
RPRCSSC3 DS    XL4                 COST 3 SUBMITTED                             
RPRCSNC3 DS    XL4                 COST 3 NEGOTIATED                            
RPRCSSC4 DS    XL4                 COST 4 SUBMITTED                             
RPRCSNC4 DS    XL4                 COST 4 NEGOTIATED                            
RPRCSLNQ EQU   *-RPRCSELD          L(ELEMENT)                                   
***********************************************************************         
* INVENTORY TEXT ELEMENT                                                        
***********************************************************************         
RPRITELD DSECT                                                                  
RPRITEL  DS    XL1                 ELEMENT CODE                                 
RPRITELQ EQU   X'64'                                                            
RPRITLEN DS    XL1                                                              
RPRITSEQ DS    XL1                 SEQUENCE NUMBER                              
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRITOVQ EQU   *-RPRITELD          L(ELEMENT WITH INVENTORY TEXT #'S)           
RPRIT1ST DS    0XL2  <== FOR NOW                                                
***********************************************************************         
* USER TEXT ELEMENT                                                             
***********************************************************************         
RPRUTELD DSECT                                                                  
RPRUTEL  DS    XL1                 ELEMENT CODE                                 
RPRUTELQ EQU   X'65'                                                            
RPRUTLEN DS    XL1                                                              
RPRUTLIN DS    XL1                 LINE NUMBER                                  
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRUTOVQ EQU   *-RPRUTELD          L(ELEMENT WITH INVENTORY TEXT #'S)           
RPRUTTXT DS    0C                  A(1ST CHARACTER OF USER TEXT)                
***********************************************************************         
* HEADER EXPANSION ELEMENT                                                      
***********************************************************************         
RPRHXELD DSECT                                                                  
RPRHXEL  DS    XL1                 ELEMENT CODE                                 
RPRHXELQ EQU   X'66'                                                            
RPRHXLEN DS    XL1                                                              
RPRHXCBK DS    XL1                 BIT 0=SPARE 1=BK1 .. 7=BK7                   
*                                   IF BIT IS ON PRINT CPP                      
         DS    XL16                SPARE                                        
RPRHXLNQ EQU   *-RPRHXELD          LENGTH                                       
***********************************************************************         
* DETAIL SUPPLEMENTAL TAB CPP ELEMENT (USED FOR QUARTERLY AMOUNTS)              
***********************************************************************         
RPRTCELD DSECT                                                                  
RPRTCEL  DS    XL1                 ELEMENT CODE                                 
RPRTCELQ EQU   X'67'                                                            
RPRTCLEN DS    XL1                                                              
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRTCPP2 DS    XL4                 TAB CPP # 2                                  
RPRTCPP3 DS    XL4                 TAB CPP # 3                                  
RPRTCPP4 DS    XL4                 TAB CPP # 4                                  
RPRTCLNQ EQU   *-RPRTCELD          L(ELEMENT)                                   
***********************************************************************         
* DETAIL AVAIL DAYTIMES ELEMENT                                                 
***********************************************************************         
RPRAVELD DSECT                                                                  
RPRAVEL  DS    XL1                 ELEMENT CODE                                 
RPRAVELQ EQU   X'68'                                                            
RPRAVLEN DS    XL1                                                              
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRAVOVQ EQU   *-RPRAVELD                                                       
RPRAVALS DS    0CL22               L' AVAIL DAY/TIME ENTRY                      
RPRAVDAY DS    CL11                L'DAYS STRING                                
RPRAVTIM DS    CL11                L'TIMES STRING                               
***********************************************************************         
* DEMO RATING/SHARE/HPT ELEMENT                                                 
***********************************************************************         
RPRDVELD DSECT                                                                  
RPRDVEL  DS    XL1                 ELEMENT CODE                                 
RPRDVELQ EQU   X'70'                                                            
RPRDVLEN DS    XL1                                                              
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRDVBNM DS    XL1                 INTERNAL BOOK NUMBER                         
RPRDVOVQ EQU   *-RPRDVELD          L(ELEMENT BEFORE ANY DEMOS)                  
RPRDVDMO DS    0XL(3*4)            A(1ST DEMO RATING/SHARE/HPT)                 
*                                   - IF HOB X'80' IS ON, OVERRIDDEN            
***********************************************************************         
* NEGOTIATED DEMO RATINGS/SHARE/HPT ELEMENT FOR THE PRIME BOOK                  
***********************************************************************         
RPRNDELD DSECT                                                                  
RPRNDEL  DS    XL1                 ELEMENT CODE                                 
RPRNDELQ EQU   X'8F'                                                            
RPRNDLEN DS    XL1                                                              
*                                  ** NO NEED FOR MINIO ELEMENT KEY **          
RPRNDPBK DS    XL1                 INTERNAL NUMBER FOR THE PRIME BOOK           
RPRNDOVQ EQU   *-RPRNDELD          L(ELEMENT BEFORE ANY DEMOS)                  
RPRNDDMO DS    0XL(3*4)            A(1ST DEMO RATING/SHARE/HPT)                 
*                                   - IF HOB X'80' IS ON, OVERRIDDEN            
***********************************************************************         
* PROGRAM OR DAY/TIME TEXT ELEMENT                                              
***********************************************************************         
RPRTXELD DSECT                                                                  
RPRTXEL  DS    XL1                 ELEMENT CODE                                 
RPRTXELQ EQU   X'90'                                                            
RPRTXLEN DS    XL1                                                              
*                                  ** MINIO ELEMENT KEY **                      
RPRTXTYP DS    XL1                 TEXT TYPE                                    
RPRTXPRQ EQU   1                     PROGRAM TEXT                               
RPRTXDTQ EQU   2                     DAY/TIME TEXT                              
         DS    XL4                 SPARE                                        
RPRTXSEQ DS    XL2                 SEQUENCE NUMBER                              
*                                                                               
RPRTXOVQ EQU   *-RPRTXELD          L(ELEMENT WITHOUT ANY TEXT)                  
*                                                                               
RPRTXTXT DS    0C                  A(1ST CHARACTER OF THE TEXT)                 
