*          DATA SET REGENABLK  AT LEVEL 027 AS OF 05/31/00                      
***********************************************************************         
* APPLICATION PAR CONTROL BLOCK DSECT:                                *         
***********************************************************************         
* HISTORY OF CHANGES                                                  *         
*  MAY30/00 (RHV) --- ORIGINAL ENTRY                                  *         
*                                                                     *         
*                     ***  END TOMBSTONE  ***                         *         
***********************************************************************         
*                                                                               
ABLOCK   DS    0C                                                               
ABPGM    DS    CL3                 PROGRAM CODE (SPACE PAD)                     
ABREC    DS    CL8                 RECORD (SPACE PAD)                           
ABACT    DS    CL8                 ACTION (SPACE PAD)                           
         DS    CL12                SPARE                                        
ABFLG1   DS    X                   FLAG BYTE 1 (NOT USED)                       
ABFLG2   DS    X                   FLAG BYTE 2 (NOT USED)                       
ABFLG3   DS    X                   FLAG BYTE 3 (NOT USED)                       
ABLENQ   EQU   *-ABLOCK                                                         
