*          DATA SET REGENCDES  AT LEVEL 006 AS OF 03/10/93                      
* TABLE USED BY REREP1J02 AND RESFM27, RELINK BOTH IF CHANGED                   
*                                                                               
* CODE LETTER, FIELD DISPLACEMENT IN RECORD, FIELD LENGTH                       
*                                                                               
CODETAB  DS    0CL3                                                             
         DC    C'A',AL1(0),AL1(20) BUYER                                        
         DC    C'B',AL1(RAGYNAM2-RAGYREC),AL1(L'RAGYNAM2)                       
         DC    C'C',AL1(RAGYADD1-RAGYREC),AL1(L'RAGYADD1)                       
         DC    C'D',AL1(RAGYADD2-RAGYREC),AL1(L'RAGYADD2)                       
         DC    C'E',AL1(RAGYSTAT-RAGYREC),AL1(L'RAGYSTAT)                       
         DC    C'F',AL1(RAGYZIP-RAGYREC),AL1(L'RAGYZIP)                         
         DC    C'G',AL1(RREPNAME-RREPREC),AL1(L'RREPNAME)                       
         DC    C'H',AL1(ROFFADD1-ROFFREC),AL1(L'ROFFADD1)                       
         DC    C'I',AL1(ROFFADD2-ROFFREC),AL1(L'ROFFADD2)                       
         DC    C'J',AL1(ROFFSTT-ROFFREC),AL1(L'ROFFSTT)                         
         DC    C'K',AL1(ROFFZIP-ROFFREC),AL1(L'ROFFZIP)                         
         DC    C'*',AL1(0),AL1(0)  LITERAL1                                     
         DC    C'*',AL1(0),AL1(0)  LITERAL2                                     
         DC    X'FF'                                                            
