*          DATA SET REGENEOM   AT LEVEL 002 AS OF 08/25/20                      
*              EOM RECORD (END OF ACCOUNTING MONTH)                             
         SPACE 1                                                                
REOMREC  DS    0C        V         RECORD                                       
REOMKEY  DS    0CL27     V         KEY                                          
REOMKTYP DS    CL24      X'18'     RECORD TYPE                                  
REOMKTQ  EQU   X'18'                                                            
REOMKREP DS    CL2       AN        REP CODE                                     
REOMKYR  DS    CL1       B         YEAR                                         
*                                                                               
REOMLEN  DS    CL2       B         RECORD LENGTH                                
REOMCNTL DS    CL1       X         CONTROL BYTE                                 
REOMLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
REOMELEM DS    0C                  REP ELEMENT                                  
REOMCODE DS    CL1       X'01'     ELEMENT CODE                                 
REOMELLN DS    CL1       B         ELEMENT LENGTH (28)                          
REOMDATE DS    CL26                COMPRESSED END DATE FOR 13 MONTHS-           
*                                  DEC,JAN-DEC                                  
