*          DATA SET REGENOFF   AT LEVEL 008 AS OF 06/10/20                      
*              OFFICE RECORD                                                    
         SPACE 1                                                                
ROFFREC  DS    0C        V         RECORD                                       
ROFFKEY  DS    0CL27     V         KEY                                          
ROFFKTYP DS    CL23      X'04'     RECORD TYPE                                  
ROFFKTQ  EQU   X'04'                                                            
ROFFKREP DS    CL2       AN        REP CODE                                     
ROFFKOFF DS    CL2       AN        OFFICE CODE                                  
ROFFLEN  DS    CL2       B         RECORD LENGTH                                
ROFFCNTL DS    CL1       X         CONTROL BYTE                                 
ROFFLINK DS    CL4       B         LINK ADDRESS                                 
         SPACE 1                                                                
ROFFELEM DS    0C                  OFFICE ELEMENT                               
ROFFCODE DS    CL1       X'01'     ELEMENT CODE                                 
ROFFELLN DS    CL1       B         ELEMENT LENGTH                               
ROFFNAME DS    CL20      AN        OFFICE NAME                                  
ROFFREG  DS    CL2       AN        REGION CODE                                  
ROFFZIP  DS    CL10      AN        OFFICE ZIP CODE                              
ROFFADD1 DS    CL20                OFFICE ADDRESS LINE 1                        
ROFFADD2 DS    CL18                OFFICE ADDRESS LINE 2                        
ROFFSTT  DS    CL2                 OFFICE STATE                                 
