*          DATA SET REGENPBLK  AT LEVEL 022 AS OF 02/11/99                      
*                                                                               
***********************************************************************         
* PROGRAM ACCESS SECURITY CONTROL BLOCK DSECT:                                  
***********************************************************************         
* HISTORY OF CHANGES                                                  *         
*  FEB11/99 (RHV) --- ORIGINAL ENTRY                                  *         
*                                                                     *         
*                                                                     *         
*                     ***  END TOMBSTONE  ***                         *         
***********************************************************************         
*                                                                               
PSBLOCK  DS    0C                                                               
PSBPGM   DS    CL3                 PROGRAM NAME            (RSECREC)            
PSBACT   DS    CL3                 RECORD/ACTION NAME      (RSECREC)            
PSBSEC   DS    X                   SECURITY LEVEL REQUIRED (RSECREC)            
*                                                                               
PSBXACT  DS    CL10                ACTION NAME (FOR ERR MSG)                    
*                                                                               
