*          DATA SET REGLFINFB  AT LEVEL 003 AS OF 03/01/99                      
*                                                                               
* REGLFINF - DSECT TO COVER GLOBBER ELEMENT FOR CALLS                           
*            FROM FILE TO INFO PROGRAMS                                         
*                                                                               
GLFINEL  DSECT                                                                  
GLFINCD  DS    C                   ELEM CODE                                    
GLFINLEN DS    C                   ELEM LEN                                     
GLFINFA  DS    CL15                FINE ACTION                                  
*                                  =RE  = REFRESH REQUIRED                      
GLFINFLG DS    X                   FLAGS                                        
GLFINSTA DS    CL6                 STATION FROM MASTER ADD                      
GLFINRET EQU   X'80'               AUTO RETURN TO CALLER AFTER ACTION           
         DS    CL24                SPARE                                        
GLFINEND EQU   *                                                                
GLFINLNQ EQU   *-GLFINEL                                                        
