*          DATA SET REINFFFDS  AT LEVEL 004 AS OF 05/15/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80BFFD      DATE 05/15/00                 
         SPACE 1                                                                
T80BFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
INFMESSH DS    CL8                                                              
INFMESS  DS    CL60     1    2   60  A  P N             T        Y              
INFSVCH  DS    CL8                                                              
INFSVC   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  A  P N             T        Y              
INFRCRDH DS    CL8                                                              
INFRCRD  DS    CL17     3   11   17  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL10     3   29   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      4    2    8  A  P N             T        Y              
INFSTRTH DS    CL8                                                              
INFSTRT  DS    CL17     4   11   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     4   29   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
INFFLTRH DS    CL8                                                              
INFFLTR  DS    CL17     5   11   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     5   29   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
INFOPTNH DS    CL8                                                              
INFOPTN  DS    CL17     6   11   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     6   29   10  A  P N             T        Y              
INFPLEGH DS    CL8                                                              
INFPLEG  DS    CL24     6   45   24  A  P Z             T        Y              
INFNEXTH DS    CL8                                                              
INFNEXT  DS    CL1      6   79    1  A  U N             T        Y              
INFTITLH DS    CL8                                                              
INFTITL  DS    CL79     8    1   79  A  P N             T        Y              
INFOUTH  DS    CL8                                                              
INFOUT   DS    CL79    10    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    11    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    12    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    13    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    14    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    15    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    16    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    17    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    18    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    19    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    20    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    21    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    22    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    23    1   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    24    1   79  A  P N             T        Y              
INFLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
INFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
