*          DATA SET REIRADV    AT LEVEL 061 AS OF 03/10/99                      
***********************************************************************         
* REIRADV - TABLES OF ADVERTISERS FOR INTEREP TYPE N CONTRACTS THAT             
*           GET SPECIAL ADDRESSES                                               
***********************************************************************         
* THIS BOOK IS INCLUDED IN: RECNT17                                             
*                           RECNT63                                             
*                           REREP1002                                           
*                                                                               
*                                                                               
*                                                                               
* TABLE OF IR ADV'S THAT GET L.A. OFFICE ADDRESS                                
*                                                                               
IRADVTAB DS    0CL4                                                             
         DC    CL4'ICO '                                                        
         DC    CL4'UPN '                                                        
         DC    CL4'BVP '                                                        
         DC    CL4'BVP1'                                                        
         DC    CL4'BUE '                                                        
         DC    CL4'NNSY'                                                        
         DC    CL4'3030'                                                        
         DC    CL4'BVD '                                                        
         DC    CL4'HLYV'                                                        
         DC    CL4'PPM '                                                        
         DC    CL4'CORS'                                                        
         DC    CL4'BELS'                                                        
         DC    CL4'XNJ '                                                        
         DC    CL4'ELCA'                                                        
         DC    CL4'MGMD'                                                        
         DC    CL4'HIT '                                                        
         DC    CL4'POLT'                                                        
         DC    CL4'DG  '                                                        
         DC    CL4'DHS '                                                        
         DC    CL4'ARC '                                                        
         DC    CL4'ALC '                                                        
         DC    CL4'QAAN'                                                        
         DC    CL4'MGC '                                                        
         DC    CL4'FTY '                                                        
         DC    CL4'QUAL'                                                        
         DC    CL4'NEX '                                                        
         DC    X'FF'                                                            
*                                                                               
* TABLE OF IR ADV'S THAT GET CHICAGO OFFICE ADDRESS                             
*                                                                               
IRCHTAB  DS    0CL4                                                             
         DC    CL4'USWE'                                                        
         DC    CL4'BASF'                                                        
         DC    X'FF'                                                            
*                                                                               
