*          DATA SET REJDSDMO   AT LEVEL 021 AS OF 03/21/96                      
*                                                                               
*    CONVERSION TABLE:  JDS  DEMOGRAPHIC CODES TO DDS                           
*        CHARS  1      :  JDS  DEMOGRAPHIC CODE                                 
*        CHAR   2      :  DDS  DEMOGRAPHIC CODE (BINARY)                        
*        CHAR   3      :  DDS  DEMOGRAPHIC CODE QUALIFIER (NOT USED)            
*                                                                               
*                                                                               
CJDSDEMO DC    AL1(001),AL1(001),CL1'R'       RATING                            
LJDSDEMO EQU   *-CJDSDEMO                                                       
         DC    AL1(002),AL1(001),CL1'S'       SHARE                             
         DC    AL1(003),AL1(001),CL1'P'       HUT                               
         DC    AL1(004),AL1(002),CL1'R'       METRO RATING A                    
         DC    AL1(005),AL1(002),CL1'S'       METRO SHARE  A                    
         DC    AL1(006),AL1(002),CL1'P'       METRO HUT    A                    
         DC    AL1(007),AL1(003),CL1'R'       METRO RATING B                    
         DC    AL1(008),AL1(003),CL1'S'       METRO SHARE  B                    
         DC    AL1(009),AL1(003),CL1'P'       METRO HUT    B                    
         DC    AL1(011),AL1(001),CL1'T'       TOTAL HOMES                       
*                                                                               
*   START OF RATING SECTION                                                     
*                                                                               
         DC    AL1(020),AL1(122),CL1'R'       CHLDRN  RATING                    
         DC    AL1(021),AL1(121),CL1'R'       CH2-5   RATING                    
         DC    AL1(022),AL1(123),CL1'R'       CH6-11  RATING                    
         DC    AL1(023),AL1(065),CL1'R'       WKGWMN  RATING                    
         DC    AL1(024),AL1(127),CL1'R'       P2+     RATING                    
         DC    AL1(025),AL1(173),CL1'R'       P2-24   RATING                    
         DC    AL1(026),AL1(172),CL1'R'       P2-17   RATING                    
         DC    AL1(027),AL1(179),CL1'R'       R6-17   NUMBER                    
         DC    AL1(028),AL1(189),CL1'R'       A21-24  RATING                    
         DC    AL1(029),AL1(190),CL1'R'       M21-34  RATING                    
         DC    AL1(030),AL1(033),CL1'R'       W12+    RATING                    
         DC    AL1(031),AL1(025),CL1'R'       W12-17  RATING                    
         DC    AL1(032),AL1(028),CL1'R'       W12-24  RATING                    
         DC    AL1(033),AL1(029),CL1'R'       W12-34  RATING                    
         DC    AL1(034),AL1(030),CL1'R'       W12-49  RATING                    
         DC    AL1(035),AL1(071),CL1'R'       W21-49  RATING                    
         DC    AL1(036),AL1(072),CL1'R'       W21-54  RATING                    
         DC    AL1(037),AL1(073),CL1'R'       W21-64  RATING                    
         DC    AL1(038),AL1(067),CL1'R'       W21+    RATING                    
         DC    AL1(039),AL1(045),CL1'R'       W18+    RATING                    
         DC    AL1(040),AL1(040),CL1'R'       W18-24  RATING                    
         DC    AL1(041),AL1(041),CL1'R'       W18-34  RATING                    
         DC    AL1(042),AL1(042),CL1'R'       W18-49  RATING                    
         DC    AL1(043),AL1(043),CL1'R'       W18-54  RATING                    
         DC    AL1(044),AL1(044),CL1'R'       W18-64  RATING                    
         DC    AL1(045),AL1(050),CL1'R'       W25+    RATING                    
         DC    AL1(046),AL1(046),CL1'R'       W25-34  RATING                    
         DC    AL1(047),AL1(047),CL1'R'       W25-49  RATING                    
         DC    AL1(048),AL1(048),CL1'R'       W25-54  RATING                    
         DC    AL1(049),AL1(049),CL1'R'       W25-64  RATING                    
         DC    AL1(050),AL1(054),CL1'R'       W35+    RATING                    
         DC    AL1(051),AL1(051),CL1'R'       W35-49  RATING                    
         DC    AL1(052),AL1(052),CL1'R'       W35-54  RATING                    
         DC    AL1(053),AL1(053),CL1'R'       W35-64  RATING                    
         DC    AL1(054),AL1(057),CL1'R'       W50+    RATING                    
         DC    AL1(055),AL1(055),CL1'R'       W50-54  RATING                    
         DC    AL1(056),AL1(056),CL1'R'       W50-64  RATING                    
         DC    AL1(057),AL1(059),CL1'R'       W55+    RATING                    
         DC    AL1(058),AL1(058),CL1'R'       W55-64  RATING                    
         DC    AL1(059),AL1(060),CL1'R'       W65+    RATING                    
         DC    AL1(060),AL1(077),CL1'R'       M12+    RATING                    
         DC    AL1(061),AL1(075),CL1'R'       M12-17  RATING                    
         DC    AL1(062),AL1(078),CL1'R'       M12-24  RATING                    
         DC    AL1(063),AL1(079),CL1'R'       M12-34  RATING                    
         DC    AL1(064),AL1(080),CL1'R'       M12-49  RATING                    
         DC    AL1(065),AL1(115),CL1'R'       M21-49  RATING                    
         DC    AL1(066),AL1(116),CL1'R'       M21-54  RATING                    
         DC    AL1(067),AL1(117),CL1'R'       M21-64  RATING                    
         DC    AL1(068),AL1(118),CL1'R'       M21+    RATING                    
         DC    AL1(069),AL1(095),CL1'R'       M18+    RATING                    
         DC    AL1(070),AL1(090),CL1'R'       M18-24  RATING                    
         DC    AL1(071),AL1(091),CL1'R'       M18-34  RATING                    
         DC    AL1(072),AL1(092),CL1'R'       M18-49  RATING                    
         DC    AL1(073),AL1(093),CL1'R'       M18-54  RATING                    
         DC    AL1(074),AL1(094),CL1'R'       M18-64  RATING                    
         DC    AL1(075),AL1(100),CL1'R'       M25+    RATING                    
         DC    AL1(076),AL1(096),CL1'R'       M25-34  RATING                    
         DC    AL1(077),AL1(097),CL1'R'       M25-49  RATING                    
         DC    AL1(078),AL1(098),CL1'R'       M25-54  RATING                    
         DC    AL1(079),AL1(099),CL1'R'       M25-64  RATING                    
         DC    AL1(080),AL1(104),CL1'R'       M35+    RATING                    
         DC    AL1(081),AL1(101),CL1'R'       M35-49  RATING                    
         DC    AL1(082),AL1(102),CL1'R'       M35-54  RATING                    
         DC    AL1(083),AL1(103),CL1'R'       M35-64  RATING                    
         DC    AL1(084),AL1(107),CL1'R'       M50+    RATING                    
         DC    AL1(085),AL1(105),CL1'R'       M50-54  RATING                    
         DC    AL1(086),AL1(106),CL1'R'       M50-64  RATING                    
         DC    AL1(087),AL1(109),CL1'R'       M55+    RATING                    
         DC    AL1(088),AL1(108),CL1'R'       M55-64  RATING                    
         DC    AL1(089),AL1(110),CL1'R'       M65+    RATING                    
         DC    AL1(090),AL1(133),CL1'R'       P12+    RATING                    
         DC    AL1(091),AL1(125),CL1'R'       TEENS   RATING                    
         DC    AL1(092),AL1(128),CL1'R'       P12-24  RATING                    
         DC    AL1(093),AL1(129),CL1'R'       P12-34  RATING                    
         DC    AL1(094),AL1(130),CL1'R'       P12-49  RATING                    
         DC    AL1(095),AL1(191),CL1'R'       A21-49  RATING                    
         DC    AL1(096),AL1(192),CL1'R'       A21-54  RATING                    
         DC    AL1(097),AL1(193),CL1'R'       A21-64  RATING                    
         DC    AL1(098),AL1(194),CL1'R'       A21+    RATING                    
         DC    AL1(099),AL1(145),CL1'R'       A18+    RATING                    
         DC    AL1(100),AL1(140),CL1'R'       A18-24  RATING                    
         DC    AL1(101),AL1(141),CL1'R'       A18-34  RATING                    
         DC    AL1(102),AL1(142),CL1'R'       A18-49  RATING                    
         DC    AL1(103),AL1(143),CL1'R'       A18-54  RATING                    
         DC    AL1(104),AL1(144),CL1'R'       A18-64  RATING                    
         DC    AL1(105),AL1(150),CL1'R'       A25+    RATING                    
         DC    AL1(106),AL1(146),CL1'R'       A25-34  RATING                    
         DC    AL1(107),AL1(147),CL1'R'       A25-49  RATING                    
         DC    AL1(108),AL1(148),CL1'R'       A25-54  RATING                    
         DC    AL1(109),AL1(149),CL1'R'       A25-64  RATING                    
         DC    AL1(110),AL1(154),CL1'R'       A35+    RATING                    
         DC    AL1(111),AL1(151),CL1'R'       A35-49  RATING                    
         DC    AL1(112),AL1(152),CL1'R'       A35-54  RATING                    
         DC    AL1(113),AL1(153),CL1'R'       A35-64  RATING                    
         DC    AL1(114),AL1(157),CL1'R'       A50+    RATING                    
         DC    AL1(115),AL1(155),CL1'R'       A50-54  RATING                    
         DC    AL1(116),AL1(156),CL1'R'       A50-64  RATING                    
         DC    AL1(117),AL1(159),CL1'R'       A55+    RATING                    
         DC    AL1(118),AL1(158),CL1'R'       A55-64  RATING                    
         DC    AL1(119),AL1(160),CL1'R'       A65+    RATING                    
*                                                                               
*   END OF RATING SECTION                                                       
*                                                                               
*                                                                               
*   START OF IMPS   SECTION                                                     
*                                                                               
         DC    AL1(120),AL1(122),CL1'T'       CHLDRN                            
         DC    AL1(121),AL1(121),CL1'T'       CH2-5                             
         DC    AL1(122),AL1(123),CL1'T'       CH6-11                            
         DC    AL1(123),AL1(065),CL1'T'       WKGWMN                            
         DC    AL1(124),AL1(127),CL1'T'       P2+                               
         DC    AL1(125),AL1(173),CL1'T'       P2-24                             
         DC    AL1(126),AL1(172),CL1'T'       P2-17                             
         DC    AL1(127),AL1(179),CL1'T'       R6-17                             
         DC    AL1(128),AL1(189),CL1'T'       A21-24                            
         DC    AL1(129),AL1(190),CL1'T'       M21-34                            
         DC    AL1(130),AL1(033),CL1'T'       W12+                              
         DC    AL1(131),AL1(025),CL1'T'       W12-17                            
         DC    AL1(132),AL1(028),CL1'T'       W12-24                            
         DC    AL1(133),AL1(029),CL1'T'       W12-34                            
         DC    AL1(134),AL1(030),CL1'T'       W12-49                            
         DC    AL1(135),AL1(071),CL1'T'       W21-49                            
         DC    AL1(136),AL1(072),CL1'T'       W21-54                            
         DC    AL1(137),AL1(073),CL1'T'       W21-64                            
         DC    AL1(138),AL1(067),CL1'T'       W21+                              
         DC    AL1(139),AL1(045),CL1'T'       W18+                              
         DC    AL1(140),AL1(040),CL1'T'       W18-24                            
         DC    AL1(141),AL1(041),CL1'T'       W18-34                            
         DC    AL1(142),AL1(042),CL1'T'       W18-49                            
         DC    AL1(143),AL1(043),CL1'T'       W18-54                            
         DC    AL1(144),AL1(044),CL1'T'       W18-64                            
         DC    AL1(145),AL1(050),CL1'T'       W25+                              
         DC    AL1(146),AL1(046),CL1'T'       W25-34                            
         DC    AL1(147),AL1(047),CL1'T'       W25-49                            
         DC    AL1(148),AL1(048),CL1'T'       W25-54                            
         DC    AL1(149),AL1(049),CL1'T'       W25-64                            
         DC    AL1(150),AL1(054),CL1'T'       W35+                              
         DC    AL1(151),AL1(051),CL1'T'       W35-49                            
         DC    AL1(152),AL1(052),CL1'T'       W35-54                            
         DC    AL1(153),AL1(053),CL1'T'       W35-64                            
         DC    AL1(154),AL1(057),CL1'T'       W50+                              
         DC    AL1(155),AL1(055),CL1'T'       W50-54                            
         DC    AL1(156),AL1(056),CL1'T'       W50-64                            
         DC    AL1(157),AL1(059),CL1'T'       W55+                              
         DC    AL1(158),AL1(058),CL1'T'       W55-64                            
         DC    AL1(159),AL1(060),CL1'T'       W65+                              
         DC    AL1(160),AL1(077),CL1'T'       M12+                              
         DC    AL1(161),AL1(075),CL1'T'       M12-17                            
         DC    AL1(162),AL1(078),CL1'T'       M12-24                            
         DC    AL1(163),AL1(079),CL1'T'       M12-34                            
         DC    AL1(164),AL1(080),CL1'T'       M12-49                            
         DC    AL1(165),AL1(115),CL1'T'       M21-49                            
         DC    AL1(166),AL1(116),CL1'T'       M21-54                            
         DC    AL1(167),AL1(117),CL1'T'       M21-64                            
         DC    AL1(168),AL1(118),CL1'T'       M21+                              
         DC    AL1(169),AL1(095),CL1'T'       M18+                              
         DC    AL1(170),AL1(090),CL1'T'       M18-24                            
         DC    AL1(171),AL1(091),CL1'T'       M18-34                            
         DC    AL1(172),AL1(092),CL1'T'       M18-49                            
         DC    AL1(173),AL1(093),CL1'T'       M18-54                            
         DC    AL1(174),AL1(094),CL1'T'       M18-64                            
         DC    AL1(175),AL1(100),CL1'T'       M25+                              
         DC    AL1(176),AL1(096),CL1'T'       M25-34                            
         DC    AL1(177),AL1(097),CL1'T'       M25-49                            
         DC    AL1(178),AL1(098),CL1'T'       M25-54                            
         DC    AL1(179),AL1(099),CL1'T'       M25-64                            
         DC    AL1(180),AL1(104),CL1'T'       M35+                              
         DC    AL1(181),AL1(101),CL1'T'       M35-49                            
         DC    AL1(182),AL1(102),CL1'T'       M35-54                            
         DC    AL1(183),AL1(103),CL1'T'       M35-64                            
         DC    AL1(184),AL1(107),CL1'T'       M50+                              
         DC    AL1(185),AL1(105),CL1'T'       M50-54                            
         DC    AL1(186),AL1(106),CL1'T'       M50-64                            
         DC    AL1(187),AL1(109),CL1'T'       M55+                              
         DC    AL1(188),AL1(108),CL1'T'       M55-64                            
         DC    AL1(189),AL1(110),CL1'T'       M65+                              
         DC    AL1(190),AL1(133),CL1'T'       P12+                              
         DC    AL1(191),AL1(125),CL1'T'       TEENS                             
         DC    AL1(192),AL1(128),CL1'T'       P12-24                            
         DC    AL1(193),AL1(129),CL1'T'       P12-34                            
         DC    AL1(194),AL1(130),CL1'T'       P12-49                            
         DC    AL1(195),AL1(191),CL1'T'       A21-49                            
         DC    AL1(196),AL1(192),CL1'T'       A21-54                            
         DC    AL1(197),AL1(193),CL1'T'       A21-64                            
         DC    AL1(198),AL1(194),CL1'T'       A21+                              
         DC    AL1(199),AL1(145),CL1'T'       A18+                              
         DC    AL1(200),AL1(140),CL1'T'       A18-24                            
         DC    AL1(201),AL1(141),CL1'T'       A18-34                            
         DC    AL1(202),AL1(142),CL1'T'       A18-49                            
         DC    AL1(203),AL1(143),CL1'T'       A18-54                            
         DC    AL1(204),AL1(144),CL1'T'       A18-64                            
         DC    AL1(205),AL1(150),CL1'T'       A25+                              
         DC    AL1(206),AL1(146),CL1'T'       A25-34                            
         DC    AL1(207),AL1(147),CL1'T'       A25-49                            
         DC    AL1(208),AL1(148),CL1'T'       A25-54                            
         DC    AL1(209),AL1(149),CL1'T'       A25-64                            
         DC    AL1(210),AL1(154),CL1'T'       A35+                              
         DC    AL1(211),AL1(151),CL1'T'       A35-49                            
         DC    AL1(212),AL1(152),CL1'T'       A35-54                            
         DC    AL1(213),AL1(153),CL1'T'       A35-64                            
         DC    AL1(214),AL1(157),CL1'T'       A50+                              
         DC    AL1(215),AL1(155),CL1'T'       A50-54                            
         DC    AL1(216),AL1(156),CL1'T'       A50-64                            
         DC    AL1(217),AL1(159),CL1'T'       A55+                              
         DC    AL1(218),AL1(158),CL1'T'       A55-64                            
         DC    AL1(219),AL1(160),CL1'T'       A65+                              
*                                                                               
*   END OF IMPS   SECTION                                                       
*                                                                               
*                                                                               
*   ADDITIONAL DEMO SECTION                                                     
*                                                                               
         DC    AL1(220),AL1(113),CL1'R'       M21-24 RATING                     
         DC    AL1(221),AL1(113),CL1'T'       M21-24                            
         DC    AL1(222),AL1(069),CL1'R'       W21-24 RATING                     
         DC    AL1(223),AL1(069),CL1'T'       W21-24                            
         DC    AL1(224),AL1(070),CL1'R'       W21-34 RATING                     
         DC    AL1(225),AL1(070),CL1'T'       W21-34                            
         DC    AL1(226),AL1(190),CL1'R'       A21-34 RATING                     
         DC    AL1(227),AL1(190),CL1'T'       A21-34                            
         DC    AL1(228),AL1(112),CL1'R'       M18-20 RATING                     
         DC    AL1(229),AL1(112),CL1'T'       M18-20                            
         DC    AL1(230),AL1(068),CL1'R'       W18-20 RATING                     
         DC    AL1(231),AL1(068),CL1'T'       W18-20                            
         DC    AL1(232),AL1(188),CL1'R'       A18-20 RATING                     
         DC    AL1(233),AL1(188),CL1'T'       A18-20                            
         DC    AL1(234),AL1(173),CL1'R'       P2-20  RATING (2-24)              
         DC    AL1(235),AL1(173),CL1'T'       P2-20         (2-24)              
*                                                                               
DMOFIELD EQU   *-CJDSDEMO                                                       
DMOCOUNT EQU   DMOFIELD/LJDSDEMO                                                
         DC    X'0000'             DELIMITER                                    
