*          DATA SET REKTZADV   AT LEVEL 007 AS OF 05/23/95                      
*                                                                               
*    CONVERSION TABLE:  KATZ ADVERTISER NUMBERS TO DDS ADVERTISERS              
*          KATZ:  5-DIGIT NUMERIC CODE                                          
*          DDS :  4-POSITION ALPHANUMERIC CODE                                  
*    TABLE 1:                                                                   
*       CONVERTS KATZ CODES BETWEEN 10,000 AND 35,999 BY REPLACING              
*          1ST TWO CHARACTERS WITH A SINGLE ALPHA A THRU Z.                     
*    TABLE 2:                                                                   
*       CONVERTS KATZ CODES 36,000 AND ABOVE BY REPLACING 1ST 2 CHARS           
*          WITH A SINGLE ALPHA A THRU Z, THEN ALSO REPLACING 3RD CHAR           
*          WITH A SINGLE ALPHA A THRU Z, ALL IN ROTATION.                       
*                                                                               
KATZTAB1 DC    CL3'10A'         2 CHARACTERS: 1ST 2 CHARS OF CODE               
LKTZTAB1 EQU   *-KATZTAB1                                                       
         DC    CL3'11B'         1 CHARACTER:  CONVERSION VALUE                  
         DC    CL3'12C'                                                         
         DC    CL3'13D'                                                         
         DC    CL3'14E'                                                         
         DC    CL3'15F'                                                         
         DC    CL3'16G'                                                         
         DC    CL3'17H'                                                         
         DC    CL3'18I'                                                         
         DC    CL3'19J'                                                         
         DC    CL3'20K'                                                         
         DC    CL3'21L'                                                         
         DC    CL3'22M'                                                         
         DC    CL3'23N'                                                         
         DC    CL3'24O'                                                         
         DC    CL3'25P'                                                         
         DC    CL3'26Q'                                                         
         DC    CL3'27R'                                                         
         DC    CL3'28S'                                                         
         DC    CL3'29T'                                                         
         DC    CL3'30U'                                                         
         DC    CL3'31V'                                                         
         DC    CL3'32W'                                                         
         DC    CL3'33X'                                                         
         DC    CL3'34Y'                                                         
         DC    CL3'35Z'                                                         
         DC    X'0000'                                                          
*                           START:  36,000 - 38,599:  AA-AZ                     
KATZTAB2 DC    CL5'360AA'                                                       
LKTZTAB2 EQU   *-KATZTAB2                                                       
         DC    CL5'361AB'                                                       
         DC    CL5'362AC'                                                       
         DC    CL5'363AD'                                                       
         DC    CL5'364AE'                                                       
         DC    CL5'365AF'                                                       
         DC    CL5'366AG'                                                       
         DC    CL5'367AH'                                                       
         DC    CL5'368AI'                                                       
         DC    CL5'369AJ'                                                       
         DC    CL5'370AK'                                                       
         DC    CL5'371AL'                                                       
         DC    CL5'372AM'                                                       
         DC    CL5'373AN'                                                       
         DC    CL5'374AO'                                                       
         DC    CL5'375AP'                                                       
         DC    CL5'376AQ'                                                       
         DC    CL5'377AR'                                                       
         DC    CL5'378AS'                                                       
         DC    CL5'379AT'                                                       
         DC    CL5'380AU'                                                       
         DC    CL5'381AV'                                                       
         DC    CL5'382AW'                                                       
         DC    CL5'383AX'                                                       
         DC    CL5'384AY'                                                       
         DC    CL5'385AZ'                                                       
*                           START:  38,600 - 41,199:  BA-BZ                     
         DC    CL5'386BA'                                                       
         DC    CL5'387BB'                                                       
         DC    CL5'388BC'                                                       
         DC    CL5'389BD'                                                       
         DC    CL5'390BE'                                                       
         DC    CL5'391BF'                                                       
         DC    CL5'392BG'                                                       
         DC    CL5'393BH'                                                       
         DC    CL5'394BI'                                                       
         DC    CL5'395BJ'                                                       
         DC    CL5'396BK'                                                       
         DC    CL5'397BL'                                                       
         DC    CL5'398BM'                                                       
         DC    CL5'399BN'                                                       
         DC    CL5'400BO'                                                       
         DC    CL5'401BP'                                                       
         DC    CL5'402BQ'                                                       
         DC    CL5'403BR'                                                       
         DC    CL5'404BS'                                                       
         DC    CL5'405BT'                                                       
         DC    CL5'406BU'                                                       
         DC    CL5'407BV'                                                       
         DC    CL5'408BW'                                                       
         DC    CL5'409BX'                                                       
         DC    CL5'410BY'                                                       
         DC    CL5'411BZ'                                                       
*                           START:  41,200 - 43,799:  CA-CZ                     
         DC    CL5'412CA'                                                       
         DC    CL5'413CB'                                                       
         DC    CL5'414CC'                                                       
         DC    CL5'415CD'                                                       
         DC    CL5'416CE'                                                       
         DC    CL5'417CF'                                                       
         DC    CL5'418CG'                                                       
         DC    CL5'419CH'                                                       
         DC    CL5'420CI'                                                       
         DC    CL5'421CJ'                                                       
         DC    CL5'422CK'                                                       
         DC    CL5'423CL'                                                       
         DC    CL5'424CM'                                                       
         DC    CL5'425CN'                                                       
         DC    CL5'426CO'                                                       
         DC    CL5'427CP'                                                       
         DC    CL5'428CQ'                                                       
         DC    CL5'429CR'                                                       
         DC    CL5'430CS'                                                       
         DC    CL5'431CT'                                                       
         DC    CL5'432CU'                                                       
         DC    CL5'433CV'                                                       
         DC    CL5'434CW'                                                       
         DC    CL5'435CX'                                                       
         DC    CL5'436CY'                                                       
         DC    CL5'437CZ'                                                       
*                           START:  43,800 - 46,399:  DA-DZ                     
         DC    CL5'438DA'                                                       
         DC    CL5'439DB'                                                       
         DC    CL5'440DC'                                                       
         DC    CL5'441DD'                                                       
         DC    CL5'442DE'                                                       
         DC    CL5'443DF'                                                       
         DC    CL5'444DG'                                                       
         DC    CL5'445DH'                                                       
         DC    CL5'446DI'                                                       
         DC    CL5'447DJ'                                                       
         DC    CL5'448DK'                                                       
         DC    CL5'449DL'                                                       
         DC    CL5'450DM'                                                       
         DC    CL5'451DN'                                                       
         DC    CL5'452DO'                                                       
         DC    CL5'453DP'                                                       
         DC    CL5'454DQ'                                                       
         DC    CL5'455DR'                                                       
         DC    CL5'456DS'                                                       
         DC    CL5'457DT'                                                       
         DC    CL5'458DU'                                                       
         DC    CL5'459DV'                                                       
         DC    CL5'460DW'                                                       
         DC    CL5'461DX'                                                       
         DC    CL5'462DY'                                                       
         DC    CL5'463DZ'                                                       
*                           START:  46,400 - 48,999:  EA-EZ                     
         DC    CL5'464EA'                                                       
         DC    CL5'465EB'                                                       
         DC    CL5'466EC'                                                       
         DC    CL5'467ED'                                                       
         DC    CL5'468EE'                                                       
         DC    CL5'469EF'                                                       
         DC    CL5'470EG'                                                       
         DC    CL5'471EH'                                                       
         DC    CL5'472EI'                                                       
         DC    CL5'473EJ'                                                       
         DC    CL5'474EK'                                                       
         DC    CL5'475EL'                                                       
         DC    CL5'476EM'                                                       
         DC    CL5'477EN'                                                       
         DC    CL5'478EO'                                                       
         DC    CL5'479EP'                                                       
         DC    CL5'480EQ'                                                       
         DC    CL5'481ER'                                                       
         DC    CL5'482ES'                                                       
         DC    CL5'483ET'                                                       
         DC    CL5'484EU'                                                       
         DC    CL5'485EV'                                                       
         DC    CL5'486EW'                                                       
         DC    CL5'487EX'                                                       
         DC    CL5'488EY'                                                       
         DC    CL5'489EZ'                                                       
*                           START:  49,000 - 51,599:  FA-FZ                     
         DC    CL5'490FA'                                                       
         DC    CL5'491FB'                                                       
         DC    CL5'492FC'                                                       
         DC    CL5'493FD'                                                       
         DC    CL5'494FE'                                                       
         DC    CL5'495FF'                                                       
         DC    CL5'496FG'                                                       
         DC    CL5'497FH'                                                       
         DC    CL5'498FI'                                                       
         DC    CL5'499FJ'                                                       
         DC    CL5'500FK'                                                       
         DC    CL5'501FL'                                                       
         DC    CL5'502FM'                                                       
         DC    CL5'503FN'                                                       
         DC    CL5'504FO'                                                       
         DC    CL5'505FP'                                                       
         DC    CL5'506FQ'                                                       
         DC    CL5'507FR'                                                       
         DC    CL5'508FS'                                                       
         DC    CL5'509FT'                                                       
         DC    CL5'510FU'                                                       
         DC    CL5'511FV'                                                       
         DC    CL5'512FW'                                                       
         DC    CL5'513FX'                                                       
         DC    CL5'514FY'                                                       
         DC    CL5'515FZ'                                                       
*                           START:  51,600 - 54,199:  GA-GZ                     
         DC    CL5'516GA'                                                       
         DC    CL5'517GB'                                                       
         DC    CL5'518GC'                                                       
         DC    CL5'519GD'                                                       
         DC    CL5'520GE'                                                       
         DC    CL5'521GF'                                                       
         DC    CL5'522GG'                                                       
         DC    CL5'523GH'                                                       
         DC    CL5'524GI'                                                       
         DC    CL5'525GJ'                                                       
         DC    CL5'526GK'                                                       
         DC    CL5'527GL'                                                       
         DC    CL5'528GM'                                                       
         DC    CL5'529GN'                                                       
         DC    CL5'530GO'                                                       
         DC    CL5'531GP'                                                       
         DC    CL5'532GQ'                                                       
         DC    CL5'533GR'                                                       
         DC    CL5'534GS'                                                       
         DC    CL5'535GT'                                                       
         DC    CL5'536GU'                                                       
         DC    CL5'537GV'                                                       
         DC    CL5'538GW'                                                       
         DC    CL5'539GX'                                                       
         DC    CL5'540GY'                                                       
         DC    CL5'541GZ'                                                       
*                           START:  54,200 - 56,799:  HA-HZ                     
         DC    CL5'542HA'                                                       
         DC    CL5'543HB'                                                       
         DC    CL5'544HC'                                                       
         DC    CL5'545HD'                                                       
         DC    CL5'546HE'                                                       
         DC    CL5'547HF'                                                       
         DC    CL5'548HG'                                                       
         DC    CL5'549HH'                                                       
         DC    CL5'550HI'                                                       
         DC    CL5'551HJ'                                                       
         DC    CL5'552HK'                                                       
         DC    CL5'553HL'                                                       
         DC    CL5'554HM'                                                       
         DC    CL5'555HN'                                                       
         DC    CL5'556HO'                                                       
         DC    CL5'557HP'                                                       
         DC    CL5'558HQ'                                                       
         DC    CL5'559HR'                                                       
         DC    CL5'560HS'                                                       
         DC    CL5'561HT'                                                       
         DC    CL5'562HU'                                                       
         DC    CL5'563HV'                                                       
         DC    CL5'564HW'                                                       
         DC    CL5'565HX'                                                       
         DC    CL5'566HY'                                                       
         DC    CL5'567HZ'                                                       
*                           START:  56,800 - 59,399:  IA-IZ                     
         DC    CL5'568IA'                                                       
         DC    CL5'569IB'                                                       
         DC    CL5'570IC'                                                       
         DC    CL5'571ID'                                                       
         DC    CL5'572IE'                                                       
         DC    CL5'573IF'                                                       
         DC    CL5'574IG'                                                       
         DC    CL5'575IH'                                                       
         DC    CL5'576II'                                                       
         DC    CL5'577IJ'                                                       
         DC    CL5'578IK'                                                       
         DC    CL5'579IL'                                                       
         DC    CL5'580IM'                                                       
         DC    CL5'581IN'                                                       
         DC    CL5'582IO'                                                       
         DC    CL5'583IP'                                                       
         DC    CL5'584IQ'                                                       
         DC    CL5'585IR'                                                       
         DC    CL5'586IS'                                                       
         DC    CL5'587IT'                                                       
         DC    CL5'588IU'                                                       
         DC    CL5'589IV'                                                       
         DC    CL5'590IW'                                                       
         DC    CL5'591IX'                                                       
         DC    CL5'592IY'                                                       
         DC    CL5'593IZ'                                                       
*                           START:  59,400 - 61,999:  JA-JZ                     
         DC    CL5'594JA'                                                       
         DC    CL5'595JB'                                                       
         DC    CL5'596JC'                                                       
         DC    CL5'597JD'                                                       
         DC    CL5'598JE'                                                       
         DC    CL5'599JF'                                                       
         DC    CL5'600JG'                                                       
         DC    CL5'601JH'                                                       
         DC    CL5'602JI'                                                       
         DC    CL5'603JJ'                                                       
         DC    CL5'604JK'                                                       
         DC    CL5'605JL'                                                       
         DC    CL5'606JM'                                                       
         DC    CL5'607JN'                                                       
         DC    CL5'608JO'                                                       
         DC    CL5'609JP'                                                       
         DC    CL5'610JQ'                                                       
         DC    CL5'611JR'                                                       
         DC    CL5'612JS'                                                       
         DC    CL5'613JT'                                                       
         DC    CL5'614JU'                                                       
         DC    CL5'615JV'                                                       
         DC    CL5'616JW'                                                       
         DC    CL5'617JX'                                                       
         DC    CL5'618JY'                                                       
         DC    CL5'619JZ'                                                       
*                           START:  59,400 - 61,999:  KA-KZ                     
         DC    CL5'620KA'                                                       
         DC    CL5'621KB'                                                       
         DC    CL5'622KC'                                                       
         DC    CL5'623KD'                                                       
         DC    CL5'624KE'                                                       
         DC    CL5'625KF'                                                       
         DC    CL5'626KG'                                                       
         DC    CL5'627KH'                                                       
         DC    CL5'628KI'                                                       
         DC    CL5'629KJ'                                                       
         DC    CL5'630KK'                                                       
         DC    CL5'631KL'                                                       
         DC    CL5'632KM'                                                       
         DC    CL5'633KN'                                                       
         DC    CL5'634KO'                                                       
         DC    CL5'635KP'                                                       
         DC    CL5'636KQ'                                                       
         DC    CL5'637KR'                                                       
         DC    CL5'638KS'                                                       
         DC    CL5'639KT'                                                       
         DC    CL5'640KU'                                                       
         DC    CL5'641KV'                                                       
         DC    CL5'642KW'                                                       
         DC    CL5'643KX'                                                       
         DC    CL5'644KY'                                                       
         DC    CL5'645KZ'                                                       
*                           START:  64,600 - 67,199:  LA-LZ                     
         DC    CL5'646LA'                                                       
         DC    CL5'647LB'                                                       
         DC    CL5'648LC'                                                       
         DC    CL5'649LD'                                                       
         DC    CL5'650LE'                                                       
         DC    CL5'651LF'                                                       
         DC    CL5'652LG'                                                       
         DC    CL5'653LH'                                                       
         DC    CL5'654LI'                                                       
         DC    CL5'655LJ'                                                       
         DC    CL5'656LK'                                                       
         DC    CL5'657LL'                                                       
         DC    CL5'658LM'                                                       
         DC    CL5'659LN'                                                       
         DC    CL5'660LO'                                                       
         DC    CL5'661LP'                                                       
         DC    CL5'662LQ'                                                       
         DC    CL5'663LR'                                                       
         DC    CL5'664LS'                                                       
         DC    CL5'665LT'                                                       
         DC    CL5'666LU'                                                       
         DC    CL5'667LV'                                                       
         DC    CL5'668LW'                                                       
         DC    CL5'669LX'                                                       
         DC    CL5'670LY'                                                       
         DC    CL5'671LZ'                                                       
*                           START:  67,200 - 69,799:  MA-MZ                     
         DC    CL5'672MA'                                                       
         DC    CL5'673MB'                                                       
         DC    CL5'674MC'                                                       
         DC    CL5'675MD'                                                       
         DC    CL5'676ME'                                                       
         DC    CL5'677MF'                                                       
         DC    CL5'678MG'                                                       
         DC    CL5'679MH'                                                       
         DC    CL5'680MI'                                                       
         DC    CL5'681MJ'                                                       
         DC    CL5'682MK'                                                       
         DC    CL5'683ML'                                                       
         DC    CL5'684MM'                                                       
         DC    CL5'685MN'                                                       
         DC    CL5'686MO'                                                       
         DC    CL5'687MP'                                                       
         DC    CL5'688MQ'                                                       
         DC    CL5'689MR'                                                       
         DC    CL5'690MS'                                                       
         DC    CL5'691MT'                                                       
         DC    CL5'692MU'                                                       
         DC    CL5'693MV'                                                       
         DC    CL5'694MW'                                                       
         DC    CL5'695MX'                                                       
         DC    CL5'696MY'                                                       
         DC    CL5'697MZ'                                                       
*                           START:  69,800 - 72,399:  NA-NZ                     
         DC    CL5'698NA'                                                       
         DC    CL5'699NB'                                                       
         DC    CL5'700NC'                                                       
         DC    CL5'701ND'                                                       
         DC    CL5'702NE'                                                       
         DC    CL5'703NF'                                                       
         DC    CL5'704NG'                                                       
         DC    CL5'705NH'                                                       
         DC    CL5'706NI'                                                       
         DC    CL5'707NJ'                                                       
         DC    CL5'708NK'                                                       
         DC    CL5'709NL'                                                       
         DC    CL5'710NM'                                                       
         DC    CL5'711NN'                                                       
         DC    CL5'712NO'                                                       
         DC    CL5'713NP'                                                       
         DC    CL5'714NQ'                                                       
         DC    CL5'715NR'                                                       
         DC    CL5'716NS'                                                       
         DC    CL5'717NT'                                                       
         DC    CL5'718NU'                                                       
         DC    CL5'719NV'                                                       
         DC    CL5'720NW'                                                       
         DC    CL5'721NX'                                                       
         DC    CL5'722NY'                                                       
         DC    CL5'723NZ'                                                       
*                           START:  72,400 - 74,999:  OA-OZ                     
         DC    CL5'724OA'                                                       
         DC    CL5'725OB'                                                       
         DC    CL5'726OC'                                                       
         DC    CL5'727OD'                                                       
         DC    CL5'728OE'                                                       
         DC    CL5'729OF'                                                       
         DC    CL5'730OG'                                                       
         DC    CL5'731OH'                                                       
         DC    CL5'732OI'                                                       
         DC    CL5'733OJ'                                                       
         DC    CL5'734OK'                                                       
         DC    CL5'735OL'                                                       
         DC    CL5'736OM'                                                       
         DC    CL5'737ON'                                                       
         DC    CL5'738OO'                                                       
         DC    CL5'739OP'                                                       
         DC    CL5'740OQ'                                                       
         DC    CL5'741OR'                                                       
         DC    CL5'742OS'                                                       
         DC    CL5'743OT'                                                       
         DC    CL5'744OU'                                                       
         DC    CL5'745OV'                                                       
         DC    CL5'746OW'                                                       
         DC    CL5'747OX'                                                       
         DC    CL5'748OY'                                                       
         DC    CL5'749OZ'                                                       
*                           START:  75,000 - 77,599:  PA-PZ                     
         DC    CL5'750PA'                                                       
         DC    CL5'751PB'                                                       
         DC    CL5'752PC'                                                       
         DC    CL5'753PD'                                                       
         DC    CL5'754PE'                                                       
         DC    CL5'755PF'                                                       
         DC    CL5'756PG'                                                       
         DC    CL5'757PH'                                                       
         DC    CL5'758PI'                                                       
         DC    CL5'759PJ'                                                       
         DC    CL5'760PK'                                                       
         DC    CL5'761PL'                                                       
         DC    CL5'762PM'                                                       
         DC    CL5'763PN'                                                       
         DC    CL5'764PO'                                                       
         DC    CL5'765PP'                                                       
         DC    CL5'766PQ'                                                       
         DC    CL5'767PR'                                                       
         DC    CL5'768PS'                                                       
         DC    CL5'769PT'                                                       
         DC    CL5'770PU'                                                       
         DC    CL5'771PV'                                                       
         DC    CL5'772PW'                                                       
         DC    CL5'773PX'                                                       
         DC    CL5'774PY'                                                       
         DC    CL5'775PZ'                                                       
*                           START:  77,600 - 80,199:  QA-QZ                     
         DC    CL5'776QA'                                                       
         DC    CL5'777QB'                                                       
         DC    CL5'778QC'                                                       
         DC    CL5'779QD'                                                       
         DC    CL5'780QE'                                                       
         DC    CL5'781QF'                                                       
         DC    CL5'782QG'                                                       
         DC    CL5'783QH'                                                       
         DC    CL5'784QI'                                                       
         DC    CL5'785QJ'                                                       
         DC    CL5'786QK'                                                       
         DC    CL5'787QL'                                                       
         DC    CL5'788QM'                                                       
         DC    CL5'789QN'                                                       
         DC    CL5'790QO'                                                       
         DC    CL5'791QP'                                                       
         DC    CL5'792QQ'                                                       
         DC    CL5'793QR'                                                       
         DC    CL5'794QS'                                                       
         DC    CL5'795QT'                                                       
         DC    CL5'796QU'                                                       
         DC    CL5'797QV'                                                       
         DC    CL5'798QW'                                                       
         DC    CL5'799QX'                                                       
         DC    CL5'800QY'                                                       
         DC    CL5'801QZ'                                                       
*                           START:  80,200 - 82,799:  RA-RZ                     
         DC    CL5'802RA'                                                       
         DC    CL5'803RB'                                                       
         DC    CL5'804RC'                                                       
         DC    CL5'805RD'                                                       
         DC    CL5'806RE'                                                       
         DC    CL5'807RF'                                                       
         DC    CL5'808RG'                                                       
         DC    CL5'809RH'                                                       
         DC    CL5'810RI'                                                       
         DC    CL5'811RJ'                                                       
         DC    CL5'812RK'                                                       
         DC    CL5'813RL'                                                       
         DC    CL5'814RM'                                                       
         DC    CL5'815RN'                                                       
         DC    CL5'816RO'                                                       
         DC    CL5'817RP'                                                       
         DC    CL5'818RQ'                                                       
         DC    CL5'819RR'                                                       
         DC    CL5'820RS'                                                       
         DC    CL5'821RT'                                                       
         DC    CL5'822RU'                                                       
         DC    CL5'823RV'                                                       
         DC    CL5'824RW'                                                       
         DC    CL5'825RX'                                                       
         DC    CL5'826RY'                                                       
         DC    CL5'827RZ'                                                       
*                           START:  82,800 - 85,399:  SA-SZ                     
         DC    CL5'828SA'                                                       
         DC    CL5'829SB'                                                       
         DC    CL5'830SC'                                                       
         DC    CL5'831SD'                                                       
         DC    CL5'832SE'                                                       
         DC    CL5'833SF'                                                       
         DC    CL5'834SG'                                                       
         DC    CL5'835SH'                                                       
         DC    CL5'836SI'                                                       
         DC    CL5'837SJ'                                                       
         DC    CL5'838SK'                                                       
         DC    CL5'839SL'                                                       
         DC    CL5'840SM'                                                       
         DC    CL5'841SN'                                                       
         DC    CL5'842SO'                                                       
         DC    CL5'843SP'                                                       
         DC    CL5'844SQ'                                                       
         DC    CL5'845SR'                                                       
         DC    CL5'846SS'                                                       
         DC    CL5'847ST'                                                       
         DC    CL5'848SU'                                                       
         DC    CL5'849SV'                                                       
         DC    CL5'850SW'                                                       
         DC    CL5'851SX'                                                       
         DC    CL5'852SY'                                                       
         DC    CL5'853SZ'                                                       
*                           START:  85,400 - 87,999:  TA-TZ                     
         DC    CL5'854TA'                                                       
         DC    CL5'855TB'                                                       
         DC    CL5'856TC'                                                       
         DC    CL5'857TD'                                                       
         DC    CL5'858TE'                                                       
         DC    CL5'859TF'                                                       
         DC    CL5'860TG'                                                       
         DC    CL5'861TH'                                                       
         DC    CL5'862TI'                                                       
         DC    CL5'863TJ'                                                       
         DC    CL5'864TK'                                                       
         DC    CL5'865TL'                                                       
         DC    CL5'866TM'                                                       
         DC    CL5'867TN'                                                       
         DC    CL5'868TO'                                                       
         DC    CL5'869TP'                                                       
         DC    CL5'870TQ'                                                       
         DC    CL5'871TR'                                                       
         DC    CL5'872TS'                                                       
         DC    CL5'873TT'                                                       
         DC    CL5'874TU'                                                       
         DC    CL5'875TV'                                                       
         DC    CL5'876TW'                                                       
         DC    CL5'877TX'                                                       
         DC    CL5'878TY'                                                       
         DC    CL5'879TZ'                                                       
*                           START:  88,000 - 90,599:  UA-UZ                     
         DC    CL5'880UA'                                                       
         DC    CL5'881UB'                                                       
         DC    CL5'882UC'                                                       
         DC    CL5'883UD'                                                       
         DC    CL5'884UE'                                                       
         DC    CL5'885UF'                                                       
         DC    CL5'886UG'                                                       
         DC    CL5'887UH'                                                       
         DC    CL5'888UI'                                                       
         DC    CL5'889UJ'                                                       
         DC    CL5'890UK'                                                       
         DC    CL5'891UL'                                                       
         DC    CL5'892UM'                                                       
         DC    CL5'893UN'                                                       
         DC    CL5'894UO'                                                       
         DC    CL5'895UP'                                                       
         DC    CL5'896UQ'                                                       
         DC    CL5'897UR'                                                       
         DC    CL5'898US'                                                       
         DC    CL5'899UT'                                                       
         DC    CL5'900UU'                                                       
         DC    CL5'901UV'                                                       
         DC    CL5'902UW'                                                       
         DC    CL5'903UX'                                                       
         DC    CL5'904UY'                                                       
         DC    CL5'905UZ'                                                       
*                           START:  90,600 - 93,199:  VA-VZ                     
         DC    CL5'906VA'                                                       
         DC    CL5'907VB'                                                       
         DC    CL5'908VC'                                                       
         DC    CL5'909VD'                                                       
         DC    CL5'910VE'                                                       
         DC    CL5'911VF'                                                       
         DC    CL5'912VG'                                                       
         DC    CL5'913VH'                                                       
         DC    CL5'914VI'                                                       
         DC    CL5'915VJ'                                                       
         DC    CL5'916VK'                                                       
         DC    CL5'917VL'                                                       
         DC    CL5'918VM'                                                       
         DC    CL5'919VN'                                                       
         DC    CL5'920VO'                                                       
         DC    CL5'921VP'                                                       
         DC    CL5'922VQ'                                                       
         DC    CL5'923VR'                                                       
         DC    CL5'924VS'                                                       
         DC    CL5'925VT'                                                       
         DC    CL5'926VU'                                                       
         DC    CL5'927VV'                                                       
         DC    CL5'928VW'                                                       
         DC    CL5'929VX'                                                       
         DC    CL5'930VY'                                                       
         DC    CL5'931VZ'                                                       
*                           START:  93,200 - 95,799:  WA-WZ                     
         DC    CL5'932WA'                                                       
         DC    CL5'933WB'                                                       
         DC    CL5'934WC'                                                       
         DC    CL5'935WD'                                                       
         DC    CL5'936WE'                                                       
         DC    CL5'937WF'                                                       
         DC    CL5'938WG'                                                       
         DC    CL5'939WH'                                                       
         DC    CL5'940WI'                                                       
         DC    CL5'941WJ'                                                       
         DC    CL5'942WK'                                                       
         DC    CL5'943WL'                                                       
         DC    CL5'944WM'                                                       
         DC    CL5'945WN'                                                       
         DC    CL5'946WO'                                                       
         DC    CL5'947WP'                                                       
         DC    CL5'948WQ'                                                       
         DC    CL5'949WR'                                                       
         DC    CL5'950WS'                                                       
         DC    CL5'951WT'                                                       
         DC    CL5'952WU'                                                       
         DC    CL5'953WV'                                                       
         DC    CL5'954WW'                                                       
         DC    CL5'955WX'                                                       
         DC    CL5'956WY'                                                       
         DC    CL5'957WZ'                                                       
*                           START:  95,800 - 98,399:  XA-XZ                     
         DC    CL5'958XA'                                                       
         DC    CL5'959XB'                                                       
         DC    CL5'960XC'                                                       
         DC    CL5'961XD'                                                       
         DC    CL5'962XE'                                                       
         DC    CL5'963XF'                                                       
         DC    CL5'964XG'                                                       
         DC    CL5'965XH'                                                       
         DC    CL5'966XI'                                                       
         DC    CL5'967XJ'                                                       
         DC    CL5'968XK'                                                       
         DC    CL5'969XL'                                                       
         DC    CL5'970XM'                                                       
         DC    CL5'971XN'                                                       
         DC    CL5'972XO'                                                       
         DC    CL5'973XP'                                                       
         DC    CL5'974XQ'                                                       
         DC    CL5'975XR'                                                       
         DC    CL5'976XS'                                                       
         DC    CL5'977XT'                                                       
         DC    CL5'978XU'                                                       
         DC    CL5'979XV'                                                       
         DC    CL5'980XW'                                                       
         DC    CL5'981XX'                                                       
         DC    CL5'982XY'                                                       
         DC    CL5'983XZ'                                                       
*                           START:  98,400 - 99,999:  YA-YP                     
         DC    CL5'984YA'                                                       
         DC    CL5'985YB'                                                       
         DC    CL5'986YC'                                                       
         DC    CL5'987YD'                                                       
         DC    CL5'988YE'                                                       
         DC    CL5'989YF'                                                       
         DC    CL5'990YG'                                                       
         DC    CL5'991YH'                                                       
         DC    CL5'992YI'                                                       
         DC    CL5'993YJ'                                                       
         DC    CL5'994YK'                                                       
         DC    CL5'995YL'                                                       
         DC    CL5'996YM'                                                       
         DC    CL5'997YN'                                                       
         DC    CL5'998YO'                                                       
         DC    CL5'999YP'                                                       
XKTZTAB2 EQU   *                                                                
KTZTAB2# EQU   (XKTZTAB2-KATZTAB2)/LKTZTAB2                                     
         DC    X'0000'             DELIMITER                                    
