*          DATA SET REKTZR01   AT LEVEL 013 AS OF 11/07/95                      
*                                                                               
*    CONTRACT RECORD DSECT:  KATZ RADIO                                         
*       FIRST PART OF RECORD                                                    
*          BYTES  1-991                                                         
*                                                                               
KCONREC1 DSECT                                                                  
KRCONNUM DS    CL7     +0          CONTRACT NUMBER                              
KPRINT   DS    CL1     +7          PRINT FLAG(?)                                
KRSALESP DS    CL5     +8          SALESPERSON                                  
KJBNUM   DS    CL4     +13         JB NUMBER(?)                                 
KRSALNAM DS    CL18    +17         S/P NAME                                     
         DS    CL10    +35         OF NO CONCERN                                
KNTWEXEC DS    CL5     +45         NETWORK EXEC                                 
KRNTWNAM DS    CL18    +50         NETWORK EXEC NAME                            
KRDIVISN DS    CL1     +68         DIVISION                                     
KAEDIVN  DS    CL1     +69         AE DIVISION                                  
KOFFNAME DS    CL18    +70         OFFICE NAME                                  
KRENTRYD DS    CL8     +88         ENTRY DATE MM/DD/YY                          
KRENTERD DS    CL8     +96         ENTERED DATE (CREATE DATE)                   
KRREVDAT DS    CL8     +104        REVISION DATE                                
KRMKT#   DS    CL3     +112        MARKET NUMBER                                
         DS    CL21    +115        OF NO CONCERN                                
KAMFM    DS    CL1     +136        AM/FM INDICATOR(?)                           
         DS    CL4     +137        OF NO CONCERN                                
KRSTATN  DS    CL5     +141        STATION                                      
KRSTATN2 DS    CL5     +146        2ND STATION OF COMBO                         
KRADV#   DS    CL5     +151        ADVERTISER CODE                              
         DS    CL4     +156        OF NO CONCERN                                
KRADVNAM DS    CL30    +160        ADVERTISER NAME                              
KRPROD   DS    CL25    +190        PRODUCT                                      
KRAGY#   DS    CL4     +215        AGENCY CODE                                  
         DS    CL4     +219        QD-AGY                                       
KRAGYNAM DS    CL30    +223        AGENCY NAME                                  
KRADDR1  DS    CL25    +253        ADDRESS 1                                    
KRADDR2  DS    CL25    +278        ADDRESS 2                                    
KRADDR3  DS    CL25    +303        ADDRESS 3                                    
KRBUYER  DS    CL25    +328        BUYER NAME                                   
         DS    CL5     +353        OF NO CONCERN (RATE CARD)                    
KRKEYDMO DS    CL2     +358        KEY DEMO                                     
KRCXTYPE DS    CL1     +360        TYPE: LOST BUS, LOSS, ELIM,TRADE             
KTOTSCHD DS    CL13    +361        TOTAL SCHEDULE                               
KTOTWKS  DS    CL2     +374        TOTAL WEEKS                                  
KSCHDWK1 DS    CL13    +376        SCHEDULE WEEK # 1                            
K#WKS1   DS    CL2     +389        # WEEKS 1                                    
KSCHDWK2 DS    CL13    +391        SCHEDULE WEEK # 2                            
K#WKS2   DS    CL2     +404        # WEEKS 2                                    
KSCHDWK3 DS    CL13    +406        SCHEDULE WEEK # 3                            
K#WKS3   DS    CL2     +419        # WEEKS 3                                    
KSCHDWK4 DS    CL13    +421        SCHEDULE WEEK # 4                            
K#WKS4   DS    CL2     +434        # WEEKS 4                                    
KSCHDWK5 DS    CL13    +436        SCHEDULE WEEK # 5                            
K#WKS5   DS    CL2     +449        # WEEKS 5                                    
KSCHDWK6 DS    CL13    +451        SCHEDULE WEEK # 6                            
K#WKS6   DS    CL2     +464        # WEEKS 6                                    
KSCHDWK7 DS    CL13    +466        SCHEDULE WEEK # 7                            
K#WKS7   DS    CL2     +479        # WEEKS 7                                    
KSCHDWK8 DS    CL13    +481        SCHEDULE WEEK # 8                            
K#WKS8   DS    CL2     +494        # WEEKS 8                                    
KSCHDWK9 DS    CL13    +496        SCHEDULE WEEK # 9                            
K#WKS9   DS    CL2     +509        # WEEKS 9                                    
KSCHDWKA DS    CL13    +511        SCHEDULE WEEK # 10                           
K#WKSA   DS    CL2     +524        # WEEKS 10                                   
KSCHDWKB DS    CL13    +526        SCHEDULE WEEK # 11                           
K#WKSB   DS    CL2     +539        # WEEKS 11                                   
KSCHDWKC DS    CL13    +541        SCHEDULE WEEK # 12                           
K#WKSC   DS    CL2     +554        # WEEKS 12                                   
         DS    CL112   +556        OF NO CONCERN                                
KRBUDGET DS    CL3     +668        BUDGET                                       
KRCOMMT1 DS    CL50    +671        1ST LINE OF COMMENT                          
KRCOMMT2 DS    CL50    +721        2ND LINE OF COMMENT                          
KRCOMMT3 DS    CL50    +771        3RD LINE OF COMMENT                          
KRCOMPDT DS    CL6     +821        COMPLETION DATE (YYMMDD)                     
KRTOTIND DS    CL1     +827        TOTAL INDICATOR (?)                          
KRTOT$$  DS    CL9     +828        TOTAL COST                                   
         DS    CL6     +837        OF NO CONCERN                                
KTERCODE DS    CL2     +843        TERRITORY CODE - AGENCY OUTSIDE              
KROFFICE DS    CL3     +845        OFFICE CODE                                  
KRATELN  DS    CL1     +848        RATE LN(?)                                   
         DS    CL6     +849        OF NO CONCERN                                
KNTWOFF# DS    CL3     +855        NETWORK OFFICE NUMBER                        
         DS    CL18    +858        OFFICE NAME                                  
KNTWPHN# DS    CL10    +876        NETWORK PHONE  NUMBER                        
         DS    CL1     +886        OF NO CONCERN                                
         DS    CL104   +887        OF NO CONCERN (JULIAN DATES)                 
LKTRREC1 EQU   *-KRCONNUM                                                       
KRBYSTUF DS    CL1     +991                                                     
*                                  BEGINNING OF BUYS:                           
*                                  SEE DSECT REKTZR02                           
