*          DATA SET REKTZC03   AT LEVEL 008 AS OF 02/08/96                      
*                                                                               
*    CONTRACT RECORD DSECT:  THIRD PART                                         
*          REMAINDER OF RECORD:                                                 
*              POSITIONS 11956-END                                              
*                                                                               
KCONREC3 DSECT                                                                  
KCONPRT3 EQU   *                                                                
         DS    260C    +0   /11956 OF NO CONCERN                                
KDETFLG  DS    144CL1  +260 /12216 DETAIL FLAGS (1X144)                         
         DS    321C    +404 /12360 OF NO CONCERN                                
KCICSREV DS    CL2     +725 /12681 REVISION NUMBER                              
KCICSEDI DS    CL43    +727 /12683 EDI REFERENCE ELEMENT                        
KXREF#   DS    CL7     +770 /12726 XREF NUMBER                                  
         DS    CL5     +777 /12733 OF NO CONCERN                                
KSADDR2  DS    CL30    +782 /12738 SCREEN AGENCY ADDRESS                        
         DS    CL26    +812 /12768 OF NO CONCERN                                
KCONFTM  DS    CL8     +838 /12794 CONFIRM TIME STAMP                           
LKTZ#3P2 EQU   *-KCICSREV                                                       
         DS    771C    +846 /12802 OF NO CONCERN                                
KKEYDEMO DS    CL3     +1617/13573 KEY DEMO                                     
KOFFICE  DS    CL3     +1620/13576 OFFICE                                       
KSALESP  DS    CL5     +1623/13579 SALESPERSON                                  
KTOT$$   DS    CL7     +1628/13584 TOTAL COST                                   
         DS    CL21    +1635/13591 OF NO CONCERN                                
KCOMP6   DS    CL4     +1656/13612 6TH COMPETITIVE STATION                      
KCOMP6$  DS    CL2     +1660/13616 6TH COMPETITIVE STATION PERCENT              
         DS    CL6     +1662/13618 OF NO CONCERN                                
KWXDAYC  DS    CL8     +1668/13624 CURRENT KWX DATE                             
KWXDAYL  DS    CL8     +1676/13632 LAST    KWX DATE                             
         DS    CL25    +1684/13640 OF NO CONCERN                                
KTIMEDAY DS    CL8     +1709/13665 DAY/TIME OF SOMETHING                        
         DS    CL3     +1717/13673 OF NO CONCERN                                
KCONFIRM DS    CL1     +1720/13676 CONFIRM SOMETHING...                         
         DS    CL8     +1721/13677 OF NO CONCERN                                
KCONFDTE DS    CL8     +1729/13685 CONFIRMATION DATE:  MM/DD/YY                 
KBOBMON  DS    CL13    +1737/13693 B-O-B MONTHS                                 
KBOB13   DS    CL2     +1750/13706 B-O-B 13TH MONTH                             
KBOB     DS    13XL4   +1752/13708 13 4-BYTE MONTHLY BUCKETS                    
KCOMMT4  DS    CL75    +1804/13760 FOURTH LINE OF COMMENT                       
         DS    CL7     +1879/13835 OF NO CONCERN                                
KESTNO   DS    CL6     +1886/13842 ESTIMATE NUMBER                              
KLSTXMIT DS    CL2     +1892/13848 LAST TRANSMIT (?)                            
KMGLSTDT DS    CL8     +1894/13850 LAST MG DATE                                 
KMGLSTTM DS    CL6     +1902/13858 LAST MG TIME                                 
LKTZ#3P3 EQU   *-KKEYDEMO                                                       
         DS    759C    +1908/13864 OF NO CONCERN                                
KAGYBLIN DS    144XL3  +2667/14623 AGENCY BUYLINES: NOT USED.                   
KDARESW  DS    CL1     +3099/15055 DARE SWITCH??                                
*                                  BEGINNING OF REMAINDER:                      
*                                  SEE DSECT REKTZC03                           
