*          DATA SET REKTZRDM   AT LEVEL 022 AS OF 11/09/95                      
*                                                                               
*            *****KATZ RADIO DEMOS*****                                         
*                                                                               
*    CONVERSION TABLE:  KATZ DEMOGRAPHIC CODES TO DDS                           
*        CHARS  1 - 2  :  KATZ DEMOGRAPHIC CODE                                 
*        CHAR   3      :  DDS  DEMOGRAPHIC CODE 'BINARY'                        
*        CHAR   4      :  DDS  DEMOGRAPHIC CODE QUALIFIER                       
*                                                                               
*                                                                               
KATZDEMO DC    CL2'A1',AL1(131),CL1'R'       *A12-54                            
LKTZDEMO EQU   *-KATZDEMO                                                       
         DC    CL2'A2',AL1(000),CL1'R'       *BLACK                             
         DC    CL2'A3',AL1(000),CL1'R'       *FARM                              
         DC    CL2'A4',AL1(000),CL1'R'       *REL                               
         DC    CL2'A5',AL1(000),CL1'R'       *SPANISH                           
         DC    CL2'01',AL1(078),CL1'R'       *TEENS                             
         DC    CL2'02',AL1(079),CL1'R'       *M12-34                            
         DC    CL2'03',AL1(090),CL1'R'       *M18-24                            
         DC    CL2'04',AL1(091),CL1'R'       *M18-34                            
         DC    CL2'05',AL1(210),CL1'R'       *M18-44                            
         DC    CL2'06',AL1(092),CL1'R'       *M18-49                            
         DC    CL2'07',AL1(093),CL1'R'       *M18-54                            
         DC    CL2'08',AL1(094),CL1'R'       *M18-64                            
         DC    CL2'09',AL1(095),CL1'R'       *M18+                              
         DC    CL2'10',AL1(096),CL1'R'       *M25-34                            
         DC    CL2'11',AL1(211),CL1'R'       *M25-44                            
         DC    CL2'12',AL1(097),CL1'R'       *M25-49                            
         DC    CL2'13',AL1(098),CL1'R'       *M25-54                            
         DC    CL2'14',AL1(099),CL1'R'       *M25-64RATING                      
         DC    CL2'15',AL1(100),CL1'R'       *M25+                              
         DC    CL2'16',AL1(212),CL1'R'       *M35-44                            
         DC    CL2'17',AL1(101),CL1'R'       *M35-49                            
         DC    CL2'18',AL1(102),CL1'R'       *M35-54                            
         DC    CL2'19',AL1(103),CL1'R'       *M35-64                            
         DC    CL2'20',AL1(104),CL1'R'       *M35+                              
         DC    CL2'21',AL1(214),CL1'R'       *M45-54                            
         DC    CL2'22',AL1(215),CL1'R'       *M45-64                            
         DC    CL2'23',AL1(216),CL1'R'       *M45+                              
         DC    CL2'24',AL1(108),CL1'R'       *M55-64                            
         DC    CL2'25',AL1(109),CL1'R'       *M55+                              
         DC    CL2'26',AL1(110),CL1'R'       *M65+                              
         DC    CL2'27',AL1(107),CL1'R'       *M50+                              
         DC    CL2'28',AL1(080),CL1'R'       *M12-49                            
         DC    CL2'29',AL1(075),CL1'R'       *TEENS 'A12-17'                    
         DC    CL2'30',AL1(000),CL1'R'                                          
         DC    CL2'31',AL1(028),CL1'R'       *W12-24                            
         DC    CL2'32',AL1(029),CL1'R'       *W12-34                            
         DC    CL2'33',AL1(040),CL1'R'       *W18-24                            
         DC    CL2'34',AL1(041),CL1'R'       *W18-34                            
         DC    CL2'35',AL1(200),CL1'R'       *W18-44                            
         DC    CL2'36',AL1(042),CL1'R'       *W18-49                            
         DC    CL2'37',AL1(043),CL1'R'       *W18-54                            
         DC    CL2'38',AL1(044),CL1'R'       *W18-64                            
         DC    CL2'39',AL1(045),CL1'R'       *W18+                              
         DC    CL2'40',AL1(046),CL1'R'       *W25-34                            
         DC    CL2'41',AL1(201),CL1'R'       *W25-44                            
         DC    CL2'42',AL1(047),CL1'R'       *W25-49                            
         DC    CL2'43',AL1(048),CL1'R'       *W25-54                            
         DC    CL2'44',AL1(049),CL1'R'       *W25-64                            
         DC    CL2'45',AL1(050),CL1'R'       *W25+                              
         DC    CL2'46',AL1(202),CL1'R'       *W35-44                            
         DC    CL2'47',AL1(051),CL1'R'       *W35-49                            
         DC    CL2'48',AL1(052),CL1'R'       *W35-54                            
         DC    CL2'49',AL1(053),CL1'R'       *W35-64                            
         DC    CL2'50',AL1(054),CL1'R'       *W35+                              
         DC    CL2'51',AL1(204),CL1'R'       *W45-54                            
         DC    CL2'52',AL1(205),CL1'R'       *W45-64                            
         DC    CL2'53',AL1(206),CL1'R'       *W45+                              
         DC    CL2'54',AL1(058),CL1'R'       *W55-64                            
         DC    CL2'55',AL1(059),CL1'R'       *W55+                              
         DC    CL2'56',AL1(060),CL1'R'       *W65+                              
         DC    CL2'57',AL1(057),CL1'R'       *W50+                              
         DC    CL2'58',AL1(030),CL1'R'       *W12-49                            
         DC    CL2'59',AL1(025),CL1'R'       *WTEENS 'W12-17'                   
         DC    CL2'60',AL1(000),CL1'R'                                          
         DC    CL2'61',AL1(128),CL1'R'       *A12-24                            
         DC    CL2'62',AL1(129),CL1'R'       *A12-34                            
         DC    CL2'63',AL1(140),CL1'R'       *A18-24                            
         DC    CL2'64',AL1(141),CL1'R'       *A18-34                            
         DC    CL2'65',AL1(220),CL1'R'       *A18-44                            
         DC    CL2'66',AL1(142),CL1'R'       *A18-49                            
         DC    CL2'67',AL1(143),CL1'R'       *A18-54                            
         DC    CL2'68',AL1(144),CL1'R'       *A18-64                            
         DC    CL2'69',AL1(145),CL1'R'       *A18+                              
         DC    CL2'70',AL1(146),CL1'R'       *A25-34                            
         DC    CL2'71',AL1(221),CL1'R'       *A25-44                            
         DC    CL2'72',AL1(147),CL1'R'       *A25-49                            
         DC    CL2'73',AL1(148),CL1'R'       *A25-54                            
         DC    CL2'74',AL1(149),CL1'R'       *A25-64                            
         DC    CL2'75',AL1(150),CL1'R'       *A25+                              
         DC    CL2'76',AL1(222),CL1'R'       *A35-44                            
         DC    CL2'77',AL1(151),CL1'R'       *A35-49                            
         DC    CL2'78',AL1(152),CL1'R'       *A35-54                            
         DC    CL2'79',AL1(153),CL1'R'       *A35-64                            
         DC    CL2'80',AL1(154),CL1'R'       *A35+                              
         DC    CL2'81',AL1(224),CL1'R'       *A45-54                            
         DC    CL2'82',AL1(225),CL1'R'       *A25-64                            
         DC    CL2'83',AL1(226),CL1'R'       *A45+                              
         DC    CL2'84',AL1(158),CL1'R'       *A55-64                            
         DC    CL2'85',AL1(159),CL1'R'       *A55+                              
         DC    CL2'86',AL1(160),CL1'R'       *A65+                              
         DC    CL2'87',AL1(157),CL1'R'       *A50+                              
         DC    CL2'88',AL1(130),CL1'R'       *A12-49                            
         DC    CL2'89',AL1(125),CL1'R'       *TEENS 'A12-17'                    
         DC    CL2'90',AL1(000),CL1'R'                                          
         DC    CL2'91',AL1(133),CL1'R'       *P12+                              
DMOFIELD EQU   *-KATZDEMO                                                       
DMOCOUNT EQU   DMOFIELD/LKTZDEMO                                                
         DC    X'0000'             DELIMITER                                    
