*          DATA SET REKTZC01   AT LEVEL 009 AS OF 04/29/96                      
*                                                                               
*    CONTRACT RECORD DSECT:  FIRST PART                                         
*          BYTES  1-724                                                         
*                                                                               
KCONREC1 DSECT                                                                  
KCONNUM  DS    CL7     +0          CONTRACT NUMBER                              
         DS    CL16    +7          OF NO CONCERN                                
KSALNAM  DS    CL18    +23         S/P NAME                                     
KSALPHON DS    CL10    +42         S/P TELEPHONE NUMBER                         
KDIVISN  DS    CL1     +51         DIVISION                                     
KTEAM    DS    CL1     +52         TEAM                                         
         DS    CL18    +53         OF NO CONCERN                                
KENTRYD  DS    CL8     +71         ENTRY DATE:  MM/DD/YY                        
KENTERD  DS    CL8     +79         ENTERED DATE (CREATE DATE)                   
KREVDATE DS    CL8     +87         REVISION DATE                                
KMKT#    DS    CL3     +95         MARKET NUMBER                                
         DS    CL22    +98         OF NO CONCERN                                
KSTATION DS    CL5     +120        STATION CALL LETTERS                         
KMKTCODE DS    CL3     +125        MARKET CODE (VS MKT#??)                      
KADV#    DS    CL5     +128        ADVERTISER:  APPLY CONVERSION                
KADVNAM  DS    CL30    +133        ADVERTISER NAME                              
KPROD    DS    CL25    +163        PRODUCT NAME                                 
KAGY#    DS    CL4     +188        AGENCY CODE (USE AS IS)                      
KAGYNAM  DS    CL30    +192        AGENCY NAME                                  
KADDR1   DS    CL30    +222        ADDRESS 1                                    
KADDR2   DS    CL30    +252        ADDRESS 2                                    
KADDR3   DS    CL30    +282        ADDRESS 3                                    
KBUYER   DS    CL25    +312        BUYER NAME                                   
         DS    CL5     +337        OF NO CONCERN                                
KSERVICE DS    CL1     +342        RATING SERVICE                               
         DS    CL2     +343        OF NO CONCERN                                
KCXTYPE  DS    CL2     +345        TYPE: LOST BUS, LOSS, ELIM,TRADE             
KBOBCODE DS    CL1     +347        BOB CODE                                     
KSCHED1  DS    CL13    +348        1ST DATES OF FLIGHT                          
*                                     MMDDYY-MMDDYY                             
KALT1    DS    CL1     +361        1ST ALTERNATE FLAG                           
KSCHED2  DS    CL13    +362        2ND DATES OF FLIGHT                          
*                                     MMDDYY-MMDDYY                             
KALT2    DS    CL1     +375        2ND ALTERNATE FLAG                           
KSCHED3  DS    CL13    +376        3RD DATES OF FLIGHT                          
*                                     MMDDYY-MMDDYY                             
KALT3    DS    CL1     +389        3RD ALTERNATE FLAG                           
K#WEEKS  DS    CL2     +390        NUMBER OF WEEKS                              
KBILLWK  DS    CL10    +392        BILL WEEK:  ROTATOR INFO                     
KBUDGET  DS    CL3     +402        BUDGET?                                      
KCOMMT1  DS    CL75    +405        1ST LINE OF COMMENT                          
KCOMMT2  DS    CL75    +480        2ND LINE OF COMMENT                          
KCOMMT3  DS    CL75    +555        3RD LINE OF COMMENT                          
KCOMPDT  DS    CL6     +630        COMPLETION DATE (YYMMDD)                     
         DS    CL1     +636        OF NO CONCERN                                
KHISPAN  DS    CL1     +637        'HISPANIC' CODE INDICTOR                     
KPRDCODE DS    CL2     +638        PRODUCT CATEGORY CODE?                       
         DS    CL3     +640        OF NO CONCERN                                
KTOTIND  DS    CL1     +643        TOTAL INDICATOR (?)                          
KCOMPST1 DS    CL4     +644        COMPETITIVE STATION 1                        
KCOMPBD1 DS    CL2     +648        COMPETITIVE PERCENT 1                        
KCOMPST2 DS    CL4     +650        COMPETITIVE STATION 2                        
KCOMPBD2 DS    CL2     +654        COMPETITIVE PERCENT 2                        
KCOMPST3 DS    CL4     +656        COMPETITIVE STATION 3                        
KCOMPBD3 DS    CL2     +660        COMPETITIVE PERCENT 3                        
KCOMPST4 DS    CL4     +662        COMPETITIVE STATION 4                        
KCOMPBD4 DS    CL2     +666        COMPETITIVE PERCENT 4                        
KCOMPST5 DS    CL4     +668        COMPETITIVE STATION 5                        
KCOMPBD5 DS    CL2     +672        COMPETITIVE PERCENT 5                        
         DS    CL17    +674        OF NO CONCERN                                
KNEWNUM  DS    CL5     +691        (?)                                          
KJULDATS DS    CL28    +696        JULIAN DATES                                 
LKTZREC1 EQU   *-KCONNUM                                                        
KBUYSTUF DS    CL1     +724                                                     
*                                  BEGINNING OF BUYS:                           
*                                  SEE DSECT REKTZC02                           
