*          DATA SET REKTZDMO   AT LEVEL 018 AS OF 05/09/96                      
*                                                                               
*    CONVERSION TABLE:  KATZ DEMOGRAPHIC CODES TO DDS                           
*        CHARS  1 - 3  :  KATZ DEMOGRAPHIC CODE                                 
*        CHAR   4      :  DDS  DEMOGRAPHIC CODE (BINARY)                        
*        CHAR   5      :  DDS  DEMOGRAPHIC CODE QUALIFIER                       
*                                                                               
*                                                                               
KATZDEMO DC    CL3'001',AL1(001),CL1'T'       HOMES                             
LKTZDEMO EQU   *-KATZDEMO                                                       
         DC    CL3'002',AL1(001),CL1'S'       SHARE                             
         DC    CL3'003',AL1(001),CL1'P'       HUT                               
         DC    CL3'004',AL1(002),CL1'R'       METRO RATING                      
         DC    CL3'005',AL1(045),CL1'R'       W18+  RATING                      
         DC    CL3'006',AL1(041),CL1'R'       W1834 RATING                      
         DC    CL3'007',AL1(042),CL1'R'       W1849 RATING                      
         DC    CL3'008',AL1(095),CL1'R'       M18+  RATING                      
         DC    CL3'009',AL1(091),CL1'R'       M1834 RATING                      
         DC    CL3'010',AL1(092),CL1'R'       M1849 RATING                      
         DC    CL3'011',AL1(122),CL1'R'       PERSONS 2-11 RATING               
         DC    CL3'012',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'013',AL1(047),CL1'R'       W2549 RATING                      
         DC    CL3'014',AL1(097),CL1'R'       M2549 RATING                      
         DC    CL3'015',AL1(048),CL1'R'       W2554 RATING                      
         DC    CL3'016',AL1(098),CL1'R'       M2554 RATING                      
         DC    CL3'017',AL1(049),CL1'R'       W2564 RATING                      
         DC    CL3'018',AL1(125),CL1'R'       P1217 RATING                      
         DC    CL3'019',AL1(123),CL1'R'       PERSONS 6-11 RATING               
         DC    CL3'020',AL1(065),CL1'R'       WKG WOM RATING                    
         DC    CL3'021',AL1(148),CL1'R'       P2554 RATING                      
         DC    CL3'022',AL1(078),CL1'R'       M1224 RATING                      
         DC    CL3'023',AL1(127),CL1'R'       PERSONS 2+ RATING                 
         DC    CL3'024',AL1(129),CL1'R'       P1234 RATING                      
         DC    CL3'025',AL1(128),CL1'R'       P1224 RATING                      
         DC    CL3'026',AL1(145),CL1'R'       P18+  RATING                      
         DC    CL3'027',AL1(141),CL1'R'       P1834 RATING                      
         DC    CL3'028',AL1(142),CL1'R'       P1849 RATING                      
         DC    CL3'029',AL1(147),CL1'R'       P2549 RATING                      
         DC    CL3'030',AL1(154),CL1'R'       P35+  RATING                      
         DC    CL3'031',AL1(001),CL1'T'       HOMES 000                         
         DC    CL3'032',AL1(045),CL1'T'       W18+  000                         
         DC    CL3'033',AL1(041),CL1'T'       W1834 000                         
         DC    CL3'034',AL1(042),CL1'T'       W1849 000                         
         DC    CL3'035',AL1(047),CL1'T'       W2549 000                         
         DC    CL3'036',AL1(048),CL1'T'       W2554 000                         
         DC    CL3'037',AL1(065),CL1'T'       WKG WOM 000                       
         DC    CL3'038',AL1(095),CL1'T'       M18+  000                         
         DC    CL3'039',AL1(092),CL1'T'       M1834 000                         
         DC    CL3'040',AL1(092),CL1'T'       M1849 000                         
         DC    CL3'041',AL1(097),CL1'T'       M2549 000                         
         DC    CL3'042',AL1(098),CL1'T'       M2554 000                         
         DC    CL3'043',AL1(122),CL1'T'       PERSONS 2-11 000                  
         DC    CL3'044',AL1(123),CL1'T'       PERSONS 6-11 000                  
         DC    CL3'045',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'046',AL1(145),CL1'T'       P18+  000                         
         DC    CL3'047',AL1(140),CL1'T'       P1824 000                         
         DC    CL3'048',AL1(141),CL1'T'       P1834 000                         
         DC    CL3'049',AL1(142),CL1'R'       P1849 000                         
         DC    CL3'050',AL1(043),CL1'T'       W1854 000                         
         DC    CL3'051',AL1(050),CL1'T'       W25+  000                         
         DC    CL3'052',AL1(100),CL1'T'       M25+  000                         
         DC    CL3'053',AL1(150),CL1'T'       P25+ 000                          
         DC    CL3'054',AL1(046),CL1'T'       W2534 000                         
         DC    CL3'055',AL1(146),CL1'T'       P2534 000                         
         DC    CL3'056',AL1(147),CL1'T'       P2549 000                         
         DC    CL3'057',AL1(148),CL1'T'       P2554 000                         
         DC    CL3'058',AL1(049),CL1'T'       W2564 000                         
         DC    CL3'059',AL1(099),CL1'T'       M2564 000                         
         DC    CL3'060',AL1(149),CL1'T'       M2564 000                         
         DC    CL3'061',AL1(054),CL1'T'       W35+  000                         
         DC    CL3'062',AL1(104),CL1'T'       M35+  000                         
         DC    CL3'063',AL1(154),CL1'T'       P35+  000                         
         DC    CL3'064',AL1(051),CL1'T'       W3549 000                         
         DC    CL3'065',AL1(151),CL1'T'       P3549 000                         
         DC    CL3'066',AL1(057),CL1'T'       W50+  000                         
         DC    CL3'067',AL1(107),CL1'T'       M50+  000                         
         DC    CL3'068',AL1(157),CL1'T'       P50+  000                         
         DC    CL3'069',AL1(028),CL1'T'       W1224 000                         
         DC    CL3'070',AL1(128),CL1'T'       P1224 000                         
         DC    CL3'071',AL1(025),CL1'T'       W1217 RATING                      
         DC    CL3'072',AL1(127),CL1'T'       PERSONS 2+ 000                    
         DC    CL3'073',AL1(129),CL1'T'       P1234 000                         
         DC    CL3'074',AL1(029),CL1'T'       W1234 000                         
         DC    CL3'075',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'076',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'077',AL1(096),CL1'T'       M2534 000                         
         DC    CL3'078',AL1(052),CL1'T'       W3554 000                         
         DC    CL3'079',AL1(040),CL1'T'       W1824 000                         
         DC    CL3'080',AL1(090),CL1'T'       M1824 000                         
         DC    CL3'081',AL1(054),CL1'R'       W35+  RATING                      
         DC    CL3'082',AL1(104),CL1'R'       M35+  RATING                      
         DC    CL3'083',AL1(057),CL1'R'       W50+  RATING                      
         DC    CL3'084',AL1(107),CL1'R'       M50+  RATING                      
         DC    CL3'085',AL1(150),CL1'R'       P25+  RATING                      
         DC    CL3'086',AL1(157),CL1'R'       P50+  RATING                      
         DC    CL3'087',AL1(050),CL1'R'       W25+  RATING                      
         DC    CL3'088',AL1(100),CL1'R'       M25+  RATING                      
         DC    CL3'089',AL1(093),CL1'R'       M1854 RATING                      
         DC    CL3'090',AL1(052),CL1'R'       W3554 RATING                      
         DC    CL3'091',AL1(028),CL1'R'       W1224 RATING                      
         DC    CL3'092',AL1(040),CL1'R'       W1824 RATING                      
         DC    CL3'093',AL1(090),CL1'R'       M1824 RATING                      
         DC    CL3'094',AL1(140),CL1'R'       P1824 RATING                      
         DC    CL3'095',AL1(046),CL1'R'       W2534 RATING                      
         DC    CL3'096',AL1(096),CL1'R'       M2534 RATING                      
         DC    CL3'097',AL1(146),CL1'R'       P2534 RATING                      
         DC    CL3'098',AL1(143),CL1'T'       M1854 000                         
         DC    CL3'099',AL1(101),CL1'T'       M3549 000                         
         DC    CL3'100',AL1(102),CL1'T'       M3554 000                         
         DC    CL3'101',AL1(152),CL1'T'       P3554 000                         
         DC    CL3'102',AL1(025),CL1'R'       W1217 RATING                      
         DC    CL3'103',AL1(029),CL1'R'       W1234 RATING                      
         DC    CL3'104',AL1(079),CL1'R'       M1234 RATING                      
         DC    CL3'105',AL1(078),CL1'T'       M1224 000                         
         DC    CL3'106',AL1(079),CL1'T'       M1234 000                         
         DC    CL3'107',AL1(093),CL1'T'       M1854 000                         
         DC    CL3'108',AL1(143),CL1'R'       P1854 RATING                      
         DC    CL3'109',AL1(043),CL1'R'       W1854 RATING                      
         DC    CL3'110',AL1(099),CL1'R'       M2564 RATING                      
         DC    CL3'111',AL1(149),CL1'R'       P2564 RATING                      
         DC    CL3'112',AL1(101),CL1'R'       M3549 RATING                      
         DC    CL3'113',AL1(051),CL1'R'       W3549 RATING                      
         DC    CL3'114',AL1(151),CL1'R'       P3549 RATING                      
         DC    CL3'115',AL1(102),CL1'R'       M3554 RATING                      
         DC    CL3'116',AL1(152),CL1'R'       P3554 RATING                      
         DC    CL3'117',AL1(075),CL1'T'       M1217 000                         
         DC    CL3'118',AL1(075),CL1'R'       M1217 RATING                      
         DC    CL3'119',AL1(060),CL1'R'       W65+  RATING                      
         DC    CL3'120',AL1(110),CL1'T'       W65+  000                         
         DC    CL3'121',AL1(160),CL1'R'       M65+  RATING                      
         DC    CL3'122',AL1(060),CL1'T'       M65+  000                         
         DC    CL3'123',AL1(110),CL1'R'       P65+  RATING                      
         DC    CL3'124',AL1(160),CL1'T'       P65+  000                         
         DC    CL3'125',AL1(053),CL1'T'       W3564 000                         
         DC    CL3'126',AL1(103),CL1'T'       M3564 000                         
         DC    CL3'127',AL1(153),CL1'T'       P3564 000                         
         DC    CL3'128',AL1(053),CL1'R'       W3564 RATING                      
         DC    CL3'129',AL1(103),CL1'R'       M3564 RATING                      
         DC    CL3'130',AL1(153),CL1'R'       P3564 RATING                      
         DC    CL3'131',AL1(179),CL1'T'       PERSONS 6-17 000                  
         DC    CL3'132',AL1(179),CL1'R'       PERSONS 6-17 RATING               
         DC    CL3'133',AL1(172),CL1'T'       PERSONS 2-17 000                  
         DC    CL3'134',AL1(172),CL1'R'       PERSONS 2-17 RATING               
         DC    CL3'135',AL1(059),CL1'T'       W55+  000                         
         DC    CL3'136',AL1(059),CL1'R'       W55+  RATING                      
         DC    CL3'137',AL1(109),CL1'T'       M55+  000                         
         DC    CL3'138',AL1(109),CL1'R'       M55+  RATING                      
         DC    CL3'139',AL1(159),CL1'T'       P55+  000                         
         DC    CL3'140',AL1(159),CL1'R'       P55+  RATING                      
         DC    CL3'141',AL1(030),CL1'T'       W1249 000                         
         DC    CL3'142',AL1(080),CL1'T'       M1249 000                         
         DC    CL3'143',AL1(030),CL1'R'       W1249 RATING                      
         DC    CL3'144',AL1(080),CL1'R'       M1249 RATING                      
         DC    CL3'145',AL1(125),CL1'T'       P1217 000                         
         DC    CL3'146',AL1(121),CL1'T'       PERSONS 2-5 000                   
         DC    CL3'147',AL1(121),CL1'R'       PERSONS 2-5 RATING                
         DC    CL3'148',AL1(130),CL1'T'       P1249 000                         
         DC    CL3'159',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'150',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'151',AL1(114),CL1'T'       M2134 000                         
         DC    CL3'152',AL1(115),CL1'T'       M2149 000                         
         DC    CL3'153',AL1(118),CL1'R'       M21+  RATING                      
         DC    CL3'154',AL1(118),CL1'T'       M21+  000                         
         DC    CL3'155',AL1(114),CL1'R'       M2134 RATING                      
         DC    CL3'156',AL1(115),CL1'R'       M2149 RATING                      
         DC    CL3'157',AL1(116),CL1'R'       M2154 RATING                      
         DC    CL3'158',AL1(116),CL1'T'       M2154 000                         
         DC    CL3'159',AL1(070),CL1'T'       W2134 000                         
         DC    CL3'160',AL1(071),CL1'T'       W2149 000                         
         DC    CL3'161',AL1(067),CL1'R'       W21+  RATING                      
         DC    CL3'162',AL1(067),CL1'T'       W21+  000                         
         DC    CL3'163',AL1(070),CL1'R'       W2134 RATING                      
         DC    CL3'164',AL1(071),CL1'R'       W2149 RATING                      
         DC    CL3'165',AL1(072),CL1'R'       W2154 RATING                      
         DC    CL3'166',AL1(072),CL1'T'       W2154 000                         
         DC    CL3'167',AL1(190),CL1'T'       P2134 000                         
         DC    CL3'168',AL1(191),CL1'T'       M2149 000                         
         DC    CL3'169',AL1(194),CL1'R'       P21+  RATING                      
         DC    CL3'170',AL1(194),CL1'T'       P21+  000                         
         DC    CL3'171',AL1(190),CL1'R'       P2134 RATING                      
         DC    CL3'172',AL1(191),CL1'R'       P2149 RATING                      
         DC    CL3'173',AL1(192),CL1'R'       P2154 RATING                      
         DC    CL3'174',AL1(192),CL1'T'       P2154 000                         
         DC    CL3'175',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'176',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'177',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'178',AL1(042),CL1'R'       NO KATZ NUMBER                    
         DC    CL3'179',AL1(042),CL1'R'       NO KATZ NUMBER                    
DMOFIELD EQU   *-KATZDEMO                                                       
DMOCOUNT EQU   DMOFIELD/LKTZDEMO                                                
         DC    X'0000'             DELIMITER                                    
