*          DATA SET RELFMFDDS  AT LEVEL 001 AS OF 11/22/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804FDD      DATE 11/22/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
FMSGENH  DS    XL8                                                              
FMSGEN   DS    CL50     6   20   50  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
FMSMKH   DS    XL8                                                              
FMSMK    DS    CL20     7   14   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   40   11  A  P N             T        Y              
FMSCSTH  DS    XL8                                                              
FMSCST   DS    CL3      7   52    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   56    6  A  P N             T        Y              
FMSCAPH  DS    XL8                                                              
FMSCAP   DS    CL3      7   63    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   67    7  A  P N             T        Y              
FMSCHH   DS    XL8                                                              
FMSCH    DS    CL5      7   75    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
FMSGSGH  DS    XL8                                                              
FMSGSG   DS    CL2      8   14    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     8   19   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     8   40   14  A  P N             T        Y              
FMSTRFH  DS    XL8                                                              
FMSTRF   DS    CL2      8   55    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18     8   58   18  A  P N             T        Y              
FMSRWSH  DS    XL8                                                              
FMSRWS   DS    CL2      8   77    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
FMSTVBH  DS    XL8                                                              
FMSTVB   DS    CL3      9   14    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     9   19   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   40    9  A  P N             T        Y              
FMSJDH   DS    XL8                                                              
FMSJD    DS    CL8      9   51    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   60   10  A  P N             T        Y              
FMSLDH   DS    XL8                                                              
FMSLD    DS    CL8      9   71    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
FMSOWNH  DS    XL8                                                              
FMSOWN   DS    CL3     10   14    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10   19   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   40   10  A  P N             T        Y              
FMSFORH  DS    XL8                                                              
FMSFOR   DS    CL3     10   51    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   60    7  A  P N             T        Y              
FMSNEWH  DS    XL8                                                              
FMSNEW   DS    CL3     10   71    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11    2    4  A  P N             T        Y              
FMSRNKH  DS    XL8                                                              
FMSRNK   DS    CL1     11   14    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   19   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   40    6  A  P N             T        Y              
FMSSTH   DS    XL8                                                              
FMSST    DS    CL20    11   51   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
FMSOPTH  DS    XL8                                                              
FMSOPT   DS    CL25    12   11   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   40    8  A  P N             T        Y              
FMSMCDH  DS    XL8                                                              
FMSMCD   DS    CL4     12   51    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   16    9  A  P N             T        Y              
FMSRIDH  DS    XL8                                                              
FMSRID   DS    CL8     13   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   40    7  A  P N             T        Y              
FMSSIDH  DS    XL8                                                              
FMSSID   DS    CL21    13   51   21  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   16   11  A  P N             T        Y              
FMSRDSH  DS    XL8                                                              
FMSRDS   DS    CL19    14   28   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   56   13  A  P N             T        Y              
FMSDMCH  DS    XL8                                                              
FMSDMC   DS    CL5     14   71    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15    2   20  A  P N             T        Y              
FMSAFH   DS    XL8                                                              
FMSAF    DS    CL3     15   24    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   28   14  A  P Z             T        Y              
FMSAF2H  DS    XL8                                                              
FMSAF2   DS    CL3     15   43    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     15   47    9  A  P N             T        Y              
FMSTZH   DS    XL8                                                              
FMSTZ    DS    CL2     15   57    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   60    6  A  P N             T        Y              
FMSSTNH  DS    XL8                                                              
FMSSTN   DS    CL8     15   67    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
FMSCCMH  DS    XL8                                                              
FMSCCM   DS    CL60    16   14   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17    2   15  A  P N             T        Y              
FMSECH   DS    XL8                                                              
FMSEC    DS    CL3     17   18    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   22    4  A  P N             T        Y              
FMSLUH   DS    XL8                                                              
FMSLU    DS    CL8     17   27    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   36    8  A  P N             T        Y              
FMSINVH  DS    XL8                                                              
FMSINV   DS    CL3     17   45    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    17   49   18  A  P N             T        Y              
FMSINTH  DS    XL8                                                              
FMSINT   DS    CL12    17   68   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    18    2   21  A  P N             T        Y              
FMSCMH   DS    XL8                                                              
FMSCM    DS    CL8     18   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   33    2  A  P N             T        Y              
FMSCM1H  DS    XL8                                                              
FMSCM1   DS    CL8     18   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   45    2  A  P N             T        Y              
FMSCM2H  DS    XL8                                                              
FMSCM2   DS    CL8     18   48    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   57    2  A  P N             T        Y              
FMSCM3H  DS    XL8                                                              
FMSCM3   DS    CL8     18   60    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   69    2  A  P N             T        Y              
FMSCM4H  DS    XL8                                                              
FMSCM4   DS    CL8     18   72    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19    2   10  A  P N             T        Y              
FMSFAXH  DS    XL8                                                              
FMSFAX   DS    CL19    19   14   19  A  U N             T        Y              
FMSDC1H  DS    XL8                                                              
FMSDC1   DS    CL8     19   36    8  A  P N             T        Y              
FMSDC2H  DS    XL8                                                              
FMSDC2   DS    CL8     19   48    8  A  P N             T        Y              
FMSDC3H  DS    XL8                                                              
FMSDC3   DS    CL8     19   60    8  A  P N             T        Y              
FMSDC4H  DS    XL8                                                              
FMSDC4   DS    CL8     19   72    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
FMSTWXH  DS    XL8                                                              
FMSTWX   DS    CL20    20   14   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   35   12  A  P N             T        Y              
FMSLADH  DS    XL8                                                              
FMSLAD   DS    CL8     20   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   57    9  A  P N             T        Y              
FMSUIDH  DS    XL8                                                              
FMSUID   DS    CL6     20   67    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    21    2   13  A  P N             T        Y              
FMSLIBH  DS    XL8                                                              
FMSLIB   DS    CL2     21   17    2  A  U N             T        Y              
FMSLICH  DS    XL8                                                              
FMSLIC   DS    CL50    21   21   50  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  P N             T        Y              
FMSSC1H  DS    XL8                                                              
FMSSC1   DS    CL65    22   13   65  A  U N             T        Y              
FMSSC2H  DS    XL8                                                              
FMSSC2   DS    CL65    23   13   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
FMSEM1H  DS    XL8                                                              
FMSEM1   DS    CL66    24   10   66  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
FMSLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
FMSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1984 BYTES                            
