*          DATA SET RELFME3DS  AT LEVEL 003 AS OF 01/28/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804E3D      DATE 01/28/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
FPPNAMEH DS    XL8                                                              
FPPNAME  DS    CL20     7   16   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     7   40   12  A  P N             T        Y              
FPPEDIH  DS    XL8                                                              
FPPEDI   DS    CL2      7   53    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     7   56   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
FPPFONEH DS    XL8                                                              
FPPFONE  DS    CL20     9   16   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   40    3  A  P N             T        Y              
FPPFAXH  DS    XL8                                                              
FPPFAX   DS    CL12     9   46   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   62    9  A  P N             T        Y              
FPPFAXPH DS    XL8                                                              
FPPFAXP  DS    CL2      9   73    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
FPPREPH  DS    XL8                                                              
FPPREP   DS    CL2     11   16    2  A  U N             T        Y              
FPPREPXH DS    XL8                                                              
FPPREPX  DS    CL20    11   22   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
FPPOFFH  DS    XL8                                                              
FPPOFF   DS    CL2     13   16    2  A  U N             T        Y              
FPPOFFXH DS    XL8                                                              
FPPOFFX  DS    CL20    13   22   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
FPPSPERH DS    XL8                                                              
FPPSPER  DS    CL3     15   16    3  A  U N             T        Y              
FPPSPEXH DS    XL8                                                              
FPPSPEX  DS    CL20    15   22   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    2   11  A  P N             T        Y              
FPPLDATH DS    XL8                                                              
FPPLDAT  DS    CL8     17   16    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
FPPEMALH DS    XL8                                                              
FPPEMAL  DS    CL48    18   16   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   79    1  A  U N             T        Y              
FPPLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
FPPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
