*          DATA SET RELFMFFD   AT LEVEL 004 AS OF 02/09/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804FFD      DATE 02/09/99                 
         SPACE 1                                                                
T804FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LFMMSGH  DS    CL8                                                              
LFMMSG   DS    CL60     1    2   60  A  P N             T        Y              
LFMSVCH  DS    CL8                                                              
LFMSVC   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      3    2    7  A  P N             T        Y              
LFMRECH  DS    CL8                                                              
LFMREC   DS    CL10     3   13   10  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
LFMACTH  DS    CL8                                                              
LFMACT   DS    CL10     4   13   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
LFMKEYH  DS    CL8                                                              
LFMKEY   DS    CL30     5   13   30  A  U N             T        Y              
LFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 280  BYTES                            
