*          DATA SET RELFME6D   AT LEVEL 005 AS OF 07/11/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804E6D      DATE 07/11/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     7   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7   33    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   P    N         T        Y              
EOMSJANH DS    CL8                                                              
EOMSJAN  DS    CL10     9   14   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   14   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    20   14   10  A   P    N         T        Y              
EOMDECH  DS    CL8                                                              
EOMDEC   DS    CL10    20   33   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   64    1  A   U    N         T        Y              
EOMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
EOMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 610  BYTES                            
