*          DATA SET RELFMEDD   AT LEVEL 004 AS OF 08/03/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804EDD      DATE 08/03/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TRNMRKTH DS    CL8                                                              
TRNMRKT  DS    CL25     5   45   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
TRNFRBKH DS    CL8                                                              
TRNFRBK  DS    CL11     8   13   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
TRNTOBKH DS    CL8                                                              
TRNTOBK  DS    CL11     9   13   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    12    2   77  A  P N             T        Y              
TRNINV1H DS    CL8                                                              
TRNINV1  DS    CL13    13    2   13  A  U N             T        Y              
TRNTYPEH DS    CL8                                                              
TRNTYPE  DS    CL2     13   18    2  A  U N             T        Y              
TRNCODEH DS    CL8                                                              
TRNCODE  DS    CL2     13   23    2  A  U N             T        Y              
TRNFROMH DS    CL8                                                              
TRNFROM  DS    CL31    13   29   31  A  U N             T        Y              
TRNUPGH  DS    CL8                                                              
TRNUPG   DS    CL16    13   63   16  A  U N             T        Y              
TRNINV2H DS    CL8                                                              
TRNINV2  DS    CL13    14    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    14   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    15    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    15   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    16    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    16   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    17    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    17   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    18    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    18   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    19    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    19   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    20    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    20   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    21   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    21   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    22   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    22   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    23   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    23   63   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    24    2   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL31    24   29   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    24   63   16  A  U N             T        Y              
TRNLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1440 BYTES                            
