*          DATA SET RELFMDDD   AT LEVEL 003 AS OF 02/21/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804DDD      DATE 02/21/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     7   14   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   14   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   14   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   14   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   20    1  A  U N             T        Y              
LDDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LDDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 176  BYTES                            
