*          DATA SET RELFMFBD   AT LEVEL 003 AS OF 05/05/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804FBD      DATE 05/05/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     7   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     8   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     9    2   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     9   17   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   17    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   17   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   17    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    13   17   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   17    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   23    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   25    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   29    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   31    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   17    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   17    1  A  U N             T        Y              
LFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 416  BYTES                            
