*          DATA SET RELFME0AD  AT LEVEL 001 AS OF 02/13/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804E0D      DATE 02/13/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     7    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64     8   12   64  A  P N             T        Y              
PROPGM1H DS    CL8                                                              
PROPGM1  DS    CL8      9    2    8  A  P N             T        Y              
PROBIT1H DS    CL8                                                              
PROBIT1  DS    CL64     9   12   64  A  U N             T        N              
PROPGM2H DS    CL8                                                              
PROPGM2  DS    CL8     10    2    8  A  P N             T        Y              
PROBIT2H DS    CL8                                                              
PROBIT2  DS    CL64    10   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    11   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    12   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    13   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    14   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    15   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    16   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    17   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    18   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    19   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    20   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    21   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    22   12   64  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     23    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL64    23   12   64  A  U N             T        N              
PROLSTH  DS    CL8                                                              
PROLST   DS    CL1     24   78    1  A  U N             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1432 BYTES                            
