*          DATA SET RELFMF7SD  AT LEVEL 004 AS OF 09/01/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F7D      DATE 09/01/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     7    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     7   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     8   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL30     9   22   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   19    1  A  U N             T        Y              
LADHAVQH DS    CL8                                                              
LADHAVQ  DS    CL16    11    2   16  A  P N             T        Y              
LADAVEQH DS    CL8                                                              
LADAVEQ  DS    CL5     11   19    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
LADOFC1H DS    CL8                                                              
LADOFC1  DS    CL2     12   15    2  A  U N             T        Y              
LADOFC2H DS    CL8                                                              
LADOFC2  DS    CL2     12   20    2  A  U N             T        Y              
LADOFC3H DS    CL8                                                              
LADOFC3  DS    CL2     12   25    2  A  U N             T        Y              
LADOFC4H DS    CL8                                                              
LADOFC4  DS    CL2     12   30    2  A  U N             T        Y              
LADOFC5H DS    CL8                                                              
LADOFC5  DS    CL2     12   35    2  A  U N             T        Y              
LADOFC6H DS    CL8                                                              
LADOFC6  DS    CL2     12   40    2  A  U N             T        Y              
LADHALCH DS    CL8                                                              
LADHALC  DS    CL13    12   52   13  A  P N             T        Y              
LADAVLCH DS    CL8                                                              
LADAVLC  DS    CL8     12   70    8  A  P N             T        Y              
LADLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 344  BYTES                            
