*          DATA SET RELFMF0D   AT LEVEL 004 AS OF 12/21/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F0D      DATE 12/21/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL15     7    2   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30     7   20   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15     8    2   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      8   20    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   20    1  A   U    N         T        Y              
LFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 112  BYTES                            
