*          DATA SET RELFMF6D   AT LEVEL 001 AS OF 11/16/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F6D      DATE 11/16/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
PRDPNAMH DS    XL8                                                              
PRDPNAM  DS    CL20     7   22   20  A  U N             T        Y   10         
PRDPNAMX DS    XL8                                                              
PRDPCNTH DS    XL8                                                              
PRDPCNT  DS    CL4      7   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     8    2   16  A  P N             T        Y              
PRDPCATH DS    XL8                                                              
PRDPCAT  DS    CL2      8   22    2  A  U N             T        Y   20         
PRDPCATX DS    XL8                                                              
PRDPCEXH DS    XL8                                                              
PRDPCEX  DS    CL30     8   29   30  A  P N             T        Y              
PRDPCFCH DS    XL8                                                              
PRDPCFC  DS    CL18     8   61   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
PRDAGYH  DS    XL8                                                              
PRDAGY   DS    CL7      9   22    7  A  U N             T        Y              
PRDAEXPH DS    XL8                                                              
PRDAEXP  DS    CL20     9   31   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
PRDDATEH DS    XL8                                                              
PRDDATE  DS    CL17    10   22   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
PRDSPCH  DS    XL8                                                              
PRDSPC   DS    CL3     13   26    3  A  U N             T        Y   61         
PRDSPCX  DS    XL8                                                              
PRDSPCNH DS    XL8                                                              
PRDSPCN  DS    CL20    13   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   11   10  A  P N             T        Y              
PRDSP1H  DS    XL8                                                              
PRDSP1   DS    CL3     14   26    3  A  U N             T        Y   62         
PRDSP1X  DS    XL8                                                              
PRDSP1NH DS    XL8                                                              
PRDSP1N  DS    CL20    14   30   20  A  P N             T        Y              
PRDSP2H  DS    XL8                                                              
PRDSP2   DS    CL3     14   52    3  A  U N             T        Y   62         
PRDSP2X  DS    XL8                                                              
PRDSP2NH DS    XL8                                                              
PRDSP2N  DS    CL20    14   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   11   13  A  P Z             T        Y              
PRDSPS1H DS    XL8                                                              
PRDSPS1  DS    CL3     15   26    3  A  P Z             T        Y   63         
PRDSPS1X DS    XL8                                                              
PRDSPS2H DS    XL8                                                              
PRDSPS2  DS    CL3     15   52    3  A  P Z             T        Y   63         
PRDSPS2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   11    8  A  P N             T        Y              
PRDSPEH  DS    XL8                                                              
PRDSPE   DS    CL3     16   26    3  A  U N             T        Y   64         
PRDSPEX  DS    XL8                                                              
PRDSPENH DS    XL8                                                              
PRDSPEN  DS    CL20    16   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    18    2   23  A  P N             T        Y              
PRDNCNOH DS    XL8                                                              
PRDNCNO  DS    CL8     18   26    8  A  U N             T        Y   30         
PRDNCNOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   36   11  A  P N             T        Y              
PRDNDESH DS    XL8                                                              
PRDNDES  DS    CL25    18   50   25  A  U N             T        Y   40         
PRDNDESX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19   10   12  A  P N             T        Y              
PRDPPERH DS    XL8                                                              
PRDPPER  DS    CL3     19   26    3  A  U N             T        Y   50         
PRDPPERX DS    XL8                                                              
PRDPPEXH DS    XL8                                                              
PRDPPEX  DS    CL20    19   31   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
PRDCTP1H DS    XL8                                                              
PRDCTP1  DS    CL1     20   26    1  A  U N             T        Y              
PRDCTP2H DS    XL8                                                              
PRDCTP2  DS    CL1     20   29    1  A  U N             T        Y              
PRDCTP3H DS    XL8                                                              
PRDCTP3  DS    CL1     20   32    1  A  U N             T        Y              
PRDCTP4H DS    XL8                                                              
PRDCTP4  DS    CL1     20   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   50   12  A  P N             T        Y              
PRDUPDH  DS    XL8                                                              
PRDUPD   DS    CL8     20   63    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   79    1  A  U N             T        Y              
PRDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
