*          DATA SET RELFMD2D   AT LEVEL 004 AS OF 07/01/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804D2D      DATE 07/01/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      7    1    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      7    8    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      7   17    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   27    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   34    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      7   43    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   53    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   60    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      7   69    8  A  P H             T        Y              
UIDUID1H DS    XL8                                                              
UIDUID1  DS    CL24     8    1   24  A  P N             T        Y              
UIDUID2H DS    XL8                                                              
UIDUID2  DS    CL24     8   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     8   53   24  A  P N             T        Y              
UIDUID3H DS    XL8                                                              
UIDUID3  DS    CL24     9    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     9   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     9   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    10    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    10   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    10   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    11    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    11   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    11   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    12    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    12   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    12   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    13    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    13   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    13   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    14    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    14   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    14   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    15    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    15   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    15   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    16    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    16   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    16   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    17    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    17   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    17   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    18    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    18   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    18   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    19    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    19   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    19   53   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    20    1   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    20   27   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    20   53   24  A  P N             T        Y              
UIDUIDLH DS    XL8                                                              
UIDUIDL  DS    CL2     21    1    2  A  P N             T        Y              
UIDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
UIDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1392 BYTES                            
