*          DATA SET RELFMF5D   AT LEVEL 007 AS OF 10/26/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F5D      DATE 10/26/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
LAGAGYSH DS    XL8                                                              
LAGAGYS  DS    CL20     7   20   20  A  U N             T        Y   10         
LAGAGYSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
LAGAGYNH DS    XL8                                                              
LAGAGYN  DS    CL33     8   20   33  A  U N             T        Y   20         
LAGAGYNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     9    2   14  A  P N             T        Y              
LAGAGY1H DS    XL8                                                              
LAGAGY1  DS    CL34     9   20   34  A  U N             T        Y   30         
LAGAGY1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
LAGAGY2H DS    XL8                                                              
LAGAGY2  DS    CL34    10   20   34  A  U N             T        Y   30         
LAGAGY2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11    2    4  A  P N             T        Y              
LAGAGYIH DS    XL8                                                              
LAGAGYI  DS    CL20    11   20   20  A  U N             T        Y   30         
LAGAGYIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
LAGAGYTH DS    XL8                                                              
LAGAGYT  DS    CL2     12   20    2  A  U N             T        Y   50         
LAGAGYTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12   30    8  A  P N             T        Y              
LAGAGYZH DS    XL8                                                              
LAGAGYZ  DS    CL10    12   40   10  A  U N             T        Y   60         
LAGAGYZX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
LAGAGYPH DS    XL8                                                              
LAGAGYP  DS    CL10    13   20   10  A  U N             T        Y   70         
LAGAGYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    13   40   16  A  P Z             T        Y              
LAGAGDDH DS    XL8                                                              
LAGAGDD  DS    CL1     13   58    1  A  P Z             T        Y   70         
LAGAGDDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    13   61   15  A  P N             T        Y              
LAGAGDUH DS    XL8                                                              
LAGAGDU  DS    CL1     13   78    1  A  U N             T        Y   70         
LAGAGDUX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
LAGAGYCH DS    XL8                                                              
LAGAGYC  DS    CL1     14   20    1  A  U N             T        Y   80         
LAGAGYCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL40    14   25   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
LAGAGYLH DS    XL8                                                              
LAGAGYL  DS    CL2     15   20    2  A  U N             T        Y   90         
LAGAGYLX DS    XL8                                                              
LAGAGYRH DS    XL8                                                              
LAGAGYR  DS    CL50    15   25   50  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   20    1  A  P N             T        Y              
LAGFAREH DS    XL8                                                              
LAGFARE  DS    CL3     16   22    3  A  U N             T        Y  100         
LAGFAREX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   26    1  N  P N             T        Y              
LAGFTELH DS    XL8                                                              
LAGFTEL  DS    CL3     16   28    3  A  U N             T        Y  100         
LAGFTELX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   32    1  N  P N             T        Y              
LAGFTE2H DS    XL8                                                              
LAGFTE2  DS    CL4     16   34    4  A  U N             T        Y  100         
LAGFTE2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    16   42   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   60    1  A  P N             T        Y              
LAGPAREH DS    XL8                                                              
LAGPARE  DS    CL3     16   62    3  A  U N             T        Y  110         
LAGPAREX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   66    1  N  P N             T        Y              
LAGPTELH DS    XL8                                                              
LAGPTEL  DS    CL3     16   68    3  A  U N             T        Y  110         
LAGPTELX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   72    1  N  P N             T        Y              
LAGPTE2H DS    XL8                                                              
LAGPTE2  DS    CL4     16   74    4  A  U N             T        Y  110         
LAGPTE2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     17    2    9  A  P N             T        Y              
LAGTCODH DS    XL8                                                              
LAGTCOD  DS    CL2     17   20    2  A  U N             T        Y  115         
LAGTCODX DS    XL8                                                              
LAGTNAMH DS    XL8                                                              
LAGTNAM  DS    CL30    17   25   30  A  P N             T        Y              
LAGDAREH DS    XL8                                                              
LAGDARE  DS    CL14    18    2   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   20    2  A  P N             T        Y              
LAGDAG1H DS    XL8                                                              
LAGDAG1  DS    CL6     18   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   30    2  A  P N             T        Y              
LAGDAG2H DS    XL8                                                              
LAGDAG2  DS    CL6     18   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   40    2  A  P N             T        Y              
LAGDAG3H DS    XL8                                                              
LAGDAG3  DS    CL6     18   43    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   50    2  A  P N             T        Y              
LAGDAG4H DS    XL8                                                              
LAGDAG4  DS    CL6     18   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL23    19    2   23  A  P N             T        Y              
LAGATRDH DS    XL8                                                              
LAGATRD  DS    CL40    19   27   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    20    2   15  A  P N             T        Y              
LAGCMT1H DS    XL8                                                              
LAGCMT1  DS    CL60    20   20   60  A  U N             T        Y              
LAGCMT2H DS    XL8                                                              
LAGCMT2  DS    CL60    21   20   60  A  U N             T        Y              
LAGHAGQH DS    XL8                                                              
LAGHAGQ  DS    CL13    22    2   13  A  P N             T        Y              
LAGAGEQH DS    XL8                                                              
LAGAGEQ  DS    CL4     22   20    4  A  U N             T        Y  120         
LAGAGEQX DS    XL8                                                              
LAGHAGOH DS    XL8                                                              
LAGHAGO  DS    CL10    22   28   10  A  P N             T        Y              
LAGAGEOH DS    XL8                                                              
LAGAGEO  DS    CL2     22   40    2  A  U N             T        Y              
LAGHBYSH DS    XL8                                                              
LAGHBYS  DS    CL19    23    2   19  A  P N             T        Y              
LAGABYSH DS    XL8                                                              
LAGABYS  DS    CL1     23   24    1  A  U N             T        Y              
LAGHLOKH DS    XL8                                                              
LAGHLOK  DS    CL7     23   28    7  A  P Z             T        Y              
LAGDLOKH DS    XL8                                                              
LAGDLOK  DS    CL1     23   36    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24    2    8  A  P N             T        Y              
LAGOFC1H DS    XL8                                                              
LAGOFC1  DS    CL2     24   15    2  A  U N             T        Y              
LAGOFC2H DS    XL8                                                              
LAGOFC2  DS    CL2     24   20    2  A  U N             T        Y              
LAGOFC3H DS    XL8                                                              
LAGOFC3  DS    CL2     24   25    2  A  U N             T        Y              
LAGOFC4H DS    XL8                                                              
LAGOFC4  DS    CL2     24   30    2  A  U N             T        Y              
LAGOFC5H DS    XL8                                                              
LAGOFC5  DS    CL2     24   35    2  A  U N             T        Y              
LAGOFC6H DS    XL8                                                              
LAGOFC6  DS    CL2     24   40    2  A  U N             T        Y              
LAGHALCH DS    XL8                                                              
LAGHALC  DS    CL13    24   52   13  A  P N             T        Y              
LAGAGLCH DS    XL8                                                              
LAGAGLC  DS    CL8     24   70    8  A  P N             T        Y              
LAGLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LAGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1584 BYTES                            
