*          DATA SET RELFMD7D   AT LEVEL 004 AS OF 04/11/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804D7D      DATE 04/11/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P N             T        Y              
SEMEM1H  DS    XL8                                                              
SEMEM1   DS    CL65     7   13   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
SEMEM2H  DS    XL8                                                              
SEMEM2   DS    CL65     8   13   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
SEMEM3H  DS    XL8                                                              
SEMEM3   DS    CL65     9   13   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
SEMEM4H  DS    XL8                                                              
SEMEM4   DS    CL65    10   13   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P Z             T        Y              
SEMEM5H  DS    XL8                                                              
SEMEM5   DS    CL65    11   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     12    2    9  A  P Z             T        Y              
SEMEM6H  DS    XL8                                                              
SEMEM6   DS    CL65    12   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P Z             T        Y              
SEMEM7H  DS    XL8                                                              
SEMEM7   DS    CL65    13   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P Z             T        Y              
SEMEM8H  DS    XL8                                                              
SEMEM8   DS    CL65    14   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  P Z             T        Y              
SEMEM9H  DS    XL8                                                              
SEMEM9   DS    CL65    15   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     16    2    9  A  P Z             T        Y              
SEMEM10H DS    XL8                                                              
SEMEM10  DS    CL65    16   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     17    2    9  A  P Z             T        Y              
SEMEM11H DS    XL8                                                              
SEMEM11  DS    CL65    17   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     18    2    9  A  P Z             T        Y              
SEMEM12H DS    XL8                                                              
SEMEM12  DS    CL65    18   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     19    2    9  A  P Z             T        Y              
SEMEM13H DS    XL8                                                              
SEMEM13  DS    CL65    19   13   65  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     20    2    9  A  P Z             T        Y              
SEMEM14H DS    XL8                                                              
SEMEM14  DS    CL65    20   13   65  A  U Z             T        Y              
         DS    XL8                                                              
         DS    CL9     21    2    9  A  P Z             T        Y              
SEMEM15H DS    XL8                                                              
SEMEM15  DS    CL65    21   13   65  A  U Z             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  P Z             T        Y              
SEMEM16H DS    XL8                                                              
SEMEM16  DS    CL65    22   13   65  A  U Z             T        Y              
SEMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1448 BYTES                            
