*          DATA SET RELFMD9D   AT LEVEL 028 AS OF 09/20/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804D9D      DATE 09/20/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL29     7    5   29  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
PLGOFFCH DS    XL8                                                              
PLGOFFC  DS    CL2      8    9    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   15   12  A  P N             T        Y              
PLGCODTH DS    XL8                                                              
PLGCODT  DS    CL8      8   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27     8   39   27  A  P N             T        Y              
PLGORIDH DS    XL8                                                              
PLGORID  DS    CL1      8   68    1  A  U N             T        Y              
PLGLABLH DS    XL8                                                              
PLGLABL  DS    CL30     9    5   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     9   43   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    2    2  A  P N             T        Y              
PLGSTA1H DS    XL8                                                              
PLGSTA1  DS    CL5     10    5    5  A  U N             T        Y              
PLGRES1H DS    XL8                                                              
PLGRES1  DS    CL26    10   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   40    2  A  P N             T        Y              
PLGSTA2H DS    XL8                                                              
PLGSTA2  DS    CL5     10   43    5  A  U N             T        Y              
PLGRES2H DS    XL8                                                              
PLGRES2  DS    CL26    10   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  P N             T        Y              
PLGSTA3H DS    XL8                                                              
PLGSTA3  DS    CL5     11    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    11   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    11   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    12   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    12   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    13   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    13   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    14   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    14   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    15   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    15   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    16   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    16   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    17   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    17   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    18   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    18   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    19   12   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   40    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   43    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    19   50   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL37    21    5   37  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    22    2   25  A  P N             T        Y              
PLGSTAFH DS    XL8                                                              
PLGSTAF  DS    CL5     22   30    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   39   13  A  P N             T        Y              
PLGOFILH DS    XL8                                                              
PLGOFIL  DS    CL2     22   60    2  A  U N             T        Y              
PLGSHDRH DS    XL8                                                              
PLGSHDR  DS    CL16    23    2   16  A  P N             T        Y              
PLGSDDSH DS    XL8                                                              
PLGSDDS  DS    CL1     23   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    23   39   16  A  P N             T        Y              
PLGDOWNH DS    XL8                                                              
PLGDOWN  DS    CL1     23   60    1  A  U N             T        Y              
PLGLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PLGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1552 BYTES                            
