*          DATA SET RELFMD4D   AT LEVEL 004 AS OF 01/09/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804D4D      DATE 01/09/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL34     7    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   16   13  A  P N             T        Y              
URLEDTCH DS    XL8                                                              
URLEDTC  DS    CL10     9   31   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   44    8  A  P N             T        Y              
URLELUIH DS    XL8                                                              
URLELUI  DS    CL8      9   54    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   64   12  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     10    2    1  A  P N             T        Y              
URLEZPNH DS    XL8                                                              
URLEZPN  DS    CL75    10    4   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   16   13  A  P N             T        Y              
URLPDTCH DS    XL8                                                              
URLPDTC  DS    CL10    11   31   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   44    8  A  P N             T        Y              
URLPLUIH DS    XL8                                                              
URLPLUI  DS    CL8     11   54    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
URLPRPNH DS    XL8                                                              
URLPRPN  DS    CL75    12    4   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   16   13  A  P N             T        Y              
URL1DTCH DS    XL8                                                              
URL1DTC  DS    CL10    13   31   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   44    8  A  P N             T        Y              
URL1LUIH DS    XL8                                                              
URL1LUI  DS    CL8     13   54    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
URLUNU1H DS    XL8                                                              
URLUNU1  DS    CL75    14    4   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   16   13  A  P N             T        Y              
URL2DTCH DS    XL8                                                              
URL2DTC  DS    CL10    15   31   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   44    8  A  P N             T        Y              
URL2LUIH DS    XL8                                                              
URL2LUI  DS    CL8     15   54    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  P N             T        Y              
URLUNU2H DS    XL8                                                              
URLUNU2  DS    CL75    16    4   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   16   13  A  P N             T        Y              
URL3DTCH DS    XL8                                                              
URL3DTC  DS    CL10    17   31   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   44    8  A  P N             T        Y              
URL3LUIH DS    XL8                                                              
URL3LUI  DS    CL8     17   54    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
URLUNU3H DS    XL8                                                              
URLUNU3  DS    CL75    18    4   75  L  U N             T        Y              
URLLSTH  DS    XL8                                                              
URLLST   DS    CL1     24   79    1  A  U N             T        Y              
URLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
URLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 976  BYTES                            
