*          DATA SET RELFMD5D   AT LEVEL 027 AS OF 01/15/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804D5D      DATE 01/15/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A  P N             T        Y              
LASOLDH  DS    CL8                                                              
LASOLD   DS    CL3      7   13    3  A  P N             T        Y              
LASOLNH  DS    CL8                                                              
LASOLN   DS    CL20     7   18   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      7   44    9  A  P N             T        Y              
LASNEWH  DS    CL8                                                              
LASNEW   DS    CL3      7   55    3  A  U N             T        Y              
LASNENH  DS    CL8                                                              
LASNEN   DS    CL20     7   60   20  A  P N             T        Y              
LASNUMH  DS    CL8                                                              
LASNUM   DS    CL4      9    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     9    7   16  A  P N             T        Y              
LASBEGH  DS    CL8                                                              
LASBEG   DS    CL79    11    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
LASENDH  DS    CL8                                                              
LASEND   DS    CL72    24    2   72  A  P N             T        Y              
LASMORH  DS    CL8                                                              
LASMOR   DS    CL6     24   75    6  A  P N             T        Y              
LASLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1392 BYTES                            
