*          DATA SET RELFMD3D   AT LEVEL 001 AS OF 07/21/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804D3D      DATE 07/21/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SMOLAB1H DS    XL8                                                              
SMOLAB1  DS    CL38     7    2   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   41    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9    2    2  A  P N             T        Y              
SMOOFF1H DS    XL8                                                              
SMOOFF1  DS    CL2      9    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9    9    2  A  P N             T        Y              
SMOOFF2H DS    XL8                                                              
SMOOFF2  DS    CL2      9   12    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   16    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   19    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   23    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   30    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   33    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   37    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   44    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   51    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   54    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   58    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   61    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   65    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   68    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    9    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   12    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   16    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   19    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   23    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   30    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   33    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   37    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   44    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   51    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   54    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   58    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   61    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   65    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   68    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    9    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   12    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   16    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   19    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   23    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   30    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   33    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   37    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   44    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   51    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   54    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   58    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   61    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   65    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   68    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    9    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   12    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   16    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   19    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   23    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   30    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   33    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   37    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   44    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   47    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   51    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   54    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   58    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   61    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   65    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   68    2  A  U N             T        Y              
SMOLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SMOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 864  BYTES                            
