*          DATA SET RELFMF7D   AT LEVEL 003 AS OF 10/24/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F7D      DATE 10/24/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL16     7    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     7   19   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     8    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     8   19   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   19    2  A  U N             T        Y              
LADCATCH DS    XL8                                                              
LADCATC  DS    CL30     9   22   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   19    1  A  U N             T        Y              
LADHAVQH DS    XL8                                                              
LADHAVQ  DS    CL16    11    2   16  A  P N             T        Y              
LADAVEQH DS    XL8                                                              
LADAVEQ  DS    CL5     11   19    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    11   40   16  A  P Z             T        Y              
LADADDDH DS    XL8                                                              
LADADDD  DS    CL1     11   58    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL15    11   61   15  A  P N             T        Y              
LADADDUH DS    XL8                                                              
LADADDU  DS    CL1     11   78    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
LADOFC1H DS    XL8                                                              
LADOFC1  DS    CL2     12   15    2  A  U N             T        Y              
LADOFC2H DS    XL8                                                              
LADOFC2  DS    CL2     12   20    2  A  U N             T        Y              
LADOFC3H DS    XL8                                                              
LADOFC3  DS    CL2     12   25    2  A  U N             T        Y              
LADOFC4H DS    XL8                                                              
LADOFC4  DS    CL2     12   30    2  A  U N             T        Y              
LADOFC5H DS    XL8                                                              
LADOFC5  DS    CL2     12   35    2  A  U N             T        Y              
LADOFC6H DS    XL8                                                              
LADOFC6  DS    CL2     12   40    2  A  U N             T        Y              
LADHALCH DS    XL8                                                              
LADHALC  DS    CL13    12   52   13  A  P N             T        Y              
LADAVLCH DS    XL8                                                              
LADAVLC  DS    CL8     12   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   17    4  A  P N             T        Y              
LADCTR1H DS    XL8                                                              
LADCTR1  DS    CL1     19   22    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   26    3  A  P N             T        Y              
LADOFR1H DS    XL8                                                              
LADOFR1  DS    CL2     19   30    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   55    4  A  P N             T        Y              
LADCTR2H DS    XL8                                                              
LADCTR2  DS    CL1     19   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   64    3  A  P N             T        Y              
LADOFR2H DS    XL8                                                              
LADOFR2  DS    CL2     19   68    2  A  U N             T        Y              
LADADD1H DS    XL8                                                              
LADADD1  DS    CL34    20    2   34  A  U N             T        Y              
LADADDAH DS    XL8                                                              
LADADDA  DS    CL34    20   40   34  A  U N             T        Y              
LADADD2H DS    XL8                                                              
LADADD2  DS    CL34    21    2   34  A  U N             T        Y              
LADADDBH DS    XL8                                                              
LADADDB  DS    CL34    21   40   34  A  U N             T        Y              
LADADD3H DS    XL8                                                              
LADADD3  DS    CL36    22    2   36  A  U N             T        Y              
LADADDCH DS    XL8                                                              
LADADDC  DS    CL36    22   40   36  A  U N             T        Y              
LADLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
