*          DATA SET RELFMD0D   AT LEVEL 003 AS OF 07/02/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804D0D      DATE 07/02/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     7    6   11  A  P N             T        Y              
SDTCDTH  DS    XL8                                                              
SDTCDT   DS    CL6      7   20    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    6   11  A  P N             T        Y              
SDTLDTH  DS    XL8                                                              
SDTLDT   DS    CL8      8   20    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   36    3  A  P N             T        Y              
SDTPGMH  DS    XL8                                                              
SDTPGM   DS    CL20     8   40   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   64    5  A  P N             T        Y              
SDTLUIH  DS    XL8                                                              
SDTLUI   DS    CL8      8   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    6   10  A  P N             T        Y              
SDTJDTH  DS    XL8                                                              
SDTJDT   DS    CL8     10   20    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   36   12  A  P N             T        Y              
SDTRJDH  DS    XL8                                                              
SDTRJD   DS    CL8     10   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   64   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    6   11  A  P N             T        Y              
SDTDDTH  DS    XL8                                                              
SDTDDT   DS    CL8     11   20    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   36   12  A  P N             T        Y              
SDTRLDH  DS    XL8                                                              
SDTRLD   DS    CL8     11   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   64   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12    6   13  A  P N             T        Y              
SDTCTRH  DS    XL8                                                              
SDTCTR   DS    CL8     12   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    6   12  A  P N             T        Y              
SDTCREH  DS    XL8                                                              
SDTCRE   DS    CL8     13   20    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   36   12  A  P N             T        Y              
SDTLADH  DS    XL8                                                              
SDTLAD   DS    CL8     13   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    15    6   23  A  P N             T        Y              
SDTHISH  DS    XL8                                                              
SDTHIS   DS    CL10    15   36   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    15   52   18  A  P N             T        Y              
SDTINVH  DS    XL8                                                              
SDTINV   DS    CL1     15   72    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17    6   10  A  P N             T        Y              
SDTIBLH  DS    XL8                                                              
SDTIBL   DS    CL10    17   18   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    17   35   21  A  P N             T        Y              
SDTIBLTH DS    XL8                                                              
SDTIBLT  DS    CL10    17   58   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    6    8  A  P N             T        Y              
SDTPID1H DS    XL8                                                              
SDTPID1  DS    CL8     19   16    8  A  U N             T        Y              
SDTPID2H DS    XL8                                                              
SDTPID2  DS    CL8     19   26    8  A  U N             T        Y              
SDTPID3H DS    XL8                                                              
SDTPID3  DS    CL8     19   36    8  A  U N             T        Y              
SDTPID4H DS    XL8                                                              
SDTPID4  DS    CL8     19   46    8  A  U N             T        Y              
SDTPID5H DS    XL8                                                              
SDTPID5  DS    CL8     19   56    8  A  U N             T        Y              
SDTPID6H DS    XL8                                                              
SDTPID6  DS    CL8     19   66    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    20    6   14  A  P N             T        Y              
SDTVENDH DS    XL8                                                              
SDTVEND  DS    CL8     20   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   36    8  A  P N             T        Y              
SDTVLUIH DS    XL8                                                              
SDTVLUI  DS    CL8     20   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   64    5  A  P N             T        Y              
SDTVDATH DS    XL8                                                              
SDTVDAT  DS    CL8     20   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    21    6   14  A  P N             T        Y              
SDTSOPTH DS    XL8                                                              
SDTSOPT  DS    CL8     21   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   36    8  A  P N             T        Y              
SDTALIAH DS    XL8                                                              
SDTALIA  DS    CL12    21   52   12  A  U N             T        Y              
SDTMQUAH DS    XL8                                                              
SDTMQUA  DS    CL14    22    6   14  A  P N             T        Y              
SDTMQUEH DS    XL8                                                              
SDTMQUE  DS    CL16    22   22   16  A  U N             T        Y              
SDTMQUBH DS    XL8                                                              
SDTMQUB  DS    CL14    22   40   14  A  P N             T        Y              
SDTMQSPH DS    XL8                                                              
SDTMQSP  DS    CL20    22   56   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23    6   17  A  P N             T        Y              
SDTAOPTH DS    XL8                                                              
SDTAOPT  DS    CL28    23   25   28  A  U N             T        Y              
SDTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SDTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1040 BYTES                            
