*          DATA SET RELFMF9D   AT LEVEL 002 AS OF 12/23/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F9D      DATE 12/23/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     7   14   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     7   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      7   53    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     7   56   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      8   14    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   40    8  A  P N             T        Y              
LF9RCODH DS    XL8                                                              
LF9RCOD  DS    CL2      8   53    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   57    6  A  P N             T        Y              
LF9MINUH DS    XL8                                                              
LF9MINU  DS    CL2      8   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   14   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   14    2  A  U N             T        Y              
LF9MOSPH DS    XL8                                                              
LF9MOSP  DS    CL10    10   40   10  A  P Z             T        Y              
LF9MONMH DS    XL8                                                              
LF9MONM  DS    CL20    10   53   20  L  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   14   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   40    9  A  P N             T        Y              
LF9FPRFH DS    XL8                                                              
LF9FPRF  DS    CL2     11   53    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
LF9MAILH DS    XL8                                                              
LF9MAIL  DS    CL48    12   14   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
LF9SASTH DS    XL8                                                              
LF9SAST  DS    CL20    13   14   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    13   40   21  A  P N             T        Y              
LF9SONLH DS    XL8                                                              
LF9SONL  DS    CL2     13   64    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
LF9SMALH DS    XL8                                                              
LF9SMAL  DS    CL48    14   14   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
LF9LEAVH DS    XL8                                                              
LF9LEAV  DS    CL12    15   14   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
LF9MGRH  DS    XL8                                                              
LF9MGR   DS    CL2     16   14    2  A  U N             T        Y              
LF9HSPQH DS    XL8                                                              
LF9HSPQ  DS    CL11    17    2   11  A  P N             T        Y              
LF9SPEQH DS    XL8                                                              
LF9SPEQ  DS    CL8     17   14    8  A  U N             T        Y              
LF9HSLCH DS    XL8                                                              
LF9HSLC  DS    CL11    18    2   11  A  P N             T        Y              
LF9SPLCH DS    XL8                                                              
LF9SPLC  DS    CL8     18   14    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19    20    2   19  A  P N             T        Y              
LF9EXLFH DS    XL8                                                              
LF9EXLF  DS    CL6     20   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   31    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   39    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   47    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   55    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   31    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   39    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   47    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   55    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   31    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   39    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   47    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   55    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   31    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   39    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   47    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   55    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   31    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   39    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   47    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   55    6  A  U N             T        Y              
LF9EXLLH DS    XL8                                                              
LF9EXLL  DS    CL6     24   63    6  A  U N             T        Y              
LF9LAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LF9WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1176 BYTES                            
