*          DATA SET RELFMF8D   AT LEVEL 002 AS OF 12/22/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F8D      DATE 12/22/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL15     7    2   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30     7   20   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   20    1  A  U N             T        Y              
LFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 80   BYTES                            
