*          DATA SET RELFMCAD   AT LEVEL 001 AS OF 08/04/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804CAD      DATE 08/04/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P N             T        Y              
SALAL1H  DS    XL8                                                              
SALAL1   DS    CL10     7   13   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
SALAL2H  DS    XL8                                                              
SALAL2   DS    CL10     8   13   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
SALAL3H  DS    XL8                                                              
SALAL3   DS    CL10     9   13   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
SALAL4H  DS    XL8                                                              
SALAL4   DS    CL10    10   13   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P N             T        Y              
SALAL5H  DS    XL8                                                              
SALAL5   DS    CL10    11   13   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    14    2   19  A  P N             T        Y              
SALADTH  DS    XL8                                                              
SALADT   DS    CL8     14   22    8  A  P N             T        Y              
SALLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SALWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
