*          DATA SET RELFMDAD   AT LEVEL 002 AS OF 11/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804DAD      DATE 11/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   22    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   42    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    9    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   22    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   29    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   42    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   49    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   62    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   69    6  A  P N             T        Y              
KTZCDE1H DS    CL8                                                              
KTZCDE1  DS    CL5      9    2    5  A  U N             T        Y   10         
KTZCDE1X DS    CL8                                                              
KTZCPY1H DS    CL8                                                              
KTZCPY1  DS    CL5      9   10    5  A  U N             T        Y   20         
KTZCPY1X DS    CL8                                                              
KTZCDE2H DS    CL8                                                              
KTZCDE2  DS    CL5      9   22    5  A  U N             T        Y   10         
KTZCDE2X DS    CL8                                                              
KTZCPY2H DS    CL8                                                              
KTZCPY2  DS    CL5      9   30    5  A  U N             T        Y   20         
KTZCPY2X DS    CL8                                                              
KTZCDE3H DS    CL8                                                              
KTZCDE3  DS    CL5      9   42    5  A  U N             T        Y   10         
KTZCDE3X DS    CL8                                                              
KTZCPY3H DS    CL8                                                              
KTZCPY3  DS    CL5      9   50    5  A  U N             T        Y   20         
KTZCPY3X DS    CL8                                                              
KTZCDE4H DS    CL8                                                              
KTZCDE4  DS    CL5      9   62    5  A  U N             T        Y   10         
KTZCDE4X DS    CL8                                                              
KTZCPY4H DS    CL8                                                              
KTZCPY4  DS    CL5      9   70    5  A  U N             T        Y   20         
KTZCPY4X DS    CL8                                                              
KTZCDE5H DS    CL8                                                              
KTZCDE5  DS    CL5     10    2    5  A  U N             T        Y   10         
KTZCDE5X DS    CL8                                                              
KTZCPY6H DS    CL8                                                              
KTZCPY6  DS    CL5     10   10    5  A  U N             T        Y   20         
KTZCPY6X DS    CL8                                                              
KTZCDE7H DS    CL8                                                              
KTZCDE7  DS    CL5     10   22    5  A  U N             T        Y   10         
KTZCDE7X DS    CL8                                                              
KTZCPY8H DS    CL8                                                              
KTZCPY8  DS    CL5     10   30    5  A  U N             T        Y   20         
KTZCPY8X DS    CL8                                                              
KTZCDE9H DS    CL8                                                              
KTZCDE9  DS    CL5     10   42    5  A  U N             T        Y   10         
KTZCDE9X DS    CL8                                                              
KTZCPY9H DS    CL8                                                              
KTZCPY9  DS    CL5     10   50    5  A  U N             T        Y   20         
KTZCPY9X DS    CL8                                                              
KTZCDELH DS    CL8                                                              
KTZCDEL  DS    CL5     10   62    5  A  U N             T        Y   10         
KTZCDELX DS    CL8                                                              
KTZCPYLH DS    CL8                                                              
KTZCPYL  DS    CL5     10   70    5  A  U N             T        Y   20         
KTZCPYLX DS    CL8                                                              
KTZLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
KTZWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 496  BYTES                            
