*          DATA SET RELFMF6AD  AT LEVEL 001 AS OF 02/11/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F6D      DATE 02/11/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
PRDPNAMH DS    CL8                                                              
PRDPNAM  DS    CL20     7   22   20  A  U N             T        Y   10         
PRDPNAMX DS    CL8                                                              
PRDPCNTH DS    CL8                                                              
PRDPCNT  DS    CL4      7   72    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  A  P N             T        Y              
PRDPCATH DS    CL8                                                              
PRDPCAT  DS    CL2      8   22    2  A  U N             T        Y   20         
PRDPCATX DS    CL8                                                              
PRDPCEXH DS    CL8                                                              
PRDPCEX  DS    CL30     8   28   30  A  P N             T        Y              
PRDPCFCH DS    CL8                                                              
PRDPCFC  DS    CL18     8   60   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10    2   15  A  P N             T        Y              
PRDSPCH  DS    CL8                                                              
PRDSPC   DS    CL3     10   26    3  A  U N             T        Y   61         
PRDSPCX  DS    CL8                                                              
PRDSPCNH DS    CL8                                                              
PRDSPCN  DS    CL20    10   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   11   10  A  P N             T        Y              
PRDSP1H  DS    CL8                                                              
PRDSP1   DS    CL3     11   26    3  A  U N             T        Y   62         
PRDSP1X  DS    CL8                                                              
PRDSP1NH DS    CL8                                                              
PRDSP1N  DS    CL20    11   30   20  A  P N             T        Y              
PRDSP2H  DS    CL8                                                              
PRDSP2   DS    CL3     11   52    3  A  U N             T        Y   62         
PRDSP2X  DS    CL8                                                              
PRDSP2NH DS    CL8                                                              
PRDSP2N  DS    CL20    11   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   11   13  A  P Z             T        Y              
PRDSPS1H DS    CL8                                                              
PRDSPS1  DS    CL3     12   26    3  A  P Z             T        Y   63         
PRDSPS1X DS    CL8                                                              
PRDSPS2H DS    CL8                                                              
PRDSPS2  DS    CL3     12   52    3  A  P Z             T        Y   63         
PRDSPS2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   11    8  A  P N             T        Y              
PRDSPEH  DS    CL8                                                              
PRDSPE   DS    CL3     13   26    3  A  U N             T        Y   64         
PRDSPEX  DS    CL8                                                              
PRDSPENH DS    CL8                                                              
PRDSPEN  DS    CL20    13   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    15    2   23  A  P N             T        Y              
PRDNCNOH DS    CL8                                                              
PRDNCNO  DS    CL8     15   26    8  A  U N             T        Y   30         
PRDNCNOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15   36   11  A  P N             T        Y              
PRDNDESH DS    CL8                                                              
PRDNDES  DS    CL25    15   50   25  A  U N             T        Y   40         
PRDNDESX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   10   12  A  P N             T        Y              
PRDPPERH DS    CL8                                                              
PRDPPER  DS    CL3     16   26    3  A  U N             T        Y   50         
PRDPPERX DS    CL8                                                              
PRDPPEXH DS    CL8                                                              
PRDPPEX  DS    CL20    16   31   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   79    1  A  U N             T        Y              
PRDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 672  BYTES                            
