*          DATA SET RELFMFAD   AT LEVEL 003 AS OF 07/11/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804FAD      DATE 07/11/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL15     7    2   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     7   18   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15     8    2   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   18   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   18    1  A   U    N         T        Y              
LFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 113  BYTES                            
