*          DATA SET RELFMFESD  AT LEVEL 003 AS OF 02/20/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804FED      DATE 02/20/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
RPMNMH   DS    CL8                                                              
RPMNM    DS    CL33     7   14   33  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     7   48   10  A  P N             T        Y              
RPMSNH   DS    CL8                                                              
RPMSN    DS    CL20     7   59   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
RPMADH   DS    CL8                                                              
RPMAD    DS    CL33     8   14   33  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   48    6  A  P N             T        Y              
RPMABH   DS    CL8                                                              
RPMAB    DS    CL7      8   59    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
RPMSPLMH DS    CL8                                                              
RPMSPLM  DS    CL7      9   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     9   24   15  A  P N             T        Y              
RPMEFFDH DS    CL8                                                              
RPMEFFD  DS    CL8      9   41    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   52   12  A  P N             T        Y              
RPMFISMH DS    CL8                                                              
RPMFISM  DS    CL4      9   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
RPMPROFH DS    CL8                                                              
RPMPROF  DS    CL1     11   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   16    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   18    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   22    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   28    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   32    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   34    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   36    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   40    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   42    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   48    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   50    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   52    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   54    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   60    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   62    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   64    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   66    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   70    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
RPMSPAGH DS    CL8                                                              
RPMSPAG  DS    CL2     13   18    2  A  U N             T        Y              
RPMSPAXH DS    CL8                                                              
RPMSPAX  DS    CL20    13   22   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    13   44   24  A  P N             T        Y              
RPMSPCNH DS    CL8                                                              
RPMSPCN  DS    CL8     13   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   11    5  A  P N             T        Y              
RPMSPMH  DS    CL8                                                              
RPMSPM   DS    CL1     14   18    1  A  U N             T        Y              
RPMSPMXH DS    CL8                                                              
RPMSPMX  DS    CL10    14   22   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    15   44   13  A  P N             T        Y              
RPMLOGOH DS    CL8                                                              
RPMLOGO  DS    CL12    15   58   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
RPMPARH  DS    CL8                                                              
RPMPAR   DS    CL2     16   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   24   10  A  P N             T        Y              
RPMMRPH  DS    CL8                                                              
RPMMRP   DS    CL2     16   36    2  A  U N             T        Y              
RPMMRPXH DS    CL8                                                              
RPMMRPX  DS    CL20    16   40   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    17    2   15  A  P N             T        Y              
RPMSRP1H DS    CL8                                                              
RPMSRP1  DS    CL2     17   18    2  A  U N             T        Y              
RPMSRP2H DS    CL8                                                              
RPMSRP2  DS    CL2     17   22    2  A  U N             T        Y              
RPMSRP3H DS    CL8                                                              
RPMSRP3  DS    CL2     17   26    2  A  U N             T        Y              
RPMSPR4H DS    CL8                                                              
RPMSPR4  DS    CL2     17   30    2  A  U N             T        Y              
RPMSPR5H DS    CL8                                                              
RPMSPR5  DS    CL2     17   34    2  A  U N             T        Y              
RPMSPR6H DS    CL8                                                              
RPMSPR6  DS    CL2     17   38    2  A  U N             T        Y              
RPMSPR7H DS    CL8                                                              
RPMSPR7  DS    CL2     17   42    2  A  U N             T        Y              
RPMSPR8H DS    CL8                                                              
RPMSPR8  DS    CL2     17   46    2  A  U N             T        Y              
RPMSPR9H DS    CL8                                                              
RPMSPR9  DS    CL2     17   50    2  A  U N             T        Y              
RPMSPRAH DS    CL8                                                              
RPMSPRA  DS    CL2     17   54    2  A  U N             T        Y              
RPMSPRBH DS    CL8                                                              
RPMSPRB  DS    CL2     17   58    2  A  U N             T        Y              
RPMSPRCH DS    CL8                                                              
RPMSPRC  DS    CL2     17   62    2  A  U N             T        Y              
RPMSPRDH DS    CL8                                                              
RPMSPRD  DS    CL2     17   66    2  A  U N             T        Y              
RPMSPREH DS    CL8                                                              
RPMSPRE  DS    CL2     17   70    2  A  U N             T        Y              
RPMSPRFH DS    CL8                                                              
RPMSPRF  DS    CL2     17   74    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    19    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
RPMAAGYH DS    CL8                                                              
RPMAAGY  DS    CL1     20   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   17   10  A  P N             T        Y              
RPMAADVH DS    CL8                                                              
RPMAADV  DS    CL1     20   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   32    7  A  P N             T        Y              
RPMAPRDH DS    CL8                                                              
RPMAPRD  DS    CL1     20   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   47    5  A  P N             T        Y              
RPMACLSH DS    CL8                                                              
RPMACLS  DS    CL1     20   59    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   62    8  A  P N             T        Y              
RPMACATH DS    CL8                                                              
RPMACAT  DS    CL1     20   74    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21    2   10  A  P N             T        Y              
RPMAPPH  DS    CL8                                                              
RPMAPP   DS    CL1     21   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   17   10  A  P N             T        Y              
RPMAGRPH DS    CL8                                                              
RPMAGRP  DS    CL1     21   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   32    9  A  P N             T        Y              
RPMATEMH DS    CL8                                                              
RPMATEM  DS    CL1     21   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   47    5  A  P N             T        Y              
RPMAOWNH DS    CL8                                                              
RPMAOWN  DS    CL1     21   59    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   62    6  A  P N             T        Y              
RPMAMKTH DS    CL8                                                              
RPMAMKT  DS    CL1     21   74    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
RPMADSLH DS    CL8                                                              
RPMADSL  DS    CL1     22   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   17    6  A  P N             T        Y              
RPMADTYH DS    CL8                                                              
RPMADTY  DS    CL1     22   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   32    9  A  P N             T        Y              
RPMASALH DS    CL8                                                              
RPMASAL  DS    CL1     22   44    1  A  U N             T        Y              
RPMLSTH  DS    CL8                                                              
RPMLST   DS    CL1     24   78    1  A  U N             T        Y              
RPMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RPMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1392 BYTES                            
