*          DATA SET RELFMEBD   AT LEVEL 002 AS OF 10/11/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804EBD      DATE 10/11/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
RATMRKTH DS    CL8                                                              
RATMRKT  DS    CL25     5   45   25   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6      7    2    6   A    P    N         T         Y           
RATSRCH  DS    CL8                                                              
RATSRC   DS    CL4      7   13    4   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL4      8    2    4   A    P    N         T         Y           
RATBOOKH DS    CL8                                                              
RATBOOK  DS    CL10     8   13   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5      8   35    5   A    P    N         T         Y           
RATFRCH  DS    CL8                                                              
RATFRC   DS    CL2      8   42    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9    2    5   A    P    N         T         Y           
RATDEMOH DS    CL8                                                              
RATDEMO  DS    CL60     9   13   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     11    2    4   A    P    N         T         Y           
RATTEXTH DS    CL8                                                              
RATTEXT  DS    CL60    11   13   60   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL60    12   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    13   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    14   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    15   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    16   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    17   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    18   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    19   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    20   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    21   13   60   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL60    22   13   60   A    U    N         T         N           
RATTABH  DS    CL8                                                              
RATTAB   DS    CL1     23   13    1   A    U    N         T         Y           
RATLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1033 BYTES                            
