*          DATA SET RELFMEAD   AT LEVEL 002 AS OF 04/10/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804EAD      DATE 04/10/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DEMDESH  DS    CL8                                                              
DEMDES   DS    CL60     7   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
DEMDEMH  DS    CL8                                                              
DEMDEM   DS    CL60     8   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60     9   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    10   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    11   16   60  A  U N             T        Y              
DEMTABH  DS    CL8                                                              
DEMTAB   DS    CL1     12   16    1  A  U N             T        Y              
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 384  BYTES                            
