*          DATA SET RELFME4D   AT LEVEL 009 AS OF 01/27/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804E4D      DATE 01/27/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL24     7   28   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70     9    9   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    10    9   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    1    7  A   P    N         T        Y              
CMTLN1H  DS    CL8                                                              
CMTLN1   DS    CL70    11    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    12    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    13    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    14    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    15    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    16    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    17    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    18    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    19    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    20    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    21    9   70  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22    1    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    22    9   70  A   U    N         T        Y              
CMTLSTH  DS    CL8                                                              
CMTLST   DS    CL1     23   79    1  A   U    N         T        Y              
CMTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CMTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1320 BYTES                            
