*          DATA SET RELFMD6D   AT LEVEL 004 AS OF 08/03/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804D6D      DATE 08/03/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL10     7   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   33    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
ACLSJANH DS    XL8                                                              
ACLSJAN  DS    CL10     8   14   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   14   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   14   10  A  P N             T        Y              
ACLDECH  DS    XL8                                                              
ACLDEC   DS    CL10    19   33   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   52   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
ACLLOCKH DS    XL8                                                              
ACLLOCK  DS    CL1     20   15    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    21    6   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   46   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL39    22    6   39  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL26    22   45   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40    23    6   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    23   46   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   71    1  A  U N             T        Y              
ACLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ACLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1096 BYTES                            
