*          DATA SET RELFMECD   AT LEVEL 003 AS OF 07/11/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804ECD      DATE 07/11/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MATMRKTH DS    CL8                                                              
MATMRKT  DS    CL25     5   45   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
MATTOBKH DS    CL8                                                              
MATTOBK  DS    CL11     7   13   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7   29    4  A   P    N         T        Y              
MATTYPEH DS    CL8                                                              
MATTYPE  DS    CL11     7   34   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      7   50    9  A   P    N         T        Y              
MATFRBKH DS    CL8                                                              
MATFRBK  DS    CL10     7   61   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9   19   11  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL26     9   46   26  A   P    N         T        Y              
MATINVH  DS    CL8                                                              
MATINV   DS    CL43    11    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    11   46   17  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL15    11   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    12    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    12   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    12   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    13    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    13   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    13   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    14    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    14   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    14   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    15    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    15   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    15   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    16    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    16   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    16   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    17    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    17   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    17   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    18    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    18   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    18   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    19    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    19   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    19   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    20    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    20   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    20   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    21    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    21   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    21   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    22    2   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    22   46   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    22   65   15  A   P    N         T        Y              
MATTABH  DS    CL8                                                              
MATTAB   DS    CL1     23    2    1  A   U    N         T        Y              
MATLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1403 BYTES                            
