*          DATA SET RELFMF5BX  AT LEVEL 004 AS OF 12/19/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804F5D      DATE 12/19/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
LAGAGYSH DS    CL8                                                              
LAGAGYS  DS    CL20     7   20   20  A  U N             T        Y   10         
LAGAGYSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
LAGAGYNH DS    CL8                                                              
LAGAGYN  DS    CL33     8   20   33  A  U N             T        Y   20         
LAGAGYNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     9    2   14  A  P N             T        Y              
LAGAGY1H DS    CL8                                                              
LAGAGY1  DS    CL34     9   20   34  A  U N             T        Y   30         
LAGAGY1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
LAGAGY2H DS    CL8                                                              
LAGAGY2  DS    CL34    10   20   34  A  U N             T        Y   30         
LAGAGY2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11    2    4  A  P N             T        Y              
LAGAGYIH DS    CL8                                                              
LAGAGYI  DS    CL20    11   20   20  A  U N             T        Y   30         
LAGAGYIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
LAGAGYTH DS    CL8                                                              
LAGAGYT  DS    CL2     12   20    2  A  U N             T        Y   50         
LAGAGYTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   30    8  A  P N             T        Y              
LAGAGYZH DS    CL8                                                              
LAGAGYZ  DS    CL10    12   40   10  A  U N             T        Y   60         
LAGAGYZX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
LAGAGYPH DS    CL8                                                              
LAGAGYP  DS    CL10    13   20   10  A  U N             T        Y   70         
LAGAGYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
LAGAGYCH DS    CL8                                                              
LAGAGYC  DS    CL1     14   20    1  A  U N             T        Y   80         
LAGAGYCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    14   25   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
LAGAGYLH DS    CL8                                                              
LAGAGYL  DS    CL2     15   20    2  A  U N             T        Y   90         
LAGAGYLX DS    CL8                                                              
LAGAGYRH DS    CL8                                                              
LAGAGYR  DS    CL50    15   25   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   20    1  A  P N             T        Y              
LAGFAREH DS    CL8                                                              
LAGFARE  DS    CL3     16   22    3  A  U N             T        Y  100         
LAGFAREX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   26    1  N  P N             T        Y              
LAGFTELH DS    CL8                                                              
LAGFTEL  DS    CL3     16   28    3  A  U N             T        Y  100         
LAGFTELX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   32    1  N  P N             T        Y              
LAGFTE2H DS    CL8                                                              
LAGFTE2  DS    CL4     16   34    4  A  U N             T        Y  100         
LAGFTE2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   42   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   60    1  A  P N             T        Y              
LAGPAREH DS    CL8                                                              
LAGPARE  DS    CL3     16   62    3  A  U N             T        Y  110         
LAGPAREX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   66    1  N  P N             T        Y              
LAGPTELH DS    CL8                                                              
LAGPTEL  DS    CL3     16   68    3  A  U N             T        Y  110         
LAGPTELX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   72    1  N  P N             T        Y              
LAGPTE2H DS    CL8                                                              
LAGPTE2  DS    CL4     16   74    4  A  U N             T        Y  110         
LAGPTE2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     17    2    9  A  P N             T        Y              
LAGTCODH DS    CL8                                                              
LAGTCOD  DS    CL2     17   20    2  A  U N             T        Y  115         
LAGTCODX DS    CL8                                                              
LAGTNAMH DS    CL8                                                              
LAGTNAM  DS    CL30    17   25   30  A  P N             T        Y              
LAGDAREH DS    CL8                                                              
LAGDARE  DS    CL14    18    2   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   20    2  A  P N             T        Y              
LAGDAG1H DS    CL8                                                              
LAGDAG1  DS    CL6     18   23    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   30    2  A  P N             T        Y              
LAGDAG2H DS    CL8                                                              
LAGDAG2  DS    CL6     18   33    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   40    2  A  P N             T        Y              
LAGDAG3H DS    CL8                                                              
LAGDAG3  DS    CL6     18   43    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   50    2  A  P N             T        Y              
LAGDAG4H DS    CL8                                                              
LAGDAG4  DS    CL6     18   53    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    20    2   15  A  P N             T        Y              
LAGCMT1H DS    CL8                                                              
LAGCMT1  DS    CL60    20   20   60  A  U N             T        Y              
LAGCMT2H DS    CL8                                                              
LAGCMT2  DS    CL60    21   20   60  A  U N             T        Y              
LAGHAGQH DS    CL8                                                              
LAGHAGQ  DS    CL13    22    2   13  A  P N             T        Y              
LAGAGEQH DS    CL8                                                              
LAGAGEQ  DS    CL4     22   20    4  A  U N             T        Y  120         
LAGAGEQX DS    CL8                                                              
LAGHAGOH DS    CL8                                                              
LAGHAGO  DS    CL10    22   28   10  A  P N             T        Y              
LAGAGEOH DS    CL8                                                              
LAGAGEO  DS    CL2     22   40    2  A  U N             T        Y              
LAGHBYSH DS    CL8                                                              
LAGHBYS  DS    CL19    23    2   19  A  P N             T        Y              
LAGABYSH DS    CL8                                                              
LAGABYS  DS    CL1     23   24    1  A  U N             T        Y              
LAGHALCH DS    CL8                                                              
LAGHALC  DS    CL13    24    2   13  A  P N             T        Y              
LAGAGLCH DS    CL8                                                              
LAGAGLC  DS    CL8     24   20    8  A  P N             T        Y              
LAGLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LAGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1320 BYTES                            
