*          DATA SET RELFMDFD   AT LEVEL 001 AS OF 06/05/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T804DFD      DATE 06/05/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     7    2   16  A  P N             T        Y              
CTYDESCH DS    CL8                                                              
CTYDESC  DS    CL20     7   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
CTYCMMTH DS    CL8                                                              
CTYCMMT  DS    CL8      8   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    10    2   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   55   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    4    8  A  P N             T        Y              
CTYRNMH  DS    CL8                                                              
CTYRNM   DS    CL33    11   16   33  A  U N             T        Y              
CTYRNMCH DS    CL8                                                              
CTYRNMC  DS    CL1     11   55    1  A  U N             T        Y              
CTYRNMWH DS    CL8                                                              
CTYRNMW  DS    CL1     11   60    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     12    4    9  A  P N             T        Y              
CTYRA1H  DS    CL8                                                              
CTYRA1   DS    CL20    12   16   20  A  U N             T        Y              
CTYRA1CH DS    CL8                                                              
CTYRA1C  DS    CL1     12   55    1  A  U N             T        Y              
CTYRA1WH DS    CL8                                                              
CTYRA1W  DS    CL1     12   60    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     13    4    9  A  P N             T        Y              
CTYRA2H  DS    CL8                                                              
CTYRA2   DS    CL34    13   16   34  A  U N             T        Y              
CTYRA2CH DS    CL8                                                              
CTYRA2C  DS    CL1     13   55    1  A  U N             T        Y              
CTYRA2WH DS    CL8                                                              
CTYRA2W  DS    CL1     13   60    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    14    4   13  A  P N             T        Y              
CTYRRLH  DS    CL8                                                              
CTYRRL   DS    CL33    14   19   33  A  U N             T        Y              
CTYRRLCH DS    CL8                                                              
CTYRRLC  DS    CL1     14   55    1  A  U N             T        Y              
CTYRRLWH DS    CL8                                                              
CTYRRLW  DS    CL1     14   60    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16    4   11  A  P N             T        Y              
CTYANMH  DS    CL8                                                              
CTYANM   DS    CL33    16   16   33  A  U N             T        Y              
CTYANMCH DS    CL8                                                              
CTYANMC  DS    CL1     16   55    1  A  U N             T        Y              
CTYANMWH DS    CL8                                                              
CTYANMW  DS    CL1     16   60    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17    4   10  A  P N             T        Y              
CTYBNMH  DS    CL8                                                              
CTYBNM   DS    CL20    17   16   20  A  U N             T        Y              
CTYBNMCH DS    CL8                                                              
CTYBNMC  DS    CL1     17   55    1  A  U N             T        Y              
CTYBNMWH DS    CL8                                                              
CTYBNMW  DS    CL1     17   60    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    4    5  A  P N             T        Y              
CTYAA1H  DS    CL8                                                              
CTYAA1   DS    CL34    18   16   34  A  U N             T        Y              
CTYAA1CH DS    CL8                                                              
CTYAA1C  DS    CL1     18   55    1  A  U N             T        Y              
CTYAA1WH DS    CL8                                                              
CTYAA1W  DS    CL1     18   60    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    4    5  A  P N             T        Y              
CTYAA2H  DS    CL8                                                              
CTYAA2   DS    CL34    19   16   34  A  U N             T        Y              
CTYAA2CH DS    CL8                                                              
CTYAA2C  DS    CL1     19   55    1  A  U N             T        Y              
CTYAA2WH DS    CL8                                                              
CTYAA2W  DS    CL1     19   60    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    4    5  A  P N             T        Y              
CTYAA3H  DS    CL8                                                              
CTYAA3   DS    CL36    20   16   36  A  U N             T        Y              
CTYAA3CH DS    CL8                                                              
CTYAA3C  DS    CL1     20   55    1  A  U N             T        Y              
CTYAA3WH DS    CL8                                                              
CTYAA3W  DS    CL1     20   60    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    22    4   19  A  P N             T        Y              
CTYPRFKH DS    CL8                                                              
CTYPRFK  DS    CL8     22   25    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    22   40   19  A  P N             T        Y              
CTYPRFAH DS    CL8                                                              
CTYPRFA  DS    CL16    22   60   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   14   10  A  P N             T        Y              
CTYPRFWH DS    CL8                                                              
CTYPRFW  DS    CL8     23   25    8  A  U N             T        Y              
CTYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CTYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 952  BYTES                            
