*          DATA SET RELOTOFF   AT LEVEL 017 AS OF 02/22/05                      
*                                                                               
*    CONVERSION TABLE:  LOTUS OFFICES TO DDS OFFICES                            
*          LOTUS :  3-DIGIT NUMERIC CODE                                        
*          DDS   :  2-POSITION ALPHANUMERIC CODE                                
*                                                                               
*    (LABELS ARE RETAINED SO PROGRAM MODULE NEED NOT BE CHANGED)                
*                                                                               
KATZOFFC DC    CL5'001AU'          AUSTIN                                       
LKTZOFF  EQU   *-KATZOFFC                                                       
         DC    CL5'002CH'          CHICAGO                                      
         DC    CL5'003DA'          DALLAS                                       
         DC    CL5'004LA'          LOS ANGELES                                  
         DC    CL5'005MI'          MIAMI                                        
         DC    CL5'006NW'          NETWORK                                      
         DC    CL5'007NY'          NEW YORK                                     
         DC    CL5'008SA'          SAN ANTONIO                                  
         DC    CL5'009SF'          SAN FRANCISCO                                
         DC    X'0000'             DELIMITER                                    
