*          DATA SET REMISSING  AT LEVEL 004 AS OF 09/22/95                      
*                                                                               
*   ADVERT TABLE:  4-BYTE CODES:  70 MISSING CODES                              
*                                                                               
*                1...2...3...4...5...6...7...                                   
MISSADV  DC    C'ACL AGI ALAMAMSIAMTRAND ARR '                                  
         DC    C'AVB BINDCLU COAMCOMOCPA DELE'                                  
         DC    C'DRCOENVIFBSWFILAFOREFPO FULL'                                  
         DC    C'GNB GNS GTB GU  HOJOHOL HTZ '                                  
         DC    C'HUDSHWE ILS JCHOJTR KIKKLAZ '                                  
         DC    C'MALIMAPPMAXTMICOMMA MOH MRCD'                                  
         DC    C'MUM MVC NAC NB  NOK ODA ODSY'                                  
         DC    C'ORA ORCHOSC OUP PHMSPON PPP '                                  
         DC    C'PRL RED RYK SFBDSG  SLR SNS '                                  
         DC    C'SUBITAUBTEE TXLAVTE VUC WLK '                                  
         DC    X'0000'                                                          
*                                                                               
*   PRODUCT TABLE:  7-BYTE CODES:  18 MISSING CODES                             
*                                                                               
*                1......2......3......4......                                   
MISSPRD  DC    C'ADT ZZ6AMTV002DCC 005DICH001'                                  
         DC    C'FBSWZ09FILA067HBH 004MICOZ21'                                  
         DC    C'MMA Z15MODEZ24MRCDZ35NCD 051'                                  
         DC    C'NEDDZ47ODT Z42PHM ZJ8RES ZG1'                                  
         DC    C'SOLAZH4XTP Z2Q'                                                
         DC    X'0000'             DELIMITER                                    
*                                                                               
*   AGENCY  TABLE:  6-BYTE CODES: AGENCY/AGY OFF:  52 MISSING CODES             
*                                                                               
*                1.....2.....3.....4.....5.....6.....                           
MISSAGY  DC    C'ACTMNNADF   ALF   AMMESSARN DT'                                
         DC    C'AZZ PPBH  DNBOHBNBCONT  CORIBY'                                
         DC    C'DRES  FLIN  FOV   GAI   GIL JB'                                
         DC    C'GLO   HUFF  HYC   INH NJISL   '                                
         DC    C'JLM TAKMM   KSL RILASA  LSTR  '                                
         DC    C'MCAF  MEDDCAMILE  ODSY  PRPR  '                                
         DC    C'PSA   PVCI  RCO   RDN   RDR   SAWI  '                          
         DC    C'SCBC  SMS   SPE   SQOM  STOU  '                                
         DC    C'SUMM  TBS TBTCI   TMEDSKTPH   '                                
         DC    C'VUC   WALK  ZMBSBKZMBSFRZMBSOK'                                
         DC    C'ZSFMHW'                                                        
         DC    X'0000'             DELIMITER                                    
