*          DATA SET RENRGE2DS  AT LEVEL 014 AS OF 06/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T815E2D      DATE 06/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  A  P N             T        Y              
RGEREGH  DS    CL8                                                              
RGEREG   DS    CL6      4   10    6  A  U N             T        Y   10         
RGEREGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      4   20    6  A  P N             T        Y              
RGEOFFH  DS    CL8                                                              
RGEOFF   DS    CL6      4   28    6  A  U N             T        Y   12         
RGEOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
RGEPYH   DS    CL8                                                              
RGEPY    DS    CL3      4   46    3  A  U N             T        Y   14         
RGEPYX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      4   56    6  A  P H             T        Y              
RGEPERH  DS    CL8                                                              
RGEPER   DS    CL14     4   63   14  A  U N             T        Y   16         
RGEPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
RGEGRPH  DS    CL8                                                              
RGEGRP   DS    CL6      5   10    6  A  U N             T        Y   18         
RGEGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
RGESTAH  DS    CL8                                                              
RGESTA   DS    CL7      5   28    7  A  U N             T        Y   20         
RGESTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
RGESTYH  DS    CL8                                                              
RGESTY   DS    CL6      5   46    6  A  U N             T        Y   22         
RGESTYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   56    3  A  P N             T        Y              
RGETVBH  DS    CL8                                                              
RGETVB   DS    CL6      5   63    6  A  U N             T        Y   24         
RGETVBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   70    5  A  P N             T        Y              
RGEOWNH  DS    CL8                                                              
RGEOWN   DS    CL3      5   77    3  A  U N             T        Y   26         
RGEOWNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
RGETEMH  DS    CL8                                                              
RGETEM   DS    CL6      6   10    6  A  U N             T        Y   28         
RGETEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   20    4  A  P N             T        Y              
RGECATH  DS    CL8                                                              
RGECAT   DS    CL6      6   28    6  A  U N             T        Y   30         
RGECATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
RGECTYH  DS    CL8                                                              
RGECTY   DS    CL6      6   46    6  A  U N             T        Y   32         
RGECTYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   56    6  A  P N             T        Y              
RGEMKTH  DS    CL8                                                              
RGEMKT   DS    CL6      6   63    6  A  U N             T        Y   34         
RGEMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   70    4  A  P N             T        Y              
RGERNKH  DS    CL8                                                              
RGERNK   DS    CL1      6   77    1  A  U N             T        Y   36         
RGERNKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
RGEAGYH  DS    CL8                                                              
RGEAGY   DS    CL6      7   10    6  A  U N             T        Y   41         
RGEAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   20    3  A  P N             T        Y              
RGEADVH  DS    CL8                                                              
RGEADV   DS    CL6      7   28    6  A  U N             T        Y   42         
RGEADVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
RGEDCTH  DS    CL8                                                              
RGEDCT   DS    CL6      7   46    6  A  U N             T        Y   43         
RGEDCTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7   56    5  A  P N             T        Y              
RGECLSH  DS    CL8                                                              
RGECLS   DS    CL6      7   63    6  A  U N             T        Y   39         
RGECLSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7   70    5  A  P N             T        Y              
RGEAFFH  DS    CL8                                                              
RGEAFF   DS    CL3      7   77    3  A  U N             T        Y   40         
RGEAFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
RGEOPTH  DS    CL8                                                              
RGEOPT   DS    CL68     8   10   68  A  U N             T        Y   38         
RGEOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8   80    1  A  P N             T        Y              
RGEHDGH  DS    CL8                                                              
RGEHDG   DS    CL79     9    2   79  A  P N             T        Y              
RGEHLNH  DS    CL8                                                              
RGEHLN   DS    CL3     10    2    3  A  P N             T        Y              
RGEHD1H  DS    CL8                                                              
RGEHD1   DS    CL75    10    6   75  A  P N             T        Y              
RGEHD2H  DS    CL8                                                              
RGEHD2   DS    CL75    11    6   75  A  P N             T        Y              
RGESELH  DS    CL8                                                              
RGESEL   DS    CL3     12    2    3  A  U N             T        Y              
RGEDETH  DS    CL8                                                              
RGEDET   DS    CL74    12    6   74  A  P N             T        Y              
RGESEL2H DS    CL8                                                              
RGESEL2  DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
RGEDETAH DS    CL8                                                              
RGEDETA  DS    CL74    22    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
RGEDETDH DS    CL8                                                              
RGEDETD  DS    CL74    24    6   74  A  P N             T        Y              
RGELAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RGEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2256 BYTES                            
