*          DATA SET RENWRIOD   AT LEVEL 076 AS OF 10/24/11                      
*              RENWRIO CONTROL BLOCK                                            
         SPACE 3                                                                
RENWRIOD DS    D                   *WRIIOD* IN DUMP                             
*                                  COMPULSORY FIELDS                            
REHOOK   DS    A                   A(USER HOOK)                                 
REACOMFC DS    A                   A(COMFACS)                                   
REREAD   DS    XL1                 RECORDS TO BE READ                           
*                                  (SAME AS FIRST BYTE OF KEY)                  
REQSE    DS    XL1                 STARTING SE NUMBER FOR UTL                   
REQREP   DS    CL2                 REP REQUESTING REPORT                        
         DS    CL4                 SPARE                                        
*                                                                               
REAIO    DS    A                   A(CURRENT IOAREA)                            
REAIO1   DS    A                   A(IOAREA1)                                   
REAIO2   DS    A                   A(IOAREA2)                                   
REAIO3   DS    A                   A(IOAREA3)                                   
REAIO4   DS    A                   A(IOAREA4)                                   
*                                  OPTIONAL OPTIMIZATION BUFFER                 
REABUFF  DS    A                       AT THIS ADDRESS                          
RELBUFF  DS    F                       FOR THIS LENGTH                          
*                                                                               
REBUFFA  DS    A                   A(BUFFER FOR TABLES)                         
REBUFFL  DS    F                   BUFFER LENGTH                                
REBFNXTA DS    A                   A(NEXT AVAILABLE BYTE IF BUFFER)             
*                                                                               
REDATA   DS    CL64                LIST OF REC IDS NEEDED FOR REPORT            
*                                                                               
REQFLAGS DS    XL1                                                              
REQFDEL  EQU   X'80'               RETURN DELETED RECS                          
REQPWCR  EQU   X'40'               PAPER WORK CT REC READ FOR CONTRACT          
*        EQU   X'20'                                                            
*        EQU   X'10'                                                            
REQPWCCO EQU   X'08'               PWC COUNT FOR CONTRACTS REQUESTED            
REQPWCSA EQU   X'04'               PWC COUNT FOR SALES REQUESTED                
REQ2MON  EQU   X'02'                                                            
REQPWCOP EQU   X'01'               PAPER WORK CT FILE OPEN                      
*                                                                               
REQTABLE DS    XL1                 REQUESTED TABLES                             
REQOFRG  EQU   X'80'               REGION PART OF REQUEST-BLD TABLE             
REQCTCL  EQU   X'40'               CLASS PART OF REQUEST-BLD TABLE              
REQSTOW  EQU   X'20'               STATION OWNER REQUEST-BLD TABLE              
REQSPPP  EQU   X'10'               POINT PERSON REQUEST-READ PRD REC            
REQCOMRQ EQU   X'08'               BUILD COMM RATE TABLE FOR STATION            
*                                                                               
REACCS   DS    CL4                 LIMIT ACCESS                                 
REAUTH   DS    CL2                 AUTHORIZATION VALUES                         
REUSERID DS    XL2                 ORIGIN ID NUM                                
*                                                                               
*        DATE FILTERS                                                           
*                                                                               
REQPDTS  DS    0CL30                                                            
REQPSTR  DS    CL6                 PERIOD START DATE  YRMODA                    
REQPEND  DS    CL6                        END DATE    YRMODA                    
REQPSTRB DS    XL3                 PERIOD START DATE  MON/YR ONLY               
REQPENDB DS    XL3                        END DATE    MON/YR ONLY               
REQPSTRM DS    CL6                 PERIOD START DATE  MON/YR ONLY               
REQPENDM DS    CL6                        END DATE    MON/YR ONLY               
*                                                                               
REQASATD DS    0XL6                AS-AT-DATES              BINARY              
REQASATS DS    XL3                 AS-AT-DATE START - YMD - BINARY              
REQASATE DS    XL3                 AS-AT-DATE END   - YMD - BINARY              
*                                                                               
REQYTDSB DS    XL3                 YTD START DATE - YM0                         
REQYTDST DS    CL6                 YTD START DATE - YYMM01                      
*                                                                               
REQCCDDT DS    0XL6                CONTRACT CREATE DATES   BINARY               
REQCCDST DS    XL3                 CONCREATE START - YMD - BINARY               
REQCCDEN DS    XL3                 CONCREATE END   - YMD - BINARY               
*                                                                               
         DS    11XL3               SPARE                                        
*                                                                               
REQADTS  DS    0CL26                                                            
REQASTR  DS    CL6                 ACTIVITY START DATE                          
REQAEND  DS    CL6                        END DATE                              
REQAASTR DS    CL6                 ACTUAL ACTIVITY START DATE                   
REQAAEND DS    CL6                                 END DATE                     
REQAAWKS DS    XL1                                                              
REQAPER  DS    CL1                 N = DATES ARE FROM ACTIVITY                  
*                                  Y = DATES ARE FROM PERIOD                    
*                                                                               
REQCFOPT DS    XL1                 COLUMN FILTERS STATUS                        
REQCFDPQ EQU   X'80'               SOME COL USING DROP FILTER                   
*                                     I.E. LINE PRINTS ONLY IF DATA             
*                                          FOR COLUMN                           
REQCFCTQ EQU   X'40'               SOME COL USING COUNT OPTION                  
REQCFYTQ EQU   X'20'               SOME COL USING YTD   OPTION                  
REQCFBCK EQU   X'10'               BACKOUT OPTION IN EFFECT                     
*                                                                               
RECOMBO  DS    XL1                 C'Y' - REPORT ONLY COMBO CONTRACTS           
*                                  C'N' - DROP COMBO CONTRACTS                  
*                                                                               
REFLAVOR DS    XL1                 REPORT FLAVOR                                
*                                  C'R' - RGON DATA                             
*                                  C'F' - CONTRACTS USING FLIGHT KEYS           
REQCSTAT DS    XL1                 CONTRACT STATUS FILTER                       
REQCSCFQ EQU   X'80'               CONFIRMED   DOLLARS ONLY                     
REQCSUCQ EQU   X'40'               UNCONFIRMED DOLLARS ONLY                     
REQCSXFQ EQU   X'20'               EXCLUDE FORECAST DOLLARS                     
REQCSACQ EQU   X'10'               USE ALTERNATE CALENDAR                       
REQCSFRQ EQU   X'08'               FORECAST ORDERS ONLY                         
*MNRCU                                                                          
REQCRCU  EQU   X'04'               INCLUDE SCRIPT UPLOAD ORDERS ONLY            
REQCXRCU EQU   X'02'               EXCLUDE SCRIPT UPLOAD ORDERS ONLY            
REQCRCM  EQU   X'01'               INCLUDE SCRIPT UPLOAD ORDERS ONLY            
REQCSTA2 DS    XL1                 CONTRACT STATUS FILTER 2                     
REQCXRCM EQU   X'80'               EXCLUDE SCRIPT UPLOAD ORDERS ONLY            
*MNRCU                                                                          
*                                                                               
REQCOMPF DS    XL1                 COMPETITIVE STATUS FILTER                    
REQCFPDQ EQU   X'80'               INCLUDE PENDING       CONTRACTS              
REQCFINQ EQU   X'40'               INCLUDE INCOMPLETE    CONTRACTS              
REQCFCPQ EQU   X'20'               INCLUDE COMPLETED WIN CONTRACTS              
REQCFLSQ EQU   X'10'               INCLUDE LOST          CONTRACTS              
*                                                                               
REQAADFN DS    XL1                 NUMBER OF AS-AT-DATE COLUMN FILTERS          
*                                                                               
RETRACE  DS    C                   Y - TRACE IO                                 
*                                                                               
REQDTYPE DS    CL1                 TYPE OF DATE TO BE FILTERED                  
REQDYR   EQU   C'Y'                     YEAR                                    
REQDSEMI EQU   C'S'                     SEMI-YEAR                               
REQDQTR  EQU   C'Q'                     QTR                                     
REQDMON  EQU   C'M'                     MONTH                                   
MULTPOST DS    CL1                 MULTIPLE POSTING OF $                        
         EJECT                                                                  
*                                  OPTIONAL REQUESTED FILTERS                   
REFILTSH DS    D                   **FILTS* IN DUMP                             
REFILTS  DS    0CL(REFILTX-REFREG)                                              
         SPACE                                                                  
REFREP   DS    CL2                 REP                                          
REFREG   DS    CL2                 REGION                                       
REFOFF   DS    CL2                 OFFICE                                       
REFGRPSB DS   0CL2                 GROUP/SUB GROUP                              
REFGRP   DS    CL1                 GROUP                                        
REFSGR   DS    CL1                 SUB GROUP                                    
REFSTA   DS    CL5                 STATION CALL LETTERS                         
REFSAL   DS    CL3                 SALESPERSON                                  
REFTEM   DS    0CL2                DIV + TEAM                                   
REFDIV   DS    CL1                 DIVISION                                     
REFTEAM  DS    CL1                 TEAM                                         
REFADV   DS    CL4                 ADVERTISER                                   
REFAGY   DS    CL4                 AGENCY                                       
REFAOF   DS    CL2                 AGENCY OFFICE                                
REFCLS   DS    CL2                 CLASS                                        
REFCTG   DS    CL2                 CATEGORY                                     
REFPRD   DS    CL3                 PRODUCT                                      
REFCTY   DS    CL1                 CONTRACT TYPE                                
REFSTTP  DS    CL1     **          STATION TYPE (OLD/NEW)                       
REFBLLOP DS    CL1     **          BILLING OPTION                               
REFMKT   DS    CL4                 MARKET CODE                                  
REFRNK   DS    CL1                 MARKET RANK CODE                             
REFTVB   DS    CL2                 STATION TVB/REGION                           
REFOWN   DS    CL3                 STATION OWNER CODE                           
REFDEMO  DS    CL3     **          DEMO                                         
REFBOOK  DS    XL4     **          BOOK - YEAR AND MONTH                        
REFCTYEX DS    CL1                 IF AN ASTERISK, EXCLUDE CONT TYPE            
REFTYP   DS    CL1                 STATION TYPE CODE                            
REFAFF   DS    CL3                 STATION AFFILIATE CODE                       
REFTER   DS    CL2                 TERRITORY CODE                               
REFNCT   DS    CL4     PWOS        NETWORK CONTRACT NUMBER                      
REFCON   DS    CL4     PWOS        CONTRACT NUMBER                              
REFDSP   DS    CL3                 DEVELOPMENTAL SALESPERSON                    
REFDCT   DS    CL2                 DEVELOPMENTAL TYPE                           
REFPTP   DS    CL3                 POINT PERSON                                 
REFBKBOP DS    CL1                 BACKBILLING OPTION I/X/O                     
REFBCD   DS    CL3                 BUY CODE                                     
REFBT1   DS    CL2                 BUY TYPE 1                                   
REFBT2   DS    CL2                 BUY TYPE 2                                   
         DS    CL23                SPARE                                        
*                                                                               
REQCMPFX DS    XL1                 COMPETITIVE STATUS FILTER - EXCLUDES         
*REQCFPDQ EQU   X'80'               PENDING       CONTRACTS                     
*REQCFINQ EQU   X'40'               INCOMPLETE    CONTRACTS                     
*REQCFCPQ EQU   X'20'               COMPLETED WIN CONTRACTS                     
*REQCFLSQ EQU   X'10'               LOST          CONTRACTS                     
*                                                                               
REQRFLTR DS    CL4                 STORED FORMAT FILTER                         
*                                                                               
REFJLSTR DS    XL3                 JOIN  DATE OVERRIDE - BINARY                 
REFJLEND DS    XL3                 LEAVE DATE OVERRIDE - BINARY                 
*                                                                               
REFLEN   DS    CL2                 LENGTH FILTER (USED BY AUR)                  
*                                                                               
*        SET RECORD IDS                                                         
*                                                                               
REGRPSID DS    CL4                 GROUP/SUBGROUP SET                           
RESTASID DS    CL4                 STATION        SET                           
READVSID DS    CL4                 ADVERTISER     SET                           
REAGYSID DS    CL4                 AGENCY         SET                           
REPTPSID DS    CL4                 POINT PERSON   SET                           
RECTYSID DS    CL4                 CONTRACT TYPE  SET                           
REDCTSID DS    CL4                 DEVELOPMENTAL CONTRACT TYPE  SET             
REOFFSID DS    CL4                 OFFICE         SET                           
REREPSID DS    CL4                 REP            SET                           
RESALSID DS    CL4                 SALESPERSON    SET                           
RESPTSID DS    CL4                 DAYPART        SET                           
REMKTSID DS    CL4                 MARKET         SET                           
*                                                                               
         DS    CL10                                                             
REFILTX  EQU   *                                                                
         SPACE                                                                  
*                                  OTHER SELECTIONS                             
         DS    0F                                                               
REQSKEY  DS    CL32                START AT THIS KEY (LIST CONT.)               
REQSTART DS    CL24                START AT (FOR LISTS)                         
REKHOOK  DS    AL4                 A(KEY HOOK ROUTINE)                          
*                                                                               
*        TABLES                                                                 
*                                                                               
         DS    0D                  ALIGNMENT                                    
READVTBA DS    A                   A(ADVERTISER TABLE)                          
READVTA  DS    A                   A(CURRENT ADVERTISER TABLE ENTRY)            
*                                                                               
REAGYTBA DS    A                   A(AGENCY TABLE)                              
REAGYTA  DS    A                   A(CURRENT AGENCY TABLE ENTRY)                
*                                                                               
RECLSTBA DS    A                   A(CLASS TABLE)                               
RECLSTA  DS    A                   A(CURRENT CLASS TABLE ENTRY)                 
*                                                                               
RECTGTBA DS    A                   A(CATEGORY TABLE)                            
RECTGTA  DS    A                   A(CURRENT CATEGORY TABLE ENTRY)              
*                                                                               
RECTYTBA DS    A                   A(CONTRACT TYPE TABLE)                       
RECTYTA  DS    A                   A(CURRENT CONTRACT TYPE TABLE ENTRY)         
*                                                                               
REDCTTBA DS    A                   A(DEVELOP CONTRACT TYPE TABLE)               
REDCTTA  DS    A                   A(CURRENT DEVELOP TYPE TABLE ENTRY)          
*                                                                               
REDSPTBA DS    A                   A(DEVELOP PERSON TABLE)                      
REDSPTA  DS    A                   A(CURRENT DEVELOP PERSON TAB ENTRY)          
*                                                                               
REGRPTBA DS    A                   A(GROUP/SUBGROUP TABLE)                      
REGRPTA  DS    A                   A(CURRENT GROUP TABLE ENTRY)                 
*                                                                               
REMKTTBA DS    A                   A(MARKET TABLE)                              
REMKTTA  DS    A                   A(MARKET TABLE ENTRY)                        
*                                                                               
REOFFTBA DS    A                   A(OFFICE TABLE)                              
REOFFTA  DS    A                   A(CURRENT OFFICE TABLE ENTRY)                
*                                                                               
REOWNTBA DS    A                   A(OWNER  TABLE)                              
REOWNTA  DS    A                   A(CURRENT OWNER TABLE ENTRY)                 
*                                                                               
REPRDTBA DS    A                   A(PRODUCT TABLE)                             
REPRDTA  DS    A                   A(CURRENT PRODUCT TABLE ENTRY)               
*                                                                               
REPTPTBA DS    A                   A(POINT PERSON TABLE)                        
REPTPTA  DS    A                   A(CURRENT POINT PERSON TABLE ENTRY)          
*                                                                               
REREGTBA DS    A                   A(REGION TABLE)                              
REREGTA  DS    A                   A(CURRENT REGION TABLE ENTRY)                
*                                                                               
REREPTBA DS    A                   A(REP TABLE)                                 
REREPTA  DS    A                   A(CURRENT REP TABLE ENTRY)                   
*                                                                               
RESALTBA DS    A                   A(SALESPERSON TABLE)                         
RESALTA  DS    A                   A(CURRENT SALESPERSON TABLE ENTRY)           
*                                                                               
RETEMTBA DS    A                   A(DIV/TEAM TABLE)                            
RETEMTA  DS    A                   A(CURRENT DIV/TEAM TABLE ENTRY)              
*                                                                               
RESTATBA DS    A                   A(STATION TABLE)                             
RESTATA  DS    A                   A(CURRENT STATION TABLE ENTRY)               
*                                                                               
RETERTBA DS    A                   A(TERRITORY TABLE)                           
RETERTA  DS    A                   A(CURRENT TERRITORY TABLE ENTRY)             
*                                                                               
RESJLTBA DS    A                   A(STATION JOIN/LEAVE DATES TABLE)            
RESJLTA  DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
REAG2TBA DS    A                   A(AGENCY 2 TABLE)                            
REAG2TA  DS    A                   A(CURRENT AGENCY 2 TABLE ENTRY)              
*                                                                               
RECOMTBA DS    A                   A(COMMISSION RATE TABLE)                     
RECOMTA  DS    A                   A(CURRENT COMMISSION RATE TABLE ENT)         
*                                                                               
REBCDTBA DS    A                   A(BUY CODE TABLE)                            
REBCDTA  DS    A                   A(CURRENT BUY CODE TABLE ENT)                
REBT1TA  DS    A                   A(CURRENT BUY TYPE 1 TABLE ENT)              
REBT2TA  DS    A                   A(CURRENT BUY TYPE 2 TABLE ENT)              
*                                                                               
         DS    22A                 SPARE                                        
*                                                                               
READDAY  DS    AL4                                                              
*                                                                               
*              VALUES RETURNED BY RENWRIO                                       
*                                                                               
REMODEH  DS    D                   **MODE** IN DUMP                             
REMODE   DS    XL1                 MODE SETTING                                 
PROCREC  EQU   1                                                                
PROCPWC  EQU   2                   READ PAPER WORK CT REC                       
         SPACE                                                                  
REERROR  DS    XL1                                                              
RENOROUT EQU   1                   NO READ ROUTINE FOR RECORD TYPE              
RESE     DS    XL1                 CURRENT SE NUMBER FOR UTL                    
         DS    CL5                                                              
*                                                                               
REKEYH   DS    D                   **REKEY* IN DUMP                             
REKEY    DS    CL32                KEY OF RECORD                                
REDSKADD DS    XL4                 DISK ADDRESS OF RECORD                       
         SPACE                                                                  
READDSH  DS    D                   **ADDS** IN DUMP                             
REAPWC   DS    A                   OPTIONAL PWC BEING PROCESSED                 
REAREC   DS    A                   RECORD BEING PROCESSED                       
*                                  OPTIONAL SAVED RECORDS                       
*                                  DEPENDS ON SIZE OF RELBUFF                   
REATVBLS DS    A                   TVB REGION LIST - IN 00 PHASE                
REANWMON DS    A                   ADDRESS OF NEWMON TBL                        
RENWMSZQ EQU   15000               SIZE OF SECTION IN NEWMON TABLE              
REUTLA   DS    A                   A(UTL)                                       
*                                                                               
*        ADDRESSES OF FIELDS ON SCREEN                                          
*                                                                               
RESTAA   DS    A                   A(STATION FIELD)                             
REOPTA   DS    A                   A(FIRST OPTIONS FIELD)                       
RELHEADA DS    A                   A(FIRST LEFT HEADLINE)                       
RERHEADA DS    A                   A(FIRST RIGHT HEADLINE)                      
REMIDA   DS    A                   A(FIRST MID-LINE)                            
REROWA   DS    A                   A(FIRST ROW)                                 
RECOLA   DS    A                   A(FIRST COLUMN)                              
         DS    10A                                                              
         EJECT                                                                  
*                                  BASIC CODES                                  
RECODESH DS    D                   **CODES* IN DUMP                             
*                                  FILLED IN WHERE RELEVANT                     
*                                  ELSE SET TO BINARY ZEROS                     
RECODES  DS    0CL(RECODEX-REREG)                                               
REREG    DS    CL2                 REGION                                       
REOFF    DS    CL2                 OFFICE                                       
REGRS    DS   0CL2                 GROUP/SUB GROUP                              
REGRP    DS     CL1                 GROUP                                       
RESGR    DS     CL1                 SUB GROUP                                   
RESTA    DS    CL5                 STATION CALL LETTERS                         
RESAL    DS    CL3                 SALESMAN                                     
RETEM    DS   0CL2                 DIV + TEAM                                   
REDIV    DS     CL1                 DIVISION                                    
RETEAM   DS     CL1                 TEAM                                        
READV    DS    CL4                 ADVERTISER                                   
REAGYAOF DS   0CL6                 AGENCY/AGENCY OFFICE                         
REAGY    DS     CL4                 AGENCY                                      
REAOF    DS     CL2                 AGENCY OFFICE                               
*                                                                               
RECLS    DS    CL2                 CLASS                                        
RECTG    DS    CL2                 CATEGORY                                     
REPRD    DS    CL3                 PRODUCT CODE                                 
RECTY    DS    CL1                 CONTRACT TYPE                                
REDCT    DS    CL2                 DEVELOPMENTAL CONTRACT TYPE                  
REDSP    DS    CL3                 DEVELOPMENTAL SALESPERSON                    
*                                                                               
RESTTP   DS    CL1      **         STATYPE (OLD/NEW/JOINED/LEFT/COMP)           
RESTTPCQ EQU   X'80'               COMPARABLE                                   
RESTTPNQ EQU   X'40'               NEW                                          
RESTTPJQ EQU   X'20'               JOINED                                       
RESTTPLQ EQU   X'10'               LEFT                                         
RESTTPOQ EQU   X'08'               OLD                                          
*                                                                               
RESTTP2  DS    CL1      **         STATION TYPE (JOIN/LEAVE)                    
REBLLOP  DS    CL1                 BILLING OPTION                               
*                                                                               
RERNK    DS    CL1                 STATION RANK                                 
RETVB    DS    CL2                 STATION TVB/REGION                           
REOWN    DS    CL3                 STATION OWNER                                
REMKT    DS    CL4                 MARKET REC CODE (FROM STATION REC)           
*                                                                               
REDEMO   DS    CL3                 DEMO (FROM X'12' SAR ELEM)                   
REBOOK3  DS    XL3                 BOOK  - CL3 SPACE,YEAR,MONTH(X'12')          
REBOOK6  DS    CL6                 BOOK  - CL6 FROM X'10' ELEM                  
REPRDN   DS    CL20                PRODUCT NAME                                 
REPTP    DS    CL3                 POINT PERSON                                 
REDPT    DS    CL1                 DAYPART CODE                                 
RESRVC   DS    CL1                 RATING SERVICE                               
REMKTGEO DS    CL5                 MARKET(GEO)    (ONLY 3 USED)                 
RETER    DS    CL2                 TERRITORY                                    
REBUDYR  DS    CL2                 BUDGET YEAR                                  
REBTPC   DS    XL1                 BUDGET TYPES - COMPANY                       
REBTPO   DS    XL1                 BUDGET TYPES - OFFICE                        
REBTPS   DS    XL1                 BUDGET TYPES - STATION                       
REBTPSP  DS    XL1                 BUDGET TYPES - SALESPERSON                   
REBTPSS  DS    XL1                 BUDGET TYPES - SALESPERSON/STATION           
REBCD    DS    CL3                 BUY CODE                                     
REBT1    DS    CL2                 BUY TYPE 1                                   
REBT2    DS    CL2                 BUY TYPE 2                                   
*                                                                               
         DS    XL11                SPARE                                        
RECNBSTB DS    XL3                 CONTRACT START B'CAST MONTH  BINARY          
RECNBENB DS    XL3                 CONTRACT END   B'CAST MONTH  BINARY          
*                                                                               
*        DATE RANGES FOR FILTERING CONTRACTS                                    
*                                                                               
REFDTESC DS    0X                  FILTER DATES - COMPRESSED                    
REFCURST DS    XL2                 CURRENT   START DATE - COMPRESSED            
REFCUREN DS    XL2                 CURRENT   END   DATE - COMPRESSED            
REFPRIST DS    XL2                 PRIOR     START DATE - COMPRESSED            
REFPRIEN DS    XL2                 PRIOR     END   DATE - COMPRESSED            
REFPR2ST DS    XL2                 2YR PRIOR START DATE - COMPRESSED            
REFPR2EN DS    XL2                 2YR PRIOR END   DATE - COMPRESSED            
REFNXTST DS    XL2                 NEXT YR   START DATE - COMPRESSED            
REFNXTEN DS    XL2                 NEXT YR   END   DATE - COMPRESSED            
REFDTECL EQU   *-REFDTESC          LENGTH OF FILTER DATES - COMPRESSED          
*                                                                               
REFDTTYP DS    XL1                 DATE TYPES NEEDED                            
REFDCURQ EQU   X'80'               CURRENT   DATES                              
REFDPRIQ EQU   X'40'               PRIOR     DATES                              
REFDPR2Q EQU   X'20'               2YR PRIOR DATES                              
REFDNXTQ EQU   X'10'               NEXT YR   DATES                              
*                                                                               
REAFF    DS    CL3                 NETWORK AFFILIATION                          
*                                                                               
REFDTESB DS    0X                  FILTER DATES - BINARY                        
REFCURSB DS    XL3                 CURRENT   START DATE - BINARY                
REFCUREB DS    XL3                 CURRENT   END   DATE - BINARY                
REFPRISB DS    XL3                 PRIOR     START DATE - BINARY                
REFPRIEB DS    XL3                 PRIOR     END   DATE - BINARY                
REFPR2SB DS    XL3                 2YR PRIOR START DATE - BINARY                
REFPR2EB DS    XL3                 2YR PRIOR END   DATE - BINARY                
REFNXTSB DS    XL3                 NEXT YR   START DATE - BINARY                
REFNXTEB DS    XL3                 NEXT YR   END   DATE - BINARY                
REFDTEBL EQU   *-REFDTESB          LENGTH OF FILTER DATES - BINARY              
*                                                                               
         DS    CL6                 SPARE                                        
*                                                                               
RESTSTR  DS    XL3                 STATION START(JOIN) DATE                     
RESTEND  DS    XL3                 STATION END(LEAVE)  DATE                     
*                                                                               
RECURDAT DS    CL2                 MON/YR OF $ FIELDS FROM NEWMON TBL           
*                                  IN POSTDLRS ROUTINE (RENWRIO)                
*                                                                               
RECUTCUR DS    XL2                 DR/PP CUTOFF DATE - YM - CURRENT             
RECUTPRI DS    XL2                 DR/PP CUTOFF DATE - YM - PRIOR               
         DS    CL6                 SPARE                                        
*                                                                               
RECON    DS    PL4                 UNSIGNED PACKED CONTRACT NUMBER              
*RECONZD  DS    CL8                 ZD CONTRACT NUMBER                          
*REFILT1  DS    CL1                 FILTER 1                                    
*REFILT2  DS    CL1                        2                                    
*REFILT3  DS    CL1                        3                                    
*REFILT4  DS    CL1                        4                                    
*REFLAGS  DS    XL1                                                             
         DS    XL13                POTENTIAL SPARE                              
REFTYPS1 DS    CL1                 FILTER TYPES BEING USED                      
REFTCTYQ EQU   X'80'                 CONTRACT TYPE                              
REFTCTGQ EQU   X'40'                 CATEGORY                                   
REFTDCTQ EQU   X'20'                 DEVELOP CONTRACT TYPE                      
REFTDSPQ EQU   X'10'                 DEVELOP CONTRACT PERSON                    
REFTPTPQ EQU   X'08'                 POINT PERSON                               
REFTSALQ EQU   X'04'                 SALESPERSON                                
REFTCLSQ EQU   X'02'                 CLASS                                      
REFTPRDQ EQU   X'01'                 PRODUCT                                    
*                                                                               
REFTYPS2 DS    CL1                 FILTER TYPES BEING USED                      
REFTRTYQ EQU   X'80'                 TERRITORY                                  
REFTAG2Q EQU   X'40'                 AGENCY 2 RECORD                            
REFTREPQ EQU   X'20'                 REP                                        
REFTTEMQ EQU   X'10'                 DIV/TEM                                    
REFTMKTQ EQU   X'08'                 MARKET                                     
REFTOWNQ EQU   X'04'                 OWNER                                      
REFTSTAQ EQU   X'02'                 STATION                                    
REFTOFFQ EQU   X'01'                 OFFICE                                     
*                                                                               
REFTYPS3 DS    CL1                 FILTER TYPES BEING USED                      
REFTBCDQ EQU   X'80'                 BUY CODE                                   
REFTBT1Q EQU   X'40'                 BUY TYPE 1                                 
REFTBT2Q EQU   X'20'                 BUY TYPE 2                                 
*MNTEST                                                                         
REFTBSPQ EQU   X'10'                 NUMBER OF SPOTS                            
REFTTDRQ EQU   X'08'                 TRUE DARE CONTRACTS                        
REFTXMLQ EQU   X'04'                 XML       CONTRACTS                        
*MNTEST                                                                         
REFTYPS4 DS    CL1                 FILTER TYPES BEING USED                      
*                                                                               
*        IF BIT ON HERE THE FILTER IS NEGATIVE                                  
*                                                                               
REFTYPN1 DS    CL1                 NEGATIVE FILTER TYPES BEING USED             
*REFTCTYQ EQU   X'80'                 CONTRACT TYPE                             
*REFTCTGQ EQU   X'40'                 CATEGORY                                  
*REFTDCTQ EQU   X'20'                 DEVELOP CONTRACT TYPE                     
*REFTDSPQ EQU   X'10'                 DEVELOP CONTRACT PERSON                   
*REFTPTPQ EQU   X'08'                 POINT PERSON                              
*REFTSALQ EQU   X'04'                 SALESPERSON                               
*REFTCLSQ EQU   X'02'                 CLASS                                     
*REFTPRDQ EQU   X'01'                 PRODUCT                                   
*                                                                               
REFTYPN2 DS    CL1                 NEGATIVE FILTER TYPES BEING USED             
*REFTRTYQ EQU   X'80'                 TERRITORY                                 
*REFTAG2Q EQU   X'40'                 AGENCY 2 RECORD                           
*REFTREPQ EQU   X'20'                 REP                                       
*REFTTEMQ EQU   X'10'                 DIV/TEM                                   
*REFTMKTQ EQU   X'08'                 MARKET                                    
*REFTOWNQ EQU   X'04'                 OWNER                                     
*REFTSTAQ EQU   X'02'                 STATION                                   
*                                                                               
REFTYPN3 DS    CL1                 NEGATIVE FILTER TYPES BEING USED             
*REFTTDRQ EQU   X'08'                 TRUE DARE CONTRACTS                       
*REFTXMLQ EQU   X'04'                 XML       CONTRACTS                       
REFTYPN4 DS    CL1                 NEGATIVE FILTER TYPES BEING USED             
*                                                                               
REQBLLOP DS    CL1                 BILLING OPTION                               
REQBOCDQ EQU   X'80'                 CURRENT DOLLARS                            
REQBODRQ EQU   X'40'                 DIRECT RESPONSE                            
REQBOPPQ EQU   X'20'                 PAID PROGRAMMING                           
REQBOR1Q EQU   X'10'                 R1                                         
REQBOR2Q EQU   X'08'                 R2                                         
REQBOR3Q EQU   X'04'                 R3                                         
REQBOR5Q EQU   X'02'                 R5                                         
*                                                                               
RECODEX  EQU   *                                                                
*                                                                               
REREP    DS    CL2                 REP                                          
REMREP   DS    CL2                 MASTER REP                                   
REDMREP  DS    CL2                 REP USED IN KEY                              
*                                                                               
RESUBS   DS    D                   **SUB*** IN DUMP                             
RENAME   DS    CL30                NAME OF SELECTED RECORD                      
RESHORT  DS    CL20                SHORT NAME                                   
RESVBBFA DS    A                   A(STACK BUFFER)                              
RESVBBFL DS    A                   LENGTH OF STACK BUFFER                       
*                                                                               
REKYWTYP DS    CL1                 KEYWORD TYPES IN REPORT                      
REKYREPQ EQU   X'80'               REP IN REQUEST                               
*                                                                               
         DS    CL1                 SPARE                                        
*                                                                               
REALL1   DS    CL1                 DATATYPES NEEDING FILE LISTING               
REALCTYQ EQU   X'80'                 CONTRACT TYPE                              
REALCTGQ EQU   X'40'                 CATEGORY                                   
REALDCTQ EQU   X'20'                 DEVELOP CONTRACT TYPE                      
REALDSPQ EQU   X'10'                 DEVELOP CONTRACT PERSON                    
REALPTPQ EQU   X'08'                 POINT PERSON                               
REALSALQ EQU   X'04'                 SALESPERSON                                
REALCLSQ EQU   X'02'                 CLASS                                      
REALPRDQ EQU   X'01'                 PRODUCT                                    
*                                                                               
REALL2   DS    CL1                                                              
REALTERQ EQU   X'80'                 TERRITORY                                  
REALAGYQ EQU   X'40'                 AGENCY                                     
REALADVQ EQU   X'20'                 ADVERTISER                                 
REALSTAQ EQU   X'10'                 STATION                                    
*                                                                               
REALL3   DS    CL1                                                              
REALL4   DS    CL1                                                              
         SPACE                                                                  
REDATES  DS    0CL35               USEFUL DATES IF AROUND                       
RECADT   DS    PL3                     CONTRACT ADD DATE                        
REDTS    DS   0XL6                     CONTRACT DATES                           
RECONSTR DS    PL3                                                              
RECONEND DS    PL3                                                              
REMONSER DS    PL2                     CONTRACT MONTH OF SERVICE                
         SPACE                                                                  
REPWCWDT DS    CL6                 WEEK OF START DATE FOR CONTRACT              
REPCENDT DS    CL6                 CONTRACT ACTIVITY COUNT END DATE             
REPSENDT DS    CL6                 SALES ACTIVITY COUNT END DATE                
REPPERST DS    CL6                 PWC PERIOD STR DATE (WORK AREA)              
REPPERND DS    CL6                 PWC PERIOD END DATE (WORK AREA)              
REPWKST  DS    XL1                 WEEKS TO START INTO ELEM                     
REPWKCT  DS    XL1                 WEEKS TO COUNT FOR PERIOD                    
*                                                                               
* RECORD EQUATES FOR REP RECORD TYPES *                                         
*                                                                               
RREPKTYQ EQU   X'01'               REP                                          
RSTAKTYQ EQU   X'02'               STATION                                      
RREGKTYQ EQU   X'03'               REGION                                       
ROFFKTYQ EQU   X'04'               OFFICE                                       
RTEMKTYQ EQU   X'05'               DIVISION/TEAM                                
RSALKTYQ EQU   X'06'               SALESPERSON                                  
RGRPKTYQ EQU   X'07'               GROUP/SUBGROUP                               
RADVKTYQ EQU   X'08'               ADVERTISER                                   
RPRDKTYQ EQU   X'09'               PRODUCT                                      
RAGYKTYQ EQU   X'0A'               AGENCY                                       
RAG2KTYQ EQU   X'1A'               AGENCY 2 - EXTENSION RECORD                  
RBUYKTYQ EQU   X'0B'               BUY                                          
RCONKTYQ EQU   X'0C'               CONTRACT                                     
RCLSKTYQ EQU   X'0D'               CLASS                                        
RCTGKTYQ EQU   X'0F'               CATEGORY                                     
RINVKTYQ EQU   X'12'               INVENTORY HEADER                             
RBUDKTYQ EQU   X'13'               BUDGET                                       
RCBDKTYQ EQU   X'93'               COMPANY BUDGET                               
RAVLKTYQ EQU   X'14'               AVAIL                                        
RPRPKTYQ EQU   X'16'               PROPOSAL/PLAN                                
ROBDKTYQ EQU   X'19'               OFFICE BUDGET                                
RCOMKTYQ EQU   X'29'               COMMISSION RATE                              
ROWNKTYQ EQU   X'2A'               STATION OWNER(S)                             
RMKTKTYQ EQU   X'2B'               MARKET                                       
RPWCKTYQ EQU   X'2F'               PAPERWORK                                    
RPOPKTYQ EQU   X'31'               POINT PERSON                                 
RRDPKTYQ EQU   X'3C'               RESEARCH DAYPART DEFINITIONS                 
*MN                                                                             
*MN                                                                             
RDARKTYQ EQU   X'41'               DARE                                         
RMGOKTYQ EQU   X'11'               MAKE GOOD RECORDS                            
*MN                                                                             
*MN                                                                             
RBCDKTYQ EQU   X'4B'               SPECIAL BUY CODE                             
RAFFKTYQ EQU   X'81'               AFFLIATION                                   
RRNKKTYQ EQU   X'82'               RANK                                         
RTVBKTYQ EQU   X'83'               TVB CODE                                     
RSTPKTYQ EQU   X'84'               TYPE                                         
RBSSKTYQ EQU   X'B4'               SALESPERSON/STATION BUDGET                   
RBSPKTYQ EQU   X'B5'               SALESPERSON/NO STATION BUDGET                
RFLTKTYQ EQU   X'C6'               USE RIS KEYS                                 
RNRGKTYQ EQU   X'D9'               RGON                                         
RSJLKTYQ EQU   X'DA'               STATION JOIN/LEAVE DATES                     
RSTAOWNT EQU   X'ED'               READ ALL STATION RECS, TABLING OWNER         
ROFFREGT EQU   X'EE'               READ ALL OFFICE RECS, TABLING REGION         
RCTGCLST EQU   X'EF'               READ ALL CATEGORY RECS, TABLING CLAS         
         SPACE                                                                  
*  QRECORD LAYOUT FROM  REREPWORKD AT LEVEL 074 AS OF 03/15/95                  
REQRECS  DS    D                                                                
QRECORD  DS    0CL80                                                            
QPROG    DS    CL2       1         REQUESTED PROGRAM NUMBER                     
QREP     DS    CL2       3         REP                                          
QREQOFF  DS    CL2       5         REQUESTING OFFICE                            
QUESTOR  DS    CL12      7         REQUESTOR                                    
QREGION  DS    CL2      19         OFFICE REGION                                
QOFFICE  DS    CL2      21         OFFICE                                       
QSTATION DS    CL5      23         STATION                                      
QDIV     DS    CL1      28         SALES DIVISION                               
QTEAM    DS    CL1      29         SALES TEAM                                   
QMAN     DS    CL3      30         SALES MAN                                    
QAGENCY  DS    CL4      33         AGENCY                                       
QAGYOFF  DS    CL2      37         AGENCY OFFICE                                
QADV     DS    CL4      39         ADVERTISER                                   
QPRODUCT DS    CL3      43         PRODUCT                                      
QCLASS   DS    CL2      46         PRODUCT CLASS                                
QCATY    DS    CL2      48         PRODUCT CATEGORY                             
QSTART   DS    CL6      50         START DATE                                   
QEND     DS    CL6      56         END DATE                                     
QASAT    DS    CL6      62         AS AT DATE                                   
QBASIS   DS    CL1      68         MONTH TYPE BASIS                             
QSTATYPE DS    CL1      69         STATION TYPE                                 
QSEQ     DS    CL1      70         SEQUENCE                                     
QOPTIONS DS    0CL3     71         OPTIONS                                      
QOPTION1 DS    CL1      71         OPTION ONE                                   
QOPTION2 DS    CL1      72         OPTION TWO                                   
QACCTOPT DS    CL1      73         ACCOUNTING OPTION                            
QCONT    DS    0CL7     74         CONTRACT NUMBER                              
QGROUP   DS    CL1      74         STATION GROUP                                
QSBGROUP DS    CL1      75         STATION SUB-GROUP                            
QCONTYPE DS    CL1      76         CONTRACT TYPE                                
QOPTION3 DS    CL1      77         OPTION THREE                                 
QRGPROG  DS    CL2      78         REPRG PROGRAM NUMBER                         
QOPTION4 DS    CL1      80         OPTION FOUR                                  
*                                                                               
QRECORD2 DS    CL80                2ND REQUEST CARD                             
*                                  COVERED BY QREC2D DSECT                      
QRECORD3 DS    CL80                3D REQUEST CARD                              
*                                                                               
CURST    DS    H                                                                
CURND    DS    H                                                                
PRIST    DS    H                                                                
PRIND    DS    H                                                                
CAVLMON  DS    H                                                                
PAVLMON  DS    H                                                                
FLIGHTST DS    H                                                                
FLIGHTND DS    H                                                                
CURST3   DS    CL3                 3-BYTE BINARY DATE                           
CURND3   DS    CL3                 3-BYTE BINARY DATE                           
PRIST3   DS    CL3                 3-BYTE BINARY DATE                           
PRIND3   DS    CL3                 3-BYTE BINARY DATE                           
ACCOPT   DS    CL1                 ACCOUNTING OPTION                            
REQDAY   DS    CL1                 DAY FROM REQUEST START                       
*                                                                               
REYMSTRP DS    CL2                 BINARY Y/M PERIOD START                      
REYMENDP DS    CL2                 BINARY Y/M PERIOD END                        
*                                                                               
REMONTBA DS    A                   A(NEWMONTB)                                  
*                                                                               
FLTTABA  DS    A                   FILTER TABLE ADDRESS                         
FLTFLTRA DS    A                   FILTER THIS KEYWORD ADDRESS                  
*                                                                               
REQCMPST DS    XL2                 REQUEST START DATE - COMPRESSED              
REQCMPND DS    XL2                 REQUEST END   DATE - COMPRESSED              
*                                                                               
RECNTRL  DS    XL1                 CONTROL SWITCH                               
RECRTRNQ EQU   X'80'               RETURN TO DRIVER FOR MORE DATA               
RECDLSTQ EQU   X'40'               DATE LIST PROCESSING                         
*                                                                               
RECURSTB DS    XL3                 CURRENT START BINARY YMD                     
RECURENB DS    XL3                 CURRENT END   BINARY YMD                     
*                                                                               
         DS    CL1                 SPARE  * BE CAREFUL HERE *                   
REDLSTA  DS    A                   A(DATE LIST)                                 
BINSRCH  DS    V                   V(BINSRCH2)                                  
RECONSPA DS    A                   A(CONTRACT SPECIFICATIONS)                   
REGETBRD DS    V                   V(GETBROAD)                                  
         DS    CL7                 SPARE  * BE CAREFUL HERE *                   
REMINLNS DS    XL1                 NUMBER OF LINES COMMENT NEEDS                
REREPSE  DS    XL2                 SE NUMBER FOR CURRENT REP                    
*                                                                               
RESPACES DS    CL198               SPACES                                       
*                                                                               
*        RENWRIO CONTROL BYTES                                                  
*                                                                               
*                                                                               
REAGCNTL DS    XL1                 AGY RECORD CONTROL SWITCH                    
REAGCFTQ EQU   X'80'                 AGY BEING FILTERED                         
REAGCFDQ EQU   X'40'                 AGY TABLE ENTRY FOUND                      
REAGCPTQ EQU   X'20'                 AGY TABLE ENTRY TO BE CREATED              
REAGCSRQ EQU   X'10'                 SORTING ON AGY TABLE ENTRY                 
REAGCFLQ EQU   X'08'                 AGY TABLE FILLED FOR OUTPUT                
*                                                                               
READCNTL DS    XL1                 ADV RECORD CONTROL SWITCH                    
READCFTQ EQU   X'80'                 ADV BEING FILTERED                         
READCFDQ EQU   X'40'                 ADV TABLE ENTRY FOUND                      
READCPTQ EQU   X'20'                 ADV TABLE ENTRY TO BE CREATED              
READCSRQ EQU   X'10'                 SORTING ON ADV TABLE ENTRY                 
READCFLQ EQU   X'08'                 ADV TABLE FILLED FOR OUTPUT                
*                                                                               
REPRCNTL DS    XL1                 PRD RECORD CONTROL SWITCH                    
REPRCFTQ EQU   X'80'                 PRD BEING FILTERED                         
REPRCFDQ EQU   X'40'                 PRD TABLE ENTRY FOUND                      
REPRCPTQ EQU   X'20'                 PRD TABLE ENTRY TO BE CREATED              
REPRCSRQ EQU   X'10'                 SORTING ON PRD TABLE ENTRY                 
REPRCFLQ EQU   X'08'                 PRD TABLE FILLED FOR OUTPUT                
*                                                                               
RESTCNTL DS    XL1                 STA RECORD CONTROL SWITCH                    
RESTCFTQ EQU   X'80'                 STA BEING FILTERED                         
*                                                                               
RETBREP  DS    XL2                 REP FOR TABLE LOOK UP                        
         DS    XL4                 SPARE                                        
*                                                                               
*        RENWRIO ROUTINES                                                       
*                                                                               
         DS    15A                 SPARE                                        
REAADTBA DS    A                   A(COLUMN FILTERS ASATDATE TABLE)             
RENRGWRA DS    A                   A(RENWRGWRI)                                 
*                                                                               
RERRGWRC DS    XL(RRGWRILE)        RRGWRI CONTROL BLOCK                         
*                                                                               
*        ACTIVITY DATES                                                         
*                                                                               
REMONACC DS    0XL(2*4)            ACTIVITY DATES                               
REMACCRS DS    XL2                 CURRENT START - COMPRESSED                   
REMACCRE DS    XL2                 CURRENT END   - COMPRESSED                   
REMACPRS DS    XL2                 PRIOR   START - COMPRESSED                   
REMACPRE DS    XL2                 PRIOR   END   - COMPRESSED                   
*                                                                               
*        KEYS OF MAJOR RECORDS                                                  
*                                                                               
         DS    0F                  ALIGNMENT                                    
RECONKEY DS    XL36                CONTRACT KEY                                 
RESTAKEY DS    XL36                STATION  KEY                                 
         DS    6XL36               SPARE                                        
*                                                                               
REBDYTAB DS    0CL24               YEARS NEEDED FOR BUDGET REPORT               
REBDYYY  DS    CL2                 BUDGET YEAR                                  
         DS    11CL2               REST OF TABLE                                
*                                                                               
*        COLUMN FILTERS AND CONTROL BYTES                                       
*        SET AT START OF EACH INPUT CALL FROM DRIVER                            
*                                                                               
RECFTRS  DS    0C                  START OF COLUMN FILTERS                      
RECFCTY  DS    XL(L'RECTY)         CONTRACT TYPE                                
RECFCTYC DS    XL1                 CONTRACT TYPE CONTROL BYTE                   
*                                     SEE FLTCTL FOR DESCRIPTION                
         DS    XL62                REST OF AREA                                 
RECFTRSL EQU   *-RECFTRS           LENGTH OF COLUMN FILTERS                     
*                                                                               
*        TABLE OF REPS INVOLVED WITH CROSS-FILE REPORTING                       
*                                                                               
REXFREP  DS    0XL3                CROSS FILE REPORTING REPS                    
REXFRPCH DS    XL2                   REP POWER CODE                             
REXFRPSE DS    XL1                   REP SE CODE                                
         DS    15XL3               ROOM FOR 15 MORE REPS                        
REXFREPL EQU   *-REXFREP           LENGTH OF CROSS FILE REP TABLE               
*                                                                               
*        DATES RELEVANT TO YTD PROCESSING                                       
*              START DATES REFER TO START OF YTD PERIOD                         
*                                                                               
REFYDTSC DS    0X                  YTD    DATES - COMPRESSED                    
REFYCRST DS    XL2                 CURRENT   START DATE - COMPRESSED            
REFYPRST DS    XL2                 PRIOR     START DATE - COMPRESSED            
REFYP2ST DS    XL2                 2YR PRIOR START DATE - COMPRESSED            
REFYNXST DS    XL2                 NEXT YR   START DATE - COMPRESSED            
REFYDTCL EQU   *-REFYDTSC          LENGTH OF YTD    DATES - COMPRESSED          
*                                                                               
REFYDTSB DS    0X                  YTD    DATES - COMPRESSED                    
REFYCRSB DS    XL3                 CURRENT   START DATE - BINARY                
REFYPRSB DS    XL3                 PRIOR     START DATE - BINARY                
REFYP2SB DS    XL3                 2YR PRIOR START DATE - BINARY                
REFYNXSB DS    XL3                 NEXT YR   START DATE - BINARY                
REFYDTBL EQU   *-REFYDTSB          LENGTH OF YTD    DATES - BINARY              
*                                                                               
REREQPRF DS    XL8                 REQUEST PROGRAM PROFILE                      
*                                    USED FOR ANY WRITER PROFILE OPTS           
*                                                                               
         DS    0D                                                               
REREPPRF DS    XL30                REP PROFILE                                  
*                                                                               
REPERTYP DS    XL1                 REQUEST PERIOD TYPES                         
REPRCURQ EQU   X'80'               CURRENT PERIOD                               
REPRPRIQ EQU   X'40'               PRIOR   PERIOD                               
REPRPR2Q EQU   X'20'               PRIOR 2 PERIOD                               
REPRNXTQ EQU   X'10'               NEXT    PERIOD                               
*                                                                               
*MN      DS    XL225               SPARE                                        
REORD    DS    CL4                 ORDER NUMBER                                 
RPTCON   DS    XL1                 PASS KEYWORD INDICATORY                      
CONPRST  EQU   X'80'           CON KEYWORD PRESENT                              
INBPRST  EQU   X'40'           INBOX KEYWORD PRESENT                            
ORDPRST  EQU   X'20'           DARE ORD/STA KEYWORD PRESENT                     
MGOPRST  EQU   X'10'           MAKEGOOD KEYWORD PRESENT                         
CPEPRST  EQU   X'08'           CLI/PRD1/PRD2/EST KEYWORD PRESENT                
READDAR  EQU   X'04'           ONLY READ DARE IF USING ORD,INBOX                
READMGO  EQU   X'02'                                                            
         DS    XL220               SPARE                                        
*MN                                                                             
*                                                                               
REEND    DS    0C                                                               
