*          DATA SET RENWRFFD   AT LEVEL 001 AS OF 03/14/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T830FFD      DATE 03/14/97                 
         SPACE 1                                                                
T830FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CONHEADH DS    CL8                                                              
CONHEAD  DS    CL60     1    2   60  A  P N             T        Y              
CONSERVH DS    CL8                                                              
CONSERV  DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  A  P H             T        Y    1         
         DS    CL8                                                              
CONRECH  DS    CL8                                                              
CONREC   DS    CL8      3   10    8  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      3   20    6  A  P H             T        Y    2         
         DS    CL8                                                              
CONACTH  DS    CL8                                                              
CONACT   DS    CL8      3   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      3   38    3  A  P N             T        Y    3         
         DS    CL8                                                              
CONKEYH  DS    CL8                                                              
CONKEY   DS    CL34     3   46   34  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      4    2    5  A  P H             T        Y    4         
         DS    CL8                                                              
CONWHENH DS    CL8                                                              
CONWHEN  DS    CL8      4   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   20    6  A  P N             T        Y    5         
         DS    CL8                                                              
CONOUTH  DS    CL8                                                              
CONOUT   DS    CL8      4   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      4   38    5  A  P N             T        Y    6         
         DS    CL8                                                              
CONDESTH DS    CL8                                                              
CONDEST  DS    CL8      4   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   56    6  A  P N             T        Y    7         
         DS    CL8                                                              
CONOTHH  DS    CL8                                                              
CONOTH   DS    CL16     4   64   16  A  U N             T        Y              
CONTAGH  DS    CL8                                                              
CONTAG   DS    CL1      5    2    1  A  P N             T        Y              
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 464  BYTES                            
