*          DATA SET RENWRDSCTS AT LEVEL 130 AS OF 06/15/05                      
         TITLE 'RENWRDSCTS - STANDARD TABLE - STDTTABD'                         
***********************************************************************         
*                                                                     *         
*        STANDARD LAYOUT FOR A TABLE                                  *         
*              CONTAINING SET RECORD                                  *         
*                         RECORDS OF TYPE                             *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
STDTTABD DSECT                     STANDARD TABLE                               
*                                                                               
*        BXLE PARAMETERS FOR STANDARD TABLE                                     
*                                                                               
         DS    0A                  ALIGNMENT                                    
STDTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
STDTSTRA DS    A                   A(START OF STANDARD ENTRIES)                 
STDTLEN  DS    F                   LENGTH OF ENTRY IN STANDARD TABLE            
STDTENDA DS    A                   A(END OF STANDARD ENTRIES)                   
*                                                                               
STDTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
STDTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
STDTSKEY DS    XL34                STANDARD SET RECORD KEY                      
STDTS1EL DS    XL16                STANDARD SET RECORD BASIC INFO ELM           
STDTSDSC DS    XL240               STANDARD SET RECORD DESC ELM                 
STDTSMEM DS    XL256               STANDARD SET RECORD MEMBERS ELM              
*                                                                               
STDTOHDQ EQU   *-STDTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        STANDARDS                                                              
*                                                                               
STDTTAB  DS    0A                  START OF STANDARD TABLE                      
*                                                                               
*        STANDARD TABLE ENTRY - MULTIPLE OCCURRENCES                            
*                                                                               
STDTENT  DS    0X                  STANDARD ENTRY IN TABLE                      
STDTKEY  DS    XL34                STANDARD RECORD KEY                          
STDTELM  DS    XL222               STANDARD RECORD STANDARD ELEMENT             
STDTENTL EQU   *-STDTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (STDTMAXQ-1)XL(STDTENTL) REST OF TABLE                           
*                                                                               
STDTABLX EQU   *-1                 END OF TABLE                                 
*                                                                               
STDTMAXQ EQU   100                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - ADVERTISER TABLE - ADVTTABD'                       
***********************************************************************         
*                                                                     *         
*        ADVERTISER TABLE - HOLDING ADVERTISER RECORDS                *         
*                              ADVERTISER SET RECORD                  *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
ADVTTABD DSECT                     ADVERTISER TABLE                             
*                                                                               
*        BINSRCH PARAMETERS FOR ADVERTISER TABLE                                
*                                                                               
         DS    0A                  ALIGNMENT                                    
ADVTBSRP DS    XL(BSPPRML)         BINSRCH PARAMETERS                           
*                                                                               
ADVTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
ADVTSKEY DS    XL34                ADVERTISER SET RECORD KEY                    
ADVTS1EL DS    XL16                ADVERTISER SET RECORD BASIC INFO ELM         
ADVTSDSC DS    XL240               ADVERTISER SET RECORD DESC ELM               
ADVTSMEM DS    XL256               ADVERTISER SET RECORD MEMBERS ELM            
*                                                                               
ADVTOHDQ EQU   *-ADVTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        ADVERTISERS                                                            
*                                                                               
ADVTTAB  DS    0A                  START OF ADVERTISER TABLE                    
*                                                                               
*        ADVERTISER TABLE ENTRY - MULTIPLE OCCURRENCES                          
*                                                                               
ADVTENT  DS    0X                  ADVERTISER ENTRY IN TABLE                    
ADVTKEY  DS    XL34                ADVERTISER RECORD KEY                        
ADVTELM  DS    XL56                ADVERTISER RECORD ADVERTISER ELEMENT         
ADVTENTL EQU   *-ADVTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (ADVTMAXQ-1)XL(ADVTENTL) REST OF TABLE                           
*                                                                               
ADVTABLX EQU   *-1                 END OF TABLE                                 
*                                                                               
ADVTMAXQ EQU   15000               MAX NUMBER OF ENTRIES IN TABLE               
*ADVTMAXQ EQU   12000               MAX NUMBER OF ENTRIES IN TABLE              
*                                                                               
         TITLE 'RENWRDSCTS - AGENCY TABLE - AGYTTABD'                           
***********************************************************************         
*                                                                     *         
*        AGENCY TABLE - HOLDING AGENCY RECORDS                        *         
*                              AGENCY SET RECORD                      *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
AGYTTABD DSECT                     AGENCY TABLE                                 
*                                                                               
*        BXLE PARAMETERS FOR AGENCY TABLE                                       
*                                                                               
         DS    0A                  ALIGNMENT                                    
AGYTBSRP DS    XL(BSPPRML)         BINSRCH PARAMETERS                           
*                                                                               
AGYTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
AGYTSKEY DS    XL34                AGENCY SET RECORD KEY                        
AGYTS1EL DS    XL16                AGENCY SET RECORD BASIC INFO  ELM            
AGYTSDSC DS    XL240               AGENCY SET RECORD DESCRIPTION ELM            
AGYTSMEM DS    XL256               AGENCY SET RECORD MEMBERS     ELM            
*                                                                               
AGYTOHDQ EQU   *-AGYTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        AGENCYS                                                                
*                                                                               
AGYTTAB  DS    0A                  START OF AGENCY TABLE                        
*                                                                               
*        AGENCY TABLE ENTRY - MULTIPLE OCCURRENCES                              
*                                                                               
AGYTENT  DS    0X                  AGENCY ENTRY IN TABLE                        
AGYTKEY  DS    XL34                AGENCY RECORD KEY                            
AGYTELM  DS    XL55                AGENCY RECORD AGENCY ELEMENT                 
AGYTEXAD DS    XL102               AGENCY EXPANDED ADDRESS ELEMENT              
AGYTFAX  DS    XL52                AGENCY RECORD FAX ELEMENT                    
AGYTENTL EQU   *-AGYTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (AGYTMAXQ-1)XL(AGYTENTL) REST OF TABLE                           
*                                                                               
AGYTABLX EQU   *-1                 END OF TABLE                                 
*                                                                               
AGYTMAXQ EQU   6000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - AGENCY TABLE - AG2TTABD'                           
***********************************************************************         
*                                                                     *         
*        AGENCY SECOND TABLE - HOLDING AGENCY DAT FROM SECOND         *         
*                              AGENCY RECORD                          *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
AG2TTABD DSECT                     AGENCY TABLE                                 
*                                                                               
*        BXLE PARAMETERS FOR AGENCY SECOND TABLE                                
*                                                                               
         DS    0A                  ALIGNMENT                                    
AG2TBSRP DS    XL(BSPPRML)         BINSRCH PARAMETERS                           
*                                                                               
AG2TENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
AG2TOHDQ EQU   *-AG2TTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        AGENCYS                                                                
*                                                                               
AG2TTAB  DS    0A                  START OF AGENCY TABLE                        
*                                                                               
*        AGENCY TABLE ENTRY - MULTIPLE OCCURRENCES                              
*                                                                               
AG2TENT  DS    0X                  AGENCY ENTRY IN TABLE                        
AG2TKEY  DS    XL34                AGENCY RECORD KEY                            
AG2T2FXE DS    XL64                AGENCY RECORD FAX ELEMENT                    
AG2T2AE1 DS    XL128               AGENCY EXPANDED ADDRESS ELEMENT              
AG2TENTL EQU   *-AG2TENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (AG2TMAXQ-1)XL(AG2TENTL) REST OF TABLE                           
*                                                                               
AG2TABLX EQU   *-1                 END OF TABLE                                 
*                                                                               
AG2TMAXQ EQU   6000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - CLASS TABLE - CLSTTABD'                            
***********************************************************************         
*                                                                     *         
*        CLASS TABLE - HOLDING CLASS RECORDS                          *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
CLSTTABD DSECT                     CLASS TABLE                                  
*                                                                               
*        BXLE PARAMETERS FOR CLASS TABLE                                        
*                                                                               
         DS    0A                  ALIGNMENT                                    
CLSTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
CLSTSTRA DS    A                   A(START OF CLASS ENTRIES)                    
CLSTLEN  DS    F                   LENGTH OF ENTRY IN CLASS TABLE               
CLSTENDA DS    A                   A(END OF CLASS ENTRIES)                      
*                                                                               
CLSTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
CLSTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
CLSTOHDQ EQU   *-CLSTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        CLASSES                                                                
*                                                                               
CLSTTAB  DS    0A                  START OF CLASS TABLE                         
*                                                                               
*        CLASS TABLE ENTRY - MULTIPLE OCCURRENCES                               
*                                                                               
CLSTENT  DS    0X                  CLASS ENTRY IN TABLE                         
CLSTKEY  DS    XL34                CLASS RECORD KEY                             
CLSTELM  DS    XL222               CLASS RECORD CLASS ELEMENT                   
CLSTENTL EQU   *-CLSTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (CLSTMAXQ-1)XL(CLSTENTL) REST OF TABLE                           
*                                                                               
CLSTTABX EQU   *-1                  END OF TABLE                                
*                                                                               
CLSTMAXQ EQU   300                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - CLASS TABLE - CRTTTABD'                            
***********************************************************************         
*                                                                     *         
*        COMMISSION RATE TABLE - HOLDING RATES FOR ONE STATION AT     *         
*              A TIME                                                 *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
COMTTABD DSECT                     RATE TABLE                                   
*                                                                               
*        BXLE PARAMETERS FOR RATE TABLE                                         
*                                                                               
         DS    0A                  ALIGNMENT                                    
COMTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
COMTSTRA DS    A                   A(START OF RATE ENTRIES)                     
COMTLEN  DS    F                   LENGTH OF ENTRY IN RATE TABLE                
COMTENDA DS    A                   A(END OF RATE ENTRIES)                       
*                                                                               
COMTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
COMTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
COMTOHDQ EQU   *-COMTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        COMMISSION RATES                                                       
*                                                                               
COMTTAB  DS    0A                  START OF RATE TABLE                          
*                                                                               
*        RATE TABLE ENTRY - MULTIPLE OCCURRENCES                                
*                                                                               
COMTENT  DS    0X                  RATE ENTRY IN TABLE                          
COMTKEY  DS    XL34                RATE RECORD KEY                              
COMTELM  DS    XL32                RATE RECORD RATE ELEMENT                     
COMTENTL EQU   *-COMTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (COMTMAXQ-1)XL(COMTENTL) REST OF TABLE                           
*                                                                               
COMTTABX EQU   *-1                  END OF TABLE                                
*                                                                               
COMTMAXQ EQU   300                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - CATEGORY TABLE - CTGTTABD'                         
***********************************************************************         
*                                                                     *         
*        CATEGORY TABLE - HOLDING CATEGORY RECORDS                    *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
CTGTTABD DSECT                     CATEGORY TABLE                               
*                                                                               
*        BXLE PARAMETERS FOR CATEGORY TABLE                                     
*                                                                               
         DS    0A                  ALIGNMENT                                    
CTGTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
CTGTSTRA DS    A                   A(START OF CATEGORY ENTRIES)                 
CTGTLEN  DS    F                   LENGTH OF ENTRY IN TABLE                     
CTGTENDA DS    A                   A(END OF CATEGORY ENTRIES)                   
*                                                                               
CTGTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
CTGTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
CTGTOHDQ EQU   *-CTGTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        CATEGORIES                                                             
*                                                                               
CTGTTAB  DS    0A                  START OF CATEGORY TABLE                      
*                                                                               
*        CATEGORY TABLE ENTRY - MULTIPLE OCCURRENCES                            
*                                                                               
CTGTENT  DS    0X                  CATEGORY ENTRY IN TABLE                      
CTGTKEY  DS    XL34                CATEGORY RECORD KEY                          
CTGTELM  DS    XL222               CATEGORY RECORD ELEMENT                      
CTGTENTL EQU   *-CTGTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (CTGTMAXQ-1)XL(CTGTENTL) REST OF TABLE                           
*                                                                               
CTGTTABX EQU   *-1                  END OF TABLE                                
*                                                                               
CTGTMAXQ EQU   300                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - CONTRACT TYPE TABLE - CTYTTABD'                    
***********************************************************************         
*                                                                     *         
*        CONTRACT TYPE TABLE - HOLDING CONTRACT TYPE RECORDS          *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
CTYTTABD DSECT                     CONTRACT TYPE TABLE                          
*                                                                               
*        BXLE PARAMETERS FOR CONTRACT TYPE TABLE                                
*                                                                               
         DS    0A                  ALIGNMENT                                    
CTYTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
CTYTSTRA DS    A                   A(START OF CONTRACT TYPE ENTRIES)            
CTYTLEN  DS    F                   LENGTH OF ENTRY IN TABLE                     
CTYTENDA DS    A                   A(END OF CONTRACT TYPE ENTRIES)              
*                                                                               
CTYTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
CTYTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
CTYTSKEY DS    XL34                CONTRACT TYPE SET RECORD KEY                 
CTYTS1EL DS    XL16                CONTRACT TYPE SET RECORD BASIC ELM           
CTYTSDSC DS    XL240               CONTRACT TYPE SET RECORD DESC ELM            
CTYTSMEM DS    XL256               CONTRACT TYPE SET RECORD MEMBERS ELM         
*                                                                               
CTYTOHDQ EQU   *-CTYTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        CATEGORIES                                                             
*                                                                               
CTYTTAB  DS    0A                  START OF CONTRACT TYPE TABLE                 
*                                                                               
*        CONTRACT TYPE TABLE ENTRY - MULTIPLE OCCURRENCES                       
*                                                                               
CTYTENT  DS    0X                  CONTRACT TYPE ENTRY IN TABLE                 
CTYTKEY  DS    XL34                CONTRACT TYPE RECORD KEY                     
CTYTELM  DS    XL50                CONTRACT TYPE RECORD ELEMENT                 
CTYTENTL EQU   *-CTYTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (CTYTMAXQ-1)XL(CTYTENTL) REST OF TABLE                           
*                                                                               
CTYTTABX EQU   *-1                  END OF TABLE                                
*                                                                               
CTYTMAXQ EQU   100                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - GROUP TABLE - DSPTTABD'                            
***********************************************************************         
*                                                                     *         
*        DEVELOP SALES TABLE - HOLDING DEVELOP SALES RECORDS          *         
*                              DEVELOP SALES SET RECORD               *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
DSPTTABD DSECT                     DEVELOP SALES TABLE                          
*                                                                               
*        BXLE PARAMETERS FOR DEVELOP SALES TABLE                                
*                                                                               
         DS    0A                  ALIGNMENT                                    
DSPTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
DSPTSTRA DS    A                   A(START OF DEVELOP SALES ENTRIES)            
DSPTLEN  DS    F                   LENGTH OF ENTRY IN GROUP TABLE               
DSPTENDA DS    A                   A(END OF DEVELOP SALES ENTRIES)              
*                                                                               
DSPTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
DSPTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
DSPTSKEY DS    XL34                DEVELOP SALES SET RECORD KEY                 
DSPTS1EL DS    XL16                DEVELOP SALES SET RECORD BASIC ELM           
DSPTSDSC DS    XL240               DEVELOP SALES SET RECORD DESC ELM            
DSPTSMEM DS    XL256               DEVELOP SALES SET RECORD MEMBERS ELM         
*                                                                               
DSPTOHDQ EQU   *-DSPTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        DEVELOP SALES                                                          
*                                                                               
DSPTTAB  DS    0A                  START OF DEVELOP SALES TABLE                 
*                                                                               
*        DEVELOP SALES TABLE ENTRY - MULTIPLE OCCURRENCES                       
*                                                                               
DSPTENT  DS    0X                  DEVELOP SALES ENTRY IN TABLE                 
DSPTKEY  DS    XL34                DEVELOP SALES RECORD KEY                     
DSPTELM  DS    XL222               DEVELOP SALES RECORD ELEMENT                 
DSPTENTL EQU   *-DSPTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (DSPTMAXQ-1)XL(DSPTENTL) REST OF TABLE                           
*                                                                               
DSPTABLX EQU   *-1                 END OF TABLE                                 
*                                                                               
DSPTMAXQ EQU   1000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - GROUP TABLE - DCTTTABD'                            
***********************************************************************         
*                                                                     *         
*        DEVELOP TYPE TABLE - HOLDING DEVELOP TYPE RECORDS            *         
*                              DEVELOP TYPE SET RECORD                *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
DCTTTABD DSECT                     DEVELOP TYPE TABLE                           
*                                                                               
*        BXLE PARAMETERS FOR DEVELOP TYPE TABLE                                 
*                                                                               
         DS    0A                  ALIGNMENT                                    
DCTTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
DCTTSTRA DS    A                   A(START OF DEVELOP TYPE ENTRIES)             
DCTTLEN  DS    F                   LENGTH OF ENTRY IN GROUP TABLE               
DCTTENDA DS    A                   A(END OF DEVELOP TYPE ENTRIES)               
*                                                                               
DCTTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
DCTTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
DCTTSKEY DS    XL34                DEVELOP TYPE SET RECORD KEY                  
DCTTS1EL DS    XL16                DEVELOP TYPE SET RECORD BASIC ELM            
DCTTSDSC DS    XL240               DEVELOP TYPE SET RECORD DESC ELM             
DCTTSMEM DS    XL256               DEVELOP TYPE SET RECORD MEMBERS ELM          
*                                                                               
DCTTOHDQ EQU   *-DCTTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        DEVELOP TYPES                                                          
*                                                                               
DCTTTAB  DS    0A                  START OF DEVELOP TYPE TABLE                  
*                                                                               
*        DEVELOP TYPE TABLE ENTRY - MULTIPLE OCCURRENCES                        
*                                                                               
DCTTENT  DS    0X                  DEVELOP TYPE ENTRY IN TABLE                  
DCTTKEY  DS    XL34                DEVELOP TYPE RECORD KEY                      
DCTTELM  DS    XL222               DEVELOP TYPE RECORD ELEMENT                  
DCTTENTL EQU   *-DCTTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (DCTTMAXQ-1)XL(DCTTENTL) REST OF TABLE                           
*                                                                               
DCTTABLX EQU   *-1                 END OF TABLE                                 
*                                                                               
DCTTMAXQ EQU   300                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - GROUP TABLE - GRPTTABD'                            
***********************************************************************         
*                                                                     *         
*        GROUP TABLE - HOLDING GROUP RECORDS                          *         
*                              GROUP SET RECORD                       *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
GRPTTABD DSECT                     GROUP TABLE                                  
*                                                                               
*        BXLE PARAMETERS FOR GROUP TABLE                                        
*                                                                               
         DS    0A                  ALIGNMENT                                    
GRPTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
GRPTSTRA DS    A                   A(START OF GROUP ENTRIES)                    
GRPTLEN  DS    F                   LENGTH OF ENTRY IN GROUP TABLE               
GRPTENDA DS    A                   A(END OF GROUP ENTRIES)                      
*                                                                               
GRPTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
GRPTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
GRPTSKEY DS    XL34                GROUP SET RECORD KEY                         
GRPTS1EL DS    XL16                GROUP SET RECORD BASIC ELM                   
GRPTSDSC DS    XL240               GROUP SET RECORD DESCRIPTION ELM             
GRPTSMEM DS    XL256               GROUP SET RECORD MEMBERS      ELM            
*                                                                               
GRPTOHDQ EQU   *-GRPTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        GROUPS                                                                 
*                                                                               
GRPTTAB  DS    0A                  START OF GROUP TABLE                         
*                                                                               
*        GROUP TABLE ENTRY - MULTIPLE OCCURRENCES                               
*                                                                               
GRPTENT  DS    0X                  GROUP ENTRY IN TABLE                         
GRPTKEY  DS    XL34                GROUP RECORD KEY                             
GRPTELM  DS    XL128               GROUP RECORD GROUP ELEMENT                   
*                                                                               
GRPTRID  DS    XL1                 GROUP RGON ID                                
GRPTRGPQ EQU   X'19'               SINGLE CHARACTER FOR GROUP                   
GRPTRSGQ EQU   X'07'               2 CHARACTERS GRP/SGRP                        
*                                                                               
GRPTENTL EQU   *-GRPTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (GRPTMAXQ-1)XL(GRPTENTL) REST OF TABLE                           
*                                                                               
GRPTABLX EQU   *-1                 END OF TABLE                                 
*                                                                               
GRPTMAXQ EQU   200                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - MARKET TABLE - MKTTTABD'                           
***********************************************************************         
*                                                                     *         
*        MARKET TABLE - HOLDING MARKET RECORDS                        *         
*                               MARKET SET RECORD                     *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
MKTTTABD DSECT                     MARKET TABLE                                 
*                                                                               
*        BXLE PARAMETERS FOR MARKET TABLE                                       
*                                                                               
         DS    0A                  ALIGNMENT                                    
MKTTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
MKTTSTRA DS    A                   A(START OF MARKET ENTRIES)                   
MKTTLEN  DS    F                   LENGTH OF ENTRY IN MARKET TABLE              
MKTTENDA DS    A                   A(END OF MARKET ENTRIES)                     
*                                                                               
MKTTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
MKTTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
MKTTSKEY DS    XL34                MARKET SET RECORD KEY                        
MKTTS1EL DS    XL16                MARKET SET RECORD BASIC ELM                  
MKTTSDSC DS    XL240               MARKET SET RECORD DESCRIPTION ELM            
MKTTSMEM DS    XL256               MARKET SET RECORD MEMBERS     ELM            
*                                                                               
MKTTOHDQ EQU   *-MKTTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        MARKETS                                                                
*                                                                               
MKTTTAB  DS   0A                  START OF MARKET TABLE                         
*                                                                               
*        MARKET TABLE ENTRY - MULTIPLE OCCURRENCES                              
*                                                                               
MKTTENT  DS    0X                  MARKET ENTRY IN TABLE                        
MKTTKEY  DS    XL34                MARKET RECORD KEY                            
MKTTELM  DS    XL50                MARKET RECORD MARKET ELEMENT                 
MKTTENTL EQU   *-MKTTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (MKTTMAXQ-1)XL(MKTTENTL) REST OF TABLE                           
*                                                                               
MKTTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
MKTTMAXQ EQU   2000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - OFFICE TABLE - OFFTTABD'                           
***********************************************************************         
*                                                                     *         
*        OFFICE TABLE - HOLDING OFFICE RECORDS                        *         
*                               OFFICE SET RECORD                     *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
OFFTTABD DSECT                     OFFICE TABLE                                 
*                                                                               
*        BXLE PARAMETERS FOR OFFICE TABLE                                       
*                                                                               
         DS    0A                  ALIGNMENT                                    
OFFTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
OFFTSTRA DS    A                   A(START OF OFFICE ENTRIES)                   
OFFTLEN  DS    F                   LENGTH OF ENTRY IN OFFICE TABLE              
OFFTENDA DS    A                   A(END OF OFFICE ENTRIES)                     
*                                                                               
OFFTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
OFFTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
OFFTSKEY DS    XL34                OFFICE SET RECORD KEY                        
OFFTS1EL DS    XL16                OFFICE SET RECORD BASIC ELM                  
OFFTSDSC DS    XL240               OFFICE SET RECORD DESCRIPTION ELM            
OFFTSMEM DS    XL256               OFFICE SET RECORD MEMBERS     ELM            
*                                                                               
OFFTOHDQ EQU   *-OFFTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        OFFICES                                                                
*                                                                               
OFFTTAB  DS   0A                  START OF OFFICE TABLE                         
*                                                                               
*        OFFICE TABLE ENTRY - MULTIPLE OCCURRENCES                              
*                                                                               
OFFTENT  DS    0X                  OFFICE ENTRY IN TABLE                        
OFFTKEY  DS    XL34                OFFICE RECORD KEY                            
OFFTELM  DS    XL222               OFFICE RECORD OFFICE ELEMENT                 
OFFTENTL EQU   *-OFFTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (OFFTMAXQ-1)XL(OFFTENTL) REST OF TABLE                           
*                                                                               
OFFTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
OFFTMAXQ EQU   300                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - OWNER TABLE - OWNTTABD'                            
***********************************************************************         
*                                                                     *         
*        OWNER TABLE - HOLDING OWNER RECORDS                          *         
*                               OWNER SET RECORD                      *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
OWNTTABD DSECT                     OWNER TABLE                                  
*                                                                               
*        BXLE PARAMETERS FOR OWNER TABLE                                        
*                                                                               
         DS    0A                  ALIGNMENT                                    
OWNTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
OWNTSTRA DS    A                   A(START OF OWNER ENTRIES)                    
OWNTLEN  DS    F                   LENGTH OF ENTRY IN OWNER TABLE               
OWNTENDA DS    A                   A(END OF OWNER ENTRIES)                      
*                                                                               
OWNTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
OWNTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
OWNTSKEY DS    XL34                OWNER SET RECORD KEY                         
OWNTS1EL DS    XL16                OWNER SET RECORD BASIC ELM                   
OWNTSDSC DS    XL240               OWNER SET RECORD DESCRIPTION ELM             
OWNTSMEM DS    XL256               OWNER SET RECORD MEMBERS      ELM            
*                                                                               
OWNTOHDQ EQU   *-OWNTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        OWNERS                                                                 
*                                                                               
OWNTTAB  DS   0A                  START OF OWNER TABLE                          
*                                                                               
*        OWNER TABLE ENTRY - MULTIPLE OCCURRENCES                               
*                                                                               
OWNTENT  DS    0X                  OWNER ENTRY IN TABLE                         
OWNTKEY  DS    XL34                OWNER RECORD KEY                             
OWNTELM  DS    XL222               OWNER RECORD OWNER ELEMENT                   
OWNTENTL EQU   *-OWNTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (OWNTMAXQ-1)XL(OWNTENTL) REST OF TABLE                           
*                                                                               
OWNTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
OWNTMAXQ EQU   2000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - GROUP TABLE - PTPTTABD'                            
***********************************************************************         
*                                                                     *         
*        POINT PERSON TABLE - HOLDING POINT PERSON RECORDS            *         
*                              POINT PERSON SET RECORD                *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
PTPTTABD DSECT                     POINT PERSON TABLE                           
*                                                                               
*        BXLE PARAMETERS FOR POINT PERSON TABLE                                 
*                                                                               
         DS    0A                  ALIGNMENT                                    
PTPTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
PTPTSTRA DS    A                   A(START OF POINT PERSON ENTRIES)             
PTPTLEN  DS    F                   LENGTH OF ENTRY IN GROUP TABLE               
PTPTENDA DS    A                   A(END OF POINT PERSON ENTRIES)               
*                                                                               
PTPTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
PTPTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
PTPTSKEY DS    XL34                POINT PERSON SET RECORD KEY                  
PTPTS1EL DS    XL16                POINT PERSON SET RECORD BASIC ELM            
PTPTSDSC DS    XL240               POINT PERSON SET RECORD DESC ELM             
PTPTSMEM DS    XL256               POINT PERSON SET RECORD MEMBERS ELM          
*                                                                               
PTPTOHDQ EQU   *-PTPTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        POINT PERSONS                                                          
*                                                                               
PTPTTAB  DS    0A                  START OF POINT PERSON TABLE                  
*                                                                               
*        POINT PERSON TABLE ENTRY - MULTIPLE OCCURRENCES                        
*                                                                               
PTPTENT  DS    0X                  POINT PERSON ENTRY IN TABLE                  
PTPTKEY  DS    XL34                POINT PERSON RECORD KEY                      
PTPTELM  DS    XL222               POINT PERSON RECORD ELEMENT                  
PTPTENTL EQU   *-PTPTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (PTPTMAXQ-1)XL(PTPTENTL) REST OF TABLE                           
*                                                                               
PTPTABLX EQU   *-1                 END OF TABLE                                 
*                                                                               
PTPTMAXQ EQU   1000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - PRODUCT TABLE - PRDTTABD'                          
***********************************************************************         
*                                                                     *         
*        PRD TABLE - HOLDING PRD RECORDS                              *         
*                               PRD SET RECORD                        *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
PRDTTABD DSECT                     PRODUCT TABLE                                
*                                                                               
         DS    0A                  ALIGNMENT                                    
PRDTBSRP DS    XL(BSPPRML)         BINSRCH PARAMETERS                           
*                                                                               
PRDTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
PRDTSKEY DS    XL34                PRODUCT SET RECORD KEY                       
PRDTS1EL DS    XL16                PRODUCT SET RECORD BASIC ELM                 
PRDTSDSC DS    XL240               PRODUCT SET RECORD DESCRIPTION ELM           
PRDTSMEM DS    XL256               PRODUCT SET RECORD MEMBERS    ELM            
*                                                                               
PRDTOHDQ EQU   *-PRDTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        PRODUCTS                                                               
*                                                                               
PRDTTAB  DS   0A                  START OF PRD TABLE                            
*                                                                               
*        PRODUCT TABLE ENTRY - MULTIPLE OCCURRENCES                             
*                                                                               
PRDTENT  DS    0X                  PRODUCT ENTRY IN TABLE                       
PRDTKEY  DS    XL34                PRODUCT RECORD KEY                           
PRDTELM  DS    XL75                PRODUCT RECORD PRODUCT ELEMENT               
PRDTENTL EQU   *-PRDTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (PRDTMAXQ-1)XL(PRDTENTL) REST OF TABLE                           
*                                                                               
PRDTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
PRDTMAXQ EQU   8000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - REGION TABLE - REGTTABD'                           
***********************************************************************         
*                                                                     *         
*        REGION TABLE - HOLDING REGION RECORDS                        *         
*                               REGION SET RECORD                     *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
REGTTABD DSECT                     REGION TABLE                                 
*                                                                               
*        BXLE PARAMETERS FOR REGION TABLE                                       
*                                                                               
         DS    0A                  ALIGNMENT                                    
REGTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
REGTSTRA DS    A                   A(START OF REGION ENTRIES)                   
REGTLEN  DS    F                   LENGTH OF ENTRY IN REGION TABLE              
REGTENDA DS    A                   A(END OF REGION ENTRIES)                     
*                                                                               
REGTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
REGTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
REGTSKEY DS    XL34                REGION SET RECORD KEY                        
REGTS1EL DS    XL16                REGION SET RECORD BASIC ELM                  
REGTSDSC DS    XL240               REGION SET RECORD DESCRIPTION ELM            
REGTSMEM DS    XL256               REGION SET RECORD MEMBERS     ELM            
*                                                                               
REGTOHDQ EQU   *-REGTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        REGIONS                                                                
*                                                                               
REGTTAB  DS   0A                   START OF REGION TABLE                        
*                                                                               
*        REGION TABLE ENTRY - MULTIPLE OCCURRENCES                              
*                                                                               
REGTENT  DS    0X                  REGION ENTRY IN TABLE                        
REGTKEY  DS    XL34                REGION RECORD KEY                            
REGTELM  DS    XL222               REGION RECORD REGION ELEMENT                 
REGTENTL EQU   *-REGTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (REGTMAXQ-1)XL(REGTENTL) REST OF TABLE                           
*                                                                               
REGTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
REGTMAXQ EQU   300                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - REP TABLE - REPTTABD'                              
***********************************************************************         
*                                                                     *         
*        REP TABLE - HOLDING REP RECORDS                              *         
*                               REP SET RECORD                        *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
REPTTABD DSECT                     REP TABLE                                    
*                                                                               
*        BINSRCH PARAMETERS FOR REP TABLE                                       
*                                                                               
         DS    0A                  ALIGNMENT                                    
REPTBSRP DS    XL(BSPPRML)         BINSRCH PARAMETERS                           
*                                                                               
REPTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
REPTSKEY DS    XL34                REP SET RECORD KEY                           
REPTS1EL DS    XL16                REP SET RECORD BASIC INFO ELM                
REPTSDSC DS    XL240               REP SET RECORD DESCRIPTION ELM               
REPTSMEM DS    XL256               REP SET RECORD MEMBERS        ELM            
*                                                                               
REPTOHDQ EQU   *-REPTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        REPS                                                                   
*                                                                               
REPTTAB  DS   0A                  START OF REP TABLE                            
*                                                                               
*        REP TABLE ENTRY - MULTIPLE OCCURRENCES                                 
*                                                                               
REPTENT  DS    0X                  REP ENTRY IN TABLE                           
REPTKEY  DS    XL34                REP RECORD KEY                               
REPTELM  DS    XL180               REP RECORD REP ELEMENT                       
REPTSE   DS    XL1                 SE  CODE                                     
REPTGRP  DS    XL1                 GRP CODE FOR XFILE REPORTING                 
         DS    XL8                 SPARE                                        
REPTENTL EQU   *-REPTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (REPTMAXQ-1)XL(REPTENTL) REST OF TABLE                           
*                                                                               
REPTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
REPTMAXQ EQU   100                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - SALESPERSON TABLE - SALTTABD'                      
***********************************************************************         
*                                                                     *         
*        SALESPERSON TABLE - HOLDING SALESPERSON RECORDS              *         
*                               SALESPERSON SET RECORD                *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
SALTTABD DSECT                     SALESPERSON TABLE                            
*                                                                               
*        BXLE PARAMETERS FOR SALESPERSON TABLE                                  
*                                                                               
         DS    0A                  ALIGNMENT                                    
SALTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
SALTSTRA DS    A                   A(START OF SALESPERSON ENTRIES)              
SALTLEN  DS    F                   LENGTH OF ENTRY IN SALESPERSON TABLE         
SALTENDA DS    A                   A(END OF SALESPERSON ENTRIES)                
*                                                                               
SALTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
SALTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
SALTSKEY DS    XL34                SALESPERSON SET RECORD KEY                   
SALTS1EL DS    XL16                SALESPERSON SET RECORD BASIC ELM             
SALTSDSC DS    XL240               SALESPERSON SET RECORD DESC ELM              
SALTSMEM DS    XL256               SALESPERSON SET RECORD MEMBERS ELM           
*                                                                               
SALTOHDQ EQU   *-SALTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        SALESPERSONS                                                           
*                                                                               
SALTTAB  DS   0A                  START OF SALESPERSON TABLE                    
*                                                                               
*        SALESPERSON TABLE ENTRY - MULTIPLE OCCURRENCES                         
*                                                                               
SALTENT  DS    0X                  SALESPERSON ENTRY IN TABLE                   
SALTKEY  DS    XL34                SALESPERSON RECORD KEY                       
SALTELM  DS    XL90                SALESPERSON RECORD SAL ELEMENT               
SALTENTL EQU   *-SALTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (SALTMAXQ-1)XL(SALTENTL) REST OF TABLE                           
*                                                                               
SALTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
SALTMAXQ EQU   2000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - STATION TABLE - STATTABD'                          
***********************************************************************         
*                                                                     *         
*        STATION TABLE - HOLDING STATION RECORDS                      *         
*                               STATION SET RECORD                    *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
STATTABD DSECT                     STATION TABLE                                
*                                                                               
*        BINSRCH PARAMETERS FOR STATION TABLE                                   
*                                                                               
         DS    0A                  ALIGNMENT                                    
STATBSRP DS    XL(BSPPRML)         BINSRCH PARAMETERS                           
*                                                                               
STATENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
STATSKEY DS    XL34                STATION SET RECORD KEY                       
STATS1EL DS    XL16                STATION SET RECORD BASIC ELM                 
STATSDSC DS    XL240               STATION SET RECORD DESCRIPTION ELM           
STATSMEM DS    XL256               STATION SET RECORD MEMBERS    ELM            
*                                                                               
STATOHDQ EQU   *-STATTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        STATIONS                                                               
*                                                                               
STATTAB  DS   0A                  START OF STATION TABLE                        
*                                                                               
*        STATION TABLE ENTRY - MULTIPLE OCCURRENCES                             
*                                                                               
STATENT  DS    0X                  STATION ENTRY IN TABLE                       
STATKEY  DS    XL34                STATION RECORD KEY                           
*                                                                               
STATENTL EQU   *-STATENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (STATMAXQ-1)XL(STATENTL) REST OF TABLE                           
*                                                                               
STATTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
*MNS                                                                            
*STATMAXQ EQU   16000               MAX NUMBER OF ENTRIES IN TABLE              
STATMAXQ EQU   17000               MAX NUMBER OF ENTRIES IN TABLE               
*MNE                                                                            
*                                                                               
         TITLE 'RENWRDSCTS - STATION JOOIN/LEAVE DATES TAB - STJLTABD'          
***********************************************************************         
*                                                                     *         
*        STATION JOIN/LEAVE DATES TABLE                               *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
SJLTTABD DSECT                     SJLTION TABLE                                
*                                                                               
*        BINSRCH PARAMETERS FOR STATION JOIN/LEAVE TABLE                        
*                                                                               
         DS    0A                  ALIGNMENT                                    
SJLTBSRP DS    XL(BSPPRML)         BINSRCH PARAMETERS                           
*                                                                               
SJLTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
SJLTOHDQ EQU   *-SJLTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        STATION JOIN/LEAVE DATES                                               
*                                                                               
SJLTTAB  DS   0A                  START OF STATION JOIN/LEAVE TABLE             
*                                                                               
*        TABLE ENTRY - MULTIPLE OCCURRENCES                                     
*                                                                               
SJLTENT  DS    0X                  ENTRY IN TABLE                               
SJLTKEY  DS    0XL5                KEY                                          
SJLTCALL DS    XL5                 STATION CALL LETTERS                         
*                                                                               
SJLTDTES DS    0X                  START OF JOIN/LEAVE DATES                    
SJLTJOIN DS    XL3                 JOIN  DATE - YMD-BINARY                      
SJLTLEAV DS    XL3                 LEAVE DATE - YMD -BINARY                     
SJLTDTEL EQU   *-SJLTDTES          LENGTH OF DATES                              
*                                                                               
         DS    (SJLTDTMQ-1)XL(SJLTDTEL) REST OF DATES FOR STATION               
*                                                                               
SJLTENTL EQU   *-SJLTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (SJLTMAXQ-1)XL(SJLTENTL) REST OF TABLE                           
*                                                                               
SJLTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
SJLTDTMQ EQU   10                  MAX NUMBER OF DATES PER ENTRY                
SJLTMAXQ EQU   1000                MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - DIV/TEAM TABLE - TEMTTABD'                         
***********************************************************************         
*                                                                     *         
*        DIV/TEAM TABLE - HOLDING DIV/TEAM RECORDS                    *         
*                               DIV/TEAM SET RECORD                   *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
TEMTTABD DSECT                     DIV/TEAM TABLE                               
*                                                                               
*        BXLE PARAMETERS FOR DIV/TEAM TABLE                                     
*                                                                               
         DS    0A                  ALIGNMENT                                    
TEMTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
TEMTSTRA DS    A                   A(START OF DIV/TEAM ENTRIES)                 
TEMTLEN  DS    F                   LENGTH OF ENTRY IN DIV/TEAM TABLE            
TEMTENDA DS    A                   A(END OF DIV/TEAM ENTRIES)                   
*                                                                               
TEMTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
TEMTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
TEMTSKEY DS    XL34                DIV/TEAM SET RECORD KEY                      
TEMTS1EL DS    XL16                DIV/TEAM SET RECORD BASIC ELM                
TEMTSDSC DS    XL240               DIV/TEAM SET RECORD DESCRIPTION ELM          
TEMTSMEM DS    XL256               DIV/TEAM SET RECORD MEMBERS   ELM            
*                                                                               
TEMTOHDQ EQU   *-TEMTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        DIV/TEAMS                                                              
*                                                                               
TEMTTAB  DS   0A                  START OF DIV/TEAM TABLE                       
*                                                                               
*        DIV/TEAM TABLE ENTRY - MULTIPLE OCCURRENCES                            
*                                                                               
TEMTENT  DS    0X                  DIV/TEAM ENTRY IN TABLE                      
TEMTKEY  DS    XL34                DIV/TEAM RECORD KEY                          
TEMTELM  DS    XL222               DIV/TEAM RECORD DIV/TEAM ELEMENT             
TEMTENTL EQU   *-TEMTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (TEMTMAXQ-1)XL(TEMTENTL) REST OF TABLE                           
*                                                                               
TEMTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
TEMTMAXQ EQU   200                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - TERRITORY TABLE - TERTTABD'                        
***********************************************************************         
*                                                                     *         
*        TERRITORY TABLE - HOLDING TERRITORY RECORDS                  *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
TERTTABD DSECT                     TERRITORIES TABLE                            
*                                                                               
*        BXLE PARAMETERS FOR DIV/TEAM TABLE                                     
*                                                                               
         DS    0A                  ALIGNMENT                                    
TERTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
TERTSTRA DS    A                   A(START OF TERRITORY ENTRIES)                
TERTLEN  DS    F                   LENGTH OF ENTRY IN TERRITORY TABLE           
TERTENDA DS    A                   A(END OF TERRITORY ENTRIES)                  
*                                                                               
TERTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
TERTENTA DS    A                   A(CURRENT TABLE ENTRY)                       
*                                                                               
TERTSKEY DS    XL34                TERRITORY SET RECORD KEY                     
TERTS1EL DS    XL16                TERRITORY SET RECORD BASIC ELM               
TERTSDSC DS    XL240               TERRITORY SET RECORD DESCRIPTION ELM         
TERTSMEM DS    XL256               TERRITORY SET RECORD MEMBERS  ELM            
*                                                                               
TERTOHDQ EQU   *-TERTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        TERRITORIES                                                            
*                                                                               
TERTTAB  DS   0A                  START OF TERRITORY TABLE                      
*                                                                               
*        TERRITORY TABLE ENTRY - MULTIPLE OCCURRENCES                           
*                                                                               
TERTENT  DS    0X                  TERRITORY ENTRY IN TABLE                     
TERTKEY  DS    XL34                TERRITORY RECORD KEY                         
TERTELM  DS    XL222               TERRITORY RECORD TERRITORY ELEMENT           
TERTENTL EQU   *-TERTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (TERTMAXQ-1)XL(TERTENTL) REST OF TABLE                           
*                                                                               
TERTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
TERTMAXQ EQU   200                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - BUY CODE TABLE - BCDTTABD'                         
***********************************************************************         
*                                                                     *         
*        BUY CODE  TABLE - HOLDING SPECIAL BUY CODE RECORDS           *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
BCDTTABD DSECT                     TERRITORIES TABLE                            
*                                                                               
*        BXLE PARAMETERS FOR BUY CODE TABLE                                     
*                                                                               
         DS    0A                  ALIGNMENT                                    
BCDTBXLE DS    0XL12               START OF BXLE PARAMETERS                     
BCDTSTRA DS    A                   A(START OF TERRITORY ENTRIES)                
BCDTLEN  DS    F                   LENGTH OF ENTRY IN TERRITORY TABLE           
BCDTENDA DS    A                   A(END OF TERRITORY ENTRIES)                  
*                                                                               
BCDTAVL  DS    F                   NUMBER OF ENTRY SLOTS LEFT IN TABLE          
BCDTBCDA DS    A                   A(CURRENT BUY CODE ENTRY)                    
BCDTBT1A DS    A                   A(CURRENT BUY TYPE 1 ENTRY)                  
BCDTBT2A DS    A                   A(CURRENT BUY TYPE 2 ENTRY)                  
*                                                                               
BCDTOHDQ EQU   *-BCDTTABD          LENGTH OF TABLE OVERHEAD                     
*                                                                               
*        BUY CODES                                                              
*                                                                               
BCDTTAB  DS   0A                  START OF BUY CODE TABLE                       
*                                                                               
*        TERRITORY TABLE ENTRY - MULTIPLE OCCURRENCES                           
*                                                                               
BCDTENT  DS    0X                  BUY CODE  ENTRY IN TABLE                     
BCDTKEY  DS    XL34                BUY CODE  RECORD KEY                         
BCDTELM  DS    XL64                BUY CODE TYPES ELEMENT                       
BCDTENTL EQU   *-BCDTENT           LENGTH OF ENTRY IN TABLE                     
*                                                                               
         DS    (BCDTMAXQ-1)XL(BCDTENTL) REST OF TABLE                           
*                                                                               
BCDTTABX EQU   *-1                 END OF TABLE                                 
*                                                                               
BCDTMAXQ EQU   256                 MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
         TITLE 'RENWRDSCTS - NEW MONTH TABLE DSECT - NWMNTABD'                  
***********************************************************************         
*                                                                     *         
*        NEW MONTH TABLE DSECT                                        *         
*              NUMBER OF ENTRIES DEPENDS ON NUMBER OF COLUMNS         *         
*              FILTERED ON AS-AT-DATES                                *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
NWMNTABD DSECT                                                                  
*                                                                               
NWMTMINF DS    XL96                MONTH INFO TABLE                             
NWMTMFRC DS    XL100               FORECAST DATE INFORMATION                    
NWMTCSPC DS    XL100               CONTRACT SPECIFIC INFO                       
*                                                                               
NWMTCTCR DS    XL2                 CUTOFF DATE - YM - BINARY - CURRENT          
NWMTCTPR DS    XL2                 CUTOFF DATE - YM - BINARY - PRIOR            
NWMTCT2P DS    XL2                 CUTOFF DATE - YM - BINARY - 2 YR PRI         
NWMTCTNX DS    XL2                 CUTOFF DATE - YM - BINARY - NEXT             
*                                                                               
NWMTAADT DS    XL3                 AS AT DATE FOR ENTRY  - YMD BINARY           
NWMTAAD2 DS    XL3                 END OF ASATDATE RANGE - YMD BINARY           
         DS    XL190               SPARE                                        
*                                                                               
         DS    0D                  ALIGNMENT                                    
NWMTHDR  DS    XL64                HEADER FOR NEW MONTH TABLE                   
         ORG   NWMTHDR                                                          
NWMTLABL DS    CL12'**NEWMONTB**'  LABEL                                        
NWMTCSPA DS    A                   A(NWMTCSPC - CONTRACT SPECS)                 
         ORG                                                                    
*                                                                               
NWMTNWMT DS    XL16000             NEW MONTH TABLE FOR VALU5NEW                 
*                                                                               
NWMTENTL EQU   *-NWMNTABD          LENGTH OF TABLE ENTRY                        
*                                                                               
         TITLE 'RENWRDSCTS - NEW MONTH TABLE DSECT - BDMNTABD'                  
***********************************************************************         
*                                                                     *         
*        BUDGET MONTH TABLE DSECT                                     *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
BDMNTABD DSECT                                                                  
*                                                                               
BDMTLBL  DS    CL12'**BUDMONTB**'  LABEL                                        
*                                                                               
*        HEADER                                                                 
*                                                                               
BDMTHDR  DS    0XL52               HEADER FOR BUD MONTH TABLE                   
*                                                                               
BDMTBDTP DS    XL1                 BUDGET TYPE   - RECORD CODE                  
BDMTBDT2 DS    XL1                 BUDGET TYPE 2 - RECORD SUB CODE              
*                                                                               
BDMTYR   DS    CL2                 YEAR                                         
BDMTSTA  DS    CL5                 STATION                                      
BDMTOFF  DS    CL2                 OFFICE CODE                                  
BDMTCTP  DS    CL1                 CONTRACT TYPE                                
BDMTTEM  DS    CL2                 TEAM                                         
BDMTSGR  DS    CL2                 SUB-GROUP                                    
BDMTSAL  DS    CL3                 SALESPERSON CODE                             
BDMTREP  DS    CL2                 REP                                          
BDMTDCT  DS    CL2                 DEVELOPMENTAL CONTRACT TYPE                  
         DS    XL11                SPARE                                        
*                                                                               
BDMTSBTP DS    XL1                 STATION BUDGET TYPE                          
BDMTSBSQ EQU   X'80'               STATION                                      
BDMTSBOQ EQU   X'40'               OFFICE                                       
BDMTSBCQ EQU   X'20'               CONTRACT TYPE                                
*                                                                               
BDMTOBTP DS    XL1                 OFFICE  BUDGET TYPE                          
BDMTOBOQ EQU   X'80'               OFFICE                                       
BDMTOBTQ EQU   X'40'               TEAM                                         
BDMTOBGQ EQU   X'20'               SUB-GROUP                                    
*                                                                               
BDMTSPTP DS    XL1                 SALESPERSON BUDGET TYPE                      
BDMTSPSQ EQU   X'80'               SALESPERSON                                  
BDMTSPDQ EQU   X'40'               DEVELOP CONTRACT TYPE                        
*                                                                               
BDMTSSTP DS    XL1                 STATION/SALESPERSON BUDGET TYPE              
BDMTSSSQ EQU   X'80'               SALESPERSON                                  
BDMTSSDQ EQU   X'40'               DEVELOP CONTRACT TYPE                        
*                                                                               
         DS    CL(L'BDMTHDR-(*-BDMTHDR))  SPARE                                 
*                                                                               
*        TABLE ENTRY                                                            
*                                                                               
BDMTNTRY DS    0X                  BUD MONTH TABLE ENTRY                        
*                                                                               
BDMTCURC DS    CL6                 CURRENT DATE - MMM/YY - USED AS ID           
         DS    XL2                 SPARE                                        
*                                                                               
BDMTDTS  DS    0X                  BUDGET DATE LIST                             
BDMTCURB DS    XL2                 CURRENT   MONTH - YM - BINARY                
BDMTPRIB DS    XL2                 PRIOR     MONTH - YM - BINARY                
BDMTPR2B DS    XL2                 PRIOR 2YR MONTH - YM - BINARY                
BDMTNXTB DS    XL2                 NEXT YEAR MONTH - YM - BINARY                
BDMTDTSL EQU   *-BDMTDTS           LENGTH OF DATE LIST                          
*                                                                               
BDMTBCK  DS    0X                  BUDGET BUCKETS                               
BDMTCUR  DS    XL4                 CURRENT    BUDGET $'S - 0 DECIMALS           
BDMTPRI  DS    XL4                 PRIOR      BUDGET $'S - 0 DECIMALS           
BDMTPR2  DS    XL4                 PRIOR 2 YR BUDGET $'S - 0 DECIMALS           
BDMTNXT  DS    XL4                 NEXT YEAR  BUDGET $'S - 0 DECIMALS           
BDMTBCKL EQU   *-BDMTBCK           LENGTH OF BUCKETS                            
*                                                                               
BDMTNTRL EQU   *-BDMTNTRY          LENGTH OF TABLE ENTRY                        
*                                                                               
         DS    (BDMTMAXQ-1)XL(BDMTNTRL)   REST OF TABLE                         
*                                                                               
BDMTENTL EQU   *-BDMNTABD          LENGTH OF TABLE                              
*                                                                               
BDMTMAXQ EQU   72                  MAX NUMBER OF ENTRIES IN TABLE               
*                                                                               
       ++INCLUDE DDBSRPRMD                                                      
