*          DATA SET REPROFFD   AT LEVEL 010 AS OF 12/16/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80AFFD      DATE 12/16/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BASMSGH  DS    CL8                                                              
BASMSG   DS    CL60     1    2   60  L  P H     4       T        Y              
BASSRVH  DS    CL8                                                              
BASSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     2    2   10  L  P H             T        Y              
BASRECH  DS    CL8                                                              
BASREC   DS    CL8      2   13    8  A  U N             T    I   Y    0         
BASRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     2   23   10  L  P H             T        Y              
BASACTH  DS    CL8                                                              
BASACT   DS    CL8      2   34    8  A  U N             T        Y    0         
BASACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     2   45   10  L  P N             T        Y              
BASKEYH  DS    CL8                                                              
BASKEY   DS    CL24     2   56   24  A  U H             T        Y    0         
BASKEYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     3    2   10  L  P N             T        Y              
BASOPTH  DS    CL8                                                              
BASOPT   DS    CL49     3   13   49  A  U H        M    T        Y    0         
BASOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      3   63    8  L  P N             T        Y              
BASPAGH  DS    CL8                                                              
BASPAG   DS    CL8      3   72    8  L  U H             T        Y    4         
BASPAGX  DS    CL8                                                              
BASOLY1H DS    CL8                                                              
BASOLY1  DS    CL1      4    2    1  A  U N             T        Y              
BASPFKH  DS    CL8                                                              
BASPFK   DS    CL78    24    2   78  A  P N     4       T        Y  255         
BASPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 464  BYTES                            
