*          DATA SET REREIFED   AT LEVEL 015 AS OF 11/07/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T826FED      DATE 11/07/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  L  P H             T        Y              
LSTSTAH  DS    XL8                                                              
LSTSTA   DS    CL9      5   10    9  A  U H             T        Y              
LSTSTNMH DS    XL8                                                              
LSTSTNM  DS    CL15     5   20   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   38    5  L  P H             T        Y              
LSTMONH  DS    XL8                                                              
LSTMON   DS    CL6      5   47    6  A  U H             T        Y              
LSTMNDTH DS    XL8                                                              
LSTMNDT  DS    CL17     5   56   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
LSTOFFH  DS    XL8                                                              
LSTOFF   DS    CL2      6   10    2  A  U H             T        Y              
LSTCONAH DS    XL8                                                              
LSTCONA  DS    CL8      6   20    8  L  P H             T        Y              
LSTCONH  DS    XL8                                                              
LSTCON   DS    CL10     6   30   10  A  U H             T        Y              
LSTTYPH  DS    XL8                                                              
LSTTYP   DS    CL1      6   42    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   47    7  L  P H             T        Y              
LSTINVH  DS    XL8                                                              
LSTINV   DS    CL10     6   56   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  L  P H             T        Y              
LSTOPTNH DS    XL8                                                              
LSTOPTN  DS    CL70     7   10   70  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
LSTHEADH DS    XL8                                                              
LSTHEAD  DS    CL35     9    2   35  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL36     9   39   36  L  P H             T        Y              
LSTSEL1H DS    XL8                                                              
LSTSEL1  DS    CL3     10    2    3  A  U N             T        Y              
LSTOFF1H DS    XL8                                                              
LSTOFF1  DS    CL2     10    6    2  A  P N             T        Y              
LSTCON1H DS    XL8                                                              
LSTCON1  DS    CL10    10   10   10  A  P N             T        Y              
LSTTYPEH DS    XL8                                                              
LSTTYPE  DS    CL1     10   21    1  A  P Z             T        Y              
LSTINV1H DS    XL8                                                              
LSTINV1  DS    CL10    10   23   10  A  P N             T        Y              
LSTADV1H DS    XL8                                                              
LSTADV1  DS    CL4     10   34    4  A  P N             T        Y              
LSTAGY1H DS    XL8                                                              
LSTAGY1  DS    CL4     10   39    4  A  P N             T        Y              
LSTSAL1H DS    XL8                                                              
LSTSAL1  DS    CL3     10   44    3  A  P N             T        Y              
LSTDAT1H DS    XL8                                                              
LSTDAT1  DS    CL8     10   48    8  A  P N             T        Y              
LSTTOT1H DS    XL8                                                              
LSTTOT1  DS    CL20    10   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    11   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    12   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    13   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    14   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    15   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    16   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    17   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    18   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    19   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    20   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   57   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    21   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    21   57   20  A  P N             T        Y              
LSTSELLH DS    XL8                                                              
LSTSELL  DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    6    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   10   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   21    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    22   23   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   39    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   44    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   57   20  A  P N             T        Y              
LSTPFLNH DS    XL8                                                              
LSTPFLN  DS    CL22    24    2   22  L  P H             T        Y              
LSTPF12H DS    XL8                                                              
LSTPF12  DS    CL11    24   60   11  L  P H             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2336 BYTES                            
