*          DATA SET RERESD1D   AT LEVEL 005 AS OF 03/07/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819D1D      DATE 03/07/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
INAMRKTH DS    CL8                                                              
INAMRKT  DS    CL25     5   45   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A   P    N         T        Y              
INACODEH DS    CL8                                                              
INACODE  DS    CL1      7   13    1  A   U    N         T        Y   10         
INACODEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   28    8  A   P    N         T        Y              
INATRNFH DS    CL8                                                              
INATRNF  DS    CL2      7   42    2  A   U    N         T        Y   20         
INATRNFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A   P    N         T        Y              
INADAYSH DS    CL8                                                              
INADAYS  DS    CL11     8   13   11  A   U    N         T        Y   30         
INADAYSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     8   28   12  A   P    N         T        Y              
INAADAYH DS    CL8                                                              
INAADAY  DS    CL11     8   42   11  A   U    N         T        Y   40         
INAADAYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
INATIMEH DS    CL8                                                              
INATIME  DS    CL11     9   13   11  A   U    N         T        Y   50         
INATIMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     9   28   13  A   P    N         T        Y              
INAATIMH DS    CL8                                                              
INAATIM  DS    CL11     9   42   11  A   U    N         T        Y   60         
INAATIMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
INAPROGH DS    CL8                                                              
INAPROG  DS    CL27    10   13   27  A   U    N         T        Y   70         
INAPROGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    11   13   27  A   U    N         T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    12   13   27  A   U    N         T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13    2    9  A   P    N         T        Y              
INAEDTEH DS    CL8                                                              
INAEDTE  DS    CL27    13   13   27  A   U    N         T        Y   80         
INAEDTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
INADYPTH DS    CL8                                                              
INADYPT  DS    CL6     14   13    6  A   U    N         T        Y   90         
INADYPTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14   25    7  A   P    N         T        Y              
INAFILTH DS    CL8                                                              
INAFILT  DS    CL6     14   34    6  A   U    N         T        Y  100         
INAFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    3    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   22    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   27    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   33   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   62    7  A   P    N         T        Y              
INABKS1H DS    CL8                                                              
INABKS1  DS    CL17    17    3   17  A   U    N         T        Y  111         
INABKS1X DS    CL8                                                              
INATYPEH DS    CL8                                                              
INATYPE  DS    CL2     17   23    2  A   U    N         T        Y  112         
INATYPEX DS    CL8                                                              
INAPCDEH DS    CL8                                                              
INAPCDE  DS    CL2     17   28    2  A   U    N         T        Y  113         
INAPCDEX DS    CL8                                                              
INAFROMH DS    CL8                                                              
INAFROM  DS    CL27    17   33   27  A   U    N         T        Y  114         
INAFROMX DS    CL8                                                              
INAUPGH  DS    CL8                                                              
INAUPG   DS    CL16    17   63   16  A   U    N         T        Y  115         
INAUPGX  DS    CL8                                                              
INABKS2H DS    CL8                                                              
INABKS2  DS    CL17    18    3   17  A   U    N         T        Y  111         
INABKS2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     18   23    2  A   U    N         T        Y  112         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     18   28    2  A   U    N         T        Y  113         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    18   33   27  A   U    N         T        Y  114         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    18   63   16  A   U    N         T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    19    3   17  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     19   23    2  A   U    N         T        Y  112         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     19   28    2  A   U    N         T        Y  113         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    19   33   27  A   U    N         T        Y  114         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    19   63   16  A   U    N         T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    20    3   17  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20   23    2  A   U    N         T        Y  112         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20   28    2  A   U    N         T        Y  113         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    20   33   27  A   U    N         T        Y  114         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    20   63   16  A   U    N         T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    21    3   17  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   23    2  A   U    N         T        Y  112         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   28    2  A   U    N         T        Y  113         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    21   33   27  A   U    N         T        Y  114         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21   63   16  A   U    N         T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    22    3   17  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     22   23    2  A   U    N         T        Y  112         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     22   28    2  A   U    N         T        Y  113         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    22   33   27  A   U    N         T        Y  114         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    22   63   16  A   U    N         T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    23    3   17  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     23   23    2  A   U    N         T        Y  112         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     23   28    2  A   U    N         T        Y  113         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    23   33   27  A   U    N         T        Y  114         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    23   63   16  A   U    N         T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    24    3   17  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     24   23    2  A   U    N         T        Y  112         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     24   28    2  A   U    N         T        Y  113         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    24   33   27  A   U    N         T        Y  114         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    24   63   16  A   U    N         T        Y  115         
         DS    CL8                                                              
INALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
INAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
