*          DATA SET RERESF6D   AT LEVEL 002 AS OF 04/20/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819F6D      DATE 04/20/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      6   13    1  A   P    N         T        Y              
DMNLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DMNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 12   BYTES                            
