*          DATA SET REREQFFDS  AT LEVEL 019 AS OF 04/12/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T807FFD      DATE 04/12/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RQSMSGH  DS    CL8                                                              
RQSMSG   DS    CL60     1    2   60  A  P N             T        Y              
RQSSRVH  DS    CL8                                                              
RQSSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  A  P N             T        Y              
RQSACTH  DS    CL8                                                              
RQSACT   DS    CL8      2    9    8  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      2   20    6  A  P N             T        Y              
RQSNUMH  DS    CL8                                                              
RQSNUM   DS    CL4      2   27    4  A  U N             T        Y              
RQSNUMXH DS    CL8                                                              
RQSNUMX  DS    CL20     2   33   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      2   55    9  A  P N             T        Y              
RQSNAMEH DS    CL8                                                              
RQSNAME  DS    CL12     2   65   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  A  P N             T        Y              
RQSOFFH  DS    CL8                                                              
RQSOFF   DS    CL2      3    9    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      3   13    5  A  P N             T        Y              
RQSDESTH DS    CL8                                                              
RQSDEST  DS    CL10     3   19   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3   31    6  A  P N             T        Y              
RQSOUTH  DS    CL8                                                              
RQSOUT   DS    CL8      3   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      3   48    5  A  P N             T        Y              
RQSWHENH DS    CL8                                                              
RQSWHEN  DS    CL4      3   54    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      3   60    4  A  P N             T        Y              
RQSOPTH  DS    CL8                                                              
RQSOPT   DS    CL15     3   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
RQSSPCEH DS    CL8                                                              
RQSSPCE  DS    CL1      4   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     4   13   15  A  P N             T        Y              
RQSCMBOH DS    CL8                                                              
RQSCMBO  DS    CL1      4   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     4   32   10  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL4      4   44    4  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL10     4   50   10  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL4      4   62    4  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL6      4   68    6  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL2      4   76    2  A  P Z             T        Y              
RQSFRSTH DS    CL8                                                              
RQSFRST  DS    CL1      4   79    1  A  U N             T        Y              
RQSLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
RQSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 512  BYTES                            
