*          DATA SET RERESFDD   AT LEVEL 010 AS OF 10/11/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819FDD      DATE 10/11/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TITSTATH DS    CL8                                                              
TITSTAT  DS    CL62     7   15   62  A  U N             T    I   Y   10         
TITSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
TITDPTH  DS    CL8                                                              
TITDPT   DS    CL19     8   15   19  A  U N             T        Y   20         
TITDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
TITSTRTH DS    CL8                                                              
TITSTRT  DS    CL9      9   15    9  A  U N             T        Y   30         
TITSTRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
TITENDH  DS    CL8                                                              
TITEND   DS    CL9     10   15    9  A  U N             T        Y   40         
TITENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
TITFILTH DS    CL8                                                              
TITFILT  DS    CL6     11   15    6  A  U N             T        Y   50         
TITFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  A  P N             T        Y              
TITOP1H  DS    CL8                                                              
TITOP1   DS    CL6     12   22    6  A  U N             T        Y   60         
TITOP1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    12   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    13    2   18  A  P N             T        Y              
TITOP2H  DS    CL8                                                              
TITOP2   DS    CL2     13   22    2  A  U N             T        Y   70         
TITOP2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   30    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    14    2   18  A  P N             T        Y              
TITOP3H  DS    CL8                                                              
TITOP3   DS    CL2     14   22    2  A  U N             T        Y   80         
TITOP3X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   30    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    15    2   18  A  P N             T        Y              
TITOP4H  DS    CL8                                                              
TITOP4   DS    CL2     15   22    2  A  U N             T        Y   90         
TITOP4X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   30    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   15    1  A  U N             T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 648  BYTES                            
