*          DATA SET REREQFFD   AT LEVEL 002 AS OF 10/11/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T807FFD      DATE 10/11/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RQSMSGH  DS    XL8                                                              
RQSMSG   DS    CL60     1    2   60  A  P N             T        Y              
RQSSRVH  DS    XL8                                                              
RQSSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      2    2    6  A  P N             T        Y              
RQSACTH  DS    XL8                                                              
RQSACT   DS    CL8      2    9    8  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      2   20    6  A  P N             T        Y              
RQSNUMH  DS    XL8                                                              
RQSNUM   DS    CL4      2   27    4  A  U N             T        Y              
RQSNUMXH DS    XL8                                                              
RQSNUMX  DS    CL20     2   33   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      2   55    9  A  P N             T        Y              
RQSNAMEH DS    XL8                                                              
RQSNAME  DS    CL12     2   65   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      3    2    6  A  P N             T        Y              
RQSOFFH  DS    XL8                                                              
RQSOFF   DS    CL2      3    9    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      3   13    5  A  P N             T        Y              
RQSDESTH DS    XL8                                                              
RQSDEST  DS    CL10     3   19   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      3   31    6  A  P N             T        Y              
RQSOUTH  DS    XL8                                                              
RQSOUT   DS    CL8      3   38    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      3   48    5  A  P N             T        Y              
RQSWHENH DS    XL8                                                              
RQSWHEN  DS    CL4      3   54    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      3   60    4  A  P N             T        Y              
RQSOPTH  DS    XL8                                                              
RQSOPT   DS    CL15     3   65   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
RQSSPCEH DS    XL8                                                              
RQSSPCE  DS    CL1      4   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     4   13   10  A  P N             T        Y              
RQSOPT2H DS    XL8                                                              
RQSOPT2  DS    CL45     4   25   45  A  U N             T        Y              
RQSFRSTH DS    XL8                                                              
RQSFRST  DS    CL1      4   79    1  A  U N             T        Y              
RQSLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
RQSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 472  BYTES                            
