*          DATA SET RERESC5D   AT LEVEL 009 AS OF 02/07/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819C5D      DATE 02/07/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
MASSRCH  DS    CL8                                                              
MASSRC   DS    CL4      6   13    4  A  U N             T    I   Y   10         
MASSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   24    5  A  P N             T        Y              
MASBKSH  DS    CL8                                                              
MASBKS   DS    CL46     6   33   46  A  U N             T        Y   20         
MASBKSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
MASDEMH  DS    CL8                                                              
MASDEM   DS    CL60     7   13   60  A  U N             T        Y   40         
MASDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
MASDPTH  DS    CL8                                                              
MASDPT   DS    CL19     8   13   19  A  U N             T        Y   50         
MASDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
MASDTMSH DS    CL8                                                              
MASDTMS  DS    CL19     9   13   19  A  U N             T        Y   50         
MASDTMSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
MASSTNH  DS    CL8                                                              
MASSTN   DS    CL8     10   13    8  A  U N             T        Y   30         
MASSTNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10   23    8  A  P N             T        Y              
MASINVH  DS    CL8                                                              
MASINV   DS    CL5     10   33    5  A  U N             T        Y   80         
MASINVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10   42    6  A  P N             T        Y              
MASFTRH  DS    CL8                                                              
MASFTR   DS    CL7     10   53    7  A  U N             T        Y   70         
MASFTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11    2   18  A  P N             T        Y              
MASESDTH DS    CL8                                                              
MASESDT  DS    CL9     11   22    9  A  U N             T        Y  110         
MASESDTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11   42   18  A  P N             T        Y              
MASEEDTH DS    CL8                                                              
MASEEDT  DS    CL9     11   62    9  A  U N             T        Y  120         
MASEEDTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
MASSTNFH DS    CL8                                                              
MASSTNF  DS    CL8     13   13    8  A  U N             T        Y   30         
MASSTNFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   23    8  A  P N             T        Y              
MASINVFH DS    CL8                                                              
MASINVF  DS    CL5     13   33    5  A  U N             T        Y   80         
MASINVFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   42    6  A  P N             T        Y              
MASFTRFH DS    CL8                                                              
MASFTRF  DS    CL7     13   53    7  A  U N             T        Y   70         
MASFTRFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  A  P N             T        Y              
MASESDFH DS    CL8                                                              
MASESDF  DS    CL9     14   22    9  A  U N             T        Y  110         
MASESDFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14   42   18  A  P N             T        Y              
MASEEDFH DS    CL8                                                              
MASEEDF  DS    CL9     14   62    9  A  U N             T        Y  120         
MASEEDFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
MASSRCFH DS    CL8                                                              
MASSRCF  DS    CL4     15   13    4  A  U N             T        Y   10         
MASSRCFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15   24    5  A  P N             T        Y              
MASBKSFH DS    CL8                                                              
MASBKSF  DS    CL20    15   33   20  A  U N             T        Y   20         
MASBKSFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   60    8  A  P N             T        Y              
MASDPTFH DS    CL8                                                              
MASDPTF  DS    CL9     15   70    9  A  U N             T        Y   50         
MASDPTFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
MASDTMFH DS    CL8                                                              
MASDTMF  DS    CL65    16   13   65  A  U N             T        Y   50         
MASDTMFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
MASPGMFH DS    CL8                                                              
MASPGMF  DS    CL65    17   13   65  A  U N             T        Y   50         
MASPGMFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
MASDEMTH DS    CL8                                                              
MASDEMT  DS    CL60    18   13   60  A  U N             T        Y   40         
MASDEMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
MASDEMFH DS    CL8                                                              
MASDEMF  DS    CL60    19   13   60  A  U N             T        Y   40         
MASDEMFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
MASSHRSH DS    CL8                                                              
MASSHRS  DS    CL60    20   13   60  A  U N             T        Y   40         
MASSHRSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
MASLVLSH DS    CL8                                                              
MASLVLS  DS    CL60    21   13   60  A  U N             T        Y   40         
MASLVLSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
MASTXT1H DS    CL8                                                              
MASTXT1  DS    CL60    22   13   60  A  U N             T        Y   40         
MASTXT1X DS    CL8                                                              
MASTXT2H DS    CL8                                                              
MASTXT2  DS    CL60    23   13   60  A  U N             T        Y   40         
MASTXT2X DS    CL8                                                              
MASLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1584 BYTES                            
