*          DATA SET RERESF5D   AT LEVEL 002 AS OF 06/21/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819F5D      DATE 06/21/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
MASSRCEH DS    XL8                                                              
MASSRCE  DS    CL24     6   11   24  A  U N             T    I   Y   10         
MASSRCEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   60    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
MASBKSH  DS    XL8                                                              
MASBKS   DS    CL66     7   11   66  A  U N             T        Y   20         
MASBKSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
MASSTNH  DS    XL8                                                              
MASSTN   DS    CL8      8   11    8  A  U N             T        Y   30         
MASSTNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
MASDEMH  DS    XL8                                                              
MASDEM   DS    CL60     9   11   60  A  U N             T        Y   40         
MASDEMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    10   11   60  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
MASDPTH  DS    XL8                                                              
MASDPT   DS    CL19    11   11   19  A  U N             T        Y   50         
MASDPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
MASDAYH  DS    XL8                                                              
MASDAY   DS    CL4     12   11    4  A  U N             T        Y   60         
MASDAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
MASFTRH  DS    XL8                                                              
MASFTR   DS    CL7     13   11    7  A  U N             T        Y   70         
MASFTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
MASINVH  DS    XL8                                                              
MASINV   DS    CL5     14   11    5  A  U N             T        Y   80         
MASINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
MASOP1H  DS    XL8                                                              
MASOP1   DS    CL2     15   11    2  A  U N             T        Y   90         
MASOP1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL35    15   28   35  A  P N             T        Y              
MASOP2H  DS    XL8                                                              
MASOP2   DS    CL2     16   11    2  A  U N             T        Y  100         
MASOP2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL38    16   28   38  A  P N             T        Y              
MASOP3H  DS    XL8                                                              
MASOP3   DS    CL2     17   11    2  A  U N             T        Y  105         
MASOP3X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL40    17   28   40  A  P N             T        Y              
MASOP4H  DS    XL8                                                              
MASOP4   DS    CL2     18   11    2  A  U N             T        Y  108         
MASOP4X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    18   28   34  A  P N             T        Y              
MASOP5H  DS    XL8                                                              
MASOP5   DS    CL2     19   11    2  A  U N             T        Y  109         
MASOP5X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL28    19   28   28  A  P N             T        Y              
MASESDTH DS    XL8                                                              
MASESDT  DS    CL9     20   11    9  A  U N             T        Y  110         
MASESDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    20   28   30  A  P N             T        Y              
MASEEDTH DS    XL8                                                              
MASEEDT  DS    CL9     21   11    9  A  U N             T        Y  120         
MASEEDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL28    21   28   28  A  P N             T        Y              
MASADTH  DS    XL8                                                              
MASADT   DS    CL9     22   11    9  A  U N             T        Y  130         
MASADTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    22   28   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   75    1  A  U N             T        Y              
MASLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1032 BYTES                            
