*          DATA SET RERESF7D   AT LEVEL 009 AS OF 08/03/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819F7D      DATE 08/03/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TITSTATH DS    CL8                                                              
TITSTAT  DS    CL7      6   15    7  A  U N             T    I   Y   10         
TITSTATX DS    CL8                                                              
TITMKTH  DS    CL8                                                              
TITMKT   DS    CL24     6   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
TITDPTH  DS    CL8                                                              
TITDPT   DS    CL19     7   15   19  A  U N             T        Y   20         
TITDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
TITSTRTH DS    CL8                                                              
TITSTRT  DS    CL9      8   15    9  A  U N             T        Y   30         
TITSTRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
TITENDH  DS    CL8                                                              
TITEND   DS    CL9      9   15    9  A  U N             T        Y   40         
TITENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
TITFILTH DS    CL8                                                              
TITFILT  DS    CL6     10   15    6  A  U N             T        Y   50         
TITFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
TITOP1H  DS    CL8                                                              
TITOP1   DS    CL2     11   15    2  A  U N             T        Y   60         
TITOP1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11   27   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
TITOP2H  DS    CL8                                                              
TITOP2   DS    CL2     12   15    2  A  U N             T        Y   70         
TITOP2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    12   27   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
TITOP3H  DS    CL8                                                              
TITOP3   DS    CL2     13   15    2  A  U N             T        Y   80         
TITOP3X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    13   27   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   15    1  A  U N             T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 448  BYTES                            
