*          DATA SET REREIFCD   AT LEVEL 004 AS OF 11/07/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T826FCD      DATE 11/07/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  L  P H             T        Y              
DTLSTAH  DS    XL8                                                              
DTLSTA   DS    CL9      5   10    9  A  U H             T        Y              
DTLSTNMH DS    XL8                                                              
DTLSTNM  DS    CL15     5   20   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   38    5  L  P H             T        Y              
DTLMONH  DS    XL8                                                              
DTLMON   DS    CL6      5   47    6  A  U H             T        Y              
DTLMNDTH DS    XL8                                                              
DTLMNDT  DS    CL17     5   56   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
DTLOFFH  DS    XL8                                                              
DTLOFF   DS    CL2      6   10    2  A  P H             T        Y              
DTLCONAH DS    XL8                                                              
DTLCONA  DS    CL8      6   20    8  L  P H             T        Y              
DTLCONH  DS    XL8                                                              
DTLCON   DS    CL11     6   30   11  A  U H             T        Y              
DTLTYPEH DS    XL8                                                              
DTLTYPE  DS    CL1      6   42    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   47    7  L  P H             T        Y              
DTLINVH  DS    XL8                                                              
DTLINV   DS    CL10     6   56   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     8    2   14  A  P H             T        Y              
DTLHNUMH DS    XL8                                                              
DTLHNUM  DS    CL20     8   17   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     9    2   14  A  P H             T        Y              
DTLSNUMH DS    XL8                                                              
DTLSNUM  DS    CL20     9   17   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P H             T        Y              
DTLOPTNH DS    XL8                                                              
DTLOPTN  DS    CL60    10   10   60  A  U N             T        Y              
DTLTAGH  DS    XL8                                                              
DTLTAG   DS    CL1     11    2    1  A  P N             T        Y              
DTLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DTLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 424  BYTES                            
