*          DATA SET RERESF1D   AT LEVEL 001 AS OF 08/03/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819F1D      DATE 08/03/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
PURSRCEH DS    CL8                                                              
PURSRCE  DS    CL24     6   13   24  A  U N             T    I   Y   10         
PURSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   67    1  A  P N             T        Y              
PURPBOKH DS    CL8                                                              
PURPBOK  DS    CL4      7    2    4  A  P N             T        Y              
PURBOOKH DS    CL8                                                              
PURBOOK  DS    CL65     7   13   65  A  U N             T        Y   30         
PURBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
PURDEMOH DS    CL8                                                              
PURDEMO  DS    CL50     8   13   50  A  U N             T        Y   40         
PURDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
PURSTATH DS    CL8                                                              
PURSTAT  DS    CL7     10   13    7  A  U N             T        Y   50         
PURSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   23    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   33    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   43    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   53    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   13    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   23    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   33    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   43    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   53    7  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
PURSTIMH DS    CL8                                                              
PURSTIM  DS    CL7     14   16    7  A  U N             T        Y   70         
PURSTIMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22    14   25   22  A  P N             T        Y              
PURPARTH DS    CL8                                                              
PURPART  DS    CL4     14   50    4  A  U N             T        Y   80         
PURPARTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    14   56   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
PURETIMH DS    CL8                                                              
PURETIM  DS    CL7     15   16    7  A  U N             T        Y   90         
PURETIMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
PURDAYFH DS    CL8                                                              
PURDAYF  DS    CL3     16   16    3  A  U N             T        Y  100         
PURDAYFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    16   25   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    17   25   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
PUROPT2H DS    CL8                                                              
PUROPT2  DS    CL2     18   16    2  A  U N             T        Y  110         
PUROPT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    18   25   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   16    1  A  U N             T        Y              
PURLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PURWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 848  BYTES                            
