*          DATA SET RERESFED   AT LEVEL 004 AS OF 11/13/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819FED      DATE 11/13/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U M             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
MASSRCEH DS    CL8                                                              
MASSRCE  DS    CL24     7   13   24  A  U N             T    I   Y   10         
MASSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   60    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
MASBKSH  DS    CL8                                                              
MASBKS   DS    CL65     8   13   65  A  U N             T        Y   20         
MASBKSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
MASSTNH  DS    CL8                                                              
MASSTN   DS    CL8      9   13    8  A  U N             T        Y   30         
MASSTNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
MASDEMH  DS    CL8                                                              
MASDEM   DS    CL60    10   13   60  A  U N             T        Y   40         
MASDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    11   13   60  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
MASRTCDH DS    CL8                                                              
MASRTCD  DS    CL8     12   13    8  A  U N             T        Y   45         
MASRTCDX DS    CL8                                                              
MASRCDH  DS    CL8                                                              
MASRCD   DS    CL19    12   23   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   44    8  A  P N             T        Y              
MASLENSH DS    CL8                                                              
MASLENS  DS    CL20    12   55   20  A  U N             T        Y   47         
MASLENSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13    2    9  A  P N             T        Y              
MASQTRSH DS    CL8                                                              
MASQTRS  DS    CL60    13   13   60  A  U N             T        Y   49         
MASQTRSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
MASDPTH  DS    CL8                                                              
MASDPT   DS    CL19    14   13   19  A  U N             T        Y   50         
MASDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14   42    3  A  P N             T        Y              
MASDAYH  DS    CL8                                                              
MASDAY   DS    CL4     14   53    4  A  U N             T        Y   60         
MASDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   62    6  A  P N             T        Y              
MASFTRH  DS    CL8                                                              
MASFTR   DS    CL7     14   72    7  A  U N             T        Y   70         
MASFTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
MASINVH  DS    CL8                                                              
MASINV   DS    CL65    15   13   65  A  U N             T        Y   80         
MASINVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16    2   18  A  P N             T        Y              
MASESDTH DS    CL8                                                              
MASESDT  DS    CL9     16   22    9  A  U N             T        Y   90         
MASESDTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16   42   18  A  P N             T        Y              
MASEEDTH DS    CL8                                                              
MASEEDT  DS    CL9     16   62    9  A  U N             T        Y  100         
MASEEDTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    18    2   18  A  P N             T        Y              
MASOP1H  DS    CL8                                                              
MASOP1   DS    CL2     18   22    2  A  U N             T        Y  130         
MASOP1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   30    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    18   42   18  A  P N             T        Y              
MASOP7H  DS    CL8                                                              
MASOP7   DS    CL2     18   62    2  A  U N             T        Y  110         
MASOP7X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   70    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    19    2   18  A  P N             T        Y              
MASOP2H  DS    CL8                                                              
MASOP2   DS    CL2     19   22    2  A  U N             T        Y  120         
MASOP2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   30    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    19   42   18  A  P N             T        Y              
MASOP5H  DS    CL8                                                              
MASOP5   DS    CL2     19   62    2  A  U N             T        Y  160         
MASOP5X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   70    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    20    2   18  A  P N             T        Y              
MASOP8H  DS    CL8                                                              
MASOP8   DS    CL2     20   22    2  A  U N             T        Y  135         
MASOP8X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20   30    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    20   42   18  A  P N             T        Y              
MASOP6H  DS    CL8                                                              
MASOP6   DS    CL2     20   62    2  A  U N             T        Y  180         
MASOP6X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20   70    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    21    2   18  A  P N             T        Y              
MASOP3H  DS    CL8                                                              
MASOP3   DS    CL2     21   22    2  A  U N             T        Y  150         
MASOP3X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     21   30    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    21   42   18  A  P N             T        Y              
MASOP9H  DS    CL8                                                              
MASOP9   DS    CL2     21   62    2  A  U N             T        Y  185         
MASOP9X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     21   70    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
MASTTL1H DS    CL8                                                              
MASTTL1  DS    CL30    22   13   30  A  U N             T        Y  140         
MASTTL1X DS    CL8                                                              
MASTTL2H DS    CL8                                                              
MASTTL2  DS    CL30    22   45   30  A  U N             T        Y  140         
MASTTL2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     23    2    8  A  P N             T        Y              
MASTXTH  DS    CL8                                                              
MASTXT   DS    CL60    23   13   60  A  U N             T        Y  141         
MASTXTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   75    1  A  U N             T        Y              
MASLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
