*          DATA SET REREQFLD   AT LEVEL 189 AS OF 10/10/11                      
         TITLE 'REREQFLD -- FIELD DEFINITION TABLE'                             
***********************************************************************         
* history of changes                                                  *         
***********************************************************************         
* jan18/93 (bu ) --- fld161 - new 'as-at' date range message          *         
*                                                                     *         
* may03/93 (sku) --- add new lit for 70 activity report               *         
*                                                                     *         
* jan10/94 (sku) --- add new lit for 71 owner listing                 *         
*                                                                     *         
* JAN26/94 (BU ) --- ADD NEW REQUEST FILTER LITERALS                  *         
*                                                                     *         
* mar21/94 (bu ) --- add option3 to 20 report                         *         
*                                                                     *         
* APR06/94 (BU ) --- ADD OPTIONS TO 19 REPORT                         *         
*                                                                     *         
* jun08/94 (bu ) --- additional rank comments                         *         
*                                                                     *         
* aug03/94 (bu ) --- this year vs last year                           *         
*                                                                     *         
* sep26/94 (bu ) --- 3v request options                               *         
*                                                                     *         
* OCT12/94 (BU ) --- RANKERS WITH CUMES MESSAGES                      *         
*                                                                     *         
* nov21/94 (bu ) --- changes to re16 messages/options                 *         
*                                                                     *         
* MAR23/95 (bu ) --- shorten filter descriptors where needed          *         
*                                                                     *         
* SEP29/11 (BOB) --- BEST $ OPTION                                    *         
*                                                                     *         
*                    **  end  tombstone  **                           *         
***********************************************************************         
*                                                                               
*-----  REREQFLD INCLUDE DATA SET -- FIELDS FOR NEW REQUEST ------*             
         SPACE 2                                                                
*                                                                               
*- FLDTBL -- BASIC FIELD UNITS                                                  
*                                                                               
*  VARIABLE LENGTH ENTRIES, FORMAT:                                             
*                                                                               
*  XL1'ENTRY LENGTH'   X'0' = END OF TABLE   <-- FIXED FOR                      
*  AL2(FIELD NUMBER)                         <   EACH ENTRY                     
*  XL?'FIELD DATA, VARIABLE LENGTH'                                             
*                                                                               
FLDLHEAD EQU   3                   FIXED LEN IN EACH ENTRY                      
         SPACE 2                                                                
FLDTBL   DS    0CL1                                                             
         SPACE                                                                  
FLD001   DC    AL1(FLD001X-*),AL2(1)                                            
         DC    C'Region'                                                        
FLD001X  EQU   *                                                                
         SPACE 2                                                                
FLD002   DC    AL1(FLD002X-*),AL2(2)                                            
         DC    C'Office'                                                        
FLD002X  EQU   *                                                                
         SPACE 2                                                                
FLD003   DC    AL1(FLD003X-*),AL2(3)                                            
         DC    C'Grp+Subgrp'                                                    
FLD003X  EQU   *                                                                
         SPACE 2                                                                
FLD004   DC    AL1(FLD004X-*),AL2(4)                                            
         DC    C'Subgroup'                                                      
FLD004X  EQU   *                                                                
         SPACE 2                                                                
FLD005   DC    AL1(FLD005X-*),AL2(5)                                            
         DC    C'Station List'                                                  
FLD005X  EQU   *                                                                
         SPACE 2                                                                
FLD006   DC    AL1(FLD006X-*),AL2(6)                                            
         DC    C'Div+Team'                                                      
FLD006X  EQU   *                                                                
         SPACE 2                                                                
FLD007   DC    AL1(FLD007X-*),AL2(7)                                            
         DC    C'Salesperson'                                                   
FLD007X  EQU   *                                                                
         SPACE 2                                                                
FLD008   DC    AL1(FLD008X-*),AL2(8)                                            
         DC    C'Station'                                                       
FLD008X  EQU   *                                                                
         SPACE 2                                                                
FLD009   DC    AL1(FLD009X-*),AL2(9)                                            
         DC    C'Advertiser'                                                    
FLD009X  EQU   *                                                                
         SPACE 2                                                                
FLD010   DC    AL1(FLD010X-*),AL2(10)                                           
         DC    C'Agency'                                                        
FLD010X  EQU   *                                                                
         SPACE 2                                                                
FLD011   DC    AL1(FLD011X-*),AL2(11)                                           
         DC    C'Class '                                                        
FLD011X  EQU   *                                                                
         SPACE 2                                                                
FLD012   DC    AL1(FLD012X-*),AL2(12)                                           
         DC    C'Category'                                                      
FLD012X  EQU   *                                                                
         SPACE 2                                                                
FLD013   DC    AL1(FLD013X-*),AL2(13)                                           
         DC    C'Con Type'                                                      
FLD013X  EQU   *                                                                
         SPACE 2                                                                
FLD014   DC    AL1(FLD014X-*),AL2(14)                                           
         DC    C'Sta Type'                                                      
FLD014X  EQU   *                                                                
         SPACE 2                                                                
FLD015   DC    AL1(FLD015X-*),AL2(15)                                           
         DC    C'Product'                                                       
FLD015X  EQU   *                                                                
         SPACE 2                                                                
FLD016   DC    AL1(FLD016X-*),AL2(16)                                           
         DC    C'Station'                                                       
FLD016X  EQU   *                                                                
         SPACE 2                                                                
FLD017   DC    AL1(FLD017X-*),AL2(17)                                           
         DC    C'Start Date'                                                    
FLD017X  EQU   *                                                                
         SPACE 2                                                                
FLD018   DC    AL1(FLD018X-*),AL2(18)                                           
         DC    C'End Date'                                                      
FLD018X  EQU   *                                                                
         SPACE 2                                                                
FLD019   DC    AL1(FLD019X-*),AL2(19)                                           
         DC    C'As At Date'                                                    
FLD019X  EQU   *                                                                
         SPACE 2                                                                
FLD020   DC    AL1(FLD020X-*),AL2(20)                                           
         DC    C'Start,End Dates'                                               
FLD020X  EQU   *                                                                
         SPACE 2                                                                
FLD021   DC    AL1(FLD021X-*),AL2(21)                                           
         DC    C'Basis '                                                        
FLD021X  EQU   *                                                                
         SPACE 2                                                                
FLD022   DC    AL1(FLD022X-*),AL2(22)                                           
         DC    C'Period Start,End'                                              
FLD022X  EQU   *                                                                
         SPACE 2                                                                
FLD023   DC    AL1(FLD023X-*),AL2(23)                                           
         DC    C'Period End'                                                    
FLD023X  EQU   *                                                                
         SPACE 2                                                                
FLD024   DC    AL1(FLD024X-*),AL2(24)                                           
         DC    C'Period End'                                                    
FLD024X  EQU   *                                                                
         SPACE 2                                                                
FLD025   DC    AL1(FLD025X-*),AL2(25)                                           
         DC    C'Sequence:'                                                     
FLD025X  EQU   *                                                                
         SPACE 2                                                                
FLD026   DC    AL1(FLD026X-*),AL2(26)                                           
         DC    C'Depth Number'                                                  
FLD026X  EQU   *                                                                
         SPACE 2                                                                
FLD027   DC    AL1(FLD027X-*),AL2(27)                                           
         DC    C'Option 1'                                                      
FLD027X  EQU   *                                                                
         SPACE 2                                                                
FLD028   DC    AL1(FLD028X-*),AL2(28)                                           
         DC    C'Start,End Dates'                                               
FLD028X  EQU   *                                                                
         SPACE 2                                                                
FLD029   DC    AL1(FLD029X-*),AL2(29)                                           
         DC    C'Option 2'                                                      
FLD029X  EQU   *                                                                
         SPACE 2                                                                
FLD030   DC    AL1(FLD030X-*),AL2(30)                                           
         DC    C'Start,End Dates'                                               
FLD030X  EQU   *                                                                
         SPACE 2                                                                
FLD031   DC    AL1(FLD031X-*),AL2(31)                                           
         DC    C'Accounting Option'                                             
FLD031X  EQU   *                                                                
         SPACE 2                                                                
FLD032   DC    AL1(FLD032X-*),AL2(032)                                          
         DC    C'Cutoff Date'                                                   
FLD032X  EQU   *                                                                
         SPACE 2                                                                
FLD033   DC    AL1(FLD033X-*),AL2(33)                                           
         DC    C'Contract Number'                                               
FLD033X  EQU   *                                                                
         SPACE 2                                                                
FLD034   DC    AL1(FLD034X-*),AL2(34)                                           
         DC    C'Contract Number'                                               
FLD034X  EQU   *                                                                
         SPACE 2                                                                
FLD035   DC    AL1(FLD035X-*),AL2(35)                                           
         DC    C'Totals Control'                                                
FLD035X  EQU   *                                                                
         SPACE 2                                                                
FLD037   DC    AL1(FLD037X-*),AL2(37)                                           
         DC    C'Option 3'                                                      
FLD037X  EQU   *                                                                
         SPACE 2                                                                
FLD039   DC    AL1(FLD039X-*),AL2(39)                                           
         DC    C'Affil    '                                                     
FLD039X  EQU   *                                                                
         SPACE 2                                                                
FLD041   DC    AL1(FLD041X-*),AL2(41)                                           
         DC    C'Option 4'                                                      
FLD041X  EQU   *                                                                
         SPACE 2                                                                
FLD043   DC    AL1(FLD043X-*),AL2(43)                                           
         DC    C'Option 5'                                                      
FLD043X  EQU   *                                                                
         SPACE 2                                                                
FLD045   DC    AL1(FLD045X-*),AL2(45)                                           
         DC    C'Option 6'                                                      
FLD045X  EQU   *                                                                
         SPACE 2                                                                
FLD047   DC    AL1(FLD047X-*),AL2(47)                                           
         DC    C'Format'                                                        
FLD047X  EQU   *                                                                
         SPACE 2                                                                
FLD049   DC    AL1(FLD049X-*),AL2(49)                                           
         DC    C'Rank Max'                                                      
FLD049X  EQU   *                                                                
         SPACE 2                                                                
FLD051   DC    AL1(FLD051X-*),AL2(51)                                           
         DC    C'Rank Period'                                                   
FLD051X  EQU   *                                                                
         SPACE 2                                                                
FLD052   DC    AL1(FLD052X-*),AL2(52)                                           
         DC    C'Budget Year'                                                   
FLD052X  EQU   *                                                                
         SPACE 2                                                                
FLD053   DC    AL1(FLD053X-*),AL2(53)                                           
         DC    C'Recap Option'                                                  
FLD053X  EQU   *                                                                
         SPACE 2                                                                
FLD054   DC    AL1(FLD054X-*),AL2(54)                                           
         DC    C'Month of'                                                      
FLD054X  EQU   *                                                                
         SPACE 2                                                                
FLD055   DC    AL1(FLD055X-*),AL2(55)                                           
         DC    C'Period End'                                                    
FLD055X  EQU   *                                                                
         SPACE 2                                                                
FLD056   DC    AL1(FLD056X-*),AL2(56)                                           
         DC    C'Credit Risk'                                                   
FLD056X  EQU   *                                                                
         SPACE 2                                                                
FLD057   DC    AL1(FLD057X-*),AL2(57)                                           
         DC    C'Liability Pos'                                                 
FLD057X  EQU   *                                                                
         SPACE 2                                                                
FLD058   DC    AL1(FLD058X-*),AL2(58)                                           
         DC    C'Best $ Option'                                                 
FLD058X  EQU   *                                                                
         SPACE 2                                                                
FLD060   DC    AL1(FLD060X-*),AL2(60)                                           
         DC    C'TVB Reg'                                                       
FLD060X  EQU   *                                                                
         SPACE 2                                                                
FLD061   DC    AL1(FLD061X-*),AL2(61)                                           
         DC    C'Owner '                                                        
FLD061X  EQU   *                                                                
         SPACE 2                                                                
FLD062   DC    AL1(FLD062X-*),AL2(62)                                           
         DC    C'Market'                                                        
FLD062X  EQU   *                                                                
         SPACE 2                                                                
FLD063   DC    AL1(FLD063X-*),AL2(63)                                           
         DC    C'Sta Rank'                                                      
FLD063X  EQU   *                                                                
         SPACE 2                                                                
FLD064   DC    AL1(FLD064X-*),AL2(64)                                           
         DC    C'Point P'                                                       
FLD064X  EQU   *                                                                
         SPACE 2                                                                
FLD065   DC    AL1(FLD065X-*),AL2(65)                                           
         DC    C'Net Con'                                                       
FLD065X  EQU   *                                                                
         SPACE 2                                                                
FLD066   DC    AL1(FLD066X-*),AL2(66)                                           
         DC    C'Budget Start,End'                                              
FLD066X  EQU   *                                                                
         SPACE 2                                                                
FLD067   DC    AL1(FLD067X-*),AL2(67)                                           
         DC    C'Allocation List'                                               
FLD067X  EQU   *                                                                
         SPACE 2                                                                
FLD069   DC    AL1(FLD069X-*),AL2(69)                                           
         DC    C'RDA Record'                                                    
FLD069X  EQU   *                                                                
         SPACE 2                                                                
FLD070   DC    AL1(FLD070X-*),AL2(70)                                           
         DC    C'Target Agency'                                                 
FLD070X  EQU   *                                                                
         SPACE 2                                                                
FLD071   DC    AL1(FLD071X-*),AL2(71)                                           
         DC    C'Rating Service'                                                
FLD071X  EQU   *                                                                
         SPACE 2                                                                
FLD072   DC    AL1(FLD072X-*),AL2(72)                                           
         DC    C'Demo Code '                                                    
FLD072X  EQU   *                                                                
         SPACE 2                                                                
FLD073   DC    AL1(FLD073X-*),AL2(73)                                           
         DC    C'Rating Book'                                                   
FLD073X  EQU   *                                                                
         SPACE 2                                                                
FLD074   DC    AL1(FLD074X-*),AL2(74)                                           
         DC    C'Label Record'                                                  
FLD074X  EQU   *                                                                
         SPACE 2                                                                
*                                                                               
*   next two items shouldn't be in this section.  should be at the              
*   end of the 'fld' list                                                       
*                                                                               
FLD075   DC    AL1(FLD075X-*),AL2(75)                                           
         DC    C'Activity'                                                      
FLD075X  EQU   *                                                                
         SPACE 2                                                                
FLD076   DC    AL1(FLD076X-*),AL2(76)                                           
         DC    C'  Start, End Dates'                                            
FLD076X  EQU   *                                                                
         SPACE 2                                                                
FLD077   DC    AL1(FLD077X-*),AL2(077)                                          
         DC    C'Dev Sal'                                                       
FLD077X  EQU   *                                                                
         SPACE 2                                                                
FLD078   DC    AL1(FLD078X-*),AL2(078)                                          
         DC    C'Dev Type'                                                      
FLD078X  EQU   *                                                                
         SPACE 2                                                                
FLD079   DC    AL1(FLD079X-*),AL2(079)                                          
         DC    C'Spot Length Option'                                            
FLD079X  EQU   *                                                                
         SPACE 2                                                                
FLD080   DC    AL1(FLD080X-*),AL2(080)                                          
         DC    C'Spacing'                                                       
FLD080X  EQU   *                                                                
         SPACE 2                                                                
FLD081   DC    AL1(FLD081X-*),AL2(081)                                          
         DC    C'Combine Combos?'                                               
FLD081X  EQU   *                                                                
         SPACE 2                                                                
FLD082   DC    AL1(FLD082X-*),AL2(082)                                          
         DC    C'Unused at this time'                                           
FLD082X  EQU   *                                                                
         SPACE 2                                                                
FLD083   DC    AL1(FLD083X-*),AL2(083)                                          
         DC    C'Unused at this time'                                           
FLD083X  EQU   *                                                                
         SPACE 2                                                                
FLD084   DC    AL1(FLD084X-*),AL2(084)                                          
         DC    C'Unused at this time'                                           
FLD084X  EQU   *                                                                
         SPACE 2                                                                
*                                  following field gen's no label               
FLD085   DC    AL1(FLD085X-*),AL2(85)                                           
         DC    C' '                                                             
FLD085X  EQU   *                                                                
         SPACE 2                                                                
FLD086   DC    AL1(FLD086X-*),AL2(86)                                           
         DC    C'SOURCE REP'                                                    
FLD086X  EQU   *                                                                
         SPACE 2                                                                
FLD087   DC    AL1(FLD087X-*),AL2(87)                                           
         DC    C'TAKEOVER STATION'                                              
FLD087X  EQU   *                                                                
         SPACE 2                                                                
FLD088   DC    AL1(FLD088X-*),AL2(88)                                           
         DC    C'SOURCE AGENCY'                                                 
FLD088X  EQU   *                                                                
         SPACE 2                                                                
FLD089   DC    AL1(FLD089X-*),AL2(89)                                           
         DC    C'SOURCE OFFICE'                                                 
FLD089X  EQU   *                                                                
         SPACE 2                                                                
FLD090   DC    AL1(FLD090X-*),AL2(90)                                           
         DC    C'Closed Thru date'                                              
FLD090X  EQU   *                                                                
         SPACE 2                                                                
FLD091   DC    AL1(FLD091X-*),AL2(91)                                           
         DC    C'Effective date'                                                
FLD091X  EQU   *                                                                
         SPACE 2                                                                
FLD129   DC    AL1(FLD129X-*),AL2(129)                                          
         DC    C'B=Brdcst*,C=Calndr,4=4-Week,5=5-Week'                          
FLD129X  EQU   *                                                                
         SPACE 2                                                                
FLD130   DC    AL1(FLD130X-*),AL2(130)                                          
         DC    C'** Request Filters **'                                         
FLD130X  EQU   *                                                                
         SPACE 2                                                                
FLD131   DC    AL1(FLD131X-*),AL2(131)                                          
         DC    C'C=Comparable,N=New,O=Old'                                      
FLD131X  EQU   *                                                                
         SPACE 2                                                                
FLD132   DC    AL1(FLD132X-*),AL2(132)                                          
         DC    C'** Request Controls **'                                        
FLD132X  EQU   *                                                                
         SPACE 2                                                                
FLD133   DC    AL1(FLD133X-*),AL2(133)                                          
         DC    C'A=Alphabetic,Default=Code'                                     
FLD133X  EQU   *                                                                
         SPACE 2                                                                
FLD134   DC    AL1(FLD134X-*),AL2(134)                                          
         DC    C'M=Money,A=Avail,B=Both'                                        
FLD134X  EQU   *                                                                
         SPACE 2                                                                
FLD135   DC    AL1(FLD135X-*),AL2(135)                                          
         DC    C'S=Station*,O=Office'                                           
FLD135X  EQU   *                                                                
         SPACE 2                                                                
FLD136   DC    AL1(FLD136X-*),AL2(136)                                          
         DC    C'1 thru Number of Stations in List'                             
FLD136X  EQU   *                                                                
         SPACE 2                                                                
FLD137   DC    AL1(FLD137X-*),AL2(137)                                          
         DC    C'S=Station*,O=Office,M=Sperson'                                 
FLD137X  EQU   *                                                                
         SPACE 2                                                                
FLD138   DC    AL1(FLD138X-*),AL2(138)                                          
         DC    C'From: A=ACE, T=TWX/WU/GRAPH, O=Other'                          
FLD138X  EQU   *                                                                
         SPACE 2                                                                
FLD139   DC    AL1(FLD139X-*),AL2(139)                                          
         DC    C'D=Differences Only'                                            
FLD139X  EQU   *                                                                
         SPACE 2                                                                
FLD140   DC    AL1(FLD140X-*),AL2(140)                                          
         DC    C'Exclude Differences When Less Than:'                           
FLD140X  EQU   *                                                                
         SPACE 2                                                                
FLD141   DC    AL1(FLD141X-*),AL2(141)                                          
         DC    C'D=Agency Office Details'                                       
FLD141X  EQU   *                                                                
         SPACE 2                                                                
FLD142   DC    AL1(FLD142X-*),AL2(142)                                          
         DC    C' E=$100 F=$500 G=$1000 H=$1500 I=$5000'                        
FLD142X  EQU   *                                                                
         SPACE 2                                                                
FLD143   DC    AL1(FLD143X-*),AL2(143)                                          
         DC    C'F=Full Listing,Default=No Details'                             
FLD143X  EQU   *                                                                
         SPACE 2                                                                
FLD144   DC    AL1(FLD144X-*),AL2(144)                                          
         DC    C'Z=Print if Ord OR Inv (NOT both) = $0'                         
FLD144X  EQU   *                                                                
         SPACE 2                                                                
FLD145   DC    AL1(FLD145X-*),AL2(145)                                          
         DC    C'F=Full Listing,L=Legal Names,Default=No Details'               
FLD145X  EQU   *                                                                
         SPACE 2                                                                
FLD146   DC    AL1(FLD146X-*),AL2(146)                                          
         DC    C'S=Station, O=Office, R=Regional, A=All'                        
FLD146X  EQU   *                                                                
         SPACE 2                                                                
FLD147   DC    AL1(FLD147X-*),AL2(147)                                          
         DC    C'S=Suppress Details'                                            
FLD147X  EQU   *                                                                
         SPACE 2                                                                
FLD148   DC    AL1(FLD148X-*),AL2(148)                                          
         DC    C'To:   A=ACE, T=TWX/WU/GRAPH, O=Other'                          
FLD148X  EQU   *                                                                
         SPACE 2                                                                
FLD149   DC    AL1(FLD149X-*),AL2(149)                                          
         DC    C'C=Comb*,R=Reg,Any Other Legal Code'                            
FLD149X  EQU   *                                                                
         SPACE 2                                                                
FLD150   DC    AL1(FLD150X-*),AL2(150)                                          
         DC    C'    A=No Category Codes'                                       
FLD150X  EQU   *                                                                
         SPACE 2                                                                
FLD151   DC    AL1(FLD151X-*),AL2(151)                                          
         DC    C'N=Network,R=Reg'                                               
FLD151X  EQU   *                                                                
         SPACE 2                                                                
FLD152   DC    AL1(FLD152X-*),AL2(152)                                          
         DC    C'D*=Detail,R=Ranker,B=Both'                                     
FLD152X  EQU   *                                                                
         SPACE 2                                                                
FLD153   DC    AL1(FLD153X-*),AL2(153)                                          
         DC    C'R=Rep''s File'                                                 
FLD153X  EQU   *                                                                
         SPACE 2                                                                
FLD154   DC    AL1(FLD154X-*),AL2(154)                                          
         DC    C'S=Station*, I=Interface Code, B=Both'                          
FLD154X  EQU   *                                                                
         SPACE 2                                                                
FLD155   DC    AL1(FLD155X-*),AL2(155)                                          
         DC    C'G=Group*,S=Station'                                            
FLD155X  EQU   *                                                                
         SPACE 2                                                                
FLD156   DC    AL1(FLD156X-*),AL2(156)                                          
         DC    C'Y=Include Billing*,N=Exclude Billing'                          
FLD156X  EQU   *                                                                
         SPACE 2                                                                
FLD157   DC    AL1(FLD157X-*),AL2(157)                                          
         DC    C'MMMDD/YY'                                                      
FLD157X  EQU   *                                                                
         SPACE 2                                                                
FLD158   DC    AL1(FLD158X-*),AL2(158)                                          
         DC    C'MMMDD/YY (start=MONDAY, end=SUNDAY)'                           
FLD158X  EQU   *                                                                
         SPACE 2                                                                
FLD159   DC    AL1(FLD159X-*),AL2(159)                                          
         DC    C'MMM/YY'                                                        
FLD159X  EQU   *                                                                
         SPACE 2                                                                
FLD160   DC    AL1(FLD160X-*),AL2(160)                                          
         DC    C'C=Current Booked*, P=Prior Booked'                             
FLD160X  EQU   *                                                                
         SPACE 2                                                                
FLD161   DC    AL1(FLD161X-*),AL2(161)                                          
         DC    C'MMMDD/YY(Def=Today)(-MMMDD/YY)'                                
****>>>  DC    C'MMMDD/YY  Default=Today'                                       
FLD161X  EQU   *                                                                
         SPACE 2                                                                
FLD162   DC    AL1(FLD162X-*),AL2(162)                                          
         DC    C'A=Prior Final'                                                 
FLD162X  EQU   *                                                                
         SPACE 2                                                                
FLD163   DC    AL1(FLD163X-*),AL2(163)                                          
         DC    C'Start MMM/YY Only - 3 Mths Reported'                           
FLD163X  EQU   *                                                                
         SPACE 2                                                                
FLD164   DC    AL1(FLD164X-*),AL2(164)                                          
         DC    C'B=This Year VS Last Year'                                      
FLD164X  EQU   *                                                                
         SPACE 2                                                                
FLD165   DC    AL1(FLD165X-*),AL2(165)                                          
         DC    C'Start MMM/YY Only'                                             
FLD165X  EQU   *                                                                
         SPACE 2                                                                
FLD166   DC    AL1(FLD166X-*),AL2(166)                                          
         DC    C'O=Office*, M=S/P, B=Office+S/P'                                
FLD166X  EQU   *                                                                
         SPACE 2                                                                
FLD167   DC    AL1(FLD167X-*),AL2(167)                                          
         DC    C'T=Station Totals Only'                                         
FLD167X  EQU   *                                                                
         SPACE 2                                                                
FLD168   DC    AL1(FLD168X-*),AL2(168)                                          
         DC    C'C=Current Booked*, P=Prior Final'                              
FLD168X  EQU   *                                                                
         SPACE 2                                                                
FLD169   DC    AL1(FLD169X-*),AL2(169)                                          
         DC    C'A=Accounting Rpt,P=Pennies Included'                           
FLD169X  EQU   *                                                                
         SPACE 2                                                                
FLD170   DC    AL1(FLD170X-*),AL2(170)                                          
         DC    C'T=Accounting Rpt,P=Pennies Included*'                          
FLD170X  EQU   *                                                                
         SPACE 2                                                                
FLD171   DC    AL1(FLD171X-*),AL2(171)                                          
         DC    C'C=Commission Report'                                           
FLD171X  EQU   *                                                                
         SPACE 2                                                                
FLD172   DC    AL1(FLD172X-*),AL2(172)                                          
         DC    C'A=Accounting Option*,N=Not Accounting'                         
FLD172X  EQU   *                                                                
         SPACE 2                                                                
FLD173   DC    AL1(FLD173X-*),AL2(173)                                          
         DC    C'N=Agy No Rate Copy'                                            
FLD173X  EQU   *                                                                
         SPACE 2                                                                
FLD174   DC    AL1(FLD174X-*),AL2(174)                                          
         DC    C'TVB Sta Mkt=S*,TVB Office=O'                                   
FLD174X  EQU   *                                                                
         SPACE 2                                                                
FLD175   DC    AL1(FLD175X-*),AL2(175)                                          
         DC    C'R=Rep,S=Sperson Sum,O=Off Sum Report'                          
FLD175X  EQU   *                                                                
         SPACE 2                                                                
FLD176   DC    AL1(FLD176X-*),AL2(176)                                          
         DC    C'Sta Type=V, Sta Mkt+Sta Type=B'                                
FLD176X  EQU   *                                                                
         SPACE 2                                                                
FLD177   DC    AL1(FLD177X-*),AL2(177)                                          
         DC    C'Must Be M'                                                     
FLD177X  EQU   *                                                                
         SPACE 2                                                                
FLD178   DC    AL1(FLD178X-*),AL2(178)                                          
         DC    C'Y=Reverse Closeout'                                            
FLD178X  EQU   *                                                                
         SPACE 2                                                                
FLD179   DC    AL1(FLD179X-*),AL2(179)                                          
         DC    C'A=Prior Actual Figures,Blank=Estimate'                         
FLD179X  EQU   *                                                                
         SPACE 2                                                                
FLD180   DC    AL1(FLD180X-*),AL2(180)                                          
         DC    C'F=Forecast $, N=Pending $'                                     
FLD180X  EQU   *                                                                
         SPACE 2                                                                
FLD181   DC    AL1(FLD181X-*),AL2(181)                                          
         DC    C'Y=Show Demo Totals'                                            
FLD181X  EQU   *                                                                
         SPACE 2                                                                
FLD182   DC    AL1(FLD182X-*),AL2(182)                                          
         DC    C'(Start Date = New Close Date)'                                 
FLD182X  EQU   *                                                                
         SPACE 2                                                                
FLD183   DC    AL1(FLD183X-*),AL2(183)                                          
         DC    C'L=Station,M=Sperson'                                           
FLD183X  EQU   *                                                                
         SPACE 2                                                                
FLD184   DC    AL1(FLD184X-*),AL2(184)                                          
         DC    C'B=Booked $$*,A=As Run $$'                                      
FLD184X  EQU   *                                                                
         SPACE 2                                                                
FLD185   DC    AL1(FLD185X-*),AL2(185)                                          
         DC    C'S=Suppress Contract Details'                                   
FLD185X  EQU   *                                                                
         SPACE 2                                                                
FLD186   DC    AL1(FLD186X-*),AL2(186)                                          
         DC    C'R=Market Rpt*, S=Business Rpt, B=Both'                         
FLD186X  EQU   *                                                                
         SPACE 2                                                                
FLD187   DC    AL1(FLD187X-*),AL2(187)                                          
         DC    C'S=Suppress Competing Station Amts'                             
FLD187X  EQU   *                                                                
         SPACE 2                                                                
FLD188   DC    AL1(FLD188X-*),AL2(188)                                          
         DC    C'Y=Display Prior Final, N=No*'                                  
FLD188X  EQU   *                                                                
         SPACE 2                                                                
FLD189   DC    AL1(FLD189X-*),AL2(189)                                          
         DC    C'Salesperson Summary A,M,O,S,P'                                 
FLD189X  EQU   *                                                                
         SPACE 2                                                                
FLD190   DC    AL1(FLD190X-*),AL2(190)                                          
         DC    C'A=Avails*,C=Curr Bill,B=Both'                                  
FLD190X  EQU   *                                                                
         SPACE 2                                                                
FLD191   DC    AL1(FLD191X-*),AL2(191)                                          
         DC    C'Advertiser Summary A,M,O,S,P'                                  
FLD191X  EQU   *                                                                
         SPACE 2                                                                
FLD192   DC    AL1(FLD192X-*),AL2(192)                                          
         DC    C'Y=Show Converted Codes Only'                                   
FLD192X  EQU   *                                                                
         SPACE 2                                                                
FLD193   DC    AL1(FLD193X-*),AL2(193)                                          
         DC    C'Agency Summary A,M,O,S,P'                                      
FLD193X  EQU   *                                                                
         SPACE 2                                                                
FLD194   DC    AL1(FLD194X-*),AL2(194)                                          
         DC    C'Deflt=All,C=Code,N=Name,O=Office'                              
FLD194X  EQU   *                                                                
         SPACE 2                                                                
FLD195   DC    AL1(FLD195X-*),AL2(195)                                          
         DC    C'P=Preliminary'                                                 
FLD195X  EQU   *                                                                
         SPACE 2                                                                
FLD196   DC    AL1(FLD196X-*),AL2(196)                                          
         DC    C'Pending $$: M=Market*, S=Station'                              
FLD196X  EQU   *                                                                
         SPACE 2                                                                
FLD197   DC    AL1(FLD197X-*),AL2(197)                                          
         DC    C'Y=Sales Pressure Rpt'                                          
FLD197X  EQU   *                                                                
         SPACE 2                                                                
FLD198   DC    AL1(FLD198X-*),AL2(198)                                          
         DC    C'P=Point Person Summary*,S=S/P Detail'                          
FLD198X  EQU   *                                                                
         SPACE 2                                                                
FLD199   DC    AL1(FLD199X-*),AL2(199)                                          
         DC    C'Daypart Table Number'                                          
FLD199X  EQU   *                                                                
         SPACE 2                                                                
FLD200   DC    AL1(FLD200X-*),AL2(200)                                          
         DC    C'P=Pending*,I=Incompletes,B=Both'                               
FLD200X  EQU   *                                                                
         SPACE 2                                                                
FLD201   DC    AL1(FLD201X-*),AL2(201)                                          
         DC    C'Y=Show Rate Detail'                                            
FLD201X  EQU   *                                                                
         SPACE 2                                                                
FLD202   DC    AL1(FLD202X-*),AL2(202)                                          
         DC    C'For COMPLETE ORDERS: MMMDD/YY'                                 
FLD202X  EQU   *                                                                
         SPACE 2                                                                
FLD203   DC    AL1(FLD203X-*),AL2(203)                                          
         DC    C'A=Agency Detail*,P=Product Detail'                             
FLD203X  EQU   *                                                                
         SPACE 2                                                                
FLD204   DC    AL1(FLD204X-*),AL2(204)                                          
         DC    C'N=No Adv Summary (OPT2 Must be Y)'                             
FLD204X  EQU   *                                                                
         SPACE 2                                                                
FLD205   DC    AL1(FLD205X-*),AL2(205)                                          
         DC    C'Y=Advertiser Within Agency Recap'                              
FLD205X  EQU   *                                                                
         SPACE 2                                                                
FLD206   DC    AL1(FLD206X-*),AL2(206)                                          
         DC    C'F=Full Dollars*,T=Thousands'                                   
FLD206X  EQU   *                                                                
         SPACE 2                                                                
FLD207   DC    AL1(FLD207X-*),AL2(207)                                          
         DC    C'W=Worksheet,Blank=Sales Actv Rpt'                              
FLD207X  EQU   *                                                                
         SPACE 2                                                                
FLD208   DC    AL1(FLD208X-*),AL2(208)                                          
         DC    C'S=Station*,O=Office,T=Team'                                    
FLD208X  EQU   *                                                                
         SPACE 2                                                                
FLD209   DC    AL1(FLD209X-*),AL2(209)                                          
         DC    C'N=Suppress Detail,S=Office Summaries'                          
FLD209X  EQU   *                                                                
         SPACE 2                                                                
FLD210   DC    AL1(FLD210X-*),AL2(210)                                          
         DC    C'Seq: O=OwnerCode*,N=Name,B=Both'                               
FLD210X  EQU   *                                                                
         SPACE 2                                                                
FLD211   DC    AL1(FLD211X-*),AL2(211)                                          
         DC    C'A=Prior Actual Figures,Blank=Estimate'                         
FLD211X  EQU   *                                                                
         SPACE 2                                                                
FLD212   DC    AL1(FLD212X-*),AL2(212)                                          
         DC    C'                                     '                         
FLD212X  EQU   *                                                                
         SPACE 2                                                                
FLD213   DC    AL1(FLD213X-*),AL2(213)                                          
         DC    C'MMM/YY  Default End Date = Start Date'                         
FLD213X  EQU   *                                                                
         SPACE 2                                                                
FLD214   DC    AL1(FLD214X-*),AL2(214)                                          
         DC    C'MMM/YY  12 months required'                                    
FLD214X  EQU   *                                                                
         SPACE 2                                                                
FLD215   DC    AL1(FLD215X-*),AL2(215)                                          
         DC    C'M=Months,Q=Quarters,A=Whole Period*'                           
FLD215X  EQU   *                                                                
         SPACE 2                                                                
FLD216   DC    AL1(FLD216X-*),AL2(216)                                          
         DC    C'reset default = NO'                                            
FLD216X  EQU   *                                                                
         SPACE 2                                                                
FLD217   DC    AL1(FLD217X-*),AL2(217)                                          
         DC    C'NN=Rank Max  Default=All'                                      
FLD217X  EQU   *                                                                
         SPACE 2                                                                
FLD218   DC    AL1(FLD218X-*),AL2(218)                                          
         DC    C'S=Stn, O=Off, B=Both, T=TEST!'                                 
FLD218X  EQU   *                                                                
         SPACE 2                                                                
FLD219   DC    AL1(FLD219X-*),AL2(219)                                          
         DC    C'Y=Rank On YTD*, P=Rank On Period'                              
FLD219X  EQU   *                                                                
         SPACE 2                                                                
FLD220   DC    AL1(FLD220X-*),AL2(220)                                          
         DC    C'Z=ONLY ZERO MONTHLY $      T=TEST!'                            
FLD220X  EQU   *                                                                
         SPACE 2                                                                
FLD221   DC    AL1(FLD221X-*),AL2(221)                                          
         DC    C'D=Detail Only*, R=Recap Only, B=Both'                          
FLD221X  EQU   *                                                                
         SPACE 2                                                                
FLD222   DC    AL1(FLD222X-*),AL2(222)                                          
         DC    C'*D=Detail,S=Summary,T=Total Only'                              
FLD222X  EQU   *                                                                
         SPACE 2                                                                
FLD223   DC    AL1(FLD223X-*),AL2(223)                                          
         DC    C'A=Active Stations*, I=Inactive, B=Both'                        
FLD223X  EQU   *                                                                
         SPACE 2                                                                
FLD224   DC    AL1(FLD224X-*),AL2(224)                                          
         DC    C'(Enter as Type,Percent)'                                       
FLD224X  EQU   *                                                                
         SPACE 2                                                                
FLD225   DC    AL1(FLD225X-*),AL2(225)                                          
         DC    C'S=Station Seq, M=Market Seq, B=Both*'                          
FLD225X  EQU   *                                                                
         SPACE 2                                                                
FLD226   DC    AL1(FLD226X-*),AL2(226)                                          
         DC    C'D=Station Seq With Details'                                    
FLD226X  EQU   *                                                                
         SPACE 2                                                                
FLD227   DC    AL1(FLD227X-*),AL2(227)                                          
         DC    C'(Enter Type)'                                                  
FLD227X  EQU   *                                                                
         SPACE 2                                                                
FLD228   DC    AL1(FLD228X-*),AL2(228)                                          
         DC    C'*S=Spots, D=$, B=S+D, A=D/S, N=None'                           
FLD228X  EQU   *                                                                
         SPACE 2                                                                
FLD229   DC    AL1(FLD229X-*),AL2(229)                                          
         DC    C'NN=Rank Max   Default=99'                                      
FLD229X  EQU   *                                                                
         SPACE 2                                                                
FLD230   DC    AL1(FLD230X-*),AL2(230)                                          
         DC    C'Percent of Daypart: S, D, B, *N'                               
FLD230X  EQU   *                                                                
         SPACE 2                                                                
FLD231   DC    AL1(FLD231X-*),AL2(231)                                          
         DC    C'W=Worksheet*, P=Preliminary, F=Final'                          
FLD231X  EQU   *                                                                
         SPACE 2                                                                
FLD232   DC    AL1(FLD232X-*),AL2(232)                                          
         DC    C'Sort on Category Code: Y or *N'                                
FLD232X  EQU   *                                                                
         SPACE 2                                                                
FLD233   DC    AL1(FLD233X-*),AL2(233)                                          
         DC    C'Y=Share Report    Default=N'                                   
FLD233X  EQU   *                                                                
         SPACE 2                                                                
FLD234   DC    AL1(FLD234X-*),AL2(234)                                          
         DC    C'(N)Exclude*/(Y)Include CURRENT BILLING'                        
FLD234X  EQU   *                                                                
         SPACE 2                                                                
FLD235   DC    AL1(FLD235X-*),AL2(235)                                          
         DC    C'R=Recap Only,     B=Both*'                                     
FLD235X  EQU   *                                                                
         SPACE 2                                                                
FLD236   DC    AL1(FLD236X-*),AL2(236)                                          
         DC    C'*E=Estimate $, B=Booked $'                                     
FLD236X  EQU   *                                                                
         SPACE 2                                                                
FLD237   DC    AL1(FLD237X-*),AL2(237)                                          
         DC    C'W=Weekly, M=Monthly'                                           
FLD237X  EQU   *                                                                
         SPACE 2                                                                
FLD238   DC    AL1(FLD238X-*),AL2(238)                                          
         DC    C'D=Company,R=Cross-Company,B=Both*'                             
FLD238X  EQU   *                                                                
         SPACE 2                                                                
FLD239   DC    AL1(FLD239X-*),AL2(239)                                          
         DC    C'W=Weekly, M=Monthly, P=Progressive'                            
FLD239X  EQU   *                                                                
         SPACE 2                                                                
FLD240   DC    AL1(FLD240X-*),AL2(240)                                          
         DC    C'C=Combo Sta List, #=Sta ID# Seq'                               
FLD240X  EQU   *                                                                
         SPACE 2                                                                
FLD241   DC    AL1(FLD241X-*),AL2(241)                                          
         DC    C'(12 Month Maximum)'                                            
FLD241X  EQU   *                                                                
         SPACE 2                                                                
FLD242   DC    AL1(FLD242X-*),AL2(242)                                          
         DC    C'Y=Print Detail, N=No*'                                         
FLD242X  EQU   *                                                                
         SPACE 2                                                                
FLD243   DC    AL1(FLD243X-*),AL2(243)                                          
         DC    C'U=Update, S=Soft (No Update)'                                  
FLD243X  EQU   *                                                                
         SPACE 2                                                                
FLD244   DC    AL1(FLD244X-*),AL2(244)                                          
         DC    C'MMMYY-MMMYY of Situation Analysis'                             
FLD244X  EQU   *                                                                
         SPACE 2                                                                
FLD245   DC    AL1(FLD245X-*),AL2(245)                                          
         DC    C'C=Clear, D=Don''t Clear Invoice Dollars'                       
FLD245X  EQU   *                                                                
         SPACE 2                                                                
FLD246   DC    AL1(FLD246X-*),AL2(246)                                          
         DC    C'A=Budgets ONLY       B=Billing ONLY'                           
FLD246X  EQU   *                                                                
         SPACE 2                                                                
FLD247   DC    AL1(FLD247X-*),AL2(247)                                          
         DC    C'C=Budgets+Billing    T=Budgets BY TYPE'                        
FLD247X  EQU   *                                                                
         SPACE 2                                                                
FLD248   DC    AL1(FLD248X-*),AL2(248)                                          
         DC    C'S=Station*,T=Station/Office'                                   
FLD248X  EQU   *                                                                
         SPACE 2                                                                
FLD249   DC    AL1(FLD249X-*),AL2(249)                                          
         DC    C'O=Office/Team,P=Grp/Off/Team'                                  
FLD249X  EQU   *                                                                
         SPACE 2                                                                
FLD250   DC    AL1(FLD250X-*),AL2(250)                                          
         DC    C'S=Station'                                                     
FLD250X  EQU   *                                                                
         SPACE 2                                                                
FLD251   DC    AL1(FLD251X-*),AL2(251)                                          
         DC    C'Y=Suppress Return Address, *N'                                 
FLD251X  EQU   *                                                                
         SPACE 2                                                                
FLD252   DC    AL1(FLD252X-*),AL2(252)                                          
         DC    C'A=Station Seq With Activity Details'                           
FLD252X  EQU   *                                                                
         SPACE 2                                                                
FLD253   DC    AL1(FLD253X-*),AL2(253)                                          
         DC    C'A=Sort By Agency, Buyer'                                       
FLD253X  EQU   *                                                                
         SPACE 2                                                                
FLD254   DC    AL1(FLD254X-*),AL2(254)                                          
         DC    C'*B=Sort By Buyer, Agency'                                      
FLD254X  EQU   *                                                                
         SPACE 2                                                                
FLD255   DC    AL1(FLD255X-*),AL2(255)                                          
         DC    C'Y=Laser Printer Option, *N'                                    
FLD255X  EQU   *                                                                
         SPACE 2                                                                
FLD256   DC    AL1(FLD256X-*),AL2(256)                                          
         DC    C'S=Station*, O=Office,'                                         
FLD256X  EQU   *                                                                
         SPACE 2                                                                
FLD257   DC    AL1(FLD257X-*),AL2(257)                                          
         DC    C'M=Salesperson, B=Office+SP'                                    
FLD257X  EQU   *                                                                
         SPACE 2                                                                
FLD258   DC    AL1(FLD258X-*),AL2(258)                                          
         DC    C'N=Station Seq With Market Code/Name'                           
FLD258X  EQU   *                                                                
         SPACE 2                                                                
FLD259   DC    AL1(FLD259X-*),AL2(259)                                          
         DC    C'*O=Owner, S=Station, B=Both'                                   
FLD259X  EQU   *                                                                
         SPACE 2                                                                
FLD260   DC    AL1(FLD260X-*),AL2(260)                                          
         DC    C'C=Company/Office/Contract type'                                
FLD260X  EQU   *                                                                
         SPACE 2                                                                
FLD261   DC    AL1(FLD261X-*),AL2(261)                                          
         DC    C'P=Pending,F=Forecast,B=Both*'                                  
FLD261X  EQU   *                                                                
FLD262   DC    AL1(FLD262X-*),AL2(262)                                          
         DC    C'Y=Details, *N'                                                 
FLD262X  EQU   *                                                                
         SPACE 2                                                                
FLD263   DC    AL1(FLD263X-*),AL2(263)                                          
         DC    C'Y=Show SubGroup Totals*, N=Suppress'                           
FLD263X  EQU   *                                                                
         SPACE 2                                                                
FLD264   DC    AL1(FLD264X-*),AL2(264)                                          
         DC    C'Y=Show Recap*, N=Suppress'                                     
FLD264X  EQU   *                                                                
         SPACE 2                                                                
FLD265   DC    AL1(FLD265X-*),AL2(265)                                          
         DC    C'O=Ordered Only, I=Invoiced Only'                               
FLD265X  EQU   *                                                                
         SPACE 2                                                                
FLD266   DC    AL1(FLD266X-*),AL2(266)                                          
         DC    C'B=Ordered+Invoiced, Default=All'                               
FLD266X  EQU   *                                                                
         SPACE 2                                                                
FLD267   DC    AL1(FLD267X-*),AL2(267)                                          
         DC    C'Y=Break Out Spot Lengths, *N'                                  
FLD267X  EQU   *                                                                
         SPACE 2                                                                
FLD268   DC    AL1(FLD268X-*),AL2(268)                                          
         DC    C'Z=YTD + CUMES, Q=Period + CUMES'                               
FLD268X  EQU   *                                                                
         SPACE 2                                                                
FLD269   DC    AL1(FLD269X-*),AL2(269)                                          
         DC    C'<CUMES Require A=Whole Period>'                                
FLD269X  EQU   *                                                                
         SPACE 2                                                                
FLD270   DC    AL1(FLD270X-*),AL2(270)                                          
         DC    C'Rank: F=Prior Final, C=Curr Forecast*'                         
FLD270X  EQU   *                                                                
         SPACE 2                                                                
FLD271   DC    AL1(FLD271X-*),AL2(271)                                          
         DC    C'UNUSED AT THIS TIME'                                           
FLD271X  EQU   *                                                                
         SPACE 2                                                                
FLD272   DC    AL1(FLD272X-*),AL2(272)                                          
         DC    C'A=Active Only, B=Both*'                                        
FLD272X  EQU   *                                                                
         SPACE 2                                                                
FLD273   DC    AL1(FLD273X-*),AL2(273)                                          
         DC    C'D=Duplicate Stations Only*, A=All'                             
FLD273X  EQU   *                                                                
         SPACE 2                                                                
FLD274   DC    AL1(FLD274X-*),AL2(274)                                          
         DC    C'S=Station Totals Only'                                         
FLD274X  EQU   *                                                                
         SPACE 2                                                                
FLD275   DC    AL1(FLD275X-*),AL2(275)                                          
         DC    C'P=Include Products'                                            
FLD275X  EQU   *                                                                
         SPACE 2                                                                
FLD276   DC    AL1(FLD276X-*),AL2(276)                                          
         DC    C'C=Suppress Contract Type'                                      
FLD276X  EQU   *                                                                
         SPACE 2                                                                
FLD277   DC    AL1(FLD277X-*),AL2(277)                                          
         DC    C'A=Market/Adv*,C=Market/Station'                                
FLD277X  EQU   *                                                                
         SPACE 2                                                                
FLD278   DC    AL1(FLD278X-*),AL2(278)                                          
         DC    C'Report Sequence:'                                              
FLD278X  EQU   *                                                                
         SPACE 2                                                                
FLD279   DC    AL1(FLD279X-*),AL2(279)                                          
         DC    C'V=Video format*,R=Report'                                      
FLD279X  EQU   *                                                                
         SPACE 2                                                                
FLD280   DC    AL1(FLD280X-*),AL2(280)                                          
         DC    C'Y=3-Year Track*,N=2Year Prior'                                 
FLD280X  EQU   *                                                                
         SPACE 2                                                                
FLD281   DC    AL1(FLD281X-*),AL2(281)                                          
         DC    C'Y=Include,N=Exclude: ADVERTISERS'                              
FLD281X  EQU   *                                                                
         SPACE 2                                                                
FLD282   DC    AL1(FLD282X-*),AL2(282)                                          
         DC    C'A=Advertiser*,S=Station'                                       
FLD282X  EQU   *                                                                
         SPACE 2                                                                
FLD283   DC    AL1(FLD283X-*),AL2(283)                                          
         DC    C'A=Manager*, B=Seller'                                          
FLD283X  EQU   *                                                                
         SPACE 2                                                                
FLD284   DC    AL1(FLD284X-*),AL2(284)                                          
         DC    C'E=Email address'                                               
FLD284X  EQU   *                                                                
         SPACE 2                                                                
FLD285   DC    AL1(FLD285X-*),AL2(285)                                          
         DC    C'Y=Current Data from Control File'                              
FLD285X  EQU   *                                                                
         SPACE 2                                                                
FLD286   DC    AL1(FLD286X-*),AL2(286)                                          
         DC    C'*S=Self-Applied Unapproved Offers'                             
FLD286X  EQU   *                                                                
         SPACE 2                                                                
FLD287   DC    AL1(FLD287X-*),AL2(287)                                          
         DC    C'O=Open Makegoods'                                              
FLD287X  EQU   *                                                                
         SPACE 2                                                                
FLD400   DC    AL1(FLD400X-*),AL2(400)                                          
         DC    C'DOWNLOAD: D=Current Booked , Q=Prior Final'                    
FLD400X  EQU   *                                                                
         SPACE 2                                                                
FLD401   DC    AL1(FLD401X-*),AL2(401)                                          
         DC    C'C=Curr$, D=Class Report, E=Forced Report'                      
FLD401X  EQU   *                                                                
         SPACE 2                                                                
FLD402   DC    AL1(FLD402X-*),AL2(402)                                          
         DC    C'CLASS/CATEGORY: E=Avail+Billing'                               
FLD402X  EQU   *                                                                
         SPACE 2                                                                
FLD403   DC    AL1(FLD403X-*),AL2(403)                                          
         DC    C'MMM/YY-MMM/YY'                                                 
FLD403X  EQU   *                                                                
         SPACE 2                                                                
FLD404   DC    AL1(FLD404X-*),AL2(404)                                          
         DC    C'EFFECTIVE DATE:  MMM/YY'                                       
FLD404X  EQU   *                                                                
         SPACE 2                                                                
FLD405   DC    AL1(FLD405X-*),AL2(405)                                          
         DC    C'R = RECEIVE, S = SEND'                                         
FLD405X  EQU   *                                                                
         SPACE 2                                                                
FLD406   DC    AL1(FLD406X-*),AL2(406)                                          
         DC    C'(SEND REQUIRES EFF. DATE)'                                     
FLD406X  EQU   *                                                                
         SPACE 2                                                                
FLD407   DC    AL1(FLD407X-*),AL2(407)                                          
         DC    C'M=Market(No Stn),O=Office Summary'                             
FLD407X  EQU   *                                                                
         SPACE 2                                                                
FLD408   DC    AL1(FLD408X-*),AL2(408)                                          
         DC    C'   When Option2 = BOTH:'                                       
FLD408X  EQU   *                                                                
         SPACE 2                                                                
FLD409   DC    AL1(FLD409X-*),AL2(409)                                          
         DC    C'Inactive Stn Cutoff (MMMDD/YY)'                                
FLD409X  EQU   *                                                                
         SPACE 2                                                                
FLD410   DC    AL1(FLD410X-*),AL2(410)                                          
         DC    C'MMMDD/YY-MMMDD/YY'                                             
FLD410X  EQU   *                                                                
         SPACE 2                                                                
FLD411   DC    AL1(FLD411X-*),AL2(411)                                          
         DC    C'O=OFFICE SEQ*,A=AGENCY SEQ'                                    
FLD411X  EQU   *                                                                
         SPACE 2                                                                
FLD412   DC    AL1(FLD412X-*),AL2(412)                                          
         DC    C'A=ALL ORDERS*,T=TAKEOVERS ONLY'                                
FLD412X  EQU   *                                                                
         SPACE 2                                                                
FLD413   DC    AL1(FLD413X-*),AL2(413)                                          
         DC    C'D=Detail(M+C) Only,R=Recap Only'                               
FLD413X  EQU   *                                                                
         SPACE 2                                                                
FLD414   DC    AL1(FLD414X-*),AL2(414)                                          
         DC    C'M=Detail MARKET, C=Detail COMPANY'                             
FLD414X  EQU   *                                                                
         SPACE 2                                                                
FLD415   DC    AL1(FLD415X-*),AL2(415)                                          
         DC    C'Y=Include AGENCY NAME'                                         
FLD415X  EQU   *                                                                
         SPACE 2                                                                
FLD416   DC    AL1(FLD416X-*),AL2(416)                                          
         DC    C'S=Sort/Page Break By Station'                                  
FLD416X  EQU   *                                                                
         SPACE 2                                                                
FLD417   DC    AL1(FLD417X-*),AL2(417)                                          
         DC    C'M=Sort By Market Name'                                         
FLD417X  EQU   *                                                                
         SPACE 2                                                                
FLD418   DC    AL1(FLD418X-*),AL2(418)                                          
         DC    C'N=Natl,L=Local,B=Both*'                                        
FLD418X  EQU   *                                                                
         SPACE 2                                                                
FLD419   DC    AL1(FLD419X-*),AL2(419)                                          
         DC    C'National/Local OFFICE Filter'                                  
FLD419X  EQU   *                                                                
         SPACE 2                                                                
FLD420   DC    AL1(FLD420X-*),AL2(420)                                          
         DC    C'N=No Station Level Breakout'                                   
FLD420X  EQU   *                                                                
         SPACE 2                                                                
FLD421   DC    AL1(FLD421X-*),AL2(421)                                          
         DC    C'B=Booked Dollars Only'                                         
FLD421X  EQU   *                                                                
         SPACE 2                                                                
FLD422   DC    AL1(FLD422X-*),AL2(422)                                          
         DC    C'C=Create Date fltr,L=Last Update fltr'                         
FLD422X  EQU   *                                                                
         SPACE 2                                                                
FLD423   DC    AL1(FLD423X-*),AL2(423)                                          
         DC    C'D=Detail Reports*, R=Recap Reports'                            
FLD423X  EQU   *                                                                
         SPACE 2                                                                
FLD424   DC    AL1(FLD424X-*),AL2(424)                                          
         DC    C'F/G=Frcst$,N/O=Pnding$,A/B=PriorFinal'                         
FLD424X  EQU   *                                                                
         SPACE 2                                                                
FLD425   DC    AL1(FLD425X-*),AL2(425)                                          
         DC    C'C/D=CurrentBooked*,P/Q=PriorBooked'                            
FLD425X  EQU   *                                                                
         SPACE 2                                                                
FLD426   DC    AL1(FLD426X-*),AL2(426)                                          
         DC    C'EXAMPLE: FORECAST$  F=WHOLE$  G=THOUSANDS'                     
FLD426X  EQU   *                                                                
         SPACE 2                                                                
FLD427   DC    AL1(FLD427X-*),AL2(427)                                          
         DC    C'budget test:  reports A,B,C,D,E'                               
FLD427X  EQU   *                                                                
         SPACE 2                                                                
FLD428   DC    AL1(FLD428X-*),AL2(428)                                          
         DC    C'Y=NAME Display'                                                
FLD428X  EQU   *                                                                
         SPACE 2                                                                
FLD429   DC    AL1(FLD429X-*),AL2(429)                                          
         DC    C'F=PERIOD+YTD*,N=NO BUDGET'                                     
FLD429X  EQU   *                                                                
         SPACE 2                                                                
FLD430   DC    AL1(FLD430X-*),AL2(430)                                          
         DC    C'P=PERIOD ONLY,Y=YTD ONLY'                                      
FLD430X  EQU   *                                                                
         SPACE 2                                                                
FLD431   DC    AL1(FLD431X-*),AL2(431)                                          
         DC    C'X=Closed Thru'                                                 
FLD431X  EQU   *                                                                
         SPACE 2                                                                
FLD432   DC    AL1(FLD432X-*),AL2(432)                                          
         DC    C'E=Use Best $'                                                  
FLD432X  EQU   *                                                                
         SPACE 2                                                                
FLD433   DC    AL1(FLD433X-*),AL2(433)                                          
         DC    C'Z=NEW/OLD Display'                                             
FLD433X  EQU   *                                                                
         SPACE 2                                                                
FLD434   DC    AL1(FLD434X-*),AL2(434)                                          
         DC    C'C=Compensation S/P Seq'                                        
FLD434X  EQU   *                                                                
         SPACE 2                                                                
*                                                                               
*- BLANK FIELDS FOR INPUT/OUTPUT.  3XX, XX=LENGTH                               
         SPACE                                                                  
FLD301   DC    AL1(FLD301X-*),AL2(301),XL1'00'                                  
FLD301X  EQU   *                                                                
         SPACE 2                                                                
FLD302   DC    AL1(FLD302X-*),AL2(302),XL2'00'                                  
FLD302X  EQU   *                                                                
         SPACE 2                                                                
FLD303   DC    AL1(FLD303X-*),AL2(303),XL3'00'                                  
FLD303X  EQU   *                                                                
         SPACE 2                                                                
FLD304   DC    AL1(FLD304X-*),AL2(304),XL4'00'                                  
FLD304X  EQU   *                                                                
         SPACE 2                                                                
FLD305   DC    AL1(FLD305X-*),AL2(305),XL5'00'                                  
FLD305X  EQU   *                                                                
         SPACE 2                                                                
FLD306   DC    AL1(FLD306X-*),AL2(306),XL6'00'                                  
FLD306X  EQU   *                                                                
         SPACE 2                                                                
FLD307   DC    AL1(FLD307X-*),AL2(307),XL7'00'                                  
FLD307X  EQU   *                                                                
         SPACE 2                                                                
FLD308   DC    AL1(FLD308X-*),AL2(308),XL8'00'                                  
FLD308X  EQU   *                                                                
         SPACE 2                                                                
FLD309   DC    AL1(FLD309X-*),AL2(309),XL9'00'                                  
FLD309X  EQU   *                                                                
         SPACE 2                                                                
FLD310   DC    AL1(FLD310X-*),AL2(310),XL10'00'                                 
FLD310X  EQU   *                                                                
         SPACE 2                                                                
FLD311   DC    AL1(FLD311X-*),AL2(311),XL11'00'                                 
FLD311X  EQU   *                                                                
         SPACE 2                                                                
FLD312   DC    AL1(FLD312X-*),AL2(312),XL12'00'                                 
FLD312X  EQU   *                                                                
         SPACE 2                                                                
FLD315   DC    AL1(FLD315X-*),AL2(315),XL15'00'                                 
FLD315X  EQU   *                                                                
         SPACE 2                                                                
FLD319   DC    AL1(FLD319X-*),AL2(319),XL19'00'                                 
FLD319X  EQU   *                                                                
         SPACE 2                                                                
FLD320   DC    AL1(FLD320X-*),AL2(320),XL20'00'                                 
FLD320X  EQU   *                                                                
         SPACE 2                                                                
FLD321   DC    AL1(FLD321X-*),AL2(321)                                          
         DC    C'E=Contract End Date*, A=All Station'                           
FLD321X  EQU   *                                                                
         SPACE 2                                                                
FLD322   DC    AL1(FLD322X-*),AL2(322)                                          
         DC    C'MMM/YY(Commission Effective Date)'                             
FLD322X  EQU   *                                                                
         SPACE 2                                                                
FLD323   DC    AL1(FLD323X-*),AL2(323)                                          
         DC    C'A=Active Stations*, I=Inactive'                                
FLD323X  EQU   *                                                                
         SPACE 2                                                                
         DC    X'00'               EOT                                          
