*          DATA SET RERESD7D   AT LEVEL 006 AS OF 03/07/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T819D7D      DATE 03/07/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
TXTSTAH  DS    CL8                                                              
TXTSTA   DS    CL8      5   10    8  A   U    N         T    I   Y   10         
TXTSTAX  DS    CL8                                                              
TXTMRKTH DS    CL8                                                              
TXTMRKT  DS    CL20     5   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    H         T        Y              
TXTTYPH  DS    CL8                                                              
TXTTYP   DS    CL15     6   10   15  A   U    N         T        Y   40         
TXTTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL29     6   38   29  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
TXTNUMH  DS    CL8                                                              
TXTNUM   DS    CL5      7   10    5  A   U    N         T        Y   50         
TXTNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   76    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  A   P    N         T        Y              
TXTSRCH  DS    CL8                                                              
TXTSRC   DS    CL4      9   10    4  A   U    N         T        Y   60         
TXTSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     10    2    4  A   P    N         T        Y              
TXTBOOKH DS    CL8                                                              
TXTBOOK  DS    CL10    10   10   10  A   U    N         T        Y   70         
TXTBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    10   38   15  A   P    N         T        Y              
TXTLOCH  DS    CL8                                                              
TXTLOC   DS    CL2     10   56    2  A   U    N         T        Y   75         
TXTLOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A   P    N         T        Y              
TXTFRCH  DS    CL8                                                              
TXTFRC   DS    CL2     11   10    2  A   U    N         T        Y   80         
TXTFRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     12    2    5  A   P    N         T        Y              
TXTDEMOH DS    CL8                                                              
TXTDEMO  DS    CL60    12   10   60  A   U    N         T        Y   90         
TXTDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    N         T        Y              
TXTTEXTH DS    CL8                                                              
TXTTEXT  DS    CL60    13   10   60  A   U    N         T        N   95         
TXTTEXTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    14   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    15   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    16   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    17   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    18   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    19   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    20   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    21   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    22   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    23   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    24   10   60  A   U    N         T        N   95         
         DS    CL8                                                              
TXTLSTH  DS    CL8                                                              
TXTLST   DS    CL1     24   76    1  A   U    N         T        Y              
TXTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TXTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
