*          DATA SET REREQWRK   AT LEVEL 237 AS OF 10/10/11                      
***********************************************************************         
* HISTORY PRIOR TO 1995 HAS BEEN DELETED                              *         
*                                                                     *         
* MAR27/95 (BU ) --- ADD L(ENTRY) EQU FOR FIELD DEFINITION            *         
*                                                                     *         
* JUL11/95 (BU ) --- AC REPORT ACCOPT                                 *         
*                                                                     *         
* OCT10/95 (BU ) --- ADD EXTRA DATES TO REQ CARD 3                    *         
*                                                                     *         
* APR11/97 (BU ) --- EXPAND CONREC AREA TO 2K                         *         
*                                                                     *         
* MAY18/98 (BU ) --- COMPANY BUDGET FLAG/REARRANGE DATE OPTION        *         
*                                                                     *         
* AUG05/98 (BU ) --- OVERLAY EQU FOR 'SECURITY' CHECKING OVERLAY      *         
*                                                                     *         
*                                                                     *         
*                    ***  END TOMBSTONE  ***                          *         
***********************************************************************         
REQWRK   DSECT                                                                  
*                                                                               
*                        GENERAL TEMPORARY W/S                                  
DUB      DS    D                                                                
FULL     DS    F                                                                
FULL2    DS    F                                                                
HALF     DS    H                                                                
HALF1    DS    H                                                                
HALF2    DS    H                                                                
BYTE     DS    C                                                                
BYTE2    DS    C                                                                
WORK     DS    CL20                                                             
KEY      DS    CL34                                                             
KEYSAVE  DS    CL34                                                             
*                                                                               
*                        ADDRESSES OF GLOBAL STORAGE AREAS                      
CURSPOS  DS    F                   A(HEADER) TO POSITION CURSOR                 
RELO     DS    F                   BASE RELOCATION FACTOR                       
*                                                                               
AERROR   DS    0F                  A(ERROR MESSAGE TO DISPLAY)                  
ERRCNTL  DS    XL1                   ERROR CONTROL BITS                         
ERRDATA  DS    XL3                   A(ERROR MSG) OR MSG NUMBER                 
LERROR   DS    F                   LENGTH OF MESSAGE (IN BYTES)                 
*                    ERRCNTL BITS                                               
ECMSGNUM EQU   X'80'               ERRDATA IS 1 BYTE MSG NUMBER                 
*                                  ON CONTROL FILE                              
ECNOBEEP EQU   X'40'               INFORMATIONAL MSG ONLY. NO BEEP.             
*                                                                               
AIOWORK  DS    A                   A(DMGR IOBUFFER)                             
ASAVE    DS    A                   A(TWA)                                       
ATEMP    DS    A                   A(W/S)                                       
ABASE    DS    A                   A(REQUEST BASE)                              
APARM    DS    F                   A(PROGRAM PARM LIST FROM MONITOR)            
AFIRSTF  DS    F                   A(FIRST INPUT FLD HDR)                       
ALASTF   DS    F                   A(LAST INPUT FLD HDR)                        
COUNTF   DS    H                   NUM OF FIELDS INPUT                          
*                                                                               
*                        ADDRESSES OF USER FACILITES                            
FACLIST  DS    0F      CL28        SYSFACS LIST                                 
DATAMGR  DS    F                                                                
CALLOV   DS    F                                                                
CASHVAL  DS    F                                                                
DATVAL   DS    F                                                                
DATCON   DS    F                                                                
GETMSG   DS    F                                                                
RECUP    DS    F                                                                
*                                                                               
*                                                                               
FILENAME DS    CL8                 DMGR FILE NAME                               
DIRNAME  DS    CL8                 DMGR DIRECTORY NAME                          
COMMAND  DS    CL8                 DMGR COMMAND                                 
TERMNAL  DS    X                   TERMINAL NUMBER                              
DMINBTS  DS    X                   DMGR INPUT BITS                              
DMOUTBTS DS    X                   DMGR OUTPUT BITS                             
DMWORK   DS    (12*8)X             12 DBBL WD DMGR WORK AREA                    
*                                                                               
AREQNTRY DS    A                   A(REQTBL ENTRY FOR CURRENT RQST)             
AACTNTRY DS    A                   A(ACTION TABLE ENTRY)                        
*                                                                               
*                        ADDRESSES OF LOCAL FACILITIES                          
ACOMMON  DS    0F                  * ORDER MUST MATCH REQ00 INITIAL *           
*                                                                               
AREQTBLC DS    A                   A(REQUEST TABLE 1(REREQ10))                  
AREQTBL1 DS    A                   A(REQUEST TABLE 2(REREQ11))                  
AREQTBL2 DS    A                   A(REQUEST TABLE 3(REREQ12))                  
AREQTBL3 DS    A                   A(REQUEST TABLE 4(REREQ13))                  
AREQTBL4 DS    A                   A(REQUEST TABLE 5(REREQ14))                  
AREQTBL5 DS    A                   A(REQUEST TABLE 6(REREQ15))                  
AGETOVLY DS    A                   A(OVERLAY ROUTINE)                           
DIRREAD  DS    A       DMREAD      DIRECTORY READ                               
DIRCHAIN DS    A       DMRDIR      REQ FILE CHAIN READ                          
DIRHIGH  DS    A       DMHIGH      DIRECTORY READ HIGH                          
DIRSEQ   DS    A       DMADD       DIRECTORY SEQUENTIAL READ                    
DIRADD   DS    A       DMADD       DIRECTORY ADD                                
DIRWRIT  DS    A       DMWRT       DIRECTORY WRITE (EXISTING KEY ONLY)          
FILREAD  DS    A       GETREC      FILE READ                                    
FILWRIT  DS    A       PUTREC      FILE WRITE                                   
FILADD   DS    A       ADDREC      FILE ADD                                     
ACLRSCRN DS    A                   CLEAR SCREEN FIELD(S) TO BLANKS              
ASETREP  DS    A                   POINT TO REP DIR/FIL                         
ASETREQ  DS    A                   POINT TO REQUEST FILE                        
ASETCNTL DS    A                   POINT TO CONTROL FILE                        
AFINDREQ DS    A                   GET NEXT REQTBL ENTRY                        
ADOMSG   DS    A                   PUT MSG ON SCREEN                            
*                                                                               
LACOMMON EQU   *-ACOMMON                                                        
#ACOMMON EQU   LACOMMON/4                                                       
         SPACE                                                                  
AIOADDR2 DS    F                   ALTERNATE A(IOWORK) FOR SPARE                
SPARE    DS    04F                 A LITTLE SPARE                               
*                                                                               
SELECTSW DS    C                   X'0'=NO SEL/C=SEL CHA/S=SEL DISP             
NOMASTER DS    X                   X'0'=OKAY  /X'1'=MASTER PROHIBITED           
         DS    CL2                 SPARE                                        
*                                                                               
DMCB     DS    6F        PARAMETER LIST                                         
         ORG   DMCB                                                             
P1       DS    F                                                                
P2       DS    F                                                                
P3       DS    F                                                                
P4       DS    F                                                                
P5       DS    F                                                                
P6       DS    F                                                                
*                                                                               
OVLYNUM  DS    CL1       OVERLAY NUMBER TO PROCESS                              
LASTOVLY DS    CL1       OVLY NUMBER LOADED IN CORE                             
AOVLY    DS    A         A(OVERLAY)                                             
ACOMFACS DS    A         A(COMFACS)                                             
ARFPTAB  DS    A                                                                
AIORFP   DS    A                                                                
AIOMINIO DS    A                                                                
AREPFACS DS    A                                                                
RFBLOCK  DS    CL6                 REPFACS BLOCK                                
*                                  BYTES 1  -  4  =  A(COMFACS)                 
*                                  BYTES 5  -  6  =  REP CODE                   
*                                                                               
OVBASE   EQU   0                   BASE (LOCAL PROCESS)                         
OVBLDSCR EQU   1                   BUILD NEW SCREEN                             
OVADD    EQU   2                   ADD REQUEST RECORD                           
OVPROC   EQU   3                   ALL OTHER PROCESSING                         
OVRFP    EQU   4                   RFP PROCESSING                               
OVSEC    EQU   5                   'SECURITY' OVERLAY                           
*                                                                               
OVTBL1   EQU   16    X'10'         REQUEST DEF TABLE 1                          
OVTBL2   EQU   17    X'11'         REQUEST DEF TABLE 2                          
OVTBL3   EQU   18    X'12'         REQUEST DEF TABLE 3                          
OVTBL4   EQU   19    X'13'         REQUEST DEF TABLE 4                          
OVTBL5   EQU   20    X'14'         REQUEST DEF TABLE 5                          
OVTBL6   EQU   21    X'15'         REQUEST DEF TABLE 6                          
*                                                                               
SCLIST   EQU   X'FE'               LIST SCREEN                                  
SCMENU   EQU   X'FC'               MENU SCREEN                                  
*                                                                               
GOPROC   DS    X                   0 = NEED RQST IPT; 1 = GO TO PROC            
*                                                                               
SAVEMSG  DS    CL60                MSG LINE FROM LAST RQST                      
*                                                                               
*- BASE SCREEN INPUT -- INTERNAL FORMAT                                         
*                                                                               
IDEST    DS    XL2                 DESTINATION NUMBER FROM CT FILE              
IOUT     DS    CL6                 OUTPUT ID                                    
IREQOFF  DS    CL2                 REQUESTING OFFICE                            
*                                                                               
WHEN     DS    X                   WHEN IS THIS TO RUN                          
EQSOON   EQU   X'80'               SOON                                         
EQOVRN   EQU   X'40'               OVERNIGHT                                    
*                                                                               
RFPSTAT  DS    X                   RFP INDICATOR                                
RFPINUSE EQU   X'01'                                                            
*                                                                               
QRFPBLK  DS    0C                  $RFP INTERFACE BLOCK                         
QRFPMODE DS    XL1                                                              
QRFPOK   EQU   0                   NO ERROR                                     
QRFPINIT EQU   1                   INITIALIZE RFP BLOCK                         
QRFPGVAL EQU   2                   VALIDATE GROUP NAME                          
QRFPSYMB EQU   3                   VALIDATE SYMBOLLIC NAME/RETURN ESC#          
QRFPRADD EQU   4                   ADD REQUEST THROUGH RFP INTERFACE            
QRFPIGRP EQU   5                   INVALID GROUP                                
QRFPISYM EQU   6                   INVALID SYMBOL                               
QRFPEADD EQU   7                   ERROR - GROUP CURRENTLY SUBMITTED            
QRFPNORO EQU   8                   NO ROOM TO ADD                               
QRFPWORK DS    CL10                IN  - GROUP NAME OR SYMBOLLIC NAME           
         ORG QRFPWORK              OUT - ESCAPE SEQUENCE EQUIVALENT             
QRFPESC  DS    0CL4                                                             
QRFPESC# DS    XL1                                                              
QRFPDICT DS    XL2                 DICTIONARY EQUATE                            
QRFPDLNQ DS    XL1                                                              
         DS    XL6                                                              
QRFPBLKQ EQU   *-QRFPBLK                                                        
*                                                                               
*- LOCAL WORK AREA FOR USE BY REQUEST SUB OVERLAYS                              
*                                                                               
USERWORK DS    1024X                                                            
USERWRKX EQU   *                   END OF USERWORK                              
USERWRKL EQU   USERWRKX-USERWORK   LENGTH (IN BYTES) OF USERWORK                
*                                                                               
REPWORK  DS    XL100               DMGR WORK AREA                               
         SPACE                                                                  
         EJECT                                                                  
***********************************************************************         
*                                                                     *         
*  REQUEST RECORD.  80 BYTE HEADER AND UP TO 11 CARDS.                *         
*                                                                     *         
***********************************************************************         
         SPACE                                                                  
*                                                                               
*  REQUEST RECORD DEFINITION.                                                   
*  80 BYTE (EXTENDED) HEADER)                                                   
*  80 BYTE PRIMARY CARD (ALWAYS THERE)                                          
*  0-10 OPTIONAL 80 BYTE CARDS, DEFINED BY REQUEST.                             
         SPACE                                                                  
CTINCOL  EQU   80-1                CONTINUATION COLUMN                          
CTINCHAR EQU   C'+'                CONTINUATION CHARACTER                       
*                                                                               
*  ** NOTE **  CONTINUATION SEEDED BY DEFAULT RTN                               
         SPACE                                                                  
REQREC   DS    0C        REQUEST RECORD                                         
       ++INCLUDE DMREQHDRA                                                      
         EJECT                                                                  
         ORG   RQHCARD             1ST CARD                                     
REQCARD  DS    0CL80     REQUEST CARD DEFINITION                                
*                                                                               
RNUM     DS    CL2       REQUEST NUMBER                                         
RREP     DS    CL2       REP                                                    
RREPO    DS    CL2       REQUESTOR OFFICE                                       
RNAME    DS    CL12      REQUESTOR NAME                                         
ROFFR    DS    CL2       OFFICE REGION                                          
ROFF     DS    CL2       OFFICE                                                 
RSTA     DS    CL5       STATION                                                
RSDIV    DS    CL1       SALES DIVISION                                         
RSTEAM   DS    CL1       SALES TEAM                                             
RSMAN    DS    CL3       SALESMAN                                               
RAGY     DS    CL4       AGENCY                                                 
RAGYO    DS    CL2       AGENCY OFFICE                                          
RADV     DS    CL4       ADVERTISER                                             
RPRO     DS    CL3       PRODUCT                                                
RPROCL   DS    CL2       PRODUCT CLASS                                          
RPROCA   DS    CL2       PRODUCT CATEGORY                                       
RSTRD    DS    CL6       START DATE                                             
RENDD    DS    CL6       END DATE                                               
RASAD    DS    CL6       AS AT DATE                                             
RBASIS   DS    CL1       BASIS                                                  
RSTAT    DS    CL1       STATION TYPE                                           
RSEQ     DS    CL1       SEQUENCE                                               
ROPTN    DS    CL1       OPTION                                                 
ROPTN2   DS    CL1                 OPTION 2                                     
RCON     DS    0CL8                CONTRACT NUMBER                              
RACCTOPT DS    CL1                 ACCOUNTING OPTION                            
RGROUP   DS    CL1                 STATION GROUP                                
RSGROUP  DS    CL1                 STATION SUB-GROUP                            
RCONTYP  DS    CL1                 CONTRACT TYPE                                
ROPTN3   DS    CL1                 OPTION 3                                     
ROPTN4   DS    CL1                 OPTION 4                                     
ROPTN5   DS    CL1                 OPTION 5                                     
*********ROPTN6   DS    CL1        OPTION 6 HAS MOVED TO CARD 2 *******         
RCONTIN  DS    CL1                 HOLDS A '+' AS A CONTINUATION CHAR           
         SPACE 2                                                                
REQCARD0 DS    CL80                OPTIONAL EXTENDED CARDS                      
REQCARD1 DS    CL80                                                             
REQCARD2 DS    CL80                                                             
REQCARD3 DS    CL80                                                             
REQCARD4 DS    CL80                                                             
REQCARD5 DS    CL80                                                             
REQCARD6 DS    CL80                UP TO 11 CARDS IN TOTAL                      
REQCARD7 DS    CL80                (PRIMARY AND 10 EXTRA)                       
REQCARD8 DS    CL80                                                             
REQCARD9 DS    CL80                                                             
*                                                                               
LREQCARD EQU   *-REQCARD           LENGTH OF ALL REQ. CARDS                     
*                                                                               
LREQREC  EQU   *-REQREC            MAX REQUEST RECORD LENGTH                    
*                                                                               
REQREC2  DS    XL(LREQREC)                                                      
*                                                                               
* RFP IO BUFFERS                                                                
*                                                                               
         DS    0F                                                               
RFPTAB   DS    CL1024                                                           
IORFP    DS    CL4096                                                           
IOMINIO  DS    CL5120                                                           
IOWKFLAG DS    CL4                                                              
DIOWORK  EQU   *-REQWRK            DISP TO IOWORK                               
         SPACE                                                                  
IOWORK   DS    CL6100              I/O BUFFER                                   
*                                                                               
LWORK    EQU   *-REQWRK            LENGTH OF TEMPORARY WORK AREA                
         SPACE                                                                  
LWORKSIZ EQU   (LWORK+7)/8         # DBBL WORDS NEEDED FOR LWORK                
         EJECT                                                                  
*                                                                               
*- OPTIONAL REQUEST CARD USAGE DSECTS                                           
*                                                                               
         SPACE                                                                  
*                                                                               
*- R17 -- DONUT REPORT.   * 2 CARD REQUEST *                                    
*                                                                               
         ORG   REQCARD0                                                         
RDEPTH   DS    CL2                 DEPTH. 01-10                                 
RSTALST# DS    CL2                 # 5 CHAR STATIONS IN STALST                  
RSTALST  DS    10CL5               1-10 STATION CODES.                          
         ORG   REQCARD0+80                                                      
         SPACE 3                                                                
*                                                                               
*- R70 -- STATION LISTING REPORT * 2 CARD REQUEST *                             
*                                                                               
         ORG   REQCARD0                                                         
         DS    CL6                 FILLER                                       
R2CLOSMN DS    CL4                 CLOSED THRU DATE (YYMM)                      
*                                                                               
*- R1C -- INTEREP BUDGET ALLOCATION REPORT * 2 CARD REQUEST *                   
*                                                                               
         ORG   REQCARD0                                                         
R2BUDST  DS    CL6                 BUDGET START (YYMM)                          
R2BUDED  DS    CL6                 BUDGET END   (YYMM)                          
R2ALCLST DS    5CL4                FIVE SETS OF CONTRACT TYPE/PERCENT           
*                                   -- CL1 CONTRACT TYPE                        
*                                   -- CL3 WHOLE NUMBER PERCENT                 
         ORG   REQCARD0+80                                                      
         SPACE 3                                                                
*                                                                               
* - - -  GENERAL CARD 2 USE                                                     
*                                                                               
         ORG   REQCARD0                                                         
*                                                                               
RREC2    DS    0CL80      START                                                 
R2OPT6   DS    CL1         01      OPTION 6 AS DISPLACED FROM CARD 1            
RTVB     DS    CL2         02      TVB REGION CODE                              
ROWNER   DS    CL3         04      STATION OWNER CODE                           
RMKT     DS    CL4         07      STATION MARKET CODE                          
RRANK    DS    CL1         11      STATION RANK CODE                            
RPPSON   DS    CL3         12      POINT PERSON                                 
RNCNUM   DS    CL8         15      NETWORK CONTRACT NUMBER                      
RCFULL   DS    CL8         23      FULL 8 CHARACTER CONTRACT NUMBER             
*                                   CONTRACT NUMBER ON CARD 1 IS 7              
R2AFFL   DS    CL3         31      NET AFFL                                     
RRRGFLAG DS    CL1         34      RRG RUN IF  'Y'                              
R2RSVC   DS    CL1         35      SERVICE: A=ARB,N=NSI,S=SRC,B=BIR             
R2RBOOK  DS    CL6         36      RATING BOOK                                  
R2DEMO   DS    CL5         42      DEMOGRAPHIC                                  
R2ASAT2  DS    CL6         47      AS-AT TO-DATE                                
R2CREDR  DS    CL1         53      CREDIT RATING                                
R2LIABP  DS    CL2         54      LIABILITY POSITION COMMENT                   
         DS    CL1         56      RRGON FLAG                                   
R2DEVCTY DS    CL2         57      DEVELOPMENTAL CONTRACT TYPE                  
R2SPACE  DS    CL1         59      OPTIONAL SPACING VALUE                       
RYADREC  DS    CL8         60      RADAR RECORD KEY                             
RTAGY    DS    CL4         68      R30 - TARGET AGENCY                          
RTAGYO   DS    CL2         72      TARGET AGENCY OFFICE                         
RSPLNOPT DS    CL1         74      R30 - SPOT LENGTH BREAK OUT OPTION           
         DS    CL2         75      SPARE                                        
R2DEVSP  DS    CL3         77      DEVELOPMENTAL SALESPERSON                    
*                                                                               
         ORG   RYADREC                                                          
RLBLREC  DS    CL8         60      LABEL RECORD KEY                             
         DS    CL9         68      SPARE                                        
         DS    CL3         77      USED FOR DEVELOPMENTAL S/P                   
*                                                                               
         ORG   RYADREC                                                          
RSETGSG  DS    CL4         60      GROUP/SUBGROUP SET IDENTIFIER                
RSETSAL  DS    CL4         64      SALESPERSON SET IDENTIFIER                   
RSETADV  DS    CL4         68      ADVERTISER SET IDENTIFIER                    
RSETAGY  DS    CL4         72      AGENCY SET IDENTIFIER                        
RCONUNC  DS    CL1         76      CONFIRMED=C, UNCONFIRMED=U                   
         DS    CL3         77      USED FOR DEVELOPMENTAL S/P                   
*                                                                               
R2CONTIN DS    CL1         80      IFF '+', THEN THERE IS A 3RD+ CARD           
*                                                                               
* - - -  GENERAL CARD 3 USE:  KEEP IN SYNCH WITH REGENREQ3   !!!                
*                                                                               
         ORG   REQCARD1                                                         
*                                                                               
RREC3    DS    0CL80      START                                                 
RSETSTA  DS    CL4         01      STATION SET IDENTIFIER                       
RCOMPNO  DS    CL1         05      SUPPRESS COMBO COMPONENTS = Y                
RSUPDET  DS    CL1         06      SUPPRESS DETAILS IF NO CURRENT $             
RRANKMAX DS    CL2         07      ALTERNATE RANK MAX VALUE                     
*                                     NON-RRG REPORTS                           
RXTRAFRM DS    CL6         09      EXTRA FROM DATE                              
RXTRATO  DS    CL6         15      EXTRA TO   DATE                              
RCTYSET  DS    CL4         21      CONTYPE SET NAME                             
RDTYSET  DS    CL4         25      DEV CONTYPE SET NAME                         
RPPRSET  DS    CL4         29      POINT PERSON SET NAME                        
ROFFSET  DS    CL4         33      OFFICE SET NAME                              
RREPSET  DS    CL4         37      REP SET NAME                                 
RDIRRES  DS    CL1         41      DIRECT RESPONSE                              
RPAYPRO  DS    CL1         42      PAID PROGRAMMING                             
RJNLEFT  DS    CL1         43      LOST PROGRAM OPTIONS:                        
*                                  1  =  R1: GROSS BILLING REPORT               
*                                  2  =  R2: EQUAL BAR REPORT                   
*                                  3  =  R3: KATZ EQUAL BAR REPORT              
RBROWZR  DS    CL1         44      Y  = OUTPUT 'BROWSER' FILE RECORDS           
RDNHEAD  DS    CL1         45      Y  = DOWNLOAD HEADINGS (D/L ONLY)            
RALTCAL  DS    CL1         46      Y  = USE ALTERNATE CALENDAR DATA             
RDISALL  DS    CL1         47      Y  = DISPLAY ALL ROWS, EVEN IF               
*                                     VALUE NOT FOUND FOR ROW                   
RSETTER  DS    CL2         48      TERRITORY FILTER (SET)                       
RNOBAKB  DS    CL1         50      EXCLUDE BACK BILLING                         
RNRRGON  DS    CL1         51      REARRANGE DATES FOR NRRGON                   
RCOMBUD  DS    CL1         52      COMPANY BUDGET FIGURES USED                  
RXFILNM  DS    CL4         53      CROSS-FILE COMPANY LIST NAME                 
RNATLOC  DS    CL1         57      NATIONAL/LOCAL BILLING OPTION                
RRERFLG  DS    CL1         58      +=REPORT RER ONLY                            
*                                  -=EXCLUDE RER FROM REPORT                    
ROWNMKT  DS    CL1         59      OWNER MARKET FILTERING                       
RSALBUD  DS    CL1         60      S/P     BUDGET FIGURES USED                  
RFORCST  DS    CL1         61      Y  =  $0 FORECAST DISPLAYED                  
RSETMKT  DS    CL4         62      MARKET SET NAME                              
RTRADE   DS    CL1         66      TRADE OPTION REQUEST                         
RBUYCOD  DS    CL1         67      Y  =  BUYLINE CODE PASSIVE REQUEST           
RBUYCODE DS    CL3         68      BUYLINE CODE FILTER                          
RBUYATT1 DS    CL2         71      BUYLINE CODE ATTRIBUTE1 FILTER               
RBUYATT2 DS    CL2         73      BUYLINE CODE ATTRIBUTE2 FILTER               
RCOMPSP  DS    CL03        75      COMPENSATION S/P CODE                        
RBEST$OP DS    CL01        78      REPORT BEST $ FIGURES                        
         DS    CL01        79      SPARE                                        
R3CONTIN DS    CL1         80      IFF '+', THEN THERE IS A 3RD+ CARD           
*                                                                               
*                                                                               
         TITLE 'COMMONLY USED EQUATES -- REQTBL LAYOUT'                         
*                                                                               
*- REQTBL LAYOUT EQUATES                                                        
*                                                                               
*                                                                               
RQLNTRY  EQU   0       CL2         ENTRY LENGTH - ZERO=END-OF-TABLE             
RQPREFIX EQU   2       CL1         REPORT ALPHA/NUMERIC PREFIX                  
*                                  X'0' = NO PREFIX                             
RQALPHA  EQU   3       CL2         ALPHA/NUMERIC REQUEST NUMBER                 
RQDFLT   EQU   5       AL3         A(DEFAULT LIST)                              
RQXTRVAL EQU   8       XL1         EXTRA VALIDATION ROUTINE NUMBER              
*                                  (INDEX IN REREQ02)                           
RQCNTL1  EQU   9       XL1         REQUEST CONTROL BITS                         
*                                                                               
RQCNTL2  EQU   10      XL1         MORE CONTROL BITS                            
*                                                                               
RQCARDID EQU   11      CL2         REQUEST CARD REPORT ID (RRG CLASS)           
*                                                                               
RQOPT4ID EQU   13      CL2         RRG OPT4 VALUE (REPORT ID) X'0'=NONE         
*                                                                               
RQNAME   EQU   15      CL20        NAME FOR MENU ACTION                         
*                                                                               
RQFIELD  EQU   35      0CL8        START OF FIELD DEFINITION ENTRIES.           
*                                  VARIABLE NUMBER OF ENTRIES.                  
*                                  XL2'00' = END OF FIELD LIST.                 
*                                  (SEE LAYOUT BELOW)                           
         EJECT                                                                  
*                                                                               
*- RQCNTL1 CONTROL BIT DEFINITIONS:                                             
*                                                                               
RQ1OVRNT EQU   X'80'               MAY PROCESS OVERNIGHT                        
RQ1SOON  EQU   X'40'               MAY PROCESS SOON                             
RQ1DDS   EQU   X'20'               DDS INTERNAL ONLY                            
*                                  (MUST BE DDS TUBE TO REQUEST)                
RQ1XMENU EQU   X'10'               DON'T LIST ON MENU                           
RQ1FMARK EQU   X'08'               REPORT IS A FILE MARKER                      
RQ1XREQ  EQU   X'04'               EXTENDED REQUEST RECORD                      
RQ1OFLMT EQU   X'02'               LIMITED OFFICE ACCESS                        
         SPACE                                                                  
*- RQCNTL2 CONTROL BIT DEFINITIONS:                                             
*                                                                               
RQ2DWNLD EQU   X'80'               MAY BE DOWNLOADED                            
RQ2RRG   EQU   X'40'               SET IF RRGEN=Y                               
RQ2MASTR EQU   X'20'               SET IF MASTR=Y (OV AND SOON)                 
RQ2MASOV EQU   X'10'               SET IF MASTR=O (OV ONLY)                     
RQ2FRIDY EQU   X'08'               SET IF OVERNIGHT REQUESTS NEED               
*                                    FRIDAY CHECK                               
RQ2BYRED EQU   X'04'               SET IF BUYRD=Y (BUYLINE DRIVER)              
*                                                                               
*- FIELD DEFINITION ENTRY LAYOUT EQUATES                                        
*                                                                               
FDDEF    DS    0XL8                                                             
FDNUM    EQU   0       XL2          FIELD NUMBER (IN REREQ01)                   
FDROW    EQU   2       XL1          ROW NUMBER.  (1-24)                         
FDCOL    EQU   3       XL1          COL NUMBER.(1-80)                           
FDVAL    EQU   4       XL2          VALIDATION RTN NUMBER (REREQ02)             
FDFMT    EQU   6       XL1          FORMAT BITS. DETERMINED BY VAL RTNS         
FDCNTL   EQU   7       XL1          FIELD CONTROL BITS                          
FDEXTHDR EQU   8       XL1          EXTENDED HEADER INDICATOR                   
FDLENGTH EQU   9                    L(FIELD DEFINITION)                         
*                  * CONTROL BITS *                                             
FCCMT    EQU   X'80'               COMMENT FIELD (PROTECTED)                    
FCNUM    EQU   X'40'               NUMERIC FIELD                                
FCRQOVRN EQU   X'20'               FLD REQUIRED FOR OVERNIGHT                   
FCRQSOON EQU   X'10'               FLD REQUIRED FOR SOON                        
FCXPAN   EQU   X'08'               FLD FOLLOWED BY EXPANSION FLD                
FCVAL    EQU   X'04'               VALIDATE EVEN IF NO INPUT.                   
FCLIST   EQU   X'02'               LIST-ORIENTED FIELD                          
*                                                                               
FDLNTRY  EQU   9           <-- LENGTH OF FIELD DEFINITION ENTRY                 
         TITLE 'COMMONLY USED EQUATES -- SCREEN FIELDS'                         
*                                                                               
*- LIST OF AVAILABLE FIELDS.                                                    
*                                                                               
QOFFREGN EQU   1                   REGION                                       
*                                                                               
QOFFICEC EQU   2                   OFFICE CODE                                  
*                                                                               
QGRPSUBG EQU   3                   GROUP/SUBGROUP                               
*                                                                               
QSUBGRPO EQU   4                   SUBGROUP ONLY                                
*                                                                               
QSTALIST EQU   5                   STATION LIST                                 
*                                                                               
QDIVTEAM EQU   6                   DIVISION/TEAM                                
*                                                                               
QSALPERS EQU   7                   SALESPERSON                                  
*                                                                               
QSTATION EQU   8                   STATION                                      
*                                                                               
QADVERTC EQU   9                   ADVERTISER                                   
*                                                                               
QAGENCYC EQU   10                  AGENCY                                       
*                                                                               
QCLASSCD EQU   11                  CLASS                                        
*                                                                               
QCATGORY EQU   12                  CATAGORY                                     
*                                                                               
QCONTYPE EQU   13                  CONTRACT TYPE                                
*                                                                               
QSTATYPE EQU   14                  STATION TYPE                                 
*                                                                               
QPRODUCT EQU   15                  PRODUCT                                      
*                                                                               
QSTAOWNR EQU   16                  STATION/TVB/OWNER/RANK                       
*                                                                               
QSTARTDT EQU   17                  START DATE ONLY                              
*                                                                               
QENDDATE EQU   18                  END DATE ONLY                                
*                                                                               
QASATDAT EQU   19                  AS AT DATE                                   
*                                                                               
QSTRTEND EQU   20                  START, END DATE                              
*                                                                               
QBASISLN EQU   21                  BASIS LINE                                   
*                                                                               
QPERDSTE EQU   22                  PERIOD START,END DATE                        
*                                                                               
QPERDSTR EQU   23                  PERIOD START                                 
*                                                                               
QPERDEND EQU   24                  PERIOD END                                   
*                                                                               
QREADSEQ EQU   25                  READING SEQUENCE                             
*                                                                               
QDEPTHNO EQU   26                  DEPTH NUMBER.                                
*                                                                               
QOPTION1 EQU   27                  OPTION 1                                     
*                                                                               
QXTRADAT EQU   28                  EXTRA SET OF DATES                           
*                                                                               
QOPTION2 EQU   29                  OPTION 2                                     
*                                                                               
QSTENMS  EQU   30                  START,END MONDAY, SUNDAY                     
*                                                                               
QACCOPTN EQU   31                  ACCOUNTING OPTION                            
*                                                                               
QCUTOFF  EQU   32                  CUTOFF DATE                                  
*                                                                               
QCONTRCT EQU   33                  CONTRACT                                     
*                                                                               
QCONTRC2 EQU   34                  CONTRACT ONLY OR FILTERS ONLY                
*                                                                               
QTOTCNTL EQU   35                  TOTALS CONTROL                               
*                                                                               
QOPTION3 EQU   37                  OPTION 3                                     
*                                                                               
QAFFILAT EQU   39                  AFFILLIATE                                   
*                                                                               
QOPTION4 EQU   41                  OPTION 4                                     
*                                                                               
QOPTION5 EQU   43                  OPTION 5                                     
*                                                                               
QOPTION6 EQU   45                  OPTION 6                                     
*                                                                               
QFORMATC EQU   47                  FORMAT (OPTION 6)                            
*                                                                               
QRANKMAX EQU   49                  RANK MAX                                     
*                                                                               
QRANKPER EQU   51                  RANK PERIOD (OPTION 3)                       
*                                                                               
QBUDYEAR EQU   52                  BUDGET YEAR                                  
*                                                                               
QRECAPOP EQU   53                  RECAP (ACCOUNTING) OPTION                    
*                                                                               
Q1MOONLY EQU   54                  ONE MONTH ONLY PERIOD                        
*                                                                               
Q1MOPERD EQU   55                  ONE MONTH ENDING PERIOD                      
*                                                                               
QCREDRAT EQU   56                  CREDIT RATING                                
*                                                                               
QLIABPOS EQU   57                  LIABILITY POSITION                           
*                                                                               
QBEST$OP EQU   58                  BEST $ OPTION                                
*                                                                               
QTVB     EQU   60                  TVB REQION                                   
*                                                                               
QOWNER   EQU   61                  OWNER                                        
*                                                                               
QMARKET  EQU   62                  MARKET CODE                                  
*                                                                               
QRANK    EQU   63                  STATION RECORD MARKET RANK                   
*                                                                               
QPPSON   EQU   64                  NET CON POINT PERSON                         
*                                                                               
QNETCON  EQU   65                  NETWORK CONTRACT NUMBER                      
*                                                                               
QBUDSTEN EQU   66                  BUDGET START, END                            
*                                                                               
QALCLIST EQU   67                  BUDGET ALLOCATION LIST                       
*                                                                               
QALCLST2 EQU   68                  BUDGET ALLOCATION RESET LIST                 
*                                                                               
QYADREC  EQU   69                  YADR RECORD                                  
*                                                                               
QTARGAGY EQU   70                  TARGET AGENCY                                
*                                                                               
QRSERV   EQU   71                  RATING SERVICE ENTRY                         
*                                                                               
QDEMOCD  EQU   72                  DEMOGRAPHIC CODE SELECTION                   
*                                                                               
QRBOOK   EQU   73                  RATING BOOK  ENTRY                           
*                                                                               
QLABREC  EQU   74                  LABEL RECORD                                 
*                                                                               
QACTDAT1 EQU   75                  ACTIVITY   (CONT. NEXT LINE)                 
*                                                                               
QDEVSP   EQU   077                 DEVELOPMENTAL SALESPERSON                    
*                                                                               
QBUSTYP  EQU   078                 NEW BUSINESS DEVELOPMENT TYPE                
*                                                                               
QSPLNOPT EQU   079                 SPOT LENGTH BREAK OUT OPTION                 
*                                                                               
QCTLINE1 EQU   080                 'SPACING' LITERAL FOR STEREO                 
*                                                                               
QCTLINE2 EQU   081                 'COMBINE COMBOS?' FOR STEREO                 
*                                                                               
QCTLINE3 EQU   082                 EXTRA FOR STEREO                             
*                                                                               
QCTLINE4 EQU   083                 EXTRA FOR STEREO                             
*                                                                               
QCTLINE5 EQU   084                 EXTRA FOR STEREO                             
*                                                                               
QOPTIONB EQU   085                 OPTION SPACE (NO LABEL)                      
*                                                                               
QOLDREP  EQU   086                 TAKEOVER OLD REP                             
*                                                                               
QTKOSTAC EQU   087                 TAKEOVER STATION                             
*                                                                               
QTKOAGYC EQU   088                 TAKEOVER AGENCY FILTER                       
*                                                                               
QTKOOFFC EQU   089                 TAKEOVER OFFICE FILTER                       
*                                                                               
QCLOSMON EQU   090                 CLOSED THRU MONTH                            
*                                                                               
QEFFDATE EQU   091                 COMMISSION EFFECTIVE DATE                    
*                                                                               
*        CMT FIELDS START HERE                                                  
*                                                                               
QCMT0129 EQU   129                 BRDCAST/CALENDAR/4WK/5WK                     
*                                                                               
QCMT0130 EQU   130                 ** REQUEST DETAILS **                        
*                                                                               
QCMT0131 EQU   131                 COMPARABLE/NEW/OLD                           
*                                                                               
QCMT0132 EQU   132                 ** REQUEST CONTROLS **                       
*                                                                               
QCMT0133 EQU   133                 ALPHABETIC/CODE                              
*                                                                               
QCMT0134 EQU   134                 MONEY/AVAIL/BOTH                             
*                                                                               
QCMT0135 EQU   135                 STATION/OFFICE                               
*                                                                               
QCMT0136 EQU   136                 1 THRU # STATIONS                            
*                                                                               
QCMT0137 EQU   137                 STATION/OFFICE/SPERSON                       
*                                                                               
QCMT0138 EQU   138                 FROM A=ACE,T=TWX/WU/GRAPH/O=OTHER            
*                                                                               
QCMT0139 EQU   139                 DIFFERENCES ONLY                             
*                                                                               
QCMT0140 EQU   140                 EXCLUDE DIFF LESS THAN $100                  
*                                                                               
QCMT0141 EQU   141                 AGY OFFICE DETAILS                           
*                                                                               
QCMT0142 EQU   142                 EXCLUDE DIFF LESS THAN $500                  
*                                                                               
QCMT0143 EQU   143                 FULL LISTING/NO DETAILS                      
*                                                                               
QCMT0144 EQU   144                 EXCLUDE DIFF LESS THAN $1000                 
*                                                                               
QCMT0145 EQU   145                 FULL LIST/LEGAL NAME/NO DETAIL               
*                                                                               
QCMT0146 EQU   146                 EXCLUDE DIFF LESS THAN $1500                 
*                                                                               
QCMT0147 EQU   147                 SUPPRESS DETAILS                             
*                                                                               
QCMT0148 EQU   148                 TO A=ACE,T=TWX/WU/GRAPH/O=OTHER              
*                                                                               
QCMT0149 EQU   149                 COMB/REG/ANY OTHER CODE                      
*                                                                               
QCMT0150 EQU   150                 NO CATEGORY CODES                            
*                                                                               
QCMT0151 EQU   151                 NETWORK/REQ                                  
*                                                                               
QCMT0152 EQU   152                 RANKER/DETAIL/BOTH                           
*                                                                               
QCMT0153 EQU   153                 REP'S FILE/STD FILE/BOTH                     
*                                                                               
QCMT0154 EQU   154                 STATION/INTERFACE CODE/BOTH                  
*                                                                               
QCMT0155 EQU   155                 GROUP/STATION                                
*                                                                               
QCMT0156 EQU   156                 ALL COLUMNS/FIRST COLUMNS ONLY               
*                                                                               
QCMT0157 EQU   157                 MMMDD/YY                                     
*                                                                               
QCMT0158 EQU   158                 MMMDD/YY (START=MONDAY, END=SUNDAY)          
*                                                                               
QCMT0159 EQU   159                 MMM/YY                                       
*                                                                               
QCMT0160 EQU   160                 F=RANK ON FORECAST,N=RANK ON PENDING         
*                                                                               
QCMT0161 EQU   161                 MMMDD/YY DEFAULT TODAY                       
*                                                                               
QCMT0162 EQU   162                 A=RANK ON PRIOR FINAL                        
*                                                                               
QCMT0163 EQU   163                 START MMM/YY.  3 MONTH REPORT                
*                                                                               
QCMT0164 EQU   164                 B=THIS YEAR VS LAST YEAR                     
*                                                                               
QCMT0165 EQU   165                 START MMM/YY.                                
*                                                                               
QCMT0166 EQU   166                 OFFICE, S/P, OFFICE+SP                       
*                                                                               
QCMT0167 EQU   167                 STATION TOTALS ONLY                          
*                                                                               
QCMT0168 EQU   168                 CURRENT BOOKED,  PRIOR FINAL                 
*                                                                               
QCMT0169 EQU   169                 ACCTG RPT/PENNIES INCLUDED                   
*                                                                               
QCMT0170 EQU   170                 ACCTG RPT WITH CENTS/PENNIES INC             
*                                                                               
QCMT0171 EQU   171                 COMMISSION REPORT                            
*                                                                               
QCMT0172 EQU   172                 A=ACCOUNTING OPTION                          
*                                                                               
QCMT0173 EQU   173                 AGY NO RATE COPY                             
*                                                                               
QCMT0174 EQU   174                 TVB STA MKT=S,TVB OFFICE=O                   
*                                                                               
QCMT0175 EQU   175                 REP/SPRESON SUM/OFF SUM RPT                  
*                                                                               
QCMT0176 EQU   176                 STA TYPE=V,STAMKT+STA TYPE=B                 
*                                                                               
QCMT0177 EQU   177                 MUST BE M                                    
*                                                                               
QCMT0178 EQU   178                 Y=BACK OUT CLOSEOUT                          
*                                                                               
QCMT0179 EQU   179                 PRIOR ACTUAL/ESTIMATE                        
*                                                                               
QCMT0180 EQU   180                 CURRENT/PRIOR PERIOD RANK                    
*                                                                               
QCMT0181 EQU   181                 SHOW DEMO TOTALS                             
*                                                                               
QCMT0182 EQU   182                 (START DATE = NEW CLOSE DATE)                
*                                                                               
QCMT0183 EQU   183                 STATION/SPERSON                              
*                                                                               
QCMT0184 EQU   184                 BOOKED$/AS-RUN$                              
*                                                                               
QCMT0185 EQU   185                 SUPPRESS CONTRACT DETAILS                    
*                                                                               
QCMT0186 EQU   186                 MARKET IND, BUSINESS IND, BOTH               
*                                                                               
QCMT0187 EQU   187                 SUPPRESS COMPETING STA AMOUNTS               
*                                                                               
QCMT0188 EQU   188                 DISPLAY PRIOR BILLING                        
*                                                                               
QCMT0189 EQU   189                 SPRESON SUMRY A,M,O,S,P                      
*                                                                               
QCMT0190 EQU   190                 AVAILS/CURRENT BILL/BOTH                     
*                                                                               
QCMT0191 EQU   191                 ADV SUMRY A,M,O,S,P                          
*                                                                               
QCMT0192 EQU   192                 **NOT ENTERED** ONLY REPORT                  
*                                                                               
QCMT0193 EQU   193                 AGY SUMRY A,M,O,S,P                          
*                                                                               
QCMT0194 EQU   194                 C=CODE,N=NAME,O=OFFICE,DEF=ALL               
*                                                                               
QCMT0195 EQU   195                 PRELIMINARY                                  
*                                                                               
QCMT0196 EQU   196                 PENDING: MARKET $$ OR STATION $$             
*                                                                               
QCMT0197 EQU   197                 SALES PRESSURE REPORT                        
*                                                                               
QCMT0198 EQU   198                 8F: SALESPERSON OR POINT PERSON              
*                                                                               
QCMT0199 EQU   199                 DAYPART TBL NUMBER                           
*                                                                               
QCMT0200 EQU   200                 INCOMPLETES: PLUS/MINUS IN PR                
*                                                                               
QCMT0201 EQU   201                 SHOW RATE DETAIL                             
*                                                                               
QCMT0202 EQU   202                 EXTRA DATE RANGE                             
*                                                                               
QCMT0203 EQU   203                 AGY/PRD DETAIL                               
*                                                                               
QCMT0204 EQU   204                 NO ADV SUMRY (OPT 2=Y)                       
*                                                                               
QCMT0205 EQU   205                 ADV W/IN AGY RECAP                           
*                                                                               
QCMT0206 EQU   206                 FULL/THOUSANDS ($$$)                         
*                                                                               
QCMT0207 EQU   207                 WRKSHEET/SALES ACTIV RPT                     
*                                                                               
QCMT0208 EQU   208                 STATION/OFFICE/TEAM                          
*                                                                               
QCMT0209 EQU   209                 SUPPRESS DTLS/OFF SUMMARIES                  
*                                                                               
QCMT0210 EQU   210                 OWNER LISTING:  SEQUENCES                    
*                                                                               
QCMT0211 EQU   211                 PRIOR ACTUAL/ESTIMATE                        
*                                                                               
QCMT0212 EQU   212                 BLANK FIELD FOR DISPLAY                      
*                                                                               
QCMT0213 EQU   213                 MMM/YY DEFAULT END TO START                  
*                                                                               
QCMT0214 EQU   214                 MMM/YY 12 MONTHS REQUIRED                    
*                                                                               
QCMT0215 EQU   215                 MONTH/QRTR/PERIOD                            
*                                                                               
QCMT0216 EQU   216                 RESTART DEFAULT = NO                         
*                                                                               
QCMT0217 EQU   217                 RANK MAX/ALL                                 
*                                                                               
QCMT0218 EQU   218                 STA/OFFICE/BOTH OR TEST RUN                  
*                                                                               
QCMT0219 EQU   219                 RANK YTD/PERIOD                              
*                                                                               
QCMT0220 EQU   220                 TEST RUN FOR ALLOCATION RESET                
*                                                                               
QCMT0221 EQU   221                 DTL/RECAP/BOTH                               
*                                                                               
QCMT0222 EQU   222                 DET/SUMMARY/EXTEND                           
*                                                                               
QCMT0223 EQU   223                 ACTIVE STA/INACTIVE/BOTH                     
*                                                                               
QCMT0224 EQU   224                 BUDGET ALLOCATION ENTERED AS                 
*                                                                               
QCMT0225 EQU   225                 STA SEQ/MKT SEQ/BOTH                         
*                                                                               
QCMT0226 EQU   226                 DETAILS STATION SEQUENCE ONLY                
*                                                                               
QCMT0227 EQU   227                 BUDGET ALLOC RESET ENTERED AS                
*                                                                               
QCMT0228 EQU   228                 PRINT: S=SPOTS,D=$,*B=BOTH                   
*                                                                               
QCMT0229 EQU   229                 RANK MAX/DEFAULT 99                          
*                                                                               
QCMT0230 EQU   230                 PRINT PERCENT OF DAYPART: D,S,*B             
*                                                                               
QCMT0231 EQU   231                 WKSHEET/PRELIM/FINAL                         
*                                                                               
QCMT0232 EQU   232                 SORT ON CATEGORY CODE                        
*                                                                               
QCMT0233 EQU   233                 SHARE REPORT                                 
*                                                                               
QCMT0234 EQU   234                 INCLUDE CURRENT BILLING FIGURES              
*                                                                               
QCMT0235 EQU   235                 RECAP ONLY/BOTH                              
*                                                                               
QCMT0236 EQU   236                 ESTIMATE $/BOOKED $                          
*                                                                               
QCMT0237 EQU   237                     WEEKLY/MONTHLY                           
*                                                                               
QCMT0238 EQU   238                  COMPANY/X-COMP RECAP/BOTH                   
*                                                                               
QCMT0239 EQU   239                     WEEKLY/MONTHLY/PROGRESSIVE               
*                                                                               
QCMT0240 EQU   240                     COMBO STATION LISTING                    
*                                                                               
QCMT0241 EQU   241                     12 MONTH MAX                             
*                                                                               
QCMT0242 EQU   242                     PRINT DETAILS/NO                         
*                                                                               
QCMT0243 EQU   243                     UPDATE/SOFT                              
*                                                                               
QCMT0244 EQU   244                     PRI FINAL, PRI BKED, CURR FCST           
*                                                                               
QCMT0245 EQU   245                     CLEAR/DON'T CLR INVOICE $                
*                                                                               
QCMT0246 EQU   246                     OPTION2:  BUDGET, BILLING                
*                    (CONTINUED IN 247)                                         
QCMT0247 EQU   247                     OPTION2:  COMBINED, CON TYPE             
*                                                                               
QCMT0248 EQU   248                     FORMAT:   COMMISSION REPORTS             
*                    (CONTINUED IN 249)                                         
QCMT0249 EQU   249                               FOR BLAIR                      
*                    (CONTINUED IN 260)                                         
QCMT0250 EQU   250                     REP TO SPOT REPORT: S=STATION            
*                                                                               
QCMT0251 EQU   251                     Y=SUPPRESS RETURN ADDRESS, *N            
*                                                                               
QCMT0252 EQU   252                     STATION ACTIVITY LISTING                 
*                                                                               
QCMT0253 EQU   253                     A=SORT BY AGENCY, BUYER                  
*                    (CONTINUED IN 254)                                         
QCMT0254 EQU   254                     *B=SORT BY BUYER, AGENCY                 
*                                                                               
QCMT0255 EQU   255                     Y=LASER PRINTING OPTION, *N              
*                                                                               
QCMT0256 EQU   256                     S=STATION*, O=OFFICE,                    
*                                                                               
QCMT0257 EQU   257                     M=SALESPERSON, B=OFFICE+SP               
*                                                                               
QCMT0258 EQU   258                     N=STATION WITH MARKET CODE/NAME          
*                                                                               
QCMT0259 EQU   259                     *O=OWNER, S=STATION, B=BOTH              
*                                                                               
QCMT0260 EQU   260                     BLAIR COMM REPORTS: FINAL                
*                                                                               
QCMT0261 EQU   261                     PENDING REPORT:  OPTION 1                
*                                                                               
QCMT0262 EQU   262                     Y=DETAILS, *N                            
*                                                                               
QCMT0263 EQU   263                     Y=DISPLAY CONVERTED %S                   
*                                                                               
QCMT0264 EQU   264                     Y=SHOW RECAP                             
*                                                                               
QCMT0265 EQU   265                     ORDER/INV/BOTH/UNFILTERED                
*                                                                               
QCMT0266 EQU   266                     265 - CONTINUED..........                
*                                                                               
QCMT0267 EQU   267                     Y=BREAK OUT SPOT LENGTHS, *N             
*                                                                               
QCMT0268 EQU   268                     Y=YTD + CUMES, PERIOD + CUMES            
*                                                                               
QCMT0269 EQU   269                     <CUMES REQUIRE WHOLE PERIOD>             
*                                                                               
QCMT0270 EQU   270                     RANK: F=PRIOR FINAL*, C=CURR             
*                                                          FORECAST             
QCMT0271 EQU   271                     UNUSED AT THIS TIME                      
*                                                                               
QCMT0272 EQU   272                     A=ACTIVE, B=BOTH                         
*                                                                               
QCMT0273 EQU   273                     D=DUPLICATE, A=ALL                       
*                                                                               
QCMT0274 EQU   274                     S=STATION TOTALS                         
*                                                                               
QCMT0275 EQU   275                     P=INCLUDE PRODUCTS                       
*                                                                               
QCMT0276 EQU   276                     SUPPRESS CONTRACT TYPE                   
*                                                                               
QCMT0277 EQU   277                     MKT/ADV VS MKT/STA SEQ                   
*                                                                               
QCMT0278 EQU   278                     REPORT SEQUENCE:                         
*                                                                               
QCMT0279 EQU   279                     VIDEO VS REPORT FORMAT                   
*                                                                               
QCMT0280 EQU   280                     PRIOR YEAR/NO PRIOR YEAR                 
*                                                                               
QCMT0281 EQU   281                     INCLUDE/EXCLUDE ADVERTS                  
*                                                                               
QCMT0282 EQU   282                     A=ADVERTISER*/S=STATION                  
*                                                                               
QCMT0283 EQU   283                     A=MANAGER*, B=SELLER                     
*                                                                               
QCMT0284 EQU   284                     E=EMAIL ADDRESS                          
*                                                                               
QCMT0285 EQU   285                     CURRENT DATA = CONTROL FILE              
*                                                                               
QCMT0286 EQU   286                     SELF-APPLIED UNAPPROVED OFFERS           
*                                                                               
QCMT0287 EQU   287                     OPEN MAKEGOODS                           
*                                                                               
QCMT0321 EQU   321                     E=CONTRACT END*, A=ALL STATION           
*                                                                               
QCMT0322 EQU   322                     MMMDD/YY,EFFECTIVE DATE                  
*                                                                               
QCMT0323 EQU   323                     ACTIVE/INACTIVE                          
*                                                                               
QCMT0400 EQU   400                     D=CURR BKED(D-LOAD), ETC                 
*                                                                               
QCMT0401 EQU   401                     C=CURR $, D=CLASS REP, E=FORCED          
*                                                                               
QCMT0402 EQU   402                     CLASS/CATEGORY: E=AVAIL+BLG              
*                                                                               
QCMT0403 EQU   403                     MMM/YY-MMM/YY                            
*                                                                               
QCMT0404 EQU   404                     EFFECTIVE DATE:  MMM/YY                  
*                                                                               
QCMT0405 EQU   405                     R = RECEIVE, S = SEND                    
*                                                                               
QCMT0406 EQU   406                     (SEND REQUIRES EFF. DATE)                
*                                                                               
QCMT0407 EQU   407                     M=MARKET(NO STN),O=OFFICE SUMM           
*                                                                               
QCMT0408 EQU   408                     WHEN OPTION2 = BOTH:                     
*                                                                               
QCMT0409 EQU   409                     INACTIVE STATION CUTOFF DATE             
*                                                                               
QCMT0410 EQU   410                     MMMDD/YY-MMMDDYY                         
*                                                                               
QCMT0411 EQU   411                     O=OFFICE SEQ*,A=AGENCY SEQ               
*                                                                               
QCMT0412 EQU   412                     T=SHOW TAKEOVERS ONLY                    
*                                                                               
QCMT0413 EQU   413                     D=DETAIL(M+C) ONLY*,ETC                  
*                                                                               
QCMT0414 EQU   414                     M=DETAIL MARKET,C=DETAIL COMP            
*                                                                               
QCMT0415 EQU   415                     Y=INCLUDE AGENCY NAME                    
*                                                                               
QCMT0416 EQU   416                     S=SORT/PAGE BREAK BY STATION             
*                                                                               
QCMT0417 EQU   417                     S=SORT BY MARKET NAME                    
*                                                                               
QCMT0418 EQU   418                     OPTION2 = (B,L,N,SPACE)                  
*                                                                               
QCMT0419 EQU   419                     NATL/LOCAL OFFICE FILTER                 
*                                                                               
QCMT0420 EQU   420                     N=NO STATION LEVEL BREAKOUT              
*                                                                               
QCMT0421 EQU   421                     B=BOOKED DOLLARS ONLY                    
*                                                                               
QCMT0422 EQU   422                     C=CREAT DTE,L=LAST UPDTE DTE             
*                                                                               
QCMT0423 EQU   423                     D=DETAIL RPTS*,R=RECAPS ONLY             
*                                                                               
QCMT0424 EQU   424                     FCST$/PENDING$/PRIOR FINAL               
*                                                                               
QCMT0425 EQU   425                     CONTINUATION                             
*                                                                               
QCMT0426 EQU   426                     LEGEND                                   
*                                                                               
QCMT0427 EQU   427                     BUDGET TEST                              
*                                                                               
QCMT0428 EQU   428                     NAME DISPLAY                             
*                                                                               
QCMT0429 EQU   429                     CO REPORT: LINE 1                        
*                                                                               
QCMT0430 EQU   430                     CO REPORT: LINE 2                        
*                                                                               
QCMT0431 EQU   431                     CLOSED THRU: 70 REPORT                   
*                                                                               
QCMT0432 EQU   432                     BEST $ FIGURE                            
*                                                                               
QCMT0433 EQU   433                     Z=NEW/OLD DISPLAY                        
*                                                                               
QCMT0434 EQU   434                     C=COMPENSATION S/P SEQ                   
*                                                                               
         EJECT                                                                  
*                                                                               
*- GENERIC I/O FIELDS.  CONVENTION: IFLD3XX, XX=FIELD LENGTH                    
*                                                                               
IFLD301  EQU   301                                                              
*                                                                               
IFLD302  EQU   302                                                              
*                                                                               
IFLD303  EQU   303                                                              
*                                                                               
IFLD304  EQU   304                                                              
*                                                                               
IFLD305  EQU   305                                                              
*                                                                               
IFLD306  EQU   306                                                              
*                                                                               
IFLD307  EQU   307                                                              
*                                                                               
IFLD308  EQU   308                                                              
*                                                                               
IFLD309  EQU   309                                                              
*                                                                               
IFLD310  EQU   310                                                              
*                                                                               
IFLD311  EQU   311                                                              
*                                                                               
IFLD312  EQU   312                                                              
*                                                                               
IFLD315  EQU   315                                                              
*                                                                               
IFLD319  EQU   319                                                              
*                                                                               
IFLD320  EQU   320                                                              
         TITLE 'REREQ00 -- FIELD VALIDATION ROUTINE EQUATES'                    
*                                                                               
*- LIST OF AVAILABLE FIELDS.                                                    
*                                                                               
VOFFREGN EQU   1                   REGION                                       
*                                                                               
VOFFICEC EQU   2                   OFFICE CODE                                  
*                                                                               
VGRPSUBG EQU   3                   GROUP/SUBGROUP                               
*                                                                               
VSUBGRPO EQU   4                   SUBGROUP ONLY                                
*                                                                               
VSTALIST EQU   5                   STATION LIST (ON CARD 2)                     
*                                                                               
VDIVTEAM EQU   6                   DIVITION/TEAM                                
*                                                                               
VSALPERS EQU   7                   SALESPERSON                                  
*                                                                               
VSTATION EQU   8                   STATION                                      
*                                                                               
VADVERTC EQU   9                   ADVERTISER                                   
*                                                                               
VAGENCYC EQU   10                  AGENCY                                       
*                                                                               
VCLASSCD EQU   11                  CLASS                                        
*                                                                               
VCATGORY EQU   12                  CATAGORY                                     
*                                                                               
VCONTYPE EQU   13                  CONTRACT TYPE                                
*                                                                               
VSTATYPE EQU   14                  STATION TYPE                                 
*                                                                               
VPRODUCT EQU   15                  PRODUCT                                      
*                                                                               
VSTAOWNR EQU   16                  STATION/TVB/OWNER/RANK                       
*                                                                               
VSTARTDT EQU   17                  START DATE ONLY                              
*                                                                               
VENDDATE EQU   18                  END DATE ONLY                                
*                                                                               
VASATDAT EQU   19                  AS AT DATE                                   
*                                                                               
VSTRTEND EQU   20                  START,END DATE                               
*                                                                               
VBASISLN EQU   21                  BASIS LINE                                   
*                                                                               
VPERDSTE EQU   22                  PERIOD START, END DATES                      
*                                                                               
VPERDSTR EQU   23                  PERIOD START                                 
*                                                                               
VPERDEND EQU   24                  PERIOD END                                   
*                                                                               
VREADSEQ EQU   25                  READING SEQUENCE                             
*                                                                               
VDEPTHNO EQU   26                  DEPTH NUMBER                                 
*                                                                               
VOPTION1 EQU   27                  OPTION 1                                     
*                                                                               
VXTRADAT EQU   28                  EXTRA SET OF DATES                           
*                                                                               
VOPTION2 EQU   29                  OPTION 2                                     
*                                                                               
VSTENMS  EQU   30                  START,END MONDAY, SUNDAY                     
*                                                                               
VACCOPTN EQU   31                  ACCOUNTING OPTION                            
*                                                                               
VCUTOFF  EQU   32                  CUTOFF DATE                                  
*                                                                               
VCONTRCT EQU   33                  CONTRACT                                     
*                                                                               
VCONTRC2 EQU   34                  CONTRACT ONLY OR FILTERS ONLY                
*                                                                               
VTOTCNTL EQU   35                  TOTALS CONTROL                               
*                                                                               
VOPTION3 EQU   37                  OPTION 3                                     
*                                                                               
VAFFILAT EQU   39                  AFFILLIATE                                   
*                                                                               
VOPTION4 EQU   41                  OPTION 4                                     
*                                                                               
VOPTION5 EQU   43                  OPTION 5                                     
*                                                                               
VOPTION6 EQU   45                  OPTION 6                                     
*                                                                               
VFORMATC EQU   47                  FORMAT (OPTION 6)                            
*                                                                               
VRANKMAX EQU   49                  RANK MAX                                     
*                                                                               
VRANKPER EQU   51                  RANK PERIOD (OPTION 3)                       
*                                                                               
VBUDYEAR EQU   52                  BUDGET YEAR                                  
*                                                                               
VRECAPOP EQU   53                  RECAP (ACCOUNTING) OPTION                    
*                                                                               
V1MOONLY EQU   54                  ONE MONTH ONLY PERIOD                        
*                                                                               
V1MOPERD EQU   55                  ONE MONTH ENDING PERIOD                      
*                                                                               
VCREDRAT EQU   56                  ONE MONTH ENDING PERIOD                      
*                                                                               
VLIABPOS EQU   57                  ONE MONTH ENDING PERIOD                      
*                                                                               
VBEST$OP EQU   58                  BEST $ OPTION                                
*                                                                               
VTVB     EQU   60                  TVB REQION                                   
*                                                                               
VOWNER   EQU   61                  OWNER                                        
*                                                                               
VMARKET  EQU   62                  MARKET CODE                                  
*                                                                               
VRANK    EQU   63                  STATION RECORD MARKET RANK                   
*                                                                               
VPPSON   EQU   64                  NET CON POINT PERSON                         
*                                                                               
VNETCON  EQU   65                  NETWORK CONTRACT NUMBER                      
*                                                                               
VBUDSTEN EQU   66                  BUDGET START, END                            
*                                                                               
VALCLIST EQU   67                  BUDGET ALLOCATION LIST                       
*                                                                               
VALCLST2 EQU   68                  BUDGET ALLOCATION RESET LIST                 
*                                                                               
VYADREC  EQU   69                  YADR RECORD                                  
*                                                                               
VTARGAGY EQU   70                  TARGET AGENCY                                
*                                                                               
VRSERV   EQU   71                  RATING SERVICE ENTRY                         
*                                                                               
VDEMOCD  EQU   72                  DEMOGRAPHIC CODE SELECTION                   
*                                                                               
VRBOOK   EQU   73                  RATING BOOK ENTRY                            
*                                                                               
VLABREC  EQU   74                  LABEL RECORD                                 
*                                                                               
VDEVSP   EQU   077                 DEVELOPMENTAL SALESPERSON                    
*                                                                               
VBUSTYP  EQU   078                 NEW BUSINESS DEVELOPMENT TYPE                
*                                                                               
VSPLNOPT EQU   079                 SPOT LENGTH OPTION                           
*                                                                               
VOPTIONB EQU   85                  BLANK OPTION                                 
*                                                                               
VOLDREP  EQU   86                  TAKEOVER OLD REP                             
*                                                                               
VTKOSTAC EQU   87                  TAKEOVER STATION                             
*                                                                               
VTKOAGYC EQU   88                  TAKEOVER AGENCY FILTER                       
*                                                                               
VTKOOFFC EQU   89                  TAKEOVER OFFICE FILTER                       
*                                                                               
VCLOSMON EQU   90                  CLOSED THRU DATE                             
*                                                                               
VEFFDATE EQU   91                  EFFECTIVE DATE USE AS AT DATE                
*                                                                               
         EJECT                                                                  
***********************************************************************         
* RFP SYMBOLIC DATADICT EQUATES                                                 
***********************************************************************         
E#START  EQU   1                   START DATE                                   
E#STARTM EQU   2                   START MONTH                                  
E#STEND  EQU   3                   START, END DATES                             
E#STENDM EQU   4                   START, END MONTH                             
E#PSTEND EQU   5                   PERIOD START, END DATES                      
E#ASAT   EQU   6                   AS AT DATE                                   
E#PEND   EQU   7                   PERIOD END                                   
E#END    EQU   8                   END                                          
E#BSTEND EQU   9                   BUDGET START, END DATES                      
E#ENDM   EQU   10                  END MONTH                                    
E#PSTEDM EQU   11                  PERIOD START, END MONTHS                     
E#PENDM  EQU   12                  PERIOD END MONTH                             
E#BSTEDM EQU   13                  BUDGET START, END MONTHS                     
E#ASAT2  EQU   14                  AS AT TO-DATE                                
E#STENDF EQU   15                  START, END DATES -> FULL YEAR                
E#STEDFM EQU   16                  START, END MONTHS -> FULL YEAR               
*                                                                               
*                                                                               
***********************************************************************         
*   REPFACS EQUATE LIBRARY                                                      
       ++INCLUDE REPFACSQ                                                       
* > > > > > > > > > END OF DATASET REREQWRK < < < < < < < < < < <               
