*          DATA SET REREPRRGT  AT LEVEL 019 AS OF 09/10/98                      
*                                                                               
***********************************************************************         
* ACCESS SECURITY CONTROL TEST DATA                                   *         
*                                                                     *         
*                                                                     *         
*                                                                     *         
***********************************************************************         
*                                                                               
         DC    C'SPECBLOK'                                                      
SPECBLOK DS    0C                                                               
***>>>                                                                          
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'ST'                                                 
         DC    AL1(12,44),C'WEEKLY BUSINESS REPORT - STATIONS BY GROUP'         
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,07,21,000,00)                                       
         DC    AL1(31,12,01,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,02,32,28,000,00)                                       
         DC    AL1(31,14,03,03,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,09)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,09)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'PGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,09)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,112),C'R'                                        
         DC    AL1(60,06,05,02,128),C'S'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'ST'                                                 
         DC    AL1(12,44),C'WEEKLY BUSINESS REPORT - STATIONS BY GROUP'         
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,25,10,000,00)                                       
         DC    AL1(31,12,01,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,02,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,02,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'R'                                        
         DC    AL1(60,06,05,02,128),C'S'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,02,04,05,06)                                           
         DC    AL1(11,04),C'ST'                                                 
         DC    AL1(12,44),C'WEEKLY BUSINESS REPORT - STATIONS BY GROUP'         
         DC    AL1(16,03,02)                                                    
         DC    AL1(26,04,01,01)                                                 
         DC    AL1(30,07,01,07,21,000,00)                                       
         DC    AL1(31,12,01,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,02,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,02,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,02,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'FNL,PCE'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'S'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,03,04,05,06)                                           
         DC    AL1(11,04),C'ST'                                                 
         DC    AL1(12,44),C'WEEKLY BUSINESS REPORT - STATIONS BY GROUP'         
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,25,10,000,00)                                       
         DC    AL1(31,12,01,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,02,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,02,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'FNL,PCE'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'S'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'ST'                                                 
         DC    AL1(12,44),C'WEEKLY BUSINESS REPORT - STATIONS BY GROUP'         
         DC    AL1(30,07,01,07,21,000,00)                                       
         DC    AL1(31,12,01,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,02,32,28,000,00)                                       
         DC    AL1(31,14,03,03,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,112),C'R'                                        
         DC    AL1(60,06,05,02,128),C'S'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'ST'                                                 
         DC    AL1(12,44),C'WEEKLY BUSINESS REPORT - STATIONS BY GROUP'         
         DC    AL1(30,07,01,25,10,000,00)                                       
         DC    AL1(31,12,01,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,02,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,02,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'R'                                        
         DC    AL1(60,06,05,02,128),C'S'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,02,04,05,06)                                           
         DC    AL1(11,04),C'ST'                                                 
         DC    AL1(12,44),C'WEEKLY BUSINESS REPORT - STATIONS BY GROUP'         
         DC    AL1(26,04,01,01)                                                 
         DC    AL1(30,07,01,07,21,000,00)                                       
         DC    AL1(31,12,01,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,02,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,02,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,02,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'S'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,03,04,05,06)                                           
         DC    AL1(11,04),C'ST'                                                 
         DC    AL1(12,44),C'WEEKLY BUSINESS REPORT - STATIONS BY GROUP'         
         DC    AL1(30,07,01,25,10,000,00)                                       
         DC    AL1(31,12,01,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,02,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,02,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'S'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'OF'                                                 
         DC    AL1(12,47),C'WEEKLY BUSINESS REPORT - GROUP/STATION/OFFI+        
               CE'                                                              
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,07,21,000,00)                                       
         DC    AL1(31,12,01,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,02,32,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,04,06,000,00)                                       
         DC    AL1(31,13,02,03,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,04,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,04,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,04,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,09)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,09)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,112),C'R'                                        
         DC    AL1(60,06,05,02,128),C'O'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'OF'                                                 
         DC    AL1(12,47),C'WEEKLY BUSINESS REPORT - GROUP/STATION/OFFI+        
               CE'                                                              
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,25,10,000,00)                                       
         DC    AL1(31,12,01,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,32,07,000,00)                                       
         DC    AL1(31,14,02,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'R'                                        
         DC    AL1(60,06,05,02,128),C'O'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,02,04,05,06)                                           
         DC    AL1(11,04),C'OF'                                                 
         DC    AL1(12,47),C'WEEKLY BUSINESS REPORT - GROUP/STATION/OFFI+        
               CE'                                                              
         DC    AL1(16,03,02)                                                    
         DC    AL1(26,04,01,02)                                                 
         DC    AL1(30,07,01,07,21,000,00)                                       
         DC    AL1(31,12,01,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,02,32,07,000,00)                                       
         DC    AL1(31,14,02,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'O'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,03,04,05,06)                                           
         DC    AL1(11,04),C'OF'                                                 
         DC    AL1(12,47),C'WEEKLY BUSINESS REPORT - GROUP/STATION/OFFI+        
               CE'                                                              
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,25,10,000,00)                                       
         DC    AL1(31,12,01,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,32,07,000,00)                                       
         DC    AL1(31,14,02,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'O'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'OT'                                                 
         DC    AL1(12,47),C'WEEKLY BUSINESS REPORT - GROUP/STATION/OFFI+        
               CE'                                                              
         DC    AL1(30,07,01,07,21,000,00)                                       
         DC    AL1(31,12,01,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,02,32,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,04,06,000,00)                                       
         DC    AL1(31,13,02,03,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,04,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,04,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,04,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,112),C'R'                                        
         DC    AL1(60,06,05,02,128),C'O'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'OT'                                                 
         DC    AL1(12,47),C'WEEKLY BUSINESS REPORT - GROUP/STATION/OFFI+        
               CE'                                                              
         DC    AL1(30,07,01,25,10,000,00)                                       
         DC    AL1(31,12,01,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,32,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'R'                                        
         DC    AL1(60,06,05,02,128),C'O'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,02,04,05,06)                                           
         DC    AL1(11,04),C'OT'                                                 
         DC    AL1(12,47),C'WEEKLY BUSINESS REPORT - GROUP/STATION/OFFI+        
               CE'                                                              
         DC    AL1(26,04,01,02)                                                 
         DC    AL1(30,07,01,07,21,000,00)                                       
         DC    AL1(31,12,01,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,02,32,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'O'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,03,04,05,06)                                           
         DC    AL1(11,04),C'OT'                                                 
         DC    AL1(12,47),C'WEEKLY BUSINESS REPORT - GROUP/STATION/OFFI+        
               CE'                                                              
         DC    AL1(30,07,01,25,10,000,00)                                       
         DC    AL1(31,12,01,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,32,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'O'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'OF'                                                 
         DC    AL1(12,38),C'WEEKLY BUSINESS REPORT - OFFICE/TEAM'               
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,25,12,000,00)                                       
         DC    AL1(31,12,03,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,03,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,05,05,000,00)                                       
         DC    AL1(31,11,01,03,04,02,10),C'TEAM'                                
         DC    AL1(30,07,04,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,04,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,04,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,09)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,09)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,112),C'R'                                        
         DC    AL1(60,06,05,02,128),C'T'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'OF'                                                 
         DC    AL1(12,38),C'WEEKLY BUSINESS REPORT - OFFICE/TEAM'               
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,25,05,000,00)                                       
         DC    AL1(31,12,02,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,04,06,000,00)                                       
         DC    AL1(31,13,02,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'R'                                        
         DC    AL1(60,06,05,02,128),C'T'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,02,04,05,06)                                           
         DC    AL1(11,04),C'OF'                                                 
         DC    AL1(12,38),C'WEEKLY BUSINESS REPORT - OFFICE/TEAM'               
         DC    AL1(16,03,02)                                                    
         DC    AL1(26,04,01,01)                                                 
         DC    AL1(30,07,01,25,05,000,00)                                       
         DC    AL1(31,12,02,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,04,06,000,00)                                       
         DC    AL1(31,13,02,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'T'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,03,04,05,06)                                           
         DC    AL1(11,04),C'OF'                                                 
         DC    AL1(12,33),C'WEEKLY BUSINESS REPORT - OFFICE'                    
         DC    AL1(16,03,02)                                                    
         DC    AL1(30,07,01,25,05,000,00)                                       
         DC    AL1(31,12,02,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,04,06,000,00)                                       
         DC    AL1(31,13,02,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,09)                               
         DC    AL1(41,18),C'CURRENT ,BOOKED '                                   
         DC    AL1(40,10,02,01,00,09,75,00,00,09)                               
         DC    AL1(41,16),C'PRIOR ,BOOKED '                                     
         DC    AL1(40,10,03,01,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,04,01,00,09,22,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,BILLED '                                     
         DC    AL1(40,10,05,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'CUR,PCT'                                            
         DC    AL1(43,09,03,03,200,04,04,02,200)                                
         DC    AL1(40,10,06,01,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,07,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,06,02,200)                                
         DC    AL1(40,10,08,01,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,09,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,03,03,200,04,08,02,200)                                
         DC    AL1(40,10,10,02,00,09,21,00,00,10)                               
         DC    AL1(41,18),C'CURRENT ,BILLED '                                   
         DC    AL1(40,10,11,02,00,09,24,00,00,10)                               
         DC    AL1(41,16),C'PRIOR ,ACTUAL '                                     
         DC    AL1(40,10,12,00,00,00,00,00,00,04)                               
         DC    AL1(41,09),C'ACT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,11,02,200)                                
         DC    AL1(40,10,13,02,00,09,25,00,00,10)                               
         DC    AL1(41,11),C'BUDGET , '                                          
         DC    AL1(40,10,14,00,00,00,00,00,00,03)                               
         DC    AL1(41,09),C'BGT,PCT'                                            
         DC    AL1(43,09,10,03,200,04,13,02,200)                                
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'T'                                        
         DC    AL1(60,06,06,03,128),C'F'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'TA'                                                 
         DC    AL1(12,38),C'WEEKLY BUSINESS REPORT - OFFICE/TEAM'               
         DC    AL1(30,07,01,25,12,000,00)                                       
         DC    AL1(31,12,03,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,05,05,000,00)                                       
         DC    AL1(31,11,01,03,04,02,10),C'TEAM'                                
         DC    AL1(30,07,04,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,04,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,04,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,112),C'R'                                        
         DC    AL1(60,06,05,02,128),C'T'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,01,04,05,06)                                           
         DC    AL1(11,04),C'TB'                                                 
         DC    AL1(12,38),C'WEEKLY BUSINESS REPORT - OFFICE/TEAM'               
         DC    AL1(30,07,01,25,12,000,00)                                       
         DC    AL1(31,12,03,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'R'                                        
         DC    AL1(60,06,05,02,128),C'T'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,02,04,05,06)                                           
         DC    AL1(11,04),C'TC'                                                 
         DC    AL1(12,33),C'WEEKLY BUSINESS REPORT - OFFICE'                    
         DC    AL1(26,04,01,01)                                                 
         DC    AL1(30,07,01,25,12,000,00)                                       
         DC    AL1(31,12,03,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'T'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    AL1(10,06,03,04,05,06)                                           
         DC    AL1(11,04),C'TD'                                                 
         DC    AL1(12,38),C'WEEKLY BUSINESS REPORT - OFFICE/TEAM'               
         DC    AL1(30,07,01,25,12,000,00)                                       
         DC    AL1(31,12,03,01,05,01,10),C'GROUP'                               
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,17,11,000,01)                                       
         DC    AL1(31,30,01,03,23,02,11),C'        P/C,PERIOD  WKS'             
         DC    AL1(30,07,03,20,06,000,02)                                       
         DC    AL1(31,13,01,03,06,02,06),C'PERIOD'                              
         DC    AL1(30,07,03,19,00,000,03)                                       
         DC    AL1(31,07,01,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,36,00,00,07)                               
         DC    AL1(41,16),C'CURRENT,BOOKED'                                     
         DC    AL1(40,10,02,01,00,09,75,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,BOOKED'                                       
         DC    AL1(40,10,03,01,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,04,01,00,09,22,00,00,07)                               
         DC    AL1(41,15),C'PRIOR,BILLING'                                      
         DC    AL1(40,10,05,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'CURRNT,PACE'                                        
         DC    AL1(43,05,03,06,04)                                              
         DC    AL1(40,10,06,01,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,07,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,03,06,06)                                              
         DC    AL1(40,10,08,01,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,09,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,03,06,08)                                              
         DC    AL1(40,10,10,02,00,09,21,00,00,07)                               
         DC    AL1(41,17),C'CURRENT,BILLING'                                    
         DC    AL1(40,10,11,02,00,09,24,00,00,07)                               
         DC    AL1(41,14),C'PRIOR,ACTUAL'                                       
         DC    AL1(40,10,12,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'ACTUAL,PACE'                                        
         DC    AL1(43,05,10,06,11)                                              
         DC    AL1(40,10,13,02,00,09,25,00,00,07)                               
         DC    AL1(41,10),C'BUDGET, '                                           
         DC    AL1(40,10,14,00,00,00,00,00,00,06)                               
         DC    AL1(41,13),C'BUDGET,PACE'                                        
         DC    AL1(43,05,10,06,13)                                              
         DC    AL1(44,10,01,09),C'PERIOD'                                       
         DC    AL1(44,16,10,14),C'YEAR TO DATE'                                 
         DC    AL1(60,06,01,04,128),C'M'                                        
         DC    AL1(60,06,02,04,128),C'Q'                                        
         DC    AL1(60,06,03,04,128),C'A'                                        
         DC    AL1(60,06,04,07,128),C'B'                                        
         DC    AL1(60,06,05,02,128),C'T'                                        
         DC    AL1(60,06,06,03,128),C'T'                                        
         DC    AL1(60,06,07,06,128),C' '                                        
         DC    AL1(60,06,08,06,112),C' '                                        
         DC    X'00'                                                            
LSPECBLK EQU   *-SPECBLOK                                                       
***>>>                                                                          
         DC    C'SPECBLOC'                                                      
SPECBLOC DS    0C                                                               
         DC    AL1(10,05,01,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,11,255,02),C'STATION'                                     
         DC    AL1(13,11),C'BY OFFICE'                                          
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,02,04,04)                                              
         DC    AL1(30,07,01,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,05,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,06,06,20,128,00)                                       
         DC    AL1(31,18,01,03,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,07,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,08,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,09,29,08,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,10,41,06,128,00)                                       
         DC    AL1(31,10,02,03,03,06,00),C'DPT'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,71,00,00,09)                               
         DC    AL1(41,17),C'PENDING,MARKET$'                                    
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'S'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,02,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,11,255,02),C'STATION'                                     
         DC    AL1(13,11),C'BY OFFICE'                                          
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,01,04,04)                                              
         DC    AL1(30,07,01,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'S'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,11,255,02),C'STATION'                                     
         DC    AL1(13,11),C'BY OFFICE'                                          
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,01,04,04)                                              
         DC    AL1(30,07,01,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'S'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,01,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,02,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,05,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,06,04,20,128,00)                                       
         DC    AL1(31,13,01,03,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,07,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,08,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,09,29,08,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,10,41,06,128,00)                                       
         DC    AL1(31,10,02,03,03,06,00),C'DPT'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,71,00,00,09)                               
         DC    AL1(41,17),C'PENDING,MARKET$'                                    
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'O'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,02,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,01,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'O'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,01,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'O'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,01,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,02,05,05)                                              
         DC    AL1(28,04,01,01)                                                 
         DC    AL1(30,07,01,06,24,000,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(35,02)                                                       
         DC    AL1(30,07,02,06,24,000,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,06,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,07,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,08,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,09,41,20,128,00)                                       
         DC    AL1(31,14,01,03,07,06,00),C'DAYPART'                             
         DC    AL1(30,07,10,29,05,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,71,00,00,09)                               
         DC    AL1(41,17),C'PENDING,MARKET$'                                    
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'M'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,02,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,01,05,05)                                              
         DC    AL1(30,07,01,06,24,000,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,02,06,00,004,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'M'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,01,05,05)                                              
         DC    AL1(30,07,01,06,24,000,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,02,06,00,004,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'M'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,01,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,02,04,04)                                              
         DC    AL1(30,07,01,06,24,000,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,05,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,06,06,20,128,00)                                       
         DC    AL1(31,18,01,03,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,07,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,08,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,09,29,08,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,10,41,06,128,00)                                       
         DC    AL1(31,10,02,03,03,06,00),C'DPT'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,71,00,00,09)                               
         DC    AL1(41,17),C'PENDING,MARKET$'                                    
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,02,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,01,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,01,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,04,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,05,05,05)                                              
         DC    AL1(28,04,01,01)                                                 
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(35,02)                                                       
         DC    AL1(30,07,02,06,24,000,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,06,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,07,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,08,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,09,41,20,128,00)                                       
         DC    AL1(31,14,01,03,07,06,00),C'DAYPART'                             
         DC    AL1(30,07,10,29,05,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,71,00,00,09)                               
         DC    AL1(41,17),C'PENDING,MARKET$'                                    
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,05,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,04,05,05)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,07,00,004,00)                                       
         DC    AL1(31,12,03,01,05,02,21),C'GROUP'                               
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,04,05,05)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,06,00,004,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'M'                                        
         DC    AL1(10,05,01,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,11,255,02),C'STATION'                                     
         DC    AL1(13,11),C'BY OFFICE'                                          
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,02,04,04)                                              
         DC    AL1(30,07,01,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,05,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,06,06,20,128,00)                                       
         DC    AL1(31,18,01,03,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,07,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,08,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,09,29,08,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,10,41,06,128,00)                                       
         DC    AL1(31,10,02,03,03,06,00),C'DPT'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,64,00,00,09)                               
         DC    AL1(41,18),C'PENDING,STATION$'                                   
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'S'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,02,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,11,255,02),C'STATION'                                     
         DC    AL1(13,11),C'BY OFFICE'                                          
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,01,04,04)                                              
         DC    AL1(30,07,01,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'S'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,11,255,02),C'STATION'                                     
         DC    AL1(13,11),C'BY OFFICE'                                          
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,01,04,04)                                              
         DC    AL1(30,07,01,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,02,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'S'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,01,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,02,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,05,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,06,06,20,128,00)                                       
         DC    AL1(31,18,01,03,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,07,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,08,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,09,29,08,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,10,41,06,128,00)                                       
         DC    AL1(31,10,02,03,03,06,00),C'DPT'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,64,00,00,09)                               
         DC    AL1(41,18),C'PENDING,STATION$'                                   
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'O'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,02,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,01,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'O'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,01,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'O'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,01,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,02,05,05)                                              
         DC    AL1(28,04,01,01)                                                 
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(35,02)                                                       
         DC    AL1(30,07,02,06,24,000,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,06,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,07,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,08,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,09,41,20,128,00)                                       
         DC    AL1(31,14,01,03,07,06,00),C'DAYPART'                             
         DC    AL1(30,07,10,29,05,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,64,00,00,09)                               
         DC    AL1(41,18),C'PENDING,STATION$'                                   
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'M'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,02,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,01,05,05)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,06,00,004,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'M'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,01,05,05)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,06,00,004,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'M'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,01,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,02,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,05,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,06,06,20,128,00)                                       
         DC    AL1(31,18,01,03,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,07,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,08,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,09,29,08,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,10,41,06,128,00)                                       
         DC    AL1(31,10,02,03,03,06,00),C'DPT'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,64,00,00,09)                               
         DC    AL1(41,18),C'PENDING,STATION$'                                   
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,02,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,01,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,12),C'BY STATION'                                         
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,01,04,04)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,03,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,04,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,04,01,02)                                              
         DC    AL1(07,03,02)                                                    
         DC    AL1(08,02)                                                       
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,30),C'P E N D I N G   R E P O R T '                       
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(24,05,05,05,05)                                              
         DC    AL1(28,04,01,01)                                                 
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(35,02)                                                       
         DC    AL1(30,07,02,06,24,000,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,22,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,128,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(30,07,06,12,08,000,00)                                       
         DC    AL1(31,15,02,03,08,04,08),C'CONTRACT'                            
         DC    AL1(30,07,07,38,06,128,00)                                       
         DC    AL1(31,11,02,03,04,07,07),C'DEMO'                                
         DC    AL1(30,07,08,42,22,000,00)                                       
         DC    AL1(31,24,01,03,17,17,00),C'FLIGHT           '                   
         DC    AL1(30,07,09,41,20,128,00)                                       
         DC    AL1(31,14,01,03,07,06,00),C'DAYPART'                             
         DC    AL1(30,07,10,29,05,000,00)                                       
         DC    AL1(31,10,01,03,03,01,03),C'SVC'                                 
         DC    AL1(30,07,11,19,00,000,00)                                       
         DC    AL1(31,07,02,03,00,00,00)                                        
         DC    AL1(40,10,01,01,00,09,64,00,00,09)                               
         DC    AL1(41,18),C'PENDING,STATION$'                                   
         DC    AL1(40,10,02,01,00,09,43,00,00,04)                               
         DC    AL1(41,10),C'SHR,GOAL'                                           
         DC    AL1(40,10,03,01,00,09,41,00,00,09)                               
         DC    AL1(41,11),C' ,BOOKED '                                          
         DC    AL1(40,10,04,01,00,09,52,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,05,01,00,09,53,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,00,00,00,00,00,00,10)                               
         DC    AL1(41,12),C' ,MARKET$ '                                         
         DC    AL1(43,09,09,03,200,03,110,04,05)                                
         DC    AL1(40,10,07,01,00,09,53,00,00,06)                               
         DC    AL1(41,07),C' ,SPL'                                              
         DC    AL1(40,10,08,01,00,09,41,00,00,08)                               
         DC    AL1(41,11),C' ,FINAL $'                                          
         DC    AL1(40,10,09,01,00,09,41,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,10,01,00,09,51,00,00,01)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(44,11,03,04),C'CURRENT'                                      
         DC    AL1(44,09,05,10),C'PRIOR'                                        
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,05,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(25,05,04,05,05)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,06,00,004,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,41,00,00,07)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,32,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,05,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,06,01,00,09,35,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,07,01,00,09,41,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,08,01,00,09,24,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,09,01,00,09,55,00,00,08)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    AL1(10,05,03,01,02)                                              
         DC    AL1(11,04),C'PR'                                                 
         DC    AL1(12,29),C'P E N D I N G   R E P O R T'                        
         DC    AL1(13,10,255,04),C'OFFICE'                                      
         DC    AL1(13,16),C'BY SALESPERSON'                                     
         DC    AL1(16,03,02)                                                    
         DC    AL1(27,05,04,05,05)                                              
         DC    AL1(30,07,01,04,23,000,00)                                       
         DC    AL1(31,13,03,01,06,02,20),C'OFFICE'                              
         DC    AL1(30,07,02,06,00,004,00)                                       
         DC    AL1(31,18,03,01,11,03,20),C'SALESPERSON'                         
         DC    AL1(30,07,03,02,28,000,00)                                       
         DC    AL1(31,14,03,01,07,07,20),C'STATION'                             
         DC    AL1(30,07,04,08,20,000,00)                                       
         DC    AL1(31,17,01,03,10,04,20),C'ADVERTISER'                          
         DC    AL1(30,07,05,10,20,000,00)                                       
         DC    AL1(31,13,01,03,06,06,20),C'AGENCY'                              
         DC    AL1(40,10,01,01,00,09,52,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,02,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,03,01,00,09,53,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(40,10,04,01,00,09,35,00,00,10)                               
         DC    AL1(41,05),C' , '                                                
         DC    AL1(60,06,01,07,128),C'B'                                        
         DC    AL1(60,06,02,03,128),C'S'                                        
         DC    X'00'                                                            
LSPECBLC EQU   *-SPECBLOC                                                       
*                                                                               
