*          DATA SET REREIFDD   AT LEVEL 004 AS OF 11/07/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T826FDD      DATE 11/07/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  L  P H             T        Y              
DISSTAH  DS    XL8                                                              
DISSTA   DS    CL9      5   10    9  A  U H             T        Y              
DISSTNMH DS    XL8                                                              
DISSTNM  DS    CL15     5   20   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   38    5  L  P H             T        Y              
DISMONH  DS    XL8                                                              
DISMON   DS    CL6      5   47    6  A  U H             T        Y              
DISMNDTH DS    XL8                                                              
DISMNDT  DS    CL17     5   56   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
DISOFFH  DS    XL8                                                              
DISOFF   DS    CL2      6   10    2  A  P H             T        Y              
DISCONAH DS    XL8                                                              
DISCONA  DS    CL8      6   20    8  L  P H             T        Y              
DISCONH  DS    XL8                                                              
DISCON   DS    CL11     6   30   11  A  U H             T        Y              
DISTYPEH DS    XL8                                                              
DISTYPE  DS    CL1      6   42    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   47    7  L  P H             T        Y              
DISINVH  DS    XL8                                                              
DISINV   DS    CL10     6   56   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8    2    4  L  P N             T        Y              
DISDATEH DS    XL8                                                              
DISDATE  DS    CL8      8   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   20    8  L  P N             T        Y              
DISDDATH DS    XL8                                                              
DISDDAT  DS    CL8      8   29    8  A  P N             T        Y              
DISPAIDH DS    XL8                                                              
DISPAID  DS    CL8      8   38    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   47    9  A  P N             T        Y              
DISRVSNH DS    XL8                                                              
DISRVSN  DS    CL4      8   57    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  L  P N             T        Y              
DISTOTLH DS    XL8                                                              
DISTOTL  DS    CL15     9   10   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   27   15  L  P N             T        Y              
DISSPTSH DS    XL8                                                              
DISSPTS  DS    CL4      9   43    4  A  P N             T        Y              
DISTAXTH DS    XL8                                                              
DISTAXT  DS    CL3      9   60    3  A  P Z             T        Y              
DISTAXAH DS    XL8                                                              
DISTAXA  DS    CL15     9   64   15  A  P Z             T        Y              
DISMSGH  DS    XL8                                                              
DISMSG   DS    CL26    11    2   26  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  L  P N             T        Y              
DISAGYH  DS    XL8                                                              
DISAGY   DS    CL7     13   10    7  A  P N             T        Y              
DISAGYNH DS    XL8                                                              
DISAGYN  DS    CL20    13   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   47    5  L  P N             T        Y              
DISBUYRH DS    XL8                                                              
DISBUYR  DS    CL20    13   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  L  P N             T        Y              
DISADVH  DS    XL8                                                              
DISADV   DS    CL4     14   10    4  A  P N             T        Y              
DISADVNH DS    XL8                                                              
DISADVN  DS    CL20    14   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   47    7  L  P N             T        Y              
DISPRODH DS    XL8                                                              
DISPROD  DS    CL20    14   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  L  P N             T        Y              
DISSALH  DS    XL8                                                              
DISSAL   DS    CL3     15   10    3  A  P N             T        Y              
DISSALNH DS    XL8                                                              
DISSALN  DS    CL20    15   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   47    5  L  P N             T        Y              
DISCDTSH DS    XL8                                                              
DISCDTS  DS    CL17    15   56   17  A  P N             T        Y              
DISPFLNH DS    XL8                                                              
DISPFLN  DS    CL20    24    2   20  L  P H             T        Y              
DISPF12H DS    XL8                                                              
DISPF12  DS    CL11    24   60   11  L  P H             T        Y              
DISLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 800  BYTES                            
