*          DATA SET RERISWRKT  AT LEVEL 062 AS OF 03/15/01                      
*********************************************************************           
*                                                                   *           
*         RERISWRK --- WORK AREA FOR RIS                            *           
*                                                                   *           
* ----------------------------------------------------------------- *           
* UPDATE HISTORY:                                                   *           
*                                                                   *           
* 02/13/89 (MRR) --- ADD LISTTRAF EQUATE                            *           
*  (LEVEL 23)                                                       *           
*                                                                   *           
* JAN23/90 (MRR) --- USE 4 BYTES OF CL90 SPARE IN 'MY WORK AREA'    *           
*                     FOR NUMLIST, NUMFILT, SINGSTA AND SINGSAL,    *           
*                     AND PUT ADVORAGY WHERE FILTBYTE WAS.          *           
*                                                                   *           
* FEB25/92 (BU ) --- USE 1 BYTE OF TWA FOR                          *           
*                    PREVIOUS VALUE OF ALTERNATE DOLLAR FLAG        *           
*                                                                   *           
* DEC03/92 (BU ) --- USE PORTION OF TWA FOR COMBO STATIONS WHICH    *           
*                    REQUIRE AGGREGATING.  USE PART OF SPARE FOR    *           
*                    COMBO REP TABLE AND FLAG.                      *           
*                                                                   *           
* OCT/95   (PXZ) --- ACOMFACS ADDED IN SPARE ADDR                   *           
*                    ATIOB    ADDED                                 *           
*                    PFKEY, PFSWAP ADDED                            *           
*                                                                   *           
*                                                                   *           
* MAY14/96 (PXZ) ---REPPRFSV ADDED (=REPPROF+8)                     *           
*                                                                   *           
* DEC23/96 (PXZ) --- PRDFILT ADDED                                  *           
*                                                                   *           
* JAN23/97 (PXZ) --- PRINT LINE DSECT FOR PRODUCT NAME REPORT ADDED *           
*                                                                   *           
* JUL22/97 (JRD) --- 2000 BYTE CONTRACT                             *           
*                    NEW FILTERS IN TWA WORKING STORAGE             *           
*                                                                   *           
* OCT24/97 (BU ) --- REMOVE RGENEROL (FARMABLE CODE) FROM WORK      *           
*                    AREA!  NO CSECT/DSECT COPY CODE!!              *           
*                                                                   *           
* DEC 3/97 (PXZ) --- USE 5 BYTES OF SPARE TO SAVE STATION CODE      *           
*                    FOR LIST,X OPTION STATION JOIN DATE            *           
*                                                                   *           
* FEB20/98 (JRD) --- 4K CONTRACT RECORD IN TWA.                     *           
*                                                                   *           
* MAY13/99 (ROB) --- REPFACS ARRIVES                                *           
*                                                                   *           
* JUL19/00 (BU ) --- MASTRREP FIELD ADDED                           *           
*                                                                   *           
* MAR14/01 (BU ) --- 1 BYTE SPARE USED TO SAVE DAILY PACING PROFILE *           
*                                                                   *           
*                                                                   *           
*                                                                   *           
*********************************************************************           
*                                                                               
FLDERR   EQU   1                                                                
STAERR   EQU   150                                                              
OFFERR   EQU   151                                                              
AGYERR   EQU   152                                                              
ADVERR   EQU   153                                                              
SLSERR   EQU   154                                                              
TEAMERR  EQU   155                                                              
VALERR   EQU   159                                                              
LISTERR  EQU   157                                                              
DATERR   EQU   13                                                               
MNTSERR  EQU   13                                                               
RISERR1  EQU   160                                                              
RISERR2  EQU   161                                                              
RISERR3  EQU   162                                                              
LENTHERR EQU   170                                                              
DUBERR   EQU   171                                                              
CTGERR   EQU   98                                                               
CLSERR   EQU   105                                                              
GRUPERR  EQU   106                                                              
         EJECT                                                                  
LISTDIV  EQU   4                                                                
LISTSLS  EQU   8                                                                
LISTAGY  EQU   12                                                               
LISTADV  EQU   16                                                               
LISTSTA  EQU   20                                                               
LISTOFF  EQU   24                                                               
LISTPRD  EQU   28                                                               
LISTCTG  EQU   32                                                               
LISTDLRS EQU   36                                                               
LISTGRP  EQU   40                                                               
LISTUNCF EQU   44                                                               
LISTTRAF EQU   48                                                               
LISTPNAM EQU   52                                                               
         EJECT                                                                  
       ++INCLUDE FLDIND                                                         
         EJECT                                                                  
       ++INCLUDE RGENOLD                                                        
         EJECT                                                                  
       ++INCLUDE REGENSTA                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENOFF                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENTEM                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENADV                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENAGY                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENSAL                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENPRD                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENCLS                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENCTG                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENGRP                                                       
         ORG   IOAREA                                                           
       ++INCLUDE REGENREPA                                                      
         ORG   IOAREA+1008                                                      
         EJECT                                                                  
* MY WORK AREAS                                                                 
*                                                                               
GRID     DS    CL300               TOTALS BY MONTH                              
LIST     DS    CL8                 8X'FF'                                       
ALL      DS    CL8                 8X'00'                                       
VREAD    DS    V                                                                
VMONDAY  DS    V                                                                
BASERB   DS    F                                                                
LINK     DS    F                                                                
SAVERE   DS    F                                                                
VREPOFFL DS    V                                                                
LISTBYTE DS    CL1                                                              
WRKDATE  DS    CL17                                                             
CONGRID  DS    36F                 CONTRACT BUCKETS BY MONTH                    
CONGRIDX DS    3F                                 TOTAL                         
ACTLIST  DS    CL36                INVOICE/ESTIMATE INDICATOR LIST              
ACOMFACS DS    A                                                                
AFACILS  DS    A                                                                
SAVETIME DS    F                                                                
RELO     DS    A                   ROOT RELOCATION FACTOR                       
RELO1    DS    A                   FIRST LEVEL RELO                             
RELO2    DS    A                   SECOND LEVEL RELO                            
ATIOB    DS    A                   FATIOB ADDRESS                               
MAXIOCTR DS    H                                                                
ADVORAGY DS    CL1                 ADV OR AGY FILTER ENTERED                    
ELCODE   DS    CL1                 ELEMENT CODE FOR GETEL                       
NUMLIST  DS    CL1                 NUMBER OF HEADER ITEMS THAT ARE LIST         
NUMFILT  DS    CL1                 NUMBER OF HDR ITEMS THAT ARE SINGLE          
SINGSTA  DS    CL1                 SINGLE STATION FLAG                          
SINGSAL  DS    CL1                 SINGLE SALESPERSON FLAG                      
CNFNOWIP DS    CL1                 Y = CONFIRMED:  NO WIP DISPLAY               
         DS    CL2                 SPARE                                        
PFKEY    DS    CL1                 PFKEY PRESSED (0=ENTER)                      
REPPRFSV DS    CL1                 SAVE REPPROF+8 FOR DIRECT RESPONSE           
GLOBSV   DS    CL24                GLOBBER RETURN SAVE AREA                     
STASAVE  DS    CL5                 STATION SAVE FOR JOIN DATE                   
STAJOIN  DS    CL3                 STATION JOIN DATE                            
         DS    CL25                SPARE                                        
RFBLOCK  DS    CL6                 PARM BLOCK FOR REPFACS                       
VREPFACS DS    A                                                                
BASERD   DS    A                                                                
         DS    A                   SPARE                                        
NUMCON   DS    F                                                                
GRID2    DS    CL160                                                            
WORK2    DS    CL64                SECONDARY WORK AREA                          
         EJECT                                                                  
       ++INCLUDE RERISFFD                                                       
TABLE    DS    0H                                                               
TBLGRP   DS    CL1                                                              
TBLSBGP  DS    CL1                                                              
TBLSTA   DS    CL5                                                              
TBLOFF   DS    CL2                                                              
TBLAGY   DS    CL4                                                              
TBLAOFF  DS    CL2                                                              
TBLADV   DS    CL4                                                              
TBLDIV   DS    CL1                                                              
TBLTEAM  DS    CL1                                                              
TBLSLS   DS    CL3                                                              
TBLSLS2  DS    CL3                 SALESPERSON INITIALS NOT INVERTED            
*                                                                               
TBLBGN   DS    0CL3                                                             
TBLBGNY  DS    CL1                                                              
TBLBGNM  DS    CL1                                                              
         DS    CL1                                                              
*                                                                               
TBLEND   DS    0CL3                                                             
TBLENDY  DS    CL1                                                              
TBLENDM  DS    CL1                                                              
         DS    CL1                                                              
*                                                                               
TBLDEMO  DS    CL3                 DEMO                                         
TBLCDATS DS    CL2                 CREATION DATE START FILTER                   
TBLCDATE DS    CL2                 CREATION DATE END FILTER                     
TBLCTYP  DS    CL3                 CONTRACT TYPE - U$,C$,UR,URW ETC.            
TBLBDATS DS    CL3                 FIRST BUY DATE FILTER - YMD                  
TBLBDATE DS    CL3                 FIRST BUY DATE FILTER - YMD                  
*                                                                               
START1   DS    CL2                                                              
START2   DS    CL2                                                              
END1     DS    CL2                                                              
END2     DS    CL2                                                              
SAVEKEY  DS    CL32                                                             
LINKSAVE DS    F                                                                
LISTSAVE DS    CL1                                                              
NEXTBYTE DS    CL1                                                              
SAVER8   DS    F                   SAVED KEY LENGTH FOR COMPARE IN 0A           
TBLCTG   DS    CL2                                                              
TBLCLS   DS    CL2                                                              
MOSTRT   DS    CL2                 START MONTH OF SERVICE FOR LISTDLR           
MOSEND   DS    CL2                 END T MONTH OF SERVICE FOR LISTDLR           
TBLFILT  DS    CL1                                                              
*                                                                               
*- THE FOLLOWING 10 BYTES ADDED 1/15/90  PJS.                                   
SVPGMPRF DS    0CL10               PROGRAM PROFILE FROM REP                     
SVPGP#   DS    XL1                 RIS EQUATE (RREPQRIS)                        
         DS    XL1                 UNDEFINED                                    
SVPGPBIT DS    XL8                 PROGRAM PROFILE BITS                         
*                                                                               
PREVALT$ DS    CL1                 PREVIOUS ALTERNATE DOLLAR INPUT              
CMBOSTAS DS    CL26                STATIONS PARTICIPATING IN COMBO              
*                                  5 X 5 BYTES, + 1 BYTE X'00'                  
CMBOREP  DS    CL1'N'              COMBO REP?  YES/NO                           
ACMBOSTA DS    A                   STATION IN USE                               
*                                                                               
PFJUMP   DS    CL1                 PFKEY JUMP TO WHERE                          
RISTATUS DS    CL1                 STATUS BYTE FOR LIST$ TOTAL READ             
*                                                                               
VIEWS    DS    CL1                 X'01'  LIST$                                 
*                                  X'02'  LISTD                                 
*                                  X'04'  BUY$                                  
*                                  X'08'  LISTP                                 
*                                  X'80'  NO BOTTOM PAGE TOTALS                 
*                                  X'40'  SENT BY REP TODAY FILTER              
*                                  X'20'  SENT BY STATION TODAY FILTER          
*                                  X'10'  SPARE                                 
*                                                                               
DLRTOTAL DS    PL8                 REQUEST TOTALS FOR LIST$                     
PGTOT    DS    PL8                 PAGE TOTALS FOR LIST$                        
SHRTOT   DS    PL8                 SHARE TOTAL FOR LISTD                        
ALLSHR   DS    PL8                 TOTAL CONTRACT $ OF SHARE CONTRACTS          
CONTOT   DS    F                   TOAL NUMBER OF CONTRACTS FOR LIST$           
SHRPCT   DS    F                   SHARE PCT FOR TOTAL REQUEST                  
*  STATION TOTALS FOR PRODUCT LIST REPORT                                       
STATOTAL DS    PL8                 PRIOR ACTUAL                                 
         DS    PL8                 PRIOR BOOKED                                 
         DS    PL8                 CURRENT BEST                                 
         DS    PL8                 CURRENT BOOKED                               
PMKTOT   DS    PL8                 PRIOR MKT TOTAL                              
CMKTOT   DS    PL8                 CURRENT MKT TOTAL                            
*  BOTTOM OF PAGE REQUEST TOTALS FOR LISTP READ                                 
STATOTBP DS    PL8                 PRIOR ACTUAL                                 
         DS    PL8                 PRIOR BOOKED                                 
         DS    PL8                 CURRENT BEST                                 
         DS    PL8                 CURRENT BOOKED                               
PMKTOTBP DS    PL8                 PRIOR MKT TOTAL                              
CMKTOTBP DS    PL8                 CURRENT MKT TOTAL                            
CONTOTBP DS    F                   CONTRACT # TOTAL                             
                                                                                
*                                                                               
* WORK AREA FOR PRINTING REPORT                                                 
         DS    C                   NEEDED FOR MYP                               
MYP      DS    CL132                                                            
MYP2     DS    CL132                                                            
PRNT     DS    CL1                 PRINTING REPORT FLAG                         
MAXLNES  DS    CL1                 MAX LINES                                    
LNE      DS    CL1                 LINE COUNTER                                 
PG       DS    CL1                 PAGE COUNTER                                 
DLRS     DS    CL1                 C'0' = ZERO DOLLARS ONLY                     
*                                  C'-' = EXCLUDE ZERO DOLLARS                  
ACOMBSV  DS    CL4                 ADDR OF COMBO LIST                           
PRDFILT  DS    CL3                 PRODUCT FILTER                               
FILTFLG  DS    CL1                 X'01' - COMBO STATIONS ONLY                  
*                                  X'02' - EXCLUDE COMBO STATIONS               
*                                                                               
* CSTATION AND CDATE USED BY ROUTINES THAT DETERMINE IF                         
* 0$ TO BE USED FOR INVOICE $ IN CALCULATING BEST $                             
CSTATION DS    CL5                 CURRENT STATION                              
CDATE    DS    CL2                 CLOSE DATE                                   
CFLAG    DS    CL1                 C'Y' = USE 0 INVOICE $                       
*                                                                               
VIEWS2   DS    CL1                 ------------------------                     
*                                   X'80'   EXCLUDE FORECAST ORDERS             
*                                   X'40'   FORECAST ORDERS ONLY                
*                                   X'20'   EXCLUDE SHR PCT                     
*                                   X'10'   SHR PCT ONLY                        
*                                   X'08'   EXCLUDE DARE ORDERS                 
*                                   X'04'   DARE ORDERS ONLY                    
*                                   X'02'   EXCLUDE PENDING ORDERS              
*                                   X'01'   PENDING ORDERS ONLY                 
SCLASATD DS    CL3                 STATION CLOSE AS AT DATE (IN 0$ RTN)         
*---------------------------------------------------------------------*         
*JRD     DS    CL16                SPARE                                        
DVSFILT  DS    CL3                 DEVELOPMENTAL SALESPERSON FILTER             
DVTFILT  DS    CL2                 DEVELOPMENTAL TYPE FILTER                    
PPERFILT DS    CL3                 POINT PERSON FILTER                          
*                                                                               
VIEWS3   DS    CL1                 ------------------------                     
*                                   X'80'   EXPAND PRODUCT LIST(LISTPX)         
*                                   X'40'   EXCLUDE TAKEOVER ORDERS             
*                                   X'20'   TAKEOVER ORDERS ONLY                
ESTBUCKT DS    XL1                 ELEMENT TYPE FOR ESTIMATE BUCKETS            
INVBUCKT DS    XL1                 ELEMENT TYPE FOR INVOICE BUCKETS             
MASTRREP DS    CL2                 MASTER REP CODE, IF SUBSIDIARY               
         DS    CL2                                                              
DAILYPAC DS    CL1                 DAILY PACING FLAG STORAGE                    
*---------------------------------------------------------------------*         
*                                                                               
* END WORK AREA FOR PRINTING REPORT                                             
                                                                                
REPIOTBL DS    CL(RIPEND-REPIOD)                                                
                                                                                
*                                                                               
CNTYPTBL DS    CL100          50 X 2 (CONTRACT TYPE + FORMAT)                   
*                                     (FROM RCTYREC)                            
*                                                                               
NAMESV   DS    0CL1000                                                          
AGYNMSV  DS    CL200                                                            
ADVNMSV  DS    CL200                                                            
PRDNMSV  DS    CL200                                                            
SLSNMSV  DS    CL200                                                            
DEMNMSV  DS    CL200                                                            
NMENTNUM EQU   (*-DEMNMSV)/25           NUMBER OF ENTRIES                       
*                                                                               
         EJECT                                                                  
RECORD   DS    0D                                                               
         DS    4096X                                                            
         ORG   RECORD                                                           
       ++INCLUDE REGENCON                                                       
         ORG                                                                    
*--------------*                                                                
** SET TABLES **                                                                
*--------------*                                                                
** 1 BYTE FLAG                                                                  
**   - X'80' IS A SET                                                           
**   - X'40' MEMBERS ARE EXCLUDED                                               
**   - X'20' SET OF SETS WAS PROCESSED                                          
** 2 BYTES SET TYPE CODE FROM REGENSET                                          
** 1 BYTE LENGTH OF SINGLE ENTRY                                                
** N ENTRIES                                                                    
** 1 BYTE NULLS FOR END OF TABLE                                                
**                                                                              
SETDISPD DS    0A                                                               
SETDISPS EQU   *-T80DFFD                                                        
SETSTAS  DS    A                   STATION SET OR MARKET LIST                   
SETADVS  DS    A                   ADVERTISERS SET LIST                         
SETAGYS  DS    A                   AGENCY SET LIST                              
SETCTYPE DS    A                   CONTRACT TYPE SET LIST                       
SETSALS  DS    A                   SALESPERSON SET LIST                         
SETOFFS  DS    A                   OFFICE SET LIST                              
SETGRPS  DS    A                   GROUP/SUBGROUP SET LIST?                     
SETDVTS  DS    A                   DEVELOPMENTAL TYPE SET LIST?                 
NEXTSETD DS    A                   DISPLACEMENT NEXT SET IN TWA                 
*                                                                               
ENDOFTWA EQU   *                                                                
*                                                                               
STADISP  EQU   SETSTAS-T80DFFD                                                  
ADVDISP  EQU   SETADVS-T80DFFD                                                  
AGYDISP  EQU   SETAGYS-T80DFFD                                                  
CTYPDISP EQU   SETCTYPE-T80DFFD                                                 
SALDISP  EQU   SETSALS-T80DFFD                                                  
OFFDISP  EQU   SETOFFS-T80DFFD                                                  
GRPDISP  EQU   SETGRPS-T80DFFD                                                  
DVTDISP  EQU   SETDVTS-T80DFFD                                                  
NEXTDISP EQU   NEXTSETD-T80DFFD                                                 
FIRSTSET EQU   ENDOFTWA-T80DFFD                                                 
*                                                                               
***********************************************************************         
*** º\  º ._. -+- º- #                                                          
*** º \ º º º  º  º-    SET TABLES ARE BUILT HERE AND COULD TAKE                
*** º  \º º_º  º  º_ #  UP ALOT OF SPACE, COMBINED WITH 4K CONTRACTS            
***                     THE PROGRAMS AREA WILL BE AT RISK ON HUGE SETS          
***********************************************************************         
         EJECT                                                                  
LINE1    DSECT                                                                  
         DS    CL9                                                              
LMNTH    DS    CL6                                                              
         DS    CL2                                                              
LCOL1    DS    CL13                                                             
         DS    CL2                                                              
LCOL2    DS    CL13                                                             
         DS    CL2                                                              
LCOL3    DS    CL13                                                             
         EJECT                                                                  
LINE2    DSECT                                                                  
         DS    CL8                                                              
L2OFF    DS    CL2                                                              
         DS    CL1                                                              
L2GRP    DS    CL2                                                              
         DS    CL1                                                              
L2STA    DS    CL4                                                              
L2MED    DS    CL1                                                              
         DS    CL1                                                              
L2AGY    DS    CL4                                                              
L2AOF    DS    CL2                                                              
         DS    CL1                                                              
L2ADV    DS    CL4                                                              
         DS    CL1                                                              
L2DIV    DS    CL2                                                              
         DS    CL1                                                              
L2SAL    DS    CL3                                                              
         DS    CL1                                                              
L2CTG    DS    CL2                                                              
         DS    CL1                                                              
L2NAME   DS    CL19                                                             
         DS    CL1                                                              
L2CON    DS    CL7                                                              
         DS    CL1                                                              
L2PER1   DS    CL8                                                              
         DS    CL1                                                              
L2PER2   DS    CL8                                                              
*                                                                               
LINE3A   DSECT               DSECT FOR DLIST VIEW 1ST LINE                      
         DS    CL8                                                              
L3STA    DS    CL5                 STATION                                      
         DS    CL1                                                              
L3AGY    DS    CL12                AGENCY                                       
         DS    CL1                                                              
L3PRD    DS    CL12                PROD NAME                                    
         DS    CL1                                                              
L3DATS   DS    CL8                 FLIGHT DATE START                            
         DS    CL1                                                              
L3CNT    DS    CL11                CONTRACT NUMBER                              
         DS    CL1                                                              
L3DLR    DS    CL10                DOLLARE                                      
         DS    CL1                                                              
L3CRDAT  DS    CL8                 CREATION DATE                                
         DS    CL1                                                              
L3VER    DS    CL5                 VER                                          
         DS    CL1                                                              
*                                                                               
LINE3B   DSECT               DSECT FOR DLIST VIEW 2ND LINE                      
         DS    CL8                                                              
L3OFF    DS    CL2                 OFFICE                                       
         DS    CL3                                                              
         DS    CL1                                                              
L3ADV    DS    CL12                ADVERTISER NAME                              
         DS    CL1                                                              
L3SLS    DS    CL12                SALES PERSON NAME                            
         DS    CL1                                                              
L3DATE   DS    CL8                 FLIGHT DATE END                              
         DS    CL1                                                              
L3DEMO   DS    CL8                 DEMO                                         
         DS    CL4                                                              
L3SHR    DS    CL10                SHARE                                        
         DS    CL1                                                              
L3ACTV   DS    CL8                 ACTIVITY DATE                                
         DS    CL1                                                              
L3SNT    DS    CL5                 SNT                                          
         DS    CL1                                                              
*                                                                               
         EJECT                                                                  
*                                                                               
PLIN3A   DSECT               DSECT FOR DLIST REPORT                             
         DS    CL8                                                              
P3STA    DS    CL5                 STATION                                      
         DS    CL3                                                              
P3AGY    DS    CL20                AGENCY                                       
         DS    CL3                                                              
P3PRD    DS    CL20                PROD NAME                                    
         DS    CL3                                                              
P3DATS   DS    CL8                 FLIGHT DATE START                            
         DS    CL3                                                              
P3CNT    DS    CL11                CONTRACT NUMBER                              
         DS    CL3                                                              
P3DLR    DS    CL10                DOLLARE                                      
         DS    CL3                                                              
P3CRDAT  DS    CL8                 CREATION DATE                                
         DS    CL3                                                              
P3VER    DS    CL5                 VER                                          
         DS    CL1                                                              
*                                                                               
PLIN3B   DSECT               DSECT FOR DLIST VIEW 2ND LINE                      
         DS    CL8                                                              
P3OFF    DS    CL2                 OFFICE                                       
         DS    CL3                                                              
         DS    CL3                                                              
P3ADV    DS    CL20                ADVERTISER NAME                              
         DS    CL3                                                              
P3SLS    DS    CL20                SALES PERSON NAME                            
         DS    CL3                                                              
P3DATE   DS    CL8                 FLIGHT DATE END                              
         DS    CL3                                                              
P3DEMO   DS    CL8                 DEMO                                         
         DS    CL6                                                              
P3SHR    DS    CL10                SHARE                                        
         DS    CL3                                                              
P3ACTV   DS    CL8                 ACTIVITY DATE                                
         DS    CL3                                                              
P3SNT    DS    CL5                 SNT                                          
         DS    CL1                                                              
*                                                                               
PLPNMD   DSECT               DSECT FOR PRODUCT NAME REPORT                      
         DS    CL8                                                              
PLPNSTA  DS    CL5                 STATION                                      
         DS    CL1                                                              
PLPNADV  DS    CL4                 ADVERTISER                                   
         DS    CL1                                                              
PLPNPRD  DS    CL15                PRODUCT NAME                                 
         DS    CL1                                                              
PLPNAGY  DS    CL6                 AGENCY                                       
         DS    CL1                                                              
PLPNCON  DS    CL8                 CONTRACT NUMBER                              
         DS    CL1                                                              
PLPNPRI  DS    CL8                 PRIOR $                                      
         DS    CL1                                                              
PLPNPRSH DS    CL7                 PRIOR SHARE                                  
         DS    CL3                                                              
PLPNCUR  DS    CL8                 CURRENT $                                    
         DS    CL1                                                              
PLPNCRSH DS    CL7                 CURRENT SHARE                                
         EJECT                                                                  
       ++INCLUDE FATWA                                                          
       ++INCLUDE REPFACSQ                                                       
