*          DATA SET RERISFFD   AT LEVEL 002 AS OF 04/05/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80DFFD      DATE 04/05/01                 
         SPACE 1                                                                
T80DFFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RISMESSH DS    XL8                                                              
RISMESS  DS    CL60     1    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL7      3    2    7  A  P H             T        Y              
RISSTAH  DS    XL8                                                              
RISSTA   DS    CL7      3   10    7  A  U N             T    I   Y              
RISSTANH DS    XL8                                                              
RISSTAN  DS    CL12     3   18   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      3   32    6  A  P N             T        Y              
RISOFFH  DS    XL8                                                              
RISOFF   DS    CL5      3   40    5  A  U N             T        Y              
RISOFFNH DS    XL8                                                              
RISOFFN  DS    CL12     3   48   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      3   62    6  A  P N             T        Y              
RISAGYH  DS    XL8                                                              
RISAGY   DS    CL7      3   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
RISADVH  DS    XL8                                                              
RISADV   DS    CL8      4   10    8  A  U N             T        Y              
RISADVNH DS    XL8                                                              
RISADVN  DS    CL12     4   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   32    7  A  P N             T        Y              
RISSLSH  DS    XL8                                                              
RISSLS   DS    CL7      4   40    7  A  U N             T        Y              
RISSLSNH DS    XL8                                                              
RISSLSN  DS    CL12     4   48   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   62    7  A  P N             T        Y              
RISCTGH  DS    XL8                                                              
RISCTG   DS    CL4      4   70    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
RISTARH  DS    XL8                                                              
RISTAR   DS    CL11     5    9   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   32    8  A  P N             T        Y              
RISCRTH  DS    XL8                                                              
RISCRT   DS    CL18     5   42   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     5   62   10  A  P N             T        Y              
RISCSTH  DS    XL8                                                              
RISCST   DS    CL3      5   73    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
RISMNTSH DS    XL8                                                              
RISMNTS  DS    CL13     6    9   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   32    7  A  P N             T        Y              
RISDATEH DS    XL8                                                              
RISDATE  DS    CL17     6   41   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   62    8  A  P N             T        Y              
RISFILTH DS    XL8                                                              
RISFILT  DS    CL5      6   73    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   62    5  A  P N             T        Y              
RISALTDH DS    XL8                                                              
RISALTD  DS    CL1      7   73    1  A  U N             T        Y              
RISNEXTH DS    XL8                                                              
RISNEXT  DS    CL1      7   78    1  A  U N             T        Y              
RISTITLH DS    XL8                                                              
RISTITL  DS    CL79     8    1   79  A  P N             T        Y              
RISTTL2H DS    XL8                                                              
RISTTL2  DS    CL79     9    1   79  A  P N             T        Y              
RISOUTH  DS    XL8                                                              
RISOUT   DS    CL79    10    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  A  U N             T        Y              
RISBOTMH DS    XL8                                                              
RISBOTM  DS    CL26    24    2   26  A  P N             T        Y              
RISBOTNH DS    XL8                                                              
RISBOTN  DS    CL49    24   29   49  A  P N             T        Y              
RISLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
RISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2136 BYTES                            
