*          DATA SET RERISKTAB  AT LEVEL 007 AS OF 04/24/92                      
*                                                                               
**********************************************************************          
*                                                                    *          
*       RERISKTAB --- CREDIT RATING (RISK) DEFINITION TABLE          *          
*                                                                    *          
* ------------------------------------------------------------------ *          
* UPDATE HISTORY:                                                    *          
*                                                                    *          
* MAR17/92 (MRR) --- INITIAL TO-DO                                   *          
*                                                                    *          
* APR02/92 (BU ) --- CHANGE LITERALS FOR TYPE 1 AND 2                *          
*                                                                    *          
* APR24/92 (SKU) --- CHANGE LITERALS FOR TYPE 6                      *          
*                                                                    *          
**********************************************************************          
*                                                                               
RISKTAB  DS    0CL40                                                            
         DC    CL40'STANDARD CREDIT TERMS'                                      
         DC    CL40'INSUFFICIENT INFO FOR CREDIT ASSESSMENT'                    
         DC    CL40'NON-COMPLIANCE W/ STATION PAYMENT TERMS'                    
         DC    CL40'CASH IN ADVANCE'                                            
         DC    CL40'CANNOT PROVIDE ACCEPTABLE GUARANTEE LTR'                    
         DC    CL40'HOLD ORDER'                                                 
         DC    X'FF'                                                            
         DS    0H                                                               
