*          DATA SET RERMPC6D   AT LEVEL 016 AS OF 08/01/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810C6D      DATE 08/01/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL22     7    2   22  A  P N             T        Y              
MENNEF1H DS    CL8                                                              
MENNEF1  DS    CL8      7   28    8  A  P N             T        Y              
MENNIN1H DS    CL8                                                              
MENNIN1  DS    CL4      7   38    4  A  P N             T        Y              
MENNPG1H DS    CL8                                                              
MENNPG1  DS    CL27     7   44   27  A  P N             T        Y              
MENNEF2H DS    CL8                                                              
MENNEF2  DS    CL8      8   28    8  A  P N             T        Y              
MENNIN2H DS    CL8                                                              
MENNIN2  DS    CL4      8   38    4  A  P N             T        Y              
MENNPG2H DS    CL8                                                              
MENNPG2  DS    CL27     8   44   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21     9    2   21  A  P N             T        Y              
MENFRSTH DS    CL8                                                              
MENFRST  DS    CL1     11    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     11    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     12    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     12   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     12   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     12   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     13    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     13   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     13   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     13   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     14    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     14   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     14   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     14   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     15    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     15   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     15   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     15   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     16    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     16   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     16   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     16   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     17    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     17   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     17   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     17   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     18    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     18   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     18   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     18   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     19    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     19   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     19   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     19   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     20    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     20   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     20   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     20   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     21    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     21   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     21   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   56    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     21   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     22    5    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     22   23    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   38    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     22   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   56    1  A  U H             T        Y              
MENENDH  DS    CL8                                                              
MENEND   DS    CL6     22   59    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A  P N             T        Y              
MENLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MENWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
