*          DATA SET RERMPFBD   AT LEVEL 007 AS OF 06/27/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810FBD      DATE 06/27/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SETTYPEH DS    XL8                                                              
SETTYPE  DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10     5   20   10  A  P H             T        Y              
SETIDENH DS    XL8                                                              
SETIDEN  DS    CL4      5   32    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
SETDESCH DS    XL8                                                              
SETDESC  DS    CL60     6   15   60  A  U H             T        Y              
SETTTLH  DS    XL8                                                              
SETTTL   DS    CL20     7   30   20  A  P H             T        Y              
SETFRSTH DS    XL8                                                              
SETFRST  DS    CL8      8    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     8   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     8   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     8   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     9   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     9   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     9   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    10   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    10   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    10   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    11   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    11   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    11   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    12   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    12   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    12   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    13   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    13   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    13   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    14   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    14   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    14   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    15   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    15   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    15   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    16   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    16   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    16   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    17   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    17   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    17   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    18   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    18   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    18   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    19   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    19   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    19   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    20   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    20   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    20   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    21   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    21   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    21   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    22   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    22   36   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    22   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23    2    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    23   12   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   26    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    23   36   12  A  P N             T        Y              
SETENDH  DS    XL8                                                              
SETEND   DS    CL8     23   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    23   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  P N             T        Y              
SETLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SETWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1920 BYTES                            
