*          DATA SET RERMPF0D   AT LEVEL 001 AS OF 11/14/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810F0D      DATE 11/14/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  L  P N             T        Y              
FFXREPH  DS    CL8                                                              
FFXREP   DS    CL2      7   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   20    4  L  P N             T        Y              
FFXBOOKH DS    CL8                                                              
FFXBOOK  DS    CL5      7   28    5  A  U N             T        Y              
FFXLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
FFXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 160  BYTES                            
