*          DATA SET RERMPECD   AT LEVEL 005 AS OF 03/27/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810ECD      DATE 03/27/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TITSTAH  DS    CL8                                                              
TITSTA   DS    CL7      7   24    7  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
TITSDTH  DS    CL8                                                              
TITSDT   DS    CL8      8   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
TITEDTH  DS    CL8                                                              
TITEDT   DS    CL8      9   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    10    2   19  A  P N             T        Y              
TITCSTH  DS    CL8                                                              
TITCST   DS    CL1     10   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   13    1  A  U N             T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 256  BYTES                            
