*          DATA SET RERMPC5D   AT LEVEL 013 AS OF 06/27/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810C5D      DATE 06/27/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     6   34   12  A  P N             T        Y              
GLBENDH  DS    XL8                                                              
GLBEND   DS    CL17     6   50   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    6   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   27   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   48    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   60    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     8    6   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   27    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   48    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   60    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9    6   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28     9   19   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   47   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
GLBNEFFH DS    XL8                                                              
GLBNEFF  DS    CL11    10    6   11  A  U N             T        Y              
GLBNPROH DS    XL8                                                              
GLBNPRO  DS    CL27    10   19   27  A  U N             T        Y              
GLBNDAYH DS    XL8                                                              
GLBNDAY  DS    CL11    10   47   11  A  U N             T        Y              
GLBNTIMH DS    XL8                                                              
GLBNTIM  DS    CL11    10   59   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
GLBNEFAH DS    XL8                                                              
GLBNEFA  DS    CL11    11    6   11  A  U N             T        Y              
GLBNPRAH DS    XL8                                                              
GLBNPRA  DS    CL27    11   19   27  A  U N             T        Y              
GLBNINVH DS    XL8                                                              
GLBNINV  DS    CL11    11   47   11  A  U N             T        Y              
GLBNDYPH DS    XL8                                                              
GLBNDYP  DS    CL11    11   59   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P Z             T        Y              
GLBNEF2H DS    XL8                                                              
GLBNEF2  DS    CL11    12    6   11  A  P N             T        Y              
GLBNPR2H DS    XL8                                                              
GLBNPR2  DS    CL27    12   19   27  A  P N             T        Y              
GLBNDA2H DS    XL8                                                              
GLBNDA2  DS    CL11    12   47   11  A  P N             T        Y              
GLBNTI2H DS    XL8                                                              
GLBNTI2  DS    CL11    12   59   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P Z             T        Y              
GLBNEFBH DS    XL8                                                              
GLBNEFB  DS    CL11    13    6   11  A  P N             T        Y              
GLBNPRBH DS    XL8                                                              
GLBNPRB  DS    CL27    13   19   27  A  P N             T        Y              
GLBNINBH DS    XL8                                                              
GLBNINB  DS    CL11    13   47   11  A  P N             T        Y              
GLBNDYBH DS    XL8                                                              
GLBNDYB  DS    CL11    13   59   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   38    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   22   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   38    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     15   50    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    16    2   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   21   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   38    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL27    16   50   27  A  P N             T        Y              
GLBBOK1H DS    XL8                                                              
GLBBOK1  DS    CL17    17    2   17  A  U N             T        Y              
GLBSRC1H DS    XL8                                                              
GLBSRC1  DS    CL15    17   21   15  A  U N             T        Y              
GLBCD1AH DS    XL8                                                              
GLBCD1A  DS    CL4     17   38    4  A  U N             T        Y              
GLBCD2AH DS    XL8                                                              
GLBCD2A  DS    CL4     17   44    4  A  P Z             T        Y              
GLBOPT1H DS    XL8                                                              
GLBOPT1  DS    CL27    17   50   27  A  U N             T        Y              
GLBBOK2H DS    XL8                                                              
GLBBOK2  DS    CL17    18    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   21   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL27    18   50   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   21   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL27    19   50   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   21   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL27    20   50   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    21   21   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL27    21   50   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22   21   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL27    22   50   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    23   21   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   44    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL27    23   50   27  A  U N             T        Y              
GLBLSTH  DS    XL8                                                              
GLBLST   DS    CL1     23   79    1  A  U N             T        Y              
GLBLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
GLBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1688 BYTES                            
