*          DATA SET RERMPCFD   AT LEVEL 017 AS OF 02/03/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810CFD      DATE 02/03/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      9    4    7  L  P H             T        Y              
ISCFSTAH DS    CL8                                                              
ISCFSTA  DS    CL8      9   12    8  A  U H             T        Y   10         
ISCFSTAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   21    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   24    7  L  P N             T        Y              
ISCFINVH DS    CL8                                                              
ISCFINV  DS    CL17     9   32   17  A  U N             T        Y   20         
ISCFINVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9   51   11  L  P N             T        Y              
ISCFEFDH DS    CL8                                                              
ISCFEFD  DS    CL17     9   63   17  A  U N             T        Y   30         
ISCFEFDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    10    4   12  L  P N             T        Y              
ISCFBKTH DS    CL8                                                              
ISCFBKT  DS    CL11    10   17   11  A  U N             T        Y   42         
ISCFBKTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10   33   13  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    11    4   25  L  P N             T        Y              
ISCFTRKH DS    CL8                                                              
ISCFTRK  DS    CL1     11   30    1  A  U N             T        Y   44         
ISCFTRKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11   33   11  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    12    4   25  L  P N             T        Y              
ISCFTXTH DS    CL8                                                              
ISCFTXT  DS    CL1     12   30    1  A  U N             T        Y   46         
ISCFTXTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    12   33   11  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL31    13    4   31  L  P N             T        Y              
ISCFMSTH DS    CL8                                                              
ISCFMST  DS    CL1     13   36    1  A  U N             T        Y   46         
ISCFMSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13   42   11  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    17    2   10  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     18    4    7  L  P H             T        Y              
ISCTSTAH DS    CL8                                                              
ISCTSTA  DS    CL8     18   12    8  A  U H             T        Y   50         
ISCTSTAX DS    CL8                                                              
ISCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ISCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 656  BYTES                            
