*          DATA SET RERMPE2D   AT LEVEL 001 AS OF 05/05/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810E2D      DATE 05/05/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TITSRCEH DS    XL8                                                              
TITSRCE  DS    CL3      7   13    3  A  U N             T    I   Y   10         
TITSRCEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
TITBOOKH DS    XL8                                                              
TITBOOK  DS    CL15     8   13   15  A  U N             T        Y   20         
TITBOOKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
TITTOH   DS    XL8                                                              
TITTO    DS    CL15     9   13   15  A  U N             T        Y   30         
TITTOX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
TITUPH   DS    XL8                                                              
TITUP    DS    CL25    10   13   25  A  U N             T        Y   40         
TITUPX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
TITSTATH DS    XL8                                                              
TITSTAT  DS    CL65    11   13   65  A  U N             T        Y   50         
TITSTATX DS    XL8                                                              
TITMKTH  DS    XL8                                                              
TITMKT   DS    CL24    12   13   24  A  P N             T        Y   60         
TITMKTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
TITDPTH  DS    XL8                                                              
TITDPT   DS    CL19    13   13   19  A  U N             T        Y   70         
TITDPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
TITINVRH DS    XL8                                                              
TITINVR  DS    CL65    14   13   65  A  U N             T        Y   45         
TITINVRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
TITOPTH  DS    XL8                                                              
TITOPT   DS    CL2     16   13    2  A  U N             T        Y   80         
TITOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL26    16   22   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17    2   10  A  P N             T        Y              
TITSTRTH DS    XL8                                                              
TITSTRT  DS    CL9     17   13    9  A  U N             T        Y   90         
TITSTRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
TITENDH  DS    XL8                                                              
TITEND   DS    CL9     18   13    9  A  U N             T        Y  100         
TITENDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
TITFILTH DS    XL8                                                              
TITFILT  DS    CL6     19   13    6  A  U N             T        Y  110         
TITFILTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
TITDETH  DS    XL8                                                              
TITDET   DS    CL1     20   13    1  A  U N             T        Y  120         
TITDETX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL29    20   22   29  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21    2   10  A  P N             T        Y              
TITACTH  DS    XL8                                                              
TITACT   DS    CL1     21   13    1  A  U N             T        Y  130         
TITACTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL39    21   22   39  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    2   10  A  P N             T        Y              
TITADEMH DS    XL8                                                              
TITADEM  DS    CL8     22   13    8  A  U N             T        Y  135         
TITADEMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   40    4  A  P N             T        Y              
TITABKH  DS    XL8                                                              
TITABK   DS    CL10    22   46   10  A  U N             T        Y  140         
TITABKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   79    1  A  U N             T        Y              
TITLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1008 BYTES                            
