*          DATA SET RERMPD6D   AT LEVEL 007 AS OF 04/23/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810D6D      DATE 04/23/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TITSTATH DS    CL8                                                              
TITSTAT  DS    CL60     7   18   60  A  U N             T    I   Y   10         
TITSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
TITSVCH  DS    CL8                                                              
TITSVC   DS    CL1      8   18    1  A  U N             T        Y   20         
TITSVCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL39     8   40   39  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
TITDPTH  DS    CL8                                                              
TITDPT   DS    CL19     9   18   19  A  U N             T        Y   30         
TITDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
TITFILTH DS    CL8                                                              
TITFILT  DS    CL6     10   18    6  A  U N             T        Y   40         
TITFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
TITDETH  DS    CL8                                                              
TITDET   DS    CL1     11   18    1  A  U N             T        Y   50         
TITDETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    11   40   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
TITDELH  DS    CL8                                                              
TITDEL   DS    CL2     13   18    2  A  U N             T        Y   60         
TITDELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    13   40   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A  P N             T        Y              
TITTYPH  DS    CL8                                                              
TITTYP   DS    CL1     15   18    1  A  U N             T        Y   70         
TITTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL37    15   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17    2   11  A  P N             T        Y              
TITBKRGH DS    CL8                                                              
TITBKRG  DS    CL20    17   18   20  A  U N             T        Y   80         
TITBKRGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    17   40   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    19    2   14  A  P N             T        Y              
TITSTRTH DS    CL8                                                              
TITSTRT  DS    CL8     19   18    8  A  U N             T        Y   90         
TITSTRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
TITENDH  DS    CL8                                                              
TITEND   DS    CL8     20   18    8  A  U N             T        Y  100         
TITENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
TITREVH  DS    CL8                                                              
TITREV   DS    CL1     22   18    1  A  U N             T        Y  110         
TITREVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL31    22   40   31  A  P N             T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 840  BYTES                            
