*          DATA SET RERMPD2D   AT LEVEL 001 AS OF 06/18/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810D2D      DATE 06/18/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
LTXSTAH  DS    XL8                                                              
LTXSTA   DS    CL8      5   10    8  A  U N             T        Y   10         
LTXSTAX  DS    XL8                                                              
LTXMRKTH DS    XL8                                                              
LTXMRKT  DS    CL20     5   28   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
LTXTYPH  DS    XL8                                                              
LTXTYP   DS    CL15     6   10   15  A  U N             T        Y   40         
LTXTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   28    6  A  P N             T        Y              
LTXKSRCH DS    XL8                                                              
LTXKSRC  DS    CL4      6   35    4  A  U N             T        Y   50         
LTXKSRCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   40    4  A  P N             T        Y              
LTXKBKH  DS    XL8                                                              
LTXKBK   DS    CL10     6   45   10  A  U N             T        Y   60         
LTXKBKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   56    5  A  P N             T        Y              
LTXKLOCH DS    XL8                                                              
LTXKLOC  DS    CL2      6   62    2  A  U N             T        Y   70         
LTXKLOCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   65    8  A  P N             T        Y              
LTXKINTH DS    XL8                                                              
LTXKINT  DS    CL2      6   74    2  A  U N             T        Y   75         
LTXKINTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
LTXHDSH  DS    XL8                                                              
LTXHDS   DS    CL43     8    7   43  A  P H             T        Y              
LTXSELH  DS    XL8                                                              
LTXSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
LTXTAGH  DS    XL8                                                              
LTXTAG   DS    CL1     24    2    1  A  P N             T        Y              
LTXLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LTXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1728 BYTES                            
