*          DATA SET RERMPC7D   AT LEVEL 002 AS OF 11/02/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810C7D      DATE 11/02/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
IR2XPDMH DS    CL8                                                              
IR2XPDM  DS    CL4     20    2    4  L  P N             T        Y              
IR2XFLGH DS    CL8                                                              
IR2XFLG  DS    CL3     20    8    3  L  P N             T        Y              
IR2XDC1H DS    CL8                                                              
IR2XDC1  DS    CL7     20   12    7  A  U N             T        Y   60         
IR2XDC1X DS    CL8                                                              
IR2XDC2H DS    CL8                                                              
IR2XDC2  DS    CL7     20   23    7  A  U N             T        Y   60         
IR2XDC2X DS    CL8                                                              
IR2XDC3H DS    CL8                                                              
IR2XDC3  DS    CL7     20   34    7  A  U N             T        Y   60         
IR2XDC3X DS    CL8                                                              
IR2XDC4H DS    CL8                                                              
IR2XDC4  DS    CL7     20   45    7  A  U N             T        Y   60         
IR2XDC4X DS    CL8                                                              
IR2XDC5H DS    CL8                                                              
IR2XDC5  DS    CL7     20   56    7  A  U N             T        Y   60         
IR2XDC5X DS    CL8                                                              
IR2XDC6H DS    CL8                                                              
IR2XDC6  DS    CL7     20   67    7  A  U N             T        Y   60         
IR2XDC6X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  L  P N             T        Y              
IR2XDRIH DS    CL8                                                              
IR2XDRI  DS    CL7     21   11    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   22    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   33    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   44    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   55    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   63    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   66    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   74    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    2    5  L  P N             T        Y              
IR2XDSHH DS    CL8                                                              
IR2XDSH  DS    CL7     22   11    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   22    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   33    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   44    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   55    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   63    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   66    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   74    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  L  P N             T        Y              
IR2XDPTH DS    CL8                                                              
IR2XDPT  DS    CL7     23   11    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   22    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   33    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   44    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   55    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   63    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   66    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   74    1  A  P N             T        Y              
IR2PFLNH DS    CL8                                                              
IR2PFLN  DS    CL60    24   20   60  L  P H             T        Y              
IR2LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
IR2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 712  BYTES                            
