*          DATA SET RERMMPE6D  AT LEVEL 005 AS OF 11/26/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810E6D      DATE 11/26/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L  P H             T        Y              
DOVSTTNH DS    CL8                                                              
DOVSTTN  DS    CL8      5   10    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  L  P H             T        Y              
DOVINVH  DS    CL8                                                              
DOVINV   DS    CL4      5   28    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  L  P H             T        Y              
DOVEFFDH DS    CL8                                                              
DOVEFFD  DS    CL17     5   50   17  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   69    6  L  P H             T        Y              
DOVSRCH  DS    CL8                                                              
DOVSRC   DS    CL3      5   77    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  L  P H             T        Y              
DOVBOOKH DS    CL8                                                              
DOVBOOK  DS    CL10     6   10   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   24    4  A  P N             T        Y              
DOVCODEH DS    CL8                                                              
DOVCODE  DS    CL2      6   29    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  L  P N             T        Y              
DOVOPT1H DS    CL8                                                              
DOVOPT1  DS    CL33     6   47   33  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  L  P N             T        Y              
DOVIHDTH DS    CL8                                                              
DOVIHDT  DS    CL19     7   10   19  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7   38    7  L  P N             T        Y              
DOVOPT2H DS    CL8                                                              
DOVOPT2  DS    CL33     7   47   33  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  L  P N             T        Y              
DOVIHPGH DS    CL8                                                              
DOVIHPG  DS    CL27     8   10   27  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   38    8  L  P N             T        Y              
DOVIFTH  DS    CL8                                                              
DOVIFT   DS    CL27     8   47   27  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    10   10   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    10   33   20  A  P H             T        Y              
DOVDHOMH DS    CL8                                                              
DOVDHOM  DS    CL6     11    2    6  A  P H             T        Y              
DOVHRTGH DS    CL8                                                              
DOVHRTG  DS    CL7     11   10    7  A  U N             T        Y              
DOVHRPH  DS    CL8                                                              
DOVHRP   DS    CL1     11   18    1  A  P N             T        Y              
DOVHIMPH DS    CL8                                                              
DOVHIMP  DS    CL7     11   21    7  A  U N             T        Y              
DOVHIPH  DS    CL8                                                              
DOVHIP   DS    CL1     11   29    1  A  P N             T        Y              
DOVHSHRH DS    CL8                                                              
DOVHSHR  DS    CL7     11   33    7  A  U N             T        Y              
DOVHSPH  DS    CL8                                                              
DOVHSP   DS    CL1     11   41    1  A  P N             T        Y              
DOVHPUTH DS    CL8                                                              
DOVHPUT  DS    CL7     11   44    7  A  U N             T        Y              
DOVHPPH  DS    CL8                                                              
DOVHPP   DS    CL1     11   52    1  A  P N             T        Y              
DOVMINH  DS    CL8                                                              
DOVMIN   DS    CL7     12    2    7  A  P N             T        Y              
DOVCAT1H DS    CL8                                                              
DOVCAT1  DS    CL20    12   10   20  A  P H             T        Y              
DOVCAT2H DS    CL8                                                              
DOVCAT2  DS    CL20    12   33   20  A  P H             T        Y              
DOVCAT3H DS    CL8                                                              
DOVCAT3  DS    CL20    12   56   20  A  P H             T        Y              
DOVTYPEH DS    CL8                                                              
DOVTYPE  DS    CL6     13    2    6  A  P H             T        Y              
DOVLBL1H DS    CL8                                                              
DOVLBL1  DS    CL20    13   10   20  A  P H             T        Y              
DOVLBL2H DS    CL8                                                              
DOVLBL2  DS    CL20    13   33   20  A  P H             T        Y              
DOVLBL3H DS    CL8                                                              
DOVLBL3  DS    CL20    13   56   20  A  P H             T        Y              
DOVDEMOH DS    CL8                                                              
DOVDEMO  DS    CL6     14    2    6  A  P H             T        Y              
DOVRTG1H DS    CL8                                                              
DOVRTG1  DS    CL7     14   10    7  A  U N             T        Y              
DOVOVR1H DS    CL8                                                              
DOVOVR1  DS    CL1     14   18    1  A  P N             T        Y              
DOVIMP1H DS    CL8                                                              
DOVIMP1  DS    CL7     14   21    7  A  U N             T        Y              
DOVOVI1H DS    CL8                                                              
DOVOVI1  DS    CL1     14   29    1  A  P N             T        Y              
DOVRTG2H DS    CL8                                                              
DOVRTG2  DS    CL7     14   33    7  A  U N             T        Y              
DOVOVR2H DS    CL8                                                              
DOVOVR2  DS    CL1     14   41    1  A  P N             T        Y              
DOVIMP2H DS    CL8                                                              
DOVIMP2  DS    CL7     14   44    7  A  U N             T        Y              
DOVOVI2H DS    CL8                                                              
DOVOVI2  DS    CL1     14   52    1  A  P N             T        Y              
DOVRTG3H DS    CL8                                                              
DOVRTG3  DS    CL7     14   56    7  A  U N             T        Y              
DOVOVR3H DS    CL8                                                              
DOVOVR3  DS    CL1     14   64    1  A  P N             T        Y              
DOVIMP3H DS    CL8                                                              
DOVIMP3  DS    CL7     14   67    7  A  U N             T        Y              
DOVOVI3H DS    CL8                                                              
DOVOVI3  DS    CL1     14   75    1  A  P N             T        Y              
DOVDEM2H DS    CL8                                                              
DOVDEM2  DS    CL6     15    2    6  A  P H             T        Y              
DOVRTG4H DS    CL8                                                              
DOVRTG4  DS    CL7     15   10    7  A  U N             T        Y              
DOVOVR4H DS    CL8                                                              
DOVOVR4  DS    CL1     15   18    1  A  P N             T        Y              
DOVIMP4H DS    CL8                                                              
DOVIMP4  DS    CL7     15   21    7  A  U N             T        Y              
DOVOVI4H DS    CL8                                                              
DOVOVI4  DS    CL1     15   29    1  A  P N             T        Y              
DOVRTG5H DS    CL8                                                              
DOVRTG5  DS    CL7     15   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   52    1  A  P N             T        Y              
DOVRTG6H DS    CL8                                                              
DOVRTG6  DS    CL7     15   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     16   10    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   21    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     17   10    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   21    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     18   10    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   21    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     19   10    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   21    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     20   10    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   21    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     21   10    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   21    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     22   10    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   21    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   75    1  A  P N             T        Y              
DOVDEMXH DS    CL8                                                              
DOVDEMX  DS    CL6     23    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     23   10    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   21    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   29    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   41    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   44    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   56    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   67    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   75    1  A  P N             T        Y              
DOVPFLNH DS    CL8                                                              
DOVPFLN  DS    CL60    24   20   60  L  P H             T        Y              
DOVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DOVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2456 BYTES                            
