*          DATA SET RERMPEDD   AT LEVEL 005 AS OF 07/13/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810EDD      DATE 07/13/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TITSTAH  DS    CL8                                                              
TITSTA   DS    CL7      7   24    7  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
TITSDTH  DS    CL8                                                              
TITSDT   DS    CL8      8   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
TITEDTH  DS    CL8                                                              
TITEDT   DS    CL8      9   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    10    2   19  A  P N             T        Y              
TITCSTH  DS    CL8                                                              
TITCST   DS    CL1     10   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    11    2   19  A  P N             T        Y              
TITINV1H DS    CL8                                                              
TITINV1  DS    CL55    11   24   55  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    12    2   19  A  P N             T        Y              
TITINV2H DS    CL8                                                              
TITINV2  DS    CL55    12   24   55  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    13    2   19  A  P N             T        Y              
TITINV3H DS    CL8                                                              
TITINV3  DS    CL55    13   24   55  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   13    1  A  U N             T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 520  BYTES                            
