*          DATA SET RERMPBED   AT LEVEL 001 AS OF 04/14/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810BED      DATE 04/14/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L  P H             T        Y              
IDMSTTNH DS    CL8                                                              
IDMSTTN  DS    CL8      5   10    8  A  U H             T        Y   10         
IDMSTTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  L  P H             T        Y              
IDMINVH  DS    CL8                                                              
IDMINV   DS    CL4      5   28    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  L  P H             T        Y              
IDMEFFDH DS    CL8                                                              
IDMEFFD  DS    CL17     5   50   17  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P N             T        Y              
IDMIHDTH DS    CL8                                                              
IDMIHDT  DS    CL19     6   10   19  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  L  P N             T        Y              
IDMIHPGH DS    CL8                                                              
IDMIHPG  DS    CL27     6   50   27  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      7    2    5  L  P N             T        Y              
IDMBKSH  DS    CL8                                                              
IDMBKS   DS    CL70     7   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  L  P N             T        Y              
IDMDEMOH DS    CL8                                                              
IDMDEMO  DS    CL70     8   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  L  P N             T        Y              
IDMOPTNH DS    CL8                                                              
IDMOPTN  DS    CL70     9   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  L  P N             T        Y              
IDMCOLHH DS    CL8                                                              
IDMCOLH  DS    CL13    11   11   13  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL13    11   25   13  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL13    11   39   13  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL13    11   53   13  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL13    11   67   13  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  L  P N             T        Y              
IDMFTNTH DS    CL8                                                              
IDMFTNT  DS    CL13    12   11   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   25   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   39   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   53   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   67   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    2    6  L  P N             T        Y              
IDMRCODH DS    CL8                                                              
IDMRCOD  DS    CL2     13   13    2  A  U N             T        Y              
IDMRTXTH DS    CL8                                                              
IDMRTXT  DS    CL4     13   17    4  A  U N             T        Y              
IDMRCT2H DS    CL8                                                              
IDMRCT2  DS    CL2     13   27    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   41    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   55    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   69    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   73    4  A  U N             T        Y              
IDMROWHH DS    CL8                                                              
IDMROWH  DS    CL6     14    2    6  A  P H             T        Y              
IDMROWCH DS    CL8                                                              
IDMROWC  DS    CL1     14    9    1  L  P N             T        Y              
IDMROWDH DS    CL8                                                              
IDMROWD  DS    CL6     14   11    6  A  P N             T        Y              
IDMROWOH DS    CL8                                                              
IDMROWO  DS    CL6     14   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   74    6  A  U N             T        Y              
IDMRW2HH DS    CL8                                                              
IDMRW2H  DS    CL6     15    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     22    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   74    6  A  U N             T        Y              
IDMROWXH DS    CL8                                                              
IDMROWX  DS    CL6     23    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     23    9    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   11    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   39    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   60    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   74    6  A  U N             T        Y              
IDMPFLNH DS    CL8                                                              
IDMPFLN  DS    CL73    24    7   73  L  P N             T        Y              
IDMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
IDMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2560 BYTES                            
