*          DATA SET RERMPE7D   AT LEVEL 002 AS OF 05/08/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810E7D      DATE 05/08/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  L  P H             T        Y              
IROSTTNH DS    XL8                                                              
IROSTTN  DS    CL8      5   10    8  A  U H             T        Y    1         
IROSTTNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   20    5  L  P H             T        Y              
IROINVH  DS    XL8                                                              
IROINV   DS    CL4      5   28    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      5   38    8  L  P H             T        Y              
IROEFFDH DS    XL8                                                              
IROEFFD  DS    CL17     5   50   17  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   69    6  L  P H             T        Y              
IROSRCH  DS    XL8                                                              
IROSRC   DS    CL3      5   77    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  L  P H             T        Y              
IROBOOKH DS    XL8                                                              
IROBOOK  DS    CL11     6   10   11  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   23    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   28    4  A  P N             T        Y              
IROCODEH DS    XL8                                                              
IROCODE  DS    CL2      6   33    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  L  P N             T        Y              
IROOPT1H DS    XL8                                                              
IROOPT1  DS    CL34     6   46   34  A  U N             T        Y   10         
IROOPT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      7    2    2  L  P N             T        Y              
IROMHUTH DS    XL8                                                              
IROMHUT  DS    CL70     7    5   70  A  U N             T        Y   10         
IROMHUTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  L  P N             T        Y              
IROIHDTH DS    XL8                                                              
IROIHDT  DS    CL19     8   10   19  A  P H             T        Y              
IROFNLBH DS    XL8                                                              
IROFNLB  DS    CL7      8   38    7  L  P N             T        Y              
IROFTNTH DS    XL8                                                              
IROFTNT  DS    CL16     8   46   16  A  U H             T        Y   14         
IROFTNTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     8   64   14  L  P N             T        Y              
IROUPFNH DS    XL8                                                              
IROUPFN  DS    CL1      8   79    1  A  U N             T        Y   16         
IROUPFNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  L  P N             T        Y              
IROIHPGH DS    XL8                                                              
IROIHPG  DS    CL27     9   10   27  A  P H             T        Y              
IRO1TIMH DS    XL8                                                              
IRO1TIM  DS    CL2      9   38    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL15     9   65   15  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     10    6    3  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     10   10    4  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   22    7  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     10   30    4  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   35    3  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    10   43   11  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   55    7  L  P H             T        Y              
IROAVD1H DS    XL8                                                              
IROAVD1  DS    CL4     10   66    4  L  P H             T        Y              
IROAVD2H DS    XL8                                                              
IROAVD2  DS    CL4     10   71    4  L  P H             T        Y              
IROAVD3H DS    XL8                                                              
IROAVD3  DS    CL4     10   76    4  L  P H             T        Y              
IROIPSCH DS    XL8                                                              
IROIPSC  DS    CL3     11    2    3  A  U N             T        Y   20         
IROIPSCX DS    XL8                                                              
IROIPFLH DS    XL8                                                              
IROIPFL  DS    CL3     11    6    3  A  U N             T        Y   22         
IROIPFLX DS    XL8                                                              
IROIPBKH DS    XL8                                                              
IROIPBK  DS    CL11    11   10   11  A  U N             T        Y   24         
IROIPBKX DS    XL8                                                              
IROIPSTH DS    XL8                                                              
IROIPST  DS    CL7     11   22    7  A  U N             T        Y   26         
IROIPSTX DS    XL8                                                              
IROIPPIH DS    XL8                                                              
IROIPPI  DS    CL4     11   30    4  A  U N             T        Y   28         
IROIPPIX DS    XL8                                                              
IROIPDYH DS    XL8                                                              
IROIPDY  DS    CL7     11   35    7  A  U N             T        Y   30         
IROIPDYX DS    XL8                                                              
IROIPTEH DS    XL8                                                              
IROIPTE  DS    CL11    11   43   11  A  U N             T        Y   32         
IROIPTEX DS    XL8                                                              
IROIPDCH DS    XL8                                                              
IROIPDC  DS    CL7     11   55    7  A  U N             T        Y   34         
IROIPDCX DS    XL8                                                              
IROFLGH  DS    XL8                                                              
IROFLG   DS    CL1     11   64    1  A  P H             T        Y              
IRORDEMH DS    XL8                                                              
IRORDEM  DS    CL4     11   66    4  A  P H             T        Y              
IROSDEMH DS    XL8                                                              
IROSDEM  DS    CL4     11   71    4  A  P H             T        Y              
IROPDEMH DS    XL8                                                              
IROPDEM  DS    CL4     11   76    4  A  P H             T        Y              
IROMPNIH DS    XL8                                                              
IROMPNI  DS    CL5     13    2    5  L  P H             T        Y              
IROLHEDH DS    XL8                                                              
IROLHED  DS    CL4     14    2    4  L  P N             T        Y  255         
IROLHEDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    14    7   73  L  P H             T        Y              
IROLDTAH DS    XL8                                                              
IROLDTA  DS    CL4     15    2    4  A  U N             T        Y   50         
IROLDTAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    15    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16    2    4  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    16    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17    2    4  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    17    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    2    4  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    18    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19    2    4  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    19    7   73  A  P N             T        Y              
IROXPDMH DS    XL8                                                              
IROXPDM  DS    CL4     20    2    4  A  U N             T        Y   50         
IROXPDMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    20    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21    2    4  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    21    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     22    2    4  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    22    7   73  A  P N             T        Y              
IROLDTZH DS    XL8                                                              
IROLDTZ  DS    CL4     23    2    4  A  U N             T        Y   50         
IROLDTZX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL73    23    7   73  A  P N             T        Y              
IROPFLNH DS    XL8                                                              
IROPFLN  DS    CL60    24   20   60  L  P H             T        Y              
IROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
IROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
