*          DATA SET RERMPCED   AT LEVEL 002 AS OF 02/13/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810CED      DATE 02/13/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      9    4    7  L  P H             T        Y              
ITCFSTAH DS    CL8                                                              
ITCFSTA  DS    CL6      9   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   24    5  L  P H             T        Y              
ITCFINVH DS    CL8                                                              
ITCFINV  DS    CL4      9   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   44    8  L  P H             T        Y              
ITCFEFDH DS    CL8                                                              
ITCFEFD  DS    CL17     9   53   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    4    6  A  P N             T        Y              
ITCSRCEH DS    CL8                                                              
ITCSRCE  DS    CL1     10   12    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    4    5  A  P N             T        Y              
ITCTRKSH DS    CL8                                                              
ITCTRKS  DS    CL60    11   12   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   12   13  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    13    4   25  L  P N             T        Y              
ITCFTXTH DS    CL8                                                              
ITCFTXT  DS    CL1     13   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   33   11  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    17    2   10  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     18    4    7  L  P H             T        Y              
ITC1STAH DS    CL8                                                              
ITC1STA  DS    CL6     18   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   24    5  L  P N             T        Y              
ITC1INVH DS    CL8                                                              
ITC1INV  DS    CL4     18   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   44    8  L  P N             T        Y              
ITC1EFDH DS    CL8                                                              
ITC1EFD  DS    CL17    18   53   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    4    7  L  P N             T        Y              
ITC2STAH DS    CL8                                                              
ITC2STA  DS    CL6     19   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   24    5  L  P N             T        Y              
ITC2INVH DS    CL8                                                              
ITC2INV  DS    CL4     19   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   44    8  L  P N             T        Y              
ITC2EFDH DS    CL8                                                              
ITC2EFD  DS    CL17    19   53   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    4    7  L  P N             T        Y              
ITC3STAH DS    CL8                                                              
ITC3STA  DS    CL6     20   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   24    5  L  P N             T        Y              
ITC3INVH DS    CL8                                                              
ITC3INV  DS    CL4     20   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   44    8  L  P N             T        Y              
ITC3EFDH DS    CL8                                                              
ITC3EFD  DS    CL17    20   53   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    4    7  L  P N             T        Y              
ITC4STAH DS    CL8                                                              
ITC4STA  DS    CL6     21   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   24    5  L  P N             T        Y              
ITC4INVH DS    CL8                                                              
ITC4INV  DS    CL4     21   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   44    8  L  P N             T        Y              
ITC4EFDH DS    CL8                                                              
ITC4EFD  DS    CL17    21   53   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    4    7  L  P N             T        Y              
ITC5STAH DS    CL8                                                              
ITC5STA  DS    CL6     22   12    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   24    5  L  P N             T        Y              
ITC5INVH DS    CL8                                                              
ITC5INV  DS    CL4     22   30    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   44    8  L  P N             T        Y              
ITC5EFDH DS    CL8                                                              
ITC5EFD  DS    CL17    22   53   17  A  U N             T        Y              
ITCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ITCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 944  BYTES                            
