*          DATA SET RERMPE5D   AT LEVEL 001 AS OF 12/21/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810E5D      DATE 12/21/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 8    BYTES                            
