*          DATA SET RERMPE3D   AT LEVEL 019 AS OF 12/29/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810E3D      DATE 12/29/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
INVSSTAH DS    CL8                                                              
INVSSTA  DS    CL8      5   10    8  A  U N             T    I   Y   10         
INVSSTAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
INVINVH  DS    CL8                                                              
INVINV   DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  A  P H             T        Y              
INVEFFH  DS    CL8                                                              
INVEFF   DS    CL17     5   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
INVCODEH DS    CL8                                                              
INVCODE  DS    CL4      7   14    4  A  U N             T        Y              
INVLSTH  DS    CL8                                                              
INVLST   DS    CL1      7   78    1  A  U N             T        Y              
INVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
INVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 160  BYTES                            
