*          DATA SET RERMPDCD   AT LEVEL 013 AS OF 03/05/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810DCD      DATE 03/05/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
MINSSTAH DS    CL8                                                              
MINSSTA  DS    CL8      5   10    8  A  U N             T    I   Y   10         
MINSSTAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    9   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7   30    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   41    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   55   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   74    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     8    8   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   26   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   38   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22     8   50   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   73    6  A  P N             T        Y              
MININV1H DS    CL8                                                              
MININV1  DS    CL5      9    2    5  A  U N             T        Y              
MINEFF1H DS    CL8                                                              
MINEFF1  DS    CL17     9    8   17  A  U N             T        Y              
MINDAY1H DS    CL8                                                              
MINDAY1  DS    CL11     9   26   11  A  U N             T        Y              
MINTIM1H DS    CL8                                                              
MINTIM1  DS    CL11     9   38   11  A  U N             T        Y              
MINPRG1H DS    CL8                                                              
MINPRG1  DS    CL22     9   50   22  A  U N             T        Y              
MINDPT1H DS    CL8                                                              
MINDPT1  DS    CL6      9   73    6  A  U N             T        Y              
MININV2H DS    CL8                                                              
MININV2  DS    CL5     10    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    10    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    10   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    11    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    11   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    12    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    12   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    13    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    13   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    14   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    15    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    15   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    16   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    17    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    17   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    18   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    19    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    19   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    20    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    20   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    21    8   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   26   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   38   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    21   50   22  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   73    6  A  U N             T        Y              
MINTAGH  DS    CL8                                                              
MINTAG   DS    CL1     24    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    24    4   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    24   28   24  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
