*          DATA SET RERMPWTWA  AT LEVEL 004 AS OF 09/15/95                      
*                                                                               
*        TWA STORED DATA                                                        
*                                                                               
         ORG   CONHEADH+3508       USE THE LAST 12 BYTES OF SCREEN AREA         
SFMPROFS DS    CL12                                                             
*                                                                               
*                                                                               
*        DSECT TO COVER THE PROFILE ENTRY                                       
*                                                                               
SVDSECT  DSECT                                                                  
*                                                                               
SVPGENTY DS    0CL12                                                            
SVPGREP  DS    CL2                 REP/AGENCY/USER POWER CODE                   
SVPGP#   DS    CL1                 SFM PROGRAM NUMBER (18)                      
         DS    CL1                                                              
SVPGPBIT DS    CL8                 64 PROFILES                                  
*                                                                               
*  INV:  BIT 0    =    IF ON FORCE USERS TO DEFINE INVOICE NUMBER               
*                                                                               
