*          DATA SET RERMPC8D   AT LEVEL 001 AS OF 11/25/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810C8D      DATE 11/25/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TITREPH  DS    CL8                                                              
TITREP   DS    CL2      7   15    2  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
TITSTAH  DS    CL8                                                              
TITSTA   DS    CL7      8   15    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   61    1  A  U N             T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 176  BYTES                            
