*          DATA SET RERMPE1D   AT LEVEL 005 AS OF 04/03/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810E1D      DATE 04/03/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
TITSRCEH DS    CL8                                                              
TITSRCE  DS    CL3      7   13    3  A  U N             T    I   Y   10         
TITSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
TITBOOKH DS    CL8                                                              
TITBOOK  DS    CL15     8   13   15  A  U N             T        Y   20         
TITBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
TITSTATH DS    CL8                                                              
TITSTAT  DS    CL65     9   13   65  A  U N             T        Y   30         
TITSTATX DS    CL8                                                              
TITMKTH  DS    CL8                                                              
TITMKT   DS    CL24    10   13   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
TITDPTH  DS    CL8                                                              
TITDPT   DS    CL19    11   13   19  A  U N             T        Y   40         
TITDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
TITINVRH DS    CL8                                                              
TITINVR  DS    CL65    12   13   65  A  U N             T        Y   45         
TITINVRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
TITOPTH  DS    CL8                                                              
TITOPT   DS    CL2     14   13    2  A  U N             T        Y   50         
TITOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL26    14   22   26  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
TITSTRTH DS    CL8                                                              
TITSTRT  DS    CL9     15   13    9  A  U N             T        Y   60         
TITSTRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
TITENDH  DS    CL8                                                              
TITEND   DS    CL9     16   13    9  A  U N             T        Y   70         
TITENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
TITFILTH DS    CL8                                                              
TITFILT  DS    CL6     17   13    6  A  U N             T        Y   80         
TITFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   13    1  A  U N             T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 664  BYTES                            
