*          DATA SET RERMPD7D   AT LEVEL 006 AS OF 08/06/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810D7D      DATE 08/06/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
INVSSTAH DS    XL8                                                              
INVSSTA  DS    CL8      5   10    8  A  U N             T    I   Y   10         
INVSSTAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
INVINVH  DS    XL8                                                              
INVINV   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P H             T        Y              
INVEFFH  DS    XL8                                                              
INVEFF   DS    CL17     5   50   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
INVSDPTH DS    XL8                                                              
INVSDPT  DS    CL6      7   23    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
INVSFLTH DS    XL8                                                              
INVSFLT  DS    CL6      7   58    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
INVICODH DS    XL8                                                              
INVICOD  DS    CL1      8   23    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL35     8   38   35  A  P N             T        Y              
INVCDYH  DS    XL8                                                              
INVCDY   DS    CL1      8   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
INVTDEFH DS    XL8                                                              
INVTDEF  DS    CL3      9   23    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19     9   38   19  A  P N             T        Y              
INVTRANH DS    XL8                                                              
INVTRAN  DS    CL4      9   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    10    2   19  A  P N             T        Y              
INVLCLH  DS    XL8                                                              
INVLCL   DS    CL1     10   23    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   38   11  A  P N             T        Y              
INVTCHAH DS    XL8                                                              
INVTCHA  DS    CL3     10   58    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL35    11    2   35  A  P N             T        Y              
INVEFFDH DS    XL8                                                              
INVEFFD  DS    CL17    11   38   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    5    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   17    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   36    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   55    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   67   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   14   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL27    14   26   27  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   54   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   66   11  A  P N             T        Y              
INVSDAYH DS    XL8                                                              
INVSDAY  DS    CL11    15    2   11  A  U N             T        Y              
INVSTMEH DS    XL8                                                              
INVSTME  DS    CL11    15   14   11  A  U N             T        Y              
INVPRG1H DS    XL8                                                              
INVPRG1  DS    CL27    15   26   27  A  U N             T        Y              
INVADY1H DS    XL8                                                              
INVADY1  DS    CL11    15   54   11  A  U N             T        Y              
INVATM1H DS    XL8                                                              
INVATM1  DS    CL11    15   66   11  A  U N             T        Y              
INVMDY1H DS    XL8                                                              
INVMDY1  DS    CL11    16    2   11  A  U N             T        Y              
INVMTM1H DS    XL8                                                              
INVMTM1  DS    CL11    16   14   11  A  U N             T        Y              
INVPRG2H DS    XL8                                                              
INVPRG2  DS    CL27    16   26   27  A  U N             T        Y              
INVADY2H DS    XL8                                                              
INVADY2  DS    CL11    16   54   11  A  U N             T        Y              
INVATM2H DS    XL8                                                              
INVATM2  DS    CL11    16   66   11  A  U N             T        Y              
INVMDY2H DS    XL8                                                              
INVMDY2  DS    CL11    17    2   11  A  U N             T        Y              
INVMTM2H DS    XL8                                                              
INVMTM2  DS    CL11    17   14   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27    17   26   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   66   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   14   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27    18   26   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   66   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   14   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27    19   26   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   66   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   14   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27    20   26   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   66   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   14   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27    21   26   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   66   11  A  U N             T        Y              
INVMDYLH DS    XL8                                                              
INVMDYL  DS    CL11    22    2   11  A  U N             T        Y              
INVMTMLH DS    XL8                                                              
INVMTML  DS    CL11    22   14   11  A  U N             T        Y              
INVPRGLH DS    XL8                                                              
INVPRGL  DS    CL27    22   26   27  A  U N             T        Y              
INVADYLH DS    XL8                                                              
INVADYL  DS    CL11    22   54   11  A  U N             T        Y              
INVATMLH DS    XL8                                                              
INVATML  DS    CL11    22   66   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL76    24    2   76  A  P N             T        Y              
INVLSTH  DS    XL8                                                              
INVLST   DS    CL1     24   79    1  A  U N             T        Y              
INVLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
INVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
