*          DATA SET RERMPEED   AT LEVEL 003 AS OF 12/01/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T810EED      DATE 12/01/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TITREPH  DS    CL8                                                              
TITREP   DS    CL2      7   15    2  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
TITSTAH  DS    CL8                                                              
TITSTA   DS    CL7      8   15    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
TITSDTH  DS    CL8                                                              
TITSDT   DS    CL8     10   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
TITEDTH  DS    CL8                                                              
TITEDT   DS    CL8     11   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
TITINVH  DS    CL8                                                              
TITINV   DS    CL9     12   15    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL27    14    2   27  A  P N             T        Y              
TITTXTH  DS    CL8                                                              
TITTXT   DS    CL1     14   42    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL38    15    2   38  A  P N             T        Y              
TITEBKH  DS    CL8                                                              
TITEBK   DS    CL1     15   42    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    16    2   13  A  P N             T        Y              
TITINCH  DS    CL8                                                              
TITINC   DS    CL35    16   17   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    17    2   13  A  P N             T        Y              
TITEXCH  DS    CL8                                                              
TITEXC   DS    CL35    17   17   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   61    1  A  U N             T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 496  BYTES                            
