*          DATA SET REROME6D   AT LEVEL 018 AS OF 02/25/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T82FE6D      DATE 02/25/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DE6HDR1H DS    XL8                                                              
DE6HDR1  DS    CL78     8    2   78  A  P H             T        Y              
DE6SELH  DS    XL8                                                              
DE6SEL   DS    CL1      9    2    1  A  U N             T        Y              
DE6STATH DS    XL8                                                              
DE6STAT  DS    CL10     9    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65     9   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    10   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    11   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    12   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    13   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    14   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    15   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    16   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    17   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    18   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    19   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    20   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    21   15   65  A  P N             T        Y              
DE6LLINH DS    XL8                                                              
DE6LLIN  DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    22   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  P Z             T        Y              
DE6LDATH DS    XL8                                                              
DE6LDAT  DS    CL75    23    4   75  A  P N             T        Y              
DE6PFLNH DS    XL8                                                              
DE6PFLN  DS    CL76    24    2   76  A  P H             T        Y              
DE6LAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DE6WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
