*          DATA SET REROMFAD   AT LEVEL 003 AS OF 02/07/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T82FFAD      DATE 10/08/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
DRBHDLNH DS    XL8                                                              
DRBHDLN  DS    CL8      5   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
DRBAORDH DS    XL8                                                              
DRBAORD  DS    CL8      5   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DRBBNUMH DS    XL8                                                              
DRBBNUM  DS    CL3      6   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL39     6   20   39  A  P Z             T        Y              
DRBFLAGH DS    XL8                                                              
DRBFLAG  DS    CL5      6   64    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
DRBCTOTH DS    XL8                                                              
DRBCTOT  DS    CL14     7   15   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7   38   12  A  P N             T        Y              
DRBTSPTH DS    XL8                                                              
DRBTSPT  DS    CL5      7   51    5  A  P N             T        Y              
DRBLISTH DS    XL8                                                              
DRBLIST  DS    CL78     8    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
DRBENDCH DS    XL8                                                              
DRBENDC  DS    CL78    22    2   78  A  P N             T        Y              
DRBENDLH DS    XL8                                                              
DRBENDL  DS    CL78    23    2   78  A  P N             T        Y              
DRBPFLNH DS    XL8                                                              
DRBPFLN  DS    CL32    24    2   32  A  P N             T        Y              
DRBLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DRBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1648 BYTES                            
