*          DATA SET REROME9D   AT LEVEL 006 AS OF 02/07/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T82FE9D      DATE 01/16/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DE9HAGYH DS    XL8                                                              
DE9HAGY  DS    CL3      8    2    3  A  P N             T        Y              
DE9AGYCH DS    XL8                                                              
DE9AGYC  DS    CL8      8    7    8  A  P N             T        Y              
DE9AGYNH DS    XL8                                                              
DE9AGYN  DS    CL20     8   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   38    5  A  P N             T        Y              
DE9BUYH  DS    XL8                                                              
DE9BUY   DS    CL20     8   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
DE9ADVH  DS    XL8                                                              
DE9ADV   DS    CL4      9    7    4  A  P N             T        Y              
DE9ADVNH DS    XL8                                                              
DE9ADVN  DS    CL20     9   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   38    7  A  P N             T        Y              
DE9PRDH  DS    XL8                                                              
DE9PRD   DS    CL20     9   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
DE9STAH  DS    XL8                                                              
DE9STA   DS    CL7     10    7    7  A  P N             T        Y              
DE9STANH DS    XL8                                                              
DE9STAN  DS    CL20    10   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   38    7  A  P N             T        Y              
DE9SALH  DS    XL8                                                              
DE9SAL   DS    CL3     10   46    3  A  P N             T        Y              
DE9OFFCH DS    XL8                                                              
DE9OFFC  DS    CL2     10   50    2  A  P N             T        Y              
DE9SALNH DS    XL8                                                              
DE9SALN  DS    CL20    10   53   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
DE9DATEH DS    XL8                                                              
DE9DATE  DS    CL17    11    9   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   38    7  A  P N             T        Y              
DE9DPRTH DS    XL8                                                              
DE9DPRT  DS    CL30    11   46   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
DE9LENH  DS    XL8                                                              
DE9LEN   DS    CL30    12    7   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   38    5  A  P N             T        Y              
DE9DEMOH DS    XL8                                                              
DE9DEMO  DS    CL20    12   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   67    4  A  P N             T        Y              
DE9ESTH  DS    XL8                                                              
DE9EST   DS    CL4     12   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   79    1  A  P N             T        Y              
DE9LHEDH DS    XL8                                                              
DE9LHED  DS    CL78    14    2   78  A  P H             T        Y              
DE9SELH  DS    XL8                                                              
DE9SEL   DS    CL1     16    2    1  A  U N             T        Y              
DE9STATH DS    XL8                                                              
DE9STAT  DS    CL10    16    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    16   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    17   15   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    18   15   65  A  P N             T        Y              
DE9LLINH DS    XL8                                                              
DE9LLIN  DS    CL1     19    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19    4   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL65    19   15   65  A  P N             T        Y              
DE9PFLNH DS    XL8                                                              
DE9PFLN  DS    CL76    20    2   76  A  P Z             T        Y              
DE9LAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DE9WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1096 BYTES                            
