*          DATA SET REROMEAD   AT LEVEL 003 AS OF 02/17/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T83FEAD      DATE 02/17/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P N             T        Y              
DIFAORDH DS    XL8                                                              
DIFAORD  DS    CL8      5   15    8  A  P H             T        Y              
DIFATOTH DS    XL8                                                              
DIFATOT  DS    CL12     5   24   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   37    6  A  P N             T        Y              
DIFASPTH DS    XL8                                                              
DIFASPT  DS    CL5      5   44    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
DIFMOPTH DS    XL8                                                              
DIFMOPT  DS    CL5      5   64    5  A  U N             T        Y              
DIFTYPEH DS    XL8                                                              
DIFTYPE  DS    CL7      5   70    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     6    2   12  A  P N             T        Y              
DIFHDLNH DS    XL8                                                              
DIFHDLN  DS    CL8      6   15    8  A  P H             T        Y              
DIFCTOTH DS    XL8                                                              
DIFCTOT  DS    CL12     6   24   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   37    6  A  P N             T        Y              
DIFCSPTH DS    XL8                                                              
DIFCSPT  DS    CL5      6   44    5  A  P N             T        Y              
DIFFDTEH DS    XL8                                                              
DIFFDTE  DS    CL28     6   51   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DIFDTOTH DS    XL8                                                              
DIFDTOT  DS    CL12     7   24   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   37    6  A  P N             T        Y              
DIFDSPTH DS    XL8                                                              
DIFDSPT  DS    CL5      7   44    5  A  P N             T        Y              
DIFHLN1H DS    XL8                                                              
DIFHLN1  DS    CL31     7   50   31  A  P N             T        Y              
DIFHLNMH DS    XL8                                                              
DIFHLNM  DS    CL1      8    4    1  A  P H             T        Y              
DIFHLNAH DS    XL8                                                              
DIFHLNA  DS    CL3      8    6    3  A  P H             T        Y              
DIFHLN2H DS    XL8                                                              
DIFHLN2  DS    CL71     8   10   71  A  P H             T        Y              
DIFHLN3H DS    XL8                                                              
DIFHLN3  DS    CL39     9    2   39  A  P H             T        Y              
DIFHL3DH DS    XL8                                                              
DIFHL3D  DS    CL38     9   43   38  A  P H             T        Y              
DIFMTCHH DS    XL8                                                              
DIFMTCH  DS    CL71    10    9   71  A  P H             T        Y              
DIFLISTH DS    XL8                                                              
DIFLIST  DS    CL1     11    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    11   10   71  A  P N             T        Y              
DIFLIS2H DS    XL8                                                              
DIFLIS2  DS    CL1     12    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    12   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    13   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    14   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    15   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    16   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    17   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    18   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    19   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    20   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    21   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71    22   10   71  A  P N             T        Y              
DIFENDH  DS    XL8                                                              
DIFEND   DS    CL1     23    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    6    3  A  P N             T        Y              
DIFEND2H DS    XL8                                                              
DIFEND2  DS    CL71    23   10   71  A  P N             T        Y              
DIFPFLNH DS    XL8                                                              
DIFPFLN  DS    CL77    24    2   77  A  P N             T        Y              
DIFLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DIFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2128 BYTES                            
