*          DATA SET REROME3D   AT LEVEL 006 AS OF 02/07/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T82FE3D      DATE 12/02/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DARHDR1H DS    XL8                                                              
DARHDR1  DS    CL78     8    2   78  A  P H             T        Y              
DARHDR2H DS    XL8                                                              
DARHDR2  DS    CL78     9    2   78  A  P H             T        Y              
DARSELH  DS    XL8                                                              
DARSEL   DS    CL1     10    2    1  A  U N             T        Y              
DARSTATH DS    XL8                                                              
DARSTAT  DS    CL10    10    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    10   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    11    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    12   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    13    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    14   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    15    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    16   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    17    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    18   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    19    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    20   17   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    21    2   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL61    22   17   61  A  P N             T        Y              
DARLLINH DS    XL8                                                              
DARLLIN  DS    CL76    23    2   76  A  P N             T        Y              
DARPFLNH DS    XL8                                                              
DARPFLN  DS    CL76    24    2   76  A  P Z             T        Y              
DARLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DARWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1520 BYTES                            
