*          DATA SET REROMFED   AT LEVEL 003 AS OF 02/07/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T82FFED      DATE 05/23/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DARHDR1H DS    XL8                                                              
DARHDR1  DS    CL78     8    2   78  A  P H             T        Y              
DARHDR2H DS    XL8                                                              
DARHDR2  DS    CL78     9    2   78  A  P H             T        Y              
DARSELH  DS    XL8                                                              
DARSEL   DS    CL1     10    2    1  A  U N             T        Y              
DARSTATH DS    XL8                                                              
DARSTAT  DS    CL10    10    6   10  A  P H             T        Y              
DARCON#H DS    XL8                                                              
DARCON#  DS    CL8     10   17    8  A  P N             T        Y              
DARAGY#H DS    XL8                                                              
DARAGY#  DS    CL9     10   26    9  A  P N             T        Y              
DARSTAH  DS    XL8                                                              
DARSTA   DS    CL6     10   36    6  A  P N             T        Y              
DARAGYH  DS    XL8                                                              
DARAGY   DS    CL6     10   43    6  A  P N             T        Y              
DAROFFH  DS    XL8                                                              
DAROFF   DS    CL2     10   50    2  A  P N             T        Y              
DARSALPH DS    XL8                                                              
DARSALP  DS    CL3     10   54    3  A  P N             T        Y              
DARADVH  DS    XL8                                                              
DARADV   DS    CL20    10   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  P N             T        Y              
DARPRD1H DS    XL8                                                              
DARPRD1  DS    CL12    11    8   12  A  P N             T        Y              
DARPRD2H DS    XL8                                                              
DARPRD2  DS    CL12    11   21   12  A  P N             T        Y              
DARFLTH  DS    XL8                                                              
DARFLT   DS    CL17    11   34   17  A  P N             T        Y              
DAREST#H DS    XL8                                                              
DAREST#  DS    CL4     11   53    4  A  P N             T        Y              
DARTOTLH DS    XL8                                                              
DARTOTL  DS    CL14    11   58   14  A  P N             T        Y              
DARTSPTH DS    XL8                                                              
DARTSPT  DS    CL5     11   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     12   17    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   26    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   36    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   50    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   54    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    8   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   34   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   53    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   58   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     14   17    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   26    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   36    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   50    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   54    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    8   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   34   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   53    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   58   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16   17    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   26    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   36    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   50    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   54    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    8   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   34   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   53    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   58   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   17    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   26    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   36    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   50    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   54    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19    8   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   34   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   53    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   58   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   17    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   26    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   36    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   50    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   54    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    21    8   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   34   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   53    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    21   58   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    6   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22   17    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   26    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   36    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   50    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   54    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    23    8   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   34   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   53    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    23   58   14  A  P N             T        Y              
DARLLINH DS    XL8                                                              
DARLLIN  DS    CL5     23   73    5  A  P N             T        Y              
DARPFLNH DS    XL8                                                              
DARPFLN  DS    CL76    24    2   76  A  P H             T        Y              
DARLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DARWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2072 BYTES                            
