*          DATA SET REROMF6D   AT LEVEL 002 AS OF 02/07/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T82FF6D      DATE 04/21/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
DRPHDLNH DS    CL8                                                              
DRPHDLN  DS    CL8      5   10    8  A  U N             T        Y   10         
DRPHDLNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
DRPTAGH  DS    CL8                                                              
DRPTAG   DS    CL1      6    2    1  A  P N             T        Y              
DRPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DRPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 64   BYTES                            
