*          DATA SET RERPTREC   AT LEVEL 002 AS OF 05/30/75                      
* REPORT RECORD                                                                 
*                                                                               
RRPTREC  DS    0CL164                                                           
RRPTKEY  DS    0CL27                                                            
RRPTKTYP DS    CL21      X'70'     RECORD TYPE                                  
RRPTKRPT DS    CL2       N         REPORT NUMBER                                
RRPTKREP DS    CL2       A         REP CODE                                     
RRPTKOFF DS    CL2       AN        OFFICE CODE                                  
RRPTLEN  DS    CL2                                                              
RRPTCNTL DS    CL1                                                              
RRPTLINK DS    CL4                                                              
         SPACE 1                                                                
RRPTELEM DS    0C                  REPORT ELEMENT                               
RRPTCODE DS    CL1       X'01'     ELEMENT CODE                                 
RRPTELLN DS    CL1       AL1(130)  ELEMENT LENGTH                               
RRPTNAME DS    CL36      AN        REPORT NAME                                  
RRPTPPR  DS    CL4       AN        PAPER CODE                                   
RRPTDIST DS    CL1       AN        DISTRIBUTION CODE (DEFAULT C'A')             
RRPTMSG  DS    CL30      AN        OPERATOR MESSAGE                             
         DS    CL67      -         SPARE                                        
