*          DATA SET RESFMCCD   AT LEVEL 006 AS OF 06/16/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818CCD      DATE 06/16/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     6    2   17  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8    5    7  L  P H             T        Y              
DIRFSTAH DS    CL8                                                              
DIRFSTA  DS    CL7      8   18    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      9    5    6  L  P H             T        Y              
DIRFPERH DS    CL8                                                              
DIRFPER  DS    CL20     9   18   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     13    5    7  L  P H             T        Y              
DIRTSTAH DS    CL8                                                              
DIRTSTA  DS    CL7     13   18    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     14    5    6  L  P H             T        Y              
DIRTPERH DS    CL8                                                              
DIRTPER  DS    CL20    14   18   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10    15    5   10  L  P H             T        Y              
DIRCTIDH DS    CL8                                                              
DIRCTID  DS    CL8     15   18    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL11    16    5   11  L  P H             T        Y              
DIRDESCH DS    CL8                                                              
DIRDESC  DS    CL25    16   18   25  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL11    17    5   11  L  P H             T        Y              
DIRTNOTH DS    CL8                                                              
DIRTNOT  DS    CL1     17   18    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     17   78    1  A  P N             T        Y              
DIRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DIRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 328  BYTES                            
