*          DATA SET RESFMDAD   AT LEVEL 006 AS OF 06/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818DAD      DATE 06/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
CMTOFFH  DS    CL8                                                              
CMTOFF   DS    CL2      5   10    2  A  U N             T        Y   10         
CMTOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
CMTNUMH  DS    CL8                                                              
CMTNUM   DS    CL2      5   26    2  A  U N             T        Y   20         
CMTNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
CMTHDSH  DS    CL8                                                              
CMTHDS   DS    CL17     7    7   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL75     8    2   75  A  P N             T        Y              
CMTSELH  DS    CL8                                                              
CMTSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70     9    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    10    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    11    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    12    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    13    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    14    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    15    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    16    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    17    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    18    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    19    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    20    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    21    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    22    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    23    7   70  A  P N             T        Y              
CMTTAGH  DS    CL8                                                              
CMTTAG   DS    CL1     24   78    1  A  P N             T        Y              
CMTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CMTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1544 BYTES                            
