*          DATA SET RESFME7D   AT LEVEL 009 AS OF 07/01/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818E7D      DATE 07/01/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     6    2   14  A  P H             T        Y              
AURGRPH  DS    CL8                                                              
AURGRP   DS    CL3      6   17    3  A  U N             T        Y   10         
AURGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   60    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
AURSTAH  DS    CL8                                                              
AURSTA   DS    CL7      7   17    7  A  U N             T        Y   20         
AURSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
AURPERH  DS    CL8                                                              
AURPER   DS    CL13     8   17   13  A  U N             T        Y   30         
AURPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P H             T        Y              
AURTYPH  DS    CL8                                                              
AURTYP   DS    CL2      9   17    2  A  U N             T        Y   40         
AURTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     9   33   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
AURDAYH  DS    CL8                                                              
AURDAY   DS    CL11    10   17   11  A  U N             T        Y   50         
AURDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
AURLENH  DS    CL8                                                              
AURLEN   DS    CL19    11   17   19  A  U N             T        Y   60         
AURLENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
AUROWNH  DS    CL8                                                              
AUROWN   DS    CL4     12   17    4  A  U N             T        Y   70         
AUROWNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
AURTVBH  DS    CL8                                                              
AURTVB   DS    CL4     13   17    4  A  U N             T        Y   80         
AURTVBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  P N             T        Y              
AURRNKH  DS    CL8                                                              
AURRNK   DS    CL3     14   17    3  A  U N             T        Y   90         
AURRNKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
AURASATH DS    CL8                                                              
AURASAT  DS    CL9     15   17    9  A  U N             T        Y  100         
AURASATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
AURFMTH  DS    CL8                                                              
AURFMT   DS    CL2     16   17    2  A  U N             T        Y  110         
AURFMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    16   33   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
AURFLTH  DS    CL8                                                              
AURFLT   DS    CL11    17   17   11  A  U N             T        Y  120         
AURFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17   33   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   44   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
AURSDPTH DS    CL8                                                              
AURSDPT  DS    CL2     18   17    2  A  U N             T        Y  130         
AURSDPTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL31    18   33   31  A  P N             T        Y              
AURSTOTH DS    CL8                                                              
AURSTOT  DS    CL2     19   17    2  A  U N             T        Y  140         
AURSTOTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    19   33   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    19   55   21  A  P N             T        Y              
AURSDOLH DS    CL8                                                              
AURSDOL  DS    CL2     20   17    2  A  U N             T        Y  150         
AURSDOLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    20   33   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    20   55   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   76    1  A  U N             T        Y              
AURLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AURWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 824  BYTES                            
