*          DATA SET RESFM80D   AT LEVEL 014 AS OF 10/19/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T81880D      DATE 10/19/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL20     7    2   20  A  P H             T        Y              
SBMATTH  DS    XL8                                                              
SBMATT   DS    CL1      7   24    1  A  U N             T        Y              
SBMTYPEH DS    XL8                                                              
SBMTYPE  DS    CL10     7   30   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2      9    2    2  A  P H             T        Y              
SBMSIDH  DS    XL8                                                              
SBMSID   DS    CL3      9   22    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   30   13  A  P H             T        Y              
SBMXNAMH DS    XL8                                                              
SBMXNAM  DS    CL20     9   46   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL37    11    2   37  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL17    11   39   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    13    2   11  A  P H             T        Y              
SBMATT1H DS    XL8                                                              
SBMATT1  DS    CL3     13   22    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   30   14  A  P N             T        Y              
SBMNAM1H DS    XL8                                                              
SBMNAM1  DS    CL20    13   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P H             T        Y              
SBMATT2H DS    XL8                                                              
SBMATT2  DS    CL3     15   22    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   30   14  A  P N             T        Y              
SBMNAM2H DS    XL8                                                              
SBMNAM2  DS    CL20    15   46   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    2   11  A  P Z             T        Y              
SBMATT3H DS    XL8                                                              
SBMATT3  DS    CL3     17   22    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14    17   30   14  A  P Z             T        Y              
SBMNAM3H DS    XL8                                                              
SBMNAM3  DS    CL20    17   46   20  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
SBMDENTH DS    XL8                                                              
SBMDENT  DS    CL10    19   15   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   30   12  A  P N             T        Y              
SBMDUPDH DS    XL8                                                              
SBMDUPD  DS    CL10    19   46   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     21    2    9  A  P N             T        Y              
SBMLUIDH DS    XL8                                                              
SBMLUID  DS    CL8     21   15    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   79    1  A  P N             T        Y              
SBMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SBMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 560  BYTES                            
