*          DATA SET RESFMD6D   AT LEVEL 009 AS OF 11/14/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818D6D      DATE 11/14/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
PRTCONH  DS    CL8                                                              
PRTCON   DS    CL8      5   10    8  A   U    H         T    I   Y   10         
PRTCONX  DS    CL8                                                              
PRTSTNH  DS    CL8                                                              
PRTSTN   DS    CL6      5   20    6  A   P    N         T        Y              
PRTMKTNH DS    CL8                                                              
PRTMKTN  DS    CL20     5   28   20  A   P    N         T        Y              
PRTAGYH  DS    CL8                                                              
PRTAGY   DS    CL20     5   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
PRTHDRH  DS    CL8                                                              
PRTHDR   DS    CL8      6   10    8  A   U    H         T        Y   30         
PRTHDRX  DS    CL8                                                              
PRTDATEH DS    CL8                                                              
PRTDATE  DS    CL17     6   20   17  A   P    N         T        Y              
PRTADVH  DS    CL8                                                              
PRTADV   DS    CL20     6   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    Z         T        Y              
PRTLINH  DS    CL8                                                              
PRTLIN   DS    CL8      7   10    8  A   P    Z         T        Y   30         
PRTLINX  DS    CL8                                                              
PRTSALH  DS    CL8                                                              
PRTSAL   DS    CL20     7   20   20  A   P    N         T        Y              
PRTPROH  DS    CL8                                                              
PRTPRO   DS    CL20     7   56   20  A   P    N         T        Y              
PRTVALH  DS    CL8                                                              
PRTVAL   DS    CL1      8   66    1  A   P    Z         T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    3    1  A   P    N         T        Y              
PRTOPAH  DS    CL8                                                              
PRTOPA   DS    CL2     10    6    2  A   U    H         T        Y   40         
PRTOPAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    10   10   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    10   46   14  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    3    1  A   P    N         T        Y              
PRTOPBH  DS    CL8                                                              
PRTOPB   DS    CL2     11    6    2  A   U    H         T        Y   50         
PRTOPBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL23    11   10   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    11   46   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    3    1  A   P    N         T        Y              
PRTOPCH  DS    CL8                                                              
PRTOPC   DS    CL2     12    6    2  A   U    H         T        Y   60         
PRTOPCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    12   10   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13    12   46   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    3    1  A   P    N         T        Y              
PRTOPDH  DS    CL8                                                              
PRTOPD   DS    CL2     13    6    2  A   U    H         T        Y   70         
PRTOPDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    13   10   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13   46   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    3    1  A   P    N         T        Y              
PRTOPEH  DS    CL8                                                              
PRTOPE   DS    CL2     14    6    2  A   U    H         T        Y   80         
PRTOPEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    14   10   14  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    14   46   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    3    1  A   P    N         T        Y              
PRTOPFH  DS    CL8                                                              
PRTOPF   DS    CL2     15    6    2  A   U    H         T        Y   90         
PRTOPFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    15   10   27  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13    15   46   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    3    1  A   P    N         T        Y              
PRTOPGH  DS    CL8                                                              
PRTOPG   DS    CL2     16    6    2  A   U    H         T        Y  100         
PRTOPGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL23    16   10   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   46   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    3    1  A   P    N         T        Y              
PRTOPHH  DS    CL8                                                              
PRTOPH   DS    CL2     17    6    2  A   U    H         T        Y  110         
PRTOPHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL33    17   10   33  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   46   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    3    1  A   P    N         T        Y              
PRTOPIH  DS    CL8                                                              
PRTOPI   DS    CL2     18    6    2  A   U    H         T        Y  120         
PRTOPIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28    18   10   28  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    18   46   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    3    1  A   P    N         T        Y              
PRTOPJH  DS    CL8                                                              
PRTOPJ   DS    CL2     19    6    2  A   U    H         T        Y  130         
PRTOPJX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    19   10   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13    19   46   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    3    1  A   P    N         T        Y              
PRTOPKH  DS    CL8                                                              
PRTOPK   DS    CL2     20    6    2  A   U    H         T        Y  140         
PRTOPKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    20   10   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23    20   46   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    24    2   11  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL11    24   16   11  A   P    H         T        Y              
PRTLSTH  DS    CL8                                                              
PRTLST   DS    CL1     24   75    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A   P    N         T        Y              
PRTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1272 BYTES                            
