*          DATA SET RESFMFCD   AT LEVEL 004 AS OF 11/29/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818FCD      DATE 11/29/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
MPRSRCH  DS    CL8                                                              
MPRSRC   DS    CL4      5   10    4  A  U N             T    I   Y   10         
MPRSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   73    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
MPRMKTH  DS    CL8                                                              
MPRMKT   DS    CL5      6   10    5  A  U N             T        Y   20         
MPRMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
MPRDPTH  DS    CL8                                                              
MPRDPT   DS    CL36     7   10   36  A  U N             T        Y   30         
MPRDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     7   50   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
MPRBKSH  DS    CL8                                                              
MPRBKS   DS    CL68     8   10   68  A  U N             T        Y   40         
MPRBKSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      9    2    5  A  P H             T        Y              
MPRPJ1H  DS    CL8                                                              
MPRPJ1   DS    CL15     9   10   15  A  U N             T        Y   50         
MPRPJ1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     9   30   16  A  P N             T        Y              
MPROV1H  DS    CL8                                                              
MPROV1   DS    CL25     9   50   25  A  U N             T        Y   55         
MPROV1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
MPRPJ2H  DS    CL8                                                              
MPRPJ2   DS    CL15    10   10   15  A  U N             T        Y   50         
MPRPJ2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10   30   16  A  P N             T        Y              
MPROV2H  DS    CL8                                                              
MPROV2   DS    CL25    10   50   25  A  U N             T        Y   55         
MPROV2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P H             T        Y              
MPRDEM1H DS    CL8                                                              
MPRDEM1  DS    CL60    11   10   60  A  U N             T        Y   60         
MPRDEM1X DS    CL8                                                              
MPRDEM2H DS    CL8                                                              
MPRDEM2  DS    CL60    12   10   60  A  U N             T        Y   60         
MPRDEM2X DS    CL8                                                              
MPRDEM3H DS    CL8                                                              
MPRDEM3  DS    CL60    13   10   60  A  U N             T        Y   60         
MPRDEM3X DS    CL8                                                              
MPRDEM4H DS    CL8                                                              
MPRDEM4  DS    CL60    14   10   60  A  U N             T        Y   60         
MPRDEM4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
MPRNDEXH DS    CL8                                                              
MPRNDEX  DS    CL9     15   10    9  A  U N             T        Y   70         
MPRNDEXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
MPROP1H  DS    CL8                                                              
MPROP1   DS    CL2     16   10    2  A  U N             T        Y   80         
MPROP1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL44    16   30   44  A  P N             T        Y              
MPROP2H  DS    CL8                                                              
MPROP2   DS    CL2     17   10    2  A  U N             T        Y   90         
MPROP2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    17   30   35  A  P N             T        Y              
MPROP3H  DS    CL8                                                              
MPROP3   DS    CL2     18   10    2  A  U N             T        Y   90         
MPROP3X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL33    18   30   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL33    19   30   33  A  P N             T        Y              
MPRLSTH  DS    CL8                                                              
MPRLST   DS    CL1     19   76    1  A  U N             T        Y              
MPRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1096 BYTES                            
