*          DATA SET RESFMF5D   AT LEVEL 016 AS OF 10/05/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818F5D      DATE 10/05/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
SDDSTAH  DS    CL8                                                              
SDDSTA   DS    CL7      5   13    7  A   U    N         T        Y   10         
SDDSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      7    7    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      7   16    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      7   31    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      7   41    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      7   56    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      7   66    4  A   P    H         T        Y              
SDDDPTH  DS    CL8                                                              
SDDDPT   DS    CL2      8    2    2  A   U    N         T        Y              
SDDDY1H  DS    CL8                                                              
SDDDY1   DS    CL8      8    6    8  A   U    N         T        Y              
SDDTM1H  DS    CL8                                                              
SDDTM1   DS    CL13     8   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     8   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     8   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     9   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     9   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     9   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    10   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    10   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    10   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    11   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    11   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    11   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    12   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    12   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    12   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    13   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    13   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    13   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    14   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    14   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    14   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    15   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    15   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    15   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    16   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    16   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    16   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    17   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    17   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    17   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    18   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    18   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    18   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     19    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    19   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     19   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    19   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     19   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    19   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    20   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    20   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    20   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    21   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    21   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    21   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    22   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    22   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    22   66   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     23    2    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     23    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    23   16   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     23   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    23   41   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     23   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    23   66   13  A   U    N         T        Y              
SDDFLGH  DS    CL8                                                              
SDDFLG   DS    CL1     24   79    1  A   U    N         T        Y              
SDDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SDDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2080 BYTES                            
