*          DATA SET RESFMEAD   AT LEVEL 009 AS OF 04/27/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818EAD      DATE 04/27/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
LTXSTAH  DS    CL8                                                              
LTXSTA   DS    CL8      5   10    8  A   U    N         T        Y   10         
LTXSTAX  DS    CL8                                                              
LTXMRKTH DS    CL8                                                              
LTXMRKT  DS    CL20     5   28   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    N         T        Y              
LTXTYPH  DS    CL8                                                              
LTXTYP   DS    CL15     6   10   15  A   U    N         T        Y   40         
LTXTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   28    6  A   P    N         T        Y              
LTXKSRCH DS    CL8                                                              
LTXKSRC  DS    CL4      6   36    4  A   U    N         T        Y   50         
LTXKSRCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   46    4  A   P    N         T        Y              
LTXKBKH  DS    CL8                                                              
LTXKBK   DS    CL10     6   54   10  A   U    N         T        Y   60         
LTXKBKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   66    5  A   P    N         T        Y              
LTXKLOCH DS    CL8                                                              
LTXKLOC  DS    CL2      6   74    2  A   U    N         T        Y   70         
LTXKLOCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A   P    H         T        Y              
LTXHDSH  DS    CL8                                                              
LTXHDS   DS    CL39     7    7   39  A   P    H         T        Y              
LTXSELH  DS    CL8                                                              
LTXSEL   DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     8    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A   P    N         T        Y              
LTXTAGH  DS    CL8                                                              
LTXTAG   DS    CL1     23    2    1  A   P    N         T        Y              
LTXLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LTXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1687 BYTES                            
