*          DATA SET RESFMB5D   AT LEVEL 005 AS OF 01/23/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818B5D      DATE 01/23/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
TKOSRCEH DS    XL8                                                              
TKOSRCE  DS    CL8      5   10    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
TKOKADVH DS    XL8                                                              
TKOKADV  DS    CL4      6    7    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   13    3  A  P N             T        Y              
TKOKAGYH DS    XL8                                                              
TKOKAGY  DS    CL6      6   18    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   26    3  A  P N             T        Y              
TKOKSALH DS    XL8                                                              
TKOKSAL  DS    CL3      6   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   35    3  A  P N             T        Y              
TKOKTYPH DS    XL8                                                              
TKOKTYP  DS    CL1      6   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   43    3  A  P N             T        Y              
TKOKPRDH DS    XL8                                                              
TKOKPRD  DS    CL3      6   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   53    3  A  P Z             T        Y              
TKOKPPNH DS    XL8                                                              
TKOKPPN  DS    CL8      6   58    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    7    8  A  P H             T        Y              
TKOSRCH  DS    XL8                                                              
TKOSRC   DS    CL6      7   17    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   47    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   57    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    7    8  A  P H             T        Y              
TKOHFLDH DS    XL8                                                              
TKOHFLD  DS    CL6      8   17    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   25   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   47    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   57    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   66    6  A  P Z             T        Y              
TKOACTH  DS    XL8                                                              
TKOACT   DS    CL3      9    2    3  A  U N             T        Y              
TKOSTRTH DS    XL8                                                              
TKOSTRT  DS    CL8      9    7    8  A  U N             T        Y              
TKOCODEH DS    XL8                                                              
TKOCODE  DS    CL7      9   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     9   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   47    8  A  P N             T        Y              
TKODCHGH DS    XL8                                                              
TKODCHG  DS    CL8      9   57    8  A  P N             T        Y              
TKOSOFFH DS    XL8                                                              
TKOSOFF  DS    CL2      9   66    2  A  P Z             T        Y              
TKOLACTH DS    XL8                                                              
TKOLACT  DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    7    8  A  U N             T        Y              
TKOLCDEH DS    XL8                                                              
TKOLCDE  DS    CL7     10   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    21   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   66    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   17    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    23   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   57    8  A  P N             T        Y              
TKOFINH  DS    XL8                                                              
TKOFIN   DS    CL2     23   66    2  A  Z N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   79    1  A  P N             T        Y              
TKOLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TKOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
