*          DATA SET RESFMC3D   AT LEVEL 019 AS OF 08/12/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818C3D      DATE 08/12/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SOLSTATH DS    CL8                                                              
SOLSTAT  DS    CL7      5   11    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SOLDATH  DS    CL8                                                              
SOLDAT   DS    CL8      6   11    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL21     6   22   21  A  P N             T        Y              
SOLTAGH  DS    CL8                                                              
SOLTAG   DS    CL1      6   78    1  A  P N             T        Y              
SOLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SOLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 104  BYTES                            
