*          DATA SET RESFMDDD   AT LEVEL 002 AS OF 08/08/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818DDD      DATE 08/08/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
PFHSTAH  DS    CL8                                                              
PFHSTA   DS    CL6      5   10    6  A  U N             T        Y   10         
PFHSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
PFHOFFH  DS    CL8                                                              
PFHOFF   DS    CL2      5   28    2  A  U N             T        Y   20         
PFHOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
PFHFILH  DS    CL8                                                              
PFHFIL   DS    CL1      5   46    1  A  U N             T        Y   30         
PFHFILX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
PFHDATEH DS    CL8                                                              
PFHDATE  DS    CL17     6   10   17  A  U N             T        Y   40         
PFHDATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
PFHLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PFHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 160  BYTES                            
