*          DATA SET RESFMBDD   AT LEVEL 002 AS OF 06/23/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818BDD      DATE 06/23/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
FCTOFFH  DS    CL8                                                              
FCTOFF   DS    CL6      8    2    6  A  P H             T        Y              
FCTOF1H  DS    CL8                                                              
FCTOF1   DS    CL2      8   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   16   10  A  P H             T        Y              
FCTMBUDH DS    CL8                                                              
FCTMBUD  DS    CL8      8   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   40    5  A  P H             T        Y              
FCTSHRH  DS    CL8                                                              
FCTSHR   DS    CL3      8   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   54   10  A  P H             T        Y              
FCTSBUDH DS    CL8                                                              
FCTSBUD  DS    CL8      8   66    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
FCTADVH  DS    CL8                                                              
FCTADV   DS    CL20     9    7   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   31    3  A  P H             T        Y              
FCTAGYH  DS    CL8                                                              
FCTAGY   DS    CL20     9   36   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   60    7  A  P H             T        Y              
FCTLUPH  DS    CL8                                                              
FCTLUP   DS    CL8      9   69    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  P H             T        Y              
FCTFLTH  DS    CL8                                                              
FCTFLT   DS    CL20    10   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  P H             T        Y              
FCTCM1H  DS    CL8                                                              
FCTCM1   DS    CL60    11   14   60  A  U N             T        Y              
FCTCM2H  DS    CL8                                                              
FCTCM2   DS    CL60    12   14   60  A  U N             T        Y              
FCTCM3H  DS    CL8                                                              
FCTCM3   DS    CL60    13   14   60  A  U N             T        Y              
FCTCM4H  DS    CL8                                                              
FCTCM4   DS    CL60    14   14   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P H             T        Y              
FCTOF2H  DS    CL8                                                              
FCTOF2   DS    CL2     16   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   16   10  A  P H             T        Y              
FCTMBD2H DS    CL8                                                              
FCTMBD2  DS    CL8     16   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   40    5  A  P H             T        Y              
FCTSR2H  DS    CL8                                                              
FCTSR2   DS    CL3     16   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   54   10  A  P H             T        Y              
FCTSBD2H DS    CL8                                                              
FCTSBD2  DS    CL8     16   66    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P H             T        Y              
FCTAD2H  DS    CL8                                                              
FCTAD2   DS    CL20    17    7   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   31    3  A  P H             T        Y              
FCTAG2H  DS    CL8                                                              
FCTAG2   DS    CL20    17   36   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   60    7  A  P H             T        Y              
FCTLU2H  DS    CL8                                                              
FCTLU2   DS    CL8     17   69    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P H             T        Y              
FCTFL2H  DS    CL8                                                              
FCTFL2   DS    CL20    18   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P H             T        Y              
FCTC21H  DS    CL8                                                              
FCTC21   DS    CL60    19   14   60  A  U N             T        Y              
FCTC22H  DS    CL8                                                              
FCTC22   DS    CL60    20   14   60  A  U N             T        Y              
FCTC23H  DS    CL8                                                              
FCTC23   DS    CL60    21   14   60  A  U N             T        Y              
FCTC24H  DS    CL8                                                              
FCTC24   DS    CL60    22   14   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   79    1  A  P N             T        Y              
FCTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
FCTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1128 BYTES                            
