*          DATA SET RESFMD2D   AT LEVEL 031 AS OF 08/06/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818D2D      DATE 08/06/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
DETCONH  DS    CL8                                                              
DETCON   DS    CL8      5   10    8  A   U    H         T    I   Y   10         
DETCONX  DS    CL8                                                              
DETSTNH  DS    CL8                                                              
DETSTN   DS    CL6      5   20    6  A   P    N         T        Y              
DETMKTNH DS    CL8                                                              
DETMKTN  DS    CL20     5   28   20  A   P    N         T        Y              
DETAGYH  DS    CL8                                                              
DETAGY   DS    CL20     5   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
DETHDRH  DS    CL8                                                              
DETHDR   DS    CL8      6   10    8  A   U    H         T        Y   20         
DETHDRX  DS    CL8                                                              
DETDATEH DS    CL8                                                              
DETDATE  DS    CL17     6   20   17  A   P    N         T        Y              
DETADVH  DS    CL8                                                              
DETADV   DS    CL20     6   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7   38    4  A   P    N         T        Y              
DETLINH  DS    CL8                                                              
DETLIN   DS    CL8      7   46    8  A   U    H         T        Y   25         
DETLINX  DS    CL8                                                              
DETSALH  DS    CL8                                                              
DETSAL   DS    CL20     8   20   20  A   P    N         T        Y              
DETPROH  DS    CL8                                                              
DETPRO   DS    CL20     8   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8   76    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A   P    N         T        Y              
DETINVH  DS    CL8                                                              
DETINV   DS    CL16    10   10   16  A   U    H         T        Y   30         
DETINVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10   38    1  A   P    N         T        Y              
DETNUMH  DS    CL8                                                              
DETNUM   DS    CL5     10   46    5  A   U    H         T        Y   40         
DETNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     10   56    4  A   P    N         T        Y              
DETCDH   DS    CL8                                                              
DETCD    DS    CL3     10   64    3  A   U    H         T        Y   50         
DETCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
DETLENH  DS    CL8                                                              
DETLEN   DS    CL30    11   10   30  A   U    H         T        Y   60         
DETLENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     12    2    5  A   P    N         T        Y              
DETRATH  DS    CL8                                                              
DETRAT   DS    CL30    12   10   30  A   U    H         T        Y   70         
DETRATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12   56    3  A   P    N         T        Y              
DETDAYOH DS    CL8                                                              
DETDAYO  DS    CL1     12   62    1  A   P    H         T        Y              
DETDAYH  DS    CL8                                                              
DETDAY   DS    CL8     12   64    8  A   U    H         T        Y   80         
DETDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13    2    5  A   P    N         T        Y              
DETTTLOH DS    CL8                                                              
DETTTLO  DS    CL1     13    8    1  A   P    H         T        Y              
DETTTLH  DS    CL8                                                              
DETTTL   DS    CL28    13   10   28  A   U    H         T        Y   90         
DETTTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13   56    4  A   P    N         T        Y              
DETTIMOH DS    CL8                                                              
DETTIMO  DS    CL1     13   62    1  A   P    H         T        Y              
DETTIMH  DS    CL8                                                              
DETTIM   DS    CL12    13   64   12  A   U    H         T        Y  100         
DETTIMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     14    2    5  A   P    N         T        Y              
DETBKSH  DS    CL8                                                              
DETBKS   DS    CL60    14   10   60  A   U    H         T        Y  110         
DETBKSX  DS    CL8                                                              
DETDC1H  DS    CL8                                                              
DETDC1   DS    CL60    15   10   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A   P    N         T        Y              
DETDEMOH DS    CL8                                                              
DETDEMO  DS    CL1     16    8    1  A   P    H         T        Y              
DETDEMH  DS    CL8                                                              
DETDEM   DS    CL60    16   10   60  A   U    H         T        Y  120         
DETDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   P    N         T        Y              
DETPJ1H  DS    CL8                                                              
DETPJ1   DS    CL44    17   10   44  A   U    H         T        Y  130         
DETPJ1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   P    Z         T        Y              
DETPJ2H  DS    CL8                                                              
DETPJ2   DS    CL44    18   10   44  A   P    Z         T        Y  130         
DETPJ2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     19    2    4  A   P    N         T        Y              
DETCOM1H DS    CL8                                                              
DETCOM1  DS    CL60    19   10   60  A   U    H         T        Y  150         
DETCOM1X DS    CL8                                                              
DETCOM2H DS    CL8                                                              
DETCOM2  DS    CL60    20   10   60  A   U    H         T        Y  150         
DETCOM2X DS    CL8                                                              
DETCOM3H DS    CL8                                                              
DETCOM3  DS    CL60    21   10   60  A   U    H         T        Y  150         
DETCOM3X DS    CL8                                                              
DETCOM4H DS    CL8                                                              
DETCOM4  DS    CL60    22   10   60  A   U    H         T        Y  150         
DETCOM4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    24    2   12  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL11    24   17   11  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    24   31   10  A   P    H         T        Y              
DETLSTH  DS    CL8                                                              
DETLST   DS    CL1     24   78    1  A   U    N         T        Y              
DETLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DETWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1472 BYTES                            
