*          DATA SET RESFME4D   AT LEVEL 007 AS OF 10/01/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818E4D      DATE 10/01/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
LPTPTCH  DS    CL8                                                              
LPTPTC   DS    CL1      5   13    1  A  U N             T        Y   10         
LPTPTCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   50    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
LPTHDSH  DS    CL8                                                              
LPTHDS   DS    CL17     6   10   17  A  P H             T        Y              
LPTSELH  DS    CL8                                                              
LPTSEL   DS    CL3      7    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     7   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     8   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     9   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    10   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    12   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    13   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    14   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    15   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    16   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    17   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    18   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    19   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    20   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    21   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    22   10   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    23   10   21  A  P N             T        Y              
LPTFLGH  DS    CL8                                                              
LPTFLG   DS    CL1     24   79    1  A  U N             T        Y              
LPTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
