*          DATA SET RESFMFED   AT LEVEL 003 AS OF 10/05/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818FED      DATE 10/05/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
SBBSTAH  DS    CL8                                                              
SBBSTA   DS    CL7      5   10    7  A   U    N         T        Y   10         
SBBSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     5   20   10  A   P    H         T        Y              
SBBADVH  DS    CL8                                                              
SBBADV   DS    CL4      5   32    4  A   U    N         T        Y   20         
SBBADVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A   P    H         T        Y              
SBBOFFH  DS    CL8                                                              
SBBOFF   DS    CL4      5   46    4  A   U    N         T        Y   30         
SBBOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   56    6  A   P    H         T        Y              
SBBPERH  DS    CL8                                                              
SBBPER   DS    CL6      5   64    6  A   U    N         T        Y   40         
SBBPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A   P    N         T        Y              
SBBTOTH  DS    CL8                                                              
SBBTOT   DS    CL12     7   20   12  A   U    N         T        Y   50         
SBBTOTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     8    2   12  A   P    N         T        Y              
SBBMTOTH DS    CL8                                                              
SBBMTOT  DS    CL12     8   20   12  A   U    N         T        Y   60         
SBBMTOTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     8   38   13  A   P    N         T        Y              
SBBSHRH  DS    CL8                                                              
SBBSHR   DS    CL3      8   56    3  A   U    N         T        Y   70         
SBBSHRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    N         T        Y              
SBBCMTH  DS    CL8                                                              
SBBCMT   DS    CL35     9   20   35  A   U    N         T        Y   80         
SBBCMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    10   20   35  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    11   20   35  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    12   20   35  A   U    N         T        Y              
SBBFLGH  DS    CL8                                                              
SBBFLG   DS    CL1     13   20    1  A   U    N         T        Y              
SBBLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SBBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 504  BYTES                            
