*          DATA SET RESFMF2D   AT LEVEL 002 AS OF 03/18/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818F2D      DATE 03/18/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
REPSTAH  DS    CL8                                                              
REPSTA   DS    CL7      5   10    7  A  U N             T        Y   10         
REPSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     5   20   10  A  P N             T        Y              
REPADVH  DS    CL8                                                              
REPADV   DS    CL4      5   32    4  A  U N             T        Y   20         
REPADVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
REPOFFH  DS    CL8                                                              
REPOFF   DS    CL4      5   46    4  A  U N             T        Y   30         
REPOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   56    6  A  P N             T        Y              
REPPERH  DS    CL8                                                              
REPPER   DS    CL6      5   64    6  A  U N             T        Y   40         
REPPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 160  BYTES                            
