*          DATA SET RESFMEDD   AT LEVEL 001 AS OF 04/10/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818EDD      DATE 04/10/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SETTYPEH DS    CL8                                                              
SETTYPE  DS    CL2      5   10    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10     5   20   10  A  P H             T        Y              
SETIDENH DS    CL8                                                              
SETIDEN  DS    CL4      5   32    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
SETDESCH DS    CL8                                                              
SETDESC  DS    CL60     6   15   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
SETSOFSH DS    CL8                                                              
SETSOFS  DS    CL1      7   15    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL14     7   20   14  A  P N             T        Y              
SETEXCSH DS    CL8                                                              
SETEXCS  DS    CL1      7   35    1  A  U H             T        Y              
SETFRSTH DS    CL8                                                              
SETFRST  DS    CL8      8    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28     8   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28     8   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28     9   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28     9   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    10   12   28  A  P N             T        Y              
SETDLIMH DS    CL8                                                              
SETDLIM  DS    CL8     10   42    8  A  U H             T        Y              
SETDLABH DS    CL8                                                              
SETDLAB  DS    CL28    10   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    11   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    11   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    12   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    12   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    13   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    13   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    14   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    14   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    15   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    15   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    16   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    16   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    17   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    17   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    18   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    18   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    19   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    19   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    20   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    20   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    21   12   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    21   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    22   12   28  A  P N             T        Y              
SETENDH  DS    CL8                                                              
SETEND   DS    CL8     22   42    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL28    22   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A  P N             T        Y              
SETLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SETWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1784 BYTES                            
