*          DATA SET RESFMF7D   AT LEVEL 018 AS OF 10/01/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818F7D      DATE 10/01/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     6    2   14  A  P H             T        Y              
PSRGRPH  DS    CL8                                                              
PSRGRP   DS    CL3      6   17    3  A  U N             T        Y   10         
PSRGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   60    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
PSRSTAH  DS    CL8                                                              
PSRSTA   DS    CL7      7   17    7  A  U N             T        Y   20         
PSRSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
PSRPERH  DS    CL8                                                              
PSRPER   DS    CL13     8   17   13  A  U N             T        Y   30         
PSRPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P H             T        Y              
PSRTYPH  DS    CL8                                                              
PSRTYP   DS    CL2      9   17    2  A  U N             T        Y   40         
PSRTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     9   33   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PSRDAYH  DS    CL8                                                              
PSRDAY   DS    CL11    10   17   11  A  U N             T        Y   50         
PSRDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
PSRLENH  DS    CL8                                                              
PSRLEN   DS    CL19    11   17   19  A  U N             T        Y   60         
PSRLENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
PSROWNH  DS    CL8                                                              
PSROWN   DS    CL4     12   17    4  A  U N             T        Y   70         
PSROWNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
PSRTVBH  DS    CL8                                                              
PSRTVB   DS    CL4     13   17    4  A  U N             T        Y   80         
PSRTVBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  P N             T        Y              
PSRRNKH  DS    CL8                                                              
PSRRNK   DS    CL3     14   17    3  A  U N             T        Y   90         
PSRRNKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
PSRASATH DS    CL8                                                              
PSRASAT  DS    CL9     15   17    9  A  U N             T        Y  100         
PSRASATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
PSRFMTH  DS    CL8                                                              
PSRFMT   DS    CL2     16   17    2  A  U N             T        Y  110         
PSRFMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    16   33   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
PSRFLTH  DS    CL8                                                              
PSRFLT   DS    CL11    17   17   11  A  U N             T        Y  120         
PSRFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22    17   33   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    17   56   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
PSRSDPTH DS    CL8                                                              
PSRSDPT  DS    CL2     18   17    2  A  U N             T        Y  130         
PSRSDPTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL31    18   33   31  A  P N             T        Y              
PSRSTOTH DS    CL8                                                              
PSRSTOT  DS    CL2     19   17    2  A  U N             T        Y  140         
PSRSTOTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    19   33   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    19   55   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   76    1  A  U N             T        Y              
PSRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PSRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
