*          DATA SET RESFMBBD   AT LEVEL 005 AS OF 03/19/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818BBD      DATE 03/19/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
SCBSTATH DS    CL8                                                              
SCBSTAT  DS    CL7      5   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
SCBMEM1H DS    CL8                                                              
SCBMEM1  DS    CL3      7   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     7   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL30     8   14   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
SCBMEM2H DS    CL8                                                              
SCBMEM2  DS    CL3      9   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     9   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    10   14   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
SCBMEM3H DS    CL8                                                              
SCBMEM3  DS    CL3     11   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    12   14   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
SCBMEM4H DS    CL8                                                              
SCBMEM4  DS    CL3     13   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    14   14   30  A  P N             T        Y              
SCBTAGH  DS    CL8                                                              
SCBTAG   DS    CL1     14   78    1  A  P N             T        Y              
SCBLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 440  BYTES                            
