*          DATA SET RESFMF1D   AT LEVEL 012 AS OF 10/05/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818F1D      DATE 10/05/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
OVRRPTH  DS    CL8                                                              
OVRRPT   DS    CL3      5   10    3  A   U    N         T        Y   10         
OVRRPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    H         T        Y              
OVRSVCH  DS    CL8                                                              
OVRSVC   DS    CL4      5   28    4  A   U    N         T        Y   20         
OVRSVCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A   P    H         T        Y              
OVRMKTH  DS    CL8                                                              
OVRMKT   DS    CL4      5   46    4  A   U    N         T        Y   30         
OVRMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   56    6  A   P    H         T        Y              
OVRSCNH  DS    CL8                                                              
OVRSCN   DS    CL5      5   64    5  A   U    N         T        Y   40         
OVRSCNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    H         T        Y              
OVRTXTH  DS    CL8                                                              
OVRTXT   DS    CL67     7    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67     8    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67     9    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    10    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    11    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    12    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    13    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    14    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    15    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    16    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    17    7   67  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL67    18    7   67  A   U    N         T        Y              
OVRFLGH  DS    CL8                                                              
OVRFLG   DS    CL1     24   79    1  A   U    N         T        Y              
OVRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OVRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1064 BYTES                            
