*          DATA SET RESFMF6D   AT LEVEL 001 AS OF 06/28/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818F6D      DATE 06/28/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
DSRSTAH  DS    CL8                                                              
DSRSTA   DS    CL7      5   10    7  A  U N             T        Y   10         
DSRSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
DSRPERH  DS    CL8                                                              
DSRPER   DS    CL13     5   27   13  A  U N             T        Y   20         
DSRPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P H             T        Y              
DSRDAYH  DS    CL8                                                              
DSRDAY   DS    CL11     5   64   11  A  U N             T        Y   30         
DSRDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
DSRLENH  DS    CL8                                                              
DSRLEN   DS    CL13     6    9   13  A  U N             T        Y   40         
DSRLENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
DSROPTH  DS    CL8                                                              
DSROPT   DS    CL29     6   46   29  A  U N             T        Y   50         
DSROPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75     8    1   75  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL74     9    1   74  A  P H             T        Y              
DSRLN1H  DS    CL8                                                              
DSRLN1   DS    CL75    10    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    1   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    1   75  A  P N             T        Y              
DSRFLGH  DS    CL8                                                              
DSRFLG   DS    CL1     22   79    1  A  U N             T        Y              
DSRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DSRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1488 BYTES                            
