*          DATA SET RESFM82D   AT LEVEL 014 AS OF 06/24/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T81882D      DATE 06/24/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
DARAGCYH DS    XL8                                                              
DARAGCY  DS    CL8      5   10    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL28     5   26   28  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      6    7    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   17    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      6   47    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   57    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   67    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    7    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   17    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13     7   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   47    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   57    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      7   67    9  A  P N             T        Y              
DARACTH  DS    XL8                                                              
DARACT   DS    CL3      8    2    3  A  U N             T        Y              
DARSTRTH DS    XL8                                                              
DARSTRT  DS    CL8      8    7    8  A  U N             T        Y              
DARCODEH DS    XL8                                                              
DARCODE  DS    CL8      8   17    8  A  U N             T        Y              
DARNAMEH DS    XL8                                                              
DARNAME  DS    CL13     8   27   13  A  P N             T        Y              
DARDENTH DS    XL8                                                              
DARDENT  DS    CL8      8   47    8  A  P N             T        Y              
DARDCHGH DS    XL8                                                              
DARDCHG  DS    CL8      8   57    8  A  P N             T        Y              
DARLUIDH DS    XL8                                                              
DARLUID  DS    CL8      8   67    8  A  P N             T        Y              
DARLACTH DS    XL8                                                              
DARLACT  DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    7    8  A  U N             T        Y              
DARLCDEH DS    XL8                                                              
DARLCDE  DS    CL8      9   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   57    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23    7    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   57    8  A  P N             T        Y              
DARFINH  DS    XL8                                                              
DARFIN   DS    CL8     23   67    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   79    1  A  P N             T        Y              
DARLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DARWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2048 BYTES                            
