*          DATA SET RESFMCAD   AT LEVEL 002 AS OF 04/22/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818CAD      DATE 04/22/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     5    2   10  A  P H             T        Y              
LABNAMEH DS    CL8                                                              
LABNAME  DS    CL8      5   14    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
LABDESCH DS    CL8                                                              
LABDESC  DS    CL60     6   15   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
LABCOLH  DS    CL8                                                              
LABCOL   DS    CL2      7   15    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   20   12  A  P N             T        Y              
LABROWH  DS    CL8                                                              
LABROW   DS    CL2      7   34    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL18     7   38   18  A  P N             T        Y              
LABNUMH  DS    CL8                                                              
LABNUM   DS    CL2      7   58    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
LABLINEH DS    CL8                                                              
LABLINE  DS    CL2      8   17    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   20   11  A  P N             T        Y              
LABTESTH DS    CL8                                                              
LABTEST  DS    CL2      8   33    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    10   14   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
LABSROWH DS    CL8                                                              
LABSROW  DS    CL2     11   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   25    2  N  U N             T        Y              
LABLENH  DS    CL8                                                              
LABLEN   DS    CL2     11   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20    2    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   36    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
LABCMT1H DS    CL8                                                              
LABCMT1  DS    CL2     22   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   25    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    22   36   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   14    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   25    2  N  U N             T        Y              
LABLFLDH DS    CL8                                                              
LABLFLD  DS    CL40    23   36   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A  P N             T        Y              
LABLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LABWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1016 BYTES                            
