*          DATA SET RESFMF8SD  AT LEVEL 018 AS OF 09/27/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818F8D      DATE 09/27/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
SWITYPH  DS    CL8                                                              
SWITYP   DS    CL11     6   20   11  A  U N             T        Y   10         
SWITYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      6   38    8  A  P H             T        Y              
SWIOLDH  DS    CL8                                                              
SWIOLD   DS    CL10     6   47   10  A  U N             T        Y   20         
SWIOLDX  DS    CL8                                                              
SWIOLDNH DS    CL8                                                              
SWIOLDN  DS    CL20     6   59   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
SWISEQH  DS    CL8                                                              
SWISEQ   DS    CL5      7   20    5  A  U N             T        Y   30         
SWISEQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   59    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
SWINEWH  DS    CL8                                                              
SWINEW   DS    CL10     9   16   10  A  U N             T        Y   40         
SWINEWX  DS    CL8                                                              
SWINEWNH DS    CL8                                                              
SWINEWN  DS    CL20     9   33   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SWIF1H   DS    CL8                                                              
SWIF1    DS    CL14    10   16   14  A  U N             T        Y   50         
SWIF1X   DS    CL8                                                              
SWIF1NH  DS    CL8                                                              
SWIF1N   DS    CL20    10   33   20  A  P N             T        Y              
SWIF2H   DS    CL8                                                              
SWIF2    DS    CL14    11   16   14  A  U N             T        Y   50         
SWIF2X   DS    CL8                                                              
SWIF2NH  DS    CL8                                                              
SWIF2N   DS    CL20    11   33   20  A  P N             T        Y              
SWIF3H   DS    CL8                                                              
SWIF3    DS    CL14    12   16   14  A  U N             T        Y   50         
SWIF3X   DS    CL8                                                              
SWIF3NH  DS    CL8                                                              
SWIF3N   DS    CL20    12   33   20  A  P N             T        Y              
SWIF4H   DS    CL8                                                              
SWIF4    DS    CL14    13   16   14  A  U N             T        Y   50         
SWIF4X   DS    CL8                                                              
SWIF4NH  DS    CL8                                                              
SWIF4N   DS    CL20    13   33   20  A  P N             T        Y              
SWIF5H   DS    CL8                                                              
SWIF5    DS    CL14    14   16   14  A  U N             T        Y   50         
SWIF5X   DS    CL8                                                              
SWIF5NH  DS    CL8                                                              
SWIF5N   DS    CL20    14   33   20  A  P N             T        Y              
SWIF6H   DS    CL8                                                              
SWIF6    DS    CL14    15   16   14  A  U N             T        Y   50         
SWIF6X   DS    CL8                                                              
SWIF6NH  DS    CL8                                                              
SWIF6N   DS    CL20    15   33   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
SWISTAH  DS    CL8                                                              
SWISTA   DS    CL8     16   16    8  A  U N             T        Y   60         
SWISTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
SWIREQH  DS    CL8                                                              
SWIREQ   DS    CL8     17   16    8  A  U N             T        Y   70         
SWIREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P Z             T        Y              
SWIOPTH  DS    CL8                                                              
SWIOPT   DS    CL50    18   16   50  A  P Z             T        Y   80         
SWIOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   76    1  A  U N             T        Y              
SWILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SWIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
