*          DATA SET RESFMF3D   AT LEVEL 010 AS OF 10/05/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818F3D      DATE 10/05/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11  A   P    H         T        Y              
DPTDTCH  DS    CL8                                                              
DPTDTC   DS    CL1      5   15    1  A   U    N         T        Y   10         
DPTDTCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   17    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A   P    H         T        Y              
DPTDTNH  DS    CL8                                                              
DPTDTN   DS    CL5      5   28    5  A   U    N         T        Y   20         
DPTDTNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22     7    2   22  A   P    H         T        Y              
DPTSCCH  DS    CL8                                                              
DPTSCC   DS    CL1      8    2    1  A   U    N         T        Y              
DPTSCNH  DS    CL8                                                              
DPTSCN   DS    CL5      8   12    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      9   12    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     10   12    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   12    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   12    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   12    5  A   U    N         T        Y              
DPTFLGH  DS    CL8                                                              
DPTFLG   DS    CL1     15   79    1  A   U    N         T        Y              
DPTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 256  BYTES                            
