*          DATA SET RESFMA7D   AT LEVEL 017 AS OF 09/27/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818A7D      DATE 09/27/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
DNASALH  DS    CL8                                                              
DNASAL   DS    CL3      5   10    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
DNATEAMH DS    CL8                                                              
DNATEAM  DS    CL2      5   28    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     6   38   12  A  P N             T        Y              
DNADATEH DS    CL8                                                              
DNADATE  DS    CL8      6   51    8  A  P N             T        Y              
DNASTA1H DS    CL8                                                              
DNASTA1  DS    CL6      7    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   66    6  A  U N             T        Y              
DNASTALH DS    CL8                                                              
DNASTAL  DS    CL6     14   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    15    2   29  A  P H             T        Y              
DNAAGY1H DS    CL8                                                              
DNAAGY1  DS    CL6     16    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   66    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23    2    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   42    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   66    6  A  U N             T        Y              
DNAAGYLH DS    CL8                                                              
DNAAGYL  DS    CL6     23   74    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A  P N             T        Y              
DNALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DNAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2400 BYTES                            
