*          DATA SET RESFME5D   AT LEVEL 009 AS OF 10/05/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818E5D      DATE 10/05/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
LSDSTAH  DS    CL8                                                              
LSDSTA   DS    CL7      5   11    7  A   U    N         T        Y   10         
LSDSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   50    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A   P    H         T        Y              
LSDLN5H  DS    CL8                                                              
LSDLN5   DS    CL21     6   10   21  A   P    H         T        Y              
LSDSELH  DS    CL8                                                              
LSDSEL   DS    CL3      7    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56     7   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56     8   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56     9   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    10   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    11   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    12   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    13   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    14   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    15   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    16   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    17   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    18   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    19   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    20   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    21   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    22   10   56  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL56    23   10   56  A   P    N         T        Y              
LSDFLGH  DS    CL8                                                              
LSDFLG   DS    CL1     24   79    1  A   U    N         T        Y              
LSDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LSDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1376 BYTES                            
