*          DATA SET RESFMD9D   AT LEVEL 010 AS OF 02/19/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818D9D      DATE 02/19/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
CMTOFFH  DS    CL8                                                              
CMTOFF   DS    CL2      5   10    2  A   U    N         T        Y   10         
CMTOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   20    4  A   P    H         T        Y              
CMTNUMH  DS    CL8                                                              
CMTNUM   DS    CL2      5   26    2  A   U    N         T        Y   20         
CMTNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   38    4  A   P    Z         T        Y              
CMTPAGH  DS    CL8                                                              
CMTPAG   DS    CL1      5   46    1  A   P    Z         T        Y   30         
CMTPAGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A   P    N         T        Y              
CMTDSCH  DS    CL8                                                              
CMTDSC   DS    CL30     7   14   30  A   U    N         T        Y   40         
CMTDSCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60     9   10   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    10   10   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
CMTCMTH  DS    CL8                                                              
CMTCMT   DS    CL60    11   10   60  A   U    N         T        Y   50         
CMTCMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
CMTCMT2H DS    CL8                                                              
CMTCMT2  DS    CL60    12   10   60  A   U    N         T        Y   50         
CMTCMT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    13   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    14   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    15   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    16   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    17   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    18   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    19   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    20   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    21   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL60    22   10   60  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   78    1  A   P    N         T        Y              
CMTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CMTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1408 BYTES                            
