*          DATA SET RESFM81D   AT LEVEL 003 AS OF 04/22/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T81881D      DATE 04/22/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL28     5    2   28  A  P N             T        Y              
SBULEVH  DS    XL8                                                              
SBULEV   DS    CL1      5   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     5   36   12  A  P N             T        Y              
SBUDESCH DS    XL8                                                              
SBUDESC  DS    CL20     5   52   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   73    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    7    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   20    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     6   27   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   54    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   73    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   76    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
SBUSELH  DS    XL8                                                              
SBUSEL   DS    CL3      7    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71     7    7   71  A  P N             T        Y              
SBULSELH DS    XL8                                                              
SBULSEL  DS    CL3      8    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71     8    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71     9    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    10    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    11    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    12    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    13    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    14    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    15    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    16    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    17    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    18    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    19    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    20    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    21    7   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   79    1  A  P N             T        Y              
SBULAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SBUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1592 BYTES                            
