*          DATA SET RESFME2D   AT LEVEL 003 AS OF 10/05/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818E2D      DATE 10/05/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
OVURPTH  DS    CL8                                                              
OVURPT   DS    CL3      5   10    3  A   U    N         T        Y   10         
OVURPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    H         T        Y              
OVUSVCH  DS    CL8                                                              
OVUSVC   DS    CL4      5   28    4  A   U    N         T        Y   20         
OVUSVCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    N         T        Y              
OVUHEDH  DS    CL8                                                              
OVUHED   DS    CL76     7    2   76  A   P    H         T        Y              
OVUSELH  DS    CL8                                                              
OVUSEL   DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68     8   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68     9   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    10   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    11   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    12   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    13   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    14   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    15   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    16   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    17   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    18   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    19   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    20   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    21   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    22   10   68  A   P    N         T        Y              
OVULAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OVUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1472 BYTES                            
