*          DATA SET RESFMF4D   AT LEVEL 006 AS OF 10/05/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818F4D      DATE 10/05/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
PGTPTCH  DS    CL8                                                              
PGTPTC   DS    CL1      5   13    1  A   U    N         T        Y   10         
PGTPTCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   16    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A   P    H         T        Y              
PGTPTNH  DS    CL8                                                              
PGTPTN   DS    CL12     5   28   12  A   U    N         T        Y   20         
PGTPTNX  DS    CL8                                                              
PGTFLGH  DS    CL8                                                              
PGTFLG   DS    CL1      7   79    1  A   U    N         T        Y              
PGTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PGTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 96   BYTES                            
