*          DATA SET RESFMB6D   AT LEVEL 006 AS OF 02/27/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818B6D      DATE 02/27/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
RSLAGYH  DS    CL8                                                              
RSLAGY   DS    CL4      5   10    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
RSLADVH  DS    CL8                                                              
RSLADV   DS    CL4      5   28    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
RSLPRDH  DS    CL8                                                              
RSLPRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19     7    2   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70     8    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70     9    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    10    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    11    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    12    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    13    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    14    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    15    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    16    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    17    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    18    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    19    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    20    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    21    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    22    7   70  A  P N             T        Y              
RSLTAGH  DS    CL8                                                              
RSLTAG   DS    CL1     22   78    1  A  P N             T        Y              
RSLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1464 BYTES                            
