*          DATA SET RESFMB3D   AT LEVEL 001 AS OF 03/11/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818B3D      DATE 03/11/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL15     6    2   15  A  P N             T        Y              
BCPCONH  DS    XL8                                                              
BCPCON   DS    CL8      6   18    8  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL1      6   28    1  A  P N             T        Y              
BCPCSTAH DS    XL8                                                              
BCPCSTA  DS    CL6      6   32    6  A  P N             T        Y              
BCPCMKTH DS    XL8                                                              
BCPCMKT  DS    CL20     6   39   20  A  P N             T        Y              
BCPCAGYH DS    XL8                                                              
BCPCAGY  DS    CL20     6   60   20  A  P N             T        Y              
BCPM1H   DS    XL8                                                              
BCPM1    DS    CL27     7    2   27  A  P N             T        Y              
BCPDATH  DS    XL8                                                              
BCPDAT   DS    CL18     7   30   18  A  U N             T        Y              
BCPCADVH DS    XL8                                                              
BCPCADV  DS    CL20     7   60   20  A  P N             T        Y              
BCPM2H   DS    XL8                                                              
BCPM2    DS    CL49     8    2   49  A  P N             T        Y              
BCPCCCH  DS    XL8                                                              
BCPCCC   DS    CL1      8   52    1  A  U N             T        Y              
BCPCPRDH DS    XL8                                                              
BCPCPRD  DS    CL20     8   60   20  A  P N             T        Y              
BCPM3H   DS    XL8                                                              
BCPM3    DS    CL30     9    2   30  A  P N             T        Y              
BCPCBCH  DS    XL8                                                              
BCPCBC   DS    CL1      9   33    1  A  U N             T        Y              
BCPM3BH  DS    XL8                                                              
BCPM3B   DS    CL19     9   36   19  A  P N             T        Y              
BCPCPGH  DS    XL8                                                              
BCPCPG   DS    CL1      9   56    1  A  U N             T        Y              
BCPM3CH  DS    XL8                                                              
BCPM3C   DS    CL17     9   59   17  A  P N             T        Y              
BCPCPCH  DS    XL8                                                              
BCPCPC   DS    CL1      9   77    1  A  U N             T        Y              
BCPM4H   DS    XL8                                                              
BCPM4    DS    CL56    11    2   56  A  P N             T        Y              
BCPM5H   DS    XL8                                                              
BCPM5    DS    CL72    12    2   72  A  P N             T        Y              
BCPM6H   DS    XL8                                                              
BCPM6    DS    CL75    13    4   75  A  P N             T        Y              
BCPCON1H DS    XL8                                                              
BCPCON1  DS    CL8     14    4    8  A  U N             T        Y              
BCPSA1H  DS    XL8                                                              
BCPSA1   DS    CL1     14   13    1  A  U N             T        Y              
BCPCON2H DS    XL8                                                              
BCPCON2  DS    CL8     14   20    8  A  U N             T        Y              
BCPSA2H  DS    XL8                                                              
BCPSA2   DS    CL1     14   29    1  A  U N             T        Y              
BCPCON3H DS    XL8                                                              
BCPCON3  DS    CL8     14   36    8  A  U N             T        Y              
BCPSA3H  DS    XL8                                                              
BCPSA3   DS    CL1     14   45    1  A  U N             T        Y              
BCPCON4H DS    XL8                                                              
BCPCON4  DS    CL8     14   52    8  A  U N             T        Y              
BCPSA4H  DS    XL8                                                              
BCPSA4   DS    CL1     14   61    1  A  U N             T        Y              
BCPCON5H DS    XL8                                                              
BCPCON5  DS    CL8     14   68    8  A  U N             T        Y              
BCPSA5H  DS    XL8                                                              
BCPSA5   DS    CL1     14   77    1  A  U N             T        Y              
BCPCONRH DS    XL8                                                              
BCPCONR  DS    CL8     15    4    8  A  U N             T        Y              
BCPSARH  DS    XL8                                                              
BCPSAR   DS    CL1     15   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   68    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   68    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   68    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   68    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   68    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   68    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   13    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   61    1  A  U N             T        Y              
BCPCONXH DS    XL8                                                              
BCPCONX  DS    CL8     21   68    8  A  U N             T        Y              
BCPSAXH  DS    XL8                                                              
BCPSAX   DS    CL1     21   77    1  A  U N             T        Y              
BCPSTATH DS    XL8                                                              
BCPSTAT  DS    CL1     21   79    1  A  P Z             T        Y              
BCPLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BCPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
