*          DATA SET RESFMA5SD  AT LEVEL 035 AS OF 02/03/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818A5D      DATE 02/03/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SC3LA1H  DS    CL8                                                              
SC3LA1   DS    CL29    10    2   29  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
SC3VA1H  DS    CL8                                                              
SC3VA1   DS    CL60    11   19   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    12    2   15  A  P N             T        Y              
SC3NC1H  DS    CL8                                                              
SC3NC1   DS    CL60    12   19   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
SC3NW1H  DS    CL8                                                              
SC3NW1   DS    CL60    13   19   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14    2   15  A  P N             T        Y              
SC3NM1H  DS    CL8                                                              
SC3NM1   DS    CL60    14   19   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15    2   15  A  P N             T        Y              
SC3NS1H  DS    CL8                                                              
SC3NS1   DS    CL60    15   19   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    16    2   15  A  P N             T        Y              
SC3NO1H  DS    CL8                                                              
SC3NO1   DS    CL60    16   19   60  A  U N             T        Y              
SC3MLLH  DS    CL8                                                              
SC3MLL   DS    CL29    17    2   29  A  P H             T        Y              
SC3VALH  DS    CL8                                                              
SC3VAL   DS    CL15    18    2   15  A  P N             T        Y              
SC3VA2H  DS    CL8                                                              
SC3VA2   DS    CL60    18   19   60  A  U N             T        Y              
SC3NCLH  DS    CL8                                                              
SC3NCL   DS    CL15    19    2   15  A  P N             T        Y              
SC3NC2H  DS    CL8                                                              
SC3NC2   DS    CL60    19   19   60  A  U N             T        Y              
SC3NWLH  DS    CL8                                                              
SC3NWL   DS    CL15    20    2   15  A  P N             T        Y              
SC3NW2H  DS    CL8                                                              
SC3NW2   DS    CL60    20   19   60  A  U N             T        Y              
SC3NMLH  DS    CL8                                                              
SC3NML   DS    CL15    21    2   15  A  P N             T        Y              
SC3NM2H  DS    CL8                                                              
SC3NM2   DS    CL60    21   19   60  A  U N             T        Y              
SC3NSLH  DS    CL8                                                              
SC3NSL   DS    CL15    22    2   15  A  P N             T        Y              
SC3NS2H  DS    CL8                                                              
SC3NS2   DS    CL60    22   19   60  A  U N             T        Y              
SC3NOLH  DS    CL8                                                              
SC3NOL   DS    CL15    23    2   15  A  P N             T        Y              
SC3NO2H  DS    CL8                                                              
SC3NO2   DS    CL60    23   19   60  A  U N             T        Y              
SC3PFKH  DS    CL8                                                              
SC3PFK   DS    CL11    24    2   11  A  P Z             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1192 BYTES                            
