*          DATA SET RESFMBED   AT LEVEL 004 AS OF 02/27/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818BED      DATE 02/27/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SONSTAH  DS    CL8                                                              
SONSTA   DS    CL6      5   11    6  A  U N             T        Y   10         
SONSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
SONBOXH  DS    CL8                                                              
SONBOX   DS    CL6      5   28    6  A  U N             T        Y   20         
SONBOXX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SONFILH  DS    CL8                                                              
SONFIL   DS    CL30     5   46   30  A  U N             T        Y   40         
SONFILX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL42     7    2   42  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL34     7   44   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71     8    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71     9    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    10    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    11    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    12    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    13    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    14    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    15    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    16    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    17    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    18    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    19    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    20    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    21    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL71    22    7   71  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   79    1  A  P N             T        Y              
SONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1600 BYTES                            
