*          DATA SET RESFMC2D   AT LEVEL 006 AS OF 08/06/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818C2D      DATE 08/06/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
LDECONH  DS    CL8                                                              
LDECON   DS    CL8      5   10    8  A   U    H         T    I   Y   10         
LDECONX  DS    CL8                                                              
LDESTNH  DS    CL8                                                              
LDESTN   DS    CL6      5   20    6  A   P    N         T        Y              
LDEMKTNH DS    CL8                                                              
LDEMKTN  DS    CL20     5   28   20  A   P    N         T        Y              
LDEAGYH  DS    CL8                                                              
LDEAGY   DS    CL20     5   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
LDEHDRH  DS    CL8                                                              
LDEHDR   DS    CL8      6   10    8  A   U    H         T        Y   20         
LDEHDRX  DS    CL8                                                              
LDEDATEH DS    CL8                                                              
LDEDATE  DS    CL17     6   20   17  A   P    N         T        Y              
LDEADVH  DS    CL8                                                              
LDEADV   DS    CL20     6   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    N         T        Y              
LDELINH  DS    CL8                                                              
LDELIN   DS    CL8      7   10    8  A   U    H         T        Y   30         
LDELINX  DS    CL8                                                              
LDESALH  DS    CL8                                                              
LDESAL   DS    CL20     7   20   20  A   P    N         T        Y              
LDEPROH  DS    CL8                                                              
LDEPRO   DS    CL20     7   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   76    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    H         T        Y              
LDEHDSH  DS    CL8                                                              
LDEHDS   DS    CL37     8    6   37  A   P    H         T        Y              
LDEHDS2H DS    CL8                                                              
LDEHDS2  DS    CL19     8   49   19  A   P    H         T        Y              
LDESELH  DS    CL8                                                              
LDESEL   DS    CL3      9    2    3  A   U    N         T        Y              
LDELNUMH DS    CL8                                                              
LDELNUM  DS    CL3      9    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      9   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     9   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     9   63   16  A   U    N         T        Y              
LDESEL2H DS    CL8                                                              
LDESEL2  DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    10   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    10   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    11   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    11   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     12   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    12   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    12   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     13   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    13   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    13   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     14   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    14   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    14   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    14   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     15   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    15   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    15   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    15   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     16   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    16   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    16   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    16   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     17   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    17   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    17   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    17   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     18   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    18   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    18   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    18   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     19   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    19   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    19   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    19   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     20   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    20   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    20   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    20   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     21   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   17    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    21   23   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   39    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   47    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    21   49   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   61    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    21   63   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    23    2   11  A   P    H         T        Y   99         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    23   16   10  A   P    H         T        Y   99         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23   29    7  A   P    H         T        Y   99         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    23   39   10  A   P    H         T        Y   99         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     23   52    9  A   P    H         T        Y   99         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     23   62    9  A   P    H         T        Y   99         
         DS    CL8                                                              
LDETAGH  DS    CL8                                                              
LDETAG   DS    CL1     23   78    1  A   P    N         T        Y              
LDELAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LDEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2656 BYTES                            
