*          DATA SET RESFMDBD   AT LEVEL 011 AS OF 11/08/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818DBD      DATE 11/08/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
GOLSTATH DS    CL8                                                              
GOLSTAT  DS    CL7      5   14    7  A  U H             T        Y              
GOLLOCAH DS    CL8                                                              
GOLLOCA  DS    CL20     5   28   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     5   56   11  A  P N             T        Y              
GOLLDATH DS    CL8                                                              
GOLLDAT  DS    CL8      5   68    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
GOLPERIH DS    CL8                                                              
GOLPERI  DS    CL20     6   14   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   40    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     6   56   10  A  P N             T        Y              
GOLSGOLH DS    CL8                                                              
GOLSGOL  DS    CL8      6   68    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
GOLCTIDH DS    CL8                                                              
GOLCTID  DS    CL8      7   14    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   28   11  A  P N             T        Y              
GOLDESCH DS    CL8                                                              
GOLDESC  DS    CL25     7   41   25  A  P N             T        Y              
GOLPAGEH DS    CL8                                                              
GOLPAGE  DS    CL7      7   72    7  A  P N             T        Y              
GOLHACCH DS    CL8                                                              
GOLHACC  DS    CL7      9    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   34    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   42   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     9   55   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     9   70   10  A  P N             T        Y              
GOLACCH  DS    CL8                                                              
GOLACC   DS    CL30    10    2   30  A  U N             T        Y              
GOLOFFH  DS    CL8                                                              
GOLOFF   DS    CL2     10   34    2  A  U N             T        Y              
GOLPSHRH DS    CL8                                                              
GOLPSHR  DS    CL3     10   42    3  N  U N             T        Y              
GOLPDOLH DS    CL8                                                              
GOLPDOL  DS    CL12    10   55   12  N  U N             T        Y              
GOLSHRGH DS    CL8                                                              
GOLSHRG  DS    CL3     10   70    3  N  U N             T        Y              
GOLACC2H DS    CL8                                                              
GOLACC2  DS    CL30    11    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    12    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    13    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    14    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    15    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    16    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    17    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    18    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    19    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL30    20    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   70    3  N  U N             T        Y              
GOLLACCH DS    CL8                                                              
GOLLACC  DS    CL30    21    2   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   42    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   55   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   70    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     23    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    23   14   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    23   26   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    23   38   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     23   50    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     23   62    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A  P N             T        Y              
GOLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
GOLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1568 BYTES                            
