*          DATA SET RESFMFBD   AT LEVEL 018 AS OF 10/29/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818FBD      DATE 10/29/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
MKTMKTH  DS    CL8                                                              
MKTMKT   DS    CL4      5   20    4  A  U N             T    I   Y   10         
MKTMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   76    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
MKTMKTNH DS    CL8                                                              
MKTMKTN  DS    CL20     7   20   20  A  U N             T        Y   60         
MKTMKTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
MKTSIDH  DS    CL8                                                              
MKTSID   DS    CL9      8   20    9  A  U N             T        Y   65         
MKTSIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8   33    9  A  U N             T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8   46    9  A  U N             T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8   59    9  A  U N             T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
MKTSTATH DS    CL8                                                              
MKTSTAT  DS    CL6     11    2    6  A  U N             T        Y   70         
MKTSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     23    2    6  A  U N             T        Y   70         
         DS    CL8                                                              
MKTLSTH  DS    CL8                                                              
MKTLST   DS    CL1     24    2    1  A  U N             T        Y              
MKTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MKTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 528  BYTES                            
