*          DATA SET RESFM9AD   AT LEVEL 016 AS OF 12/13/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T8189AD      DATE 12/13/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
TKASRCEH DS    CL8                                                              
TKASRCE  DS    CL8      5   10    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
TKAKADVH DS    CL8                                                              
TKAKADV  DS    CL4      6    7    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   13    3  A  P N             T        Y              
TKAKAGYH DS    CL8                                                              
TKAKAGY  DS    CL6      6   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   26    3  A  P N             T        Y              
TKAKSALH DS    CL8                                                              
TKAKSAL  DS    CL3      6   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   35    3  A  P N             T        Y              
TKAKTYPH DS    CL8                                                              
TKAKTYP  DS    CL1      6   40    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    7    6  A  P H             T        Y              
TKASRCH  DS    CL8                                                              
TKASRC   DS    CL6      7   17    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     7   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      7   76    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
TKAIFLDH DS    CL8                                                              
TKAIFLD  DS    CL8      8    7    8  A  P H             T        Y              
TKAHFLDH DS    CL8                                                              
TKAHFLD  DS    CL11     8   17   11  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     8   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   53    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   76    3  A  P Z             T        Y              
TKAACTH  DS    CL8                                                              
TKAACT   DS    CL3      9    2    3  A  U N             T        Y              
TKASTRTH DS    CL8                                                              
TKASTRT  DS    CL8      9    7    8  A  U N             T        Y              
TKACODEH DS    CL8                                                              
TKACODE  DS    CL8      9   17    8  A  U N             T        Y              
TKAEXPH  DS    CL8                                                              
TKAEXP   DS    CL20     9   30   20  A  P N             T        Y              
TKAFINLH DS    CL8                                                              
TKAFINL  DS    CL20     9   53   20  A  P N             T        Y              
TKASOFFH DS    CL8                                                              
TKASOFF  DS    CL2      9   76    2  A  P Z             T        Y              
TKAEXP2H DS    CL8                                                              
TKAEXP2  DS    CL20    10   30   20  A  P N             T        Y              
TKALACTH DS    CL8                                                              
TKALACT  DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    7    8  A  U N             T        Y              
TKALCDEH DS    CL8                                                              
TKALCDE  DS    CL8     11   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   76    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL20    12   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   76    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL20    14   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   76    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL20    16   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   76    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL20    18   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   53   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   76    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL20    20   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   30   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   53   20  A  P N             T        Y              
TKAFINH  DS    CL8                                                              
TKAFIN   DS    CL2     21   76    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL20    22   30   20  A  P N             T        Y              
TKALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TKAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1264 BYTES                            
