*          DATA SET RESFMCFD   AT LEVEL 001 AS OF 05/26/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818CFD      DATE 05/26/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     5    2   14  A  P H             T        Y              
GNRGRUPH DS    CL8                                                              
GNRGRUP  DS    CL2      5   24    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
GNRSTATH DS    CL8                                                              
GNRSTAT  DS    CL7      6   24    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
GNRPERIH DS    CL8                                                              
GNRPERI  DS    CL20     7   24   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL19     8    2   19  A  P N             T        Y              
GNRDATEH DS    CL8                                                              
GNRDATE  DS    CL10     8   24   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    10    2   29  A  P N             T        Y              
GNRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
GNRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 192  BYTES                            
