*          DATA SET RESFMB7D   AT LEVEL 013 AS OF 04/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818B7D      DATE 04/09/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
RSMAGYH  DS    CL8                                                              
RSMAGY   DS    CL4      5   10    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
RSMADVH  DS    CL8                                                              
RSMADV   DS    CL4      5   28    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
RSMPRDH  DS    CL8                                                              
RSMPRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     7    2   17  A  P N             T        Y              
RSMSPTH  DS    CL8                                                              
RSMSPT   DS    CL4      7   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   38   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     8    2   15  A  P N             T        Y              
RSMCONH  DS    CL8                                                              
RSMCON   DS    CL4      8   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   38   10  A  P N             T        Y              
RSMBUYH  DS    CL8                                                              
RSMBUY   DS    CL6      8   56    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
RSMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RSMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
