*          DATA SET RESFME1D   AT LEVEL 011 AS OF 10/05/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818E1D      DATE 10/05/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
OVLRPTH  DS    CL8                                                              
OVLRPT   DS    CL3      5   10    3  A   U    N         T        Y   10         
OVLRPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    H         T        Y              
OVLSVCH  DS    CL8                                                              
OVLSVC   DS    CL4      5   28    4  A   U    N         T        Y   20         
OVLSVCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A   P    H         T        Y              
OVLMKTH  DS    CL8                                                              
OVLMKT   DS    CL4      5   46    4  A   U    N         T        Y   30         
OVLMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   56    6  A   P    Z         T        Y              
OVLSCNH  DS    CL8                                                              
OVLSCN   DS    CL5      5   64    5  A   P    Z         T        Y              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    N         T        Y              
OVLHEDH  DS    CL8                                                              
OVLHED   DS    CL76     7    2   76  A   P    H         T        Y              
OVLSELH  DS    CL8                                                              
OVLSEL   DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68     8   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68     9   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    10   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    11   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    12   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    13   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    14   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    15   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    16   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    17   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    18   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    19   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    20   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    21   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    22   10   68  A   P    N         T        Y              
OVLFLGH  DS    CL8                                                              
OVLFLG   DS    CL1     24   79    1  A   U    N         T        Y              
OVLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1544 BYTES                            
