*          DATA SET RESFMACDS  AT LEVEL 065 AS OF 04/07/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818ACD      DATE 04/07/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
CTOREPH  DS    CL8                                                              
CTOREP   DS    CL6      5   12    6  A  U N             T        Y   10         
CTOREPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
CTOSTAH  DS    CL8                                                              
CTOSTA   DS    CL6      5   29    6  A  U N             T        Y   10         
CTOSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
CTOOFFH  DS    CL8                                                              
CTOOFF   DS    CL2      5   48    2  A  U N             T        Y   20         
CTOOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     5   56   13  A  P N             T        Y              
CTOAGIH  DS    CL8                                                              
CTOAGI   DS    CL7      5   70    7  A  U N             T        Y   20         
CTOAGIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
CTOSALH  DS    CL8                                                              
CTOSAL   DS    CL3      6   12    3  A  U N             T        Y   20         
CTOSALX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6   20    9  A  P N             T        Y              
CTOTYPH  DS    CL8                                                              
CTOTYP   DS    CL2      6   31    2  A  U N             T        Y   40         
CTOTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6   38    9  A  P N             T        Y              
CTODATEH DS    CL8                                                              
CTODATE  DS    CL9      6   48    9  A  P N             T        Y   40         
CTODATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   60    4  A  P N             T        Y              
CTOOPTH  DS    CL8                                                              
CTOOPT   DS    CL12     6   66   12  A  U N             T        Y   10         
CTOOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
CTOHDS1H DS    CL8                                                              
CTOHDS1  DS    CL9      7    7    9  A  P N             T        Y              
CTOHDS2H DS    CL8                                                              
CTOHDS2  DS    CL20     7   17   20  A  P N             T        Y              
CTOHDS3H DS    CL8                                                              
CTOHDS3  DS    CL20     7   38   20  A  P N             T        Y              
CTOHDS4H DS    CL8                                                              
CTOHDS4  DS    CL18     7   59   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
CTOHDS5H DS    CL8                                                              
CTOHDS5  DS    CL8      8    7    8  A  P N             T        Y              
CTOHDS6H DS    CL8                                                              
CTOHDS6  DS    CL22     8   23   22  A  P H             T        Y              
CTOSELH  DS    CL8                                                              
CTOSEL   DS    CL3      9    2    3  A  U N             T        Y              
CTOCONH  DS    CL8                                                              
CTOCON   DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
CTOAGYH  DS    CL8                                                              
CTOAGY   DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
CTONCNH  DS    CL8                                                              
CTONCN   DS    CL8     11    7    8  A  P H             T        Y              
CTONEWH  DS    CL8                                                              
CTONEW   DS    CL5     11   17    5  A  P H             T        Y              
CTONAGH  DS    CL8                                                              
CTONAG   DS    CL7     11   23    7  A  U N             T        Y              
CTONADH  DS    CL8                                                              
CTONAD   DS    CL4     11   32    4  A  U N             T        Y              
CTONSPH  DS    CL8                                                              
CTONSP   DS    CL3     11   38    3  A  U N             T        Y              
CTONTYH  DS    CL8                                                              
CTONTY   DS    CL1     11   43    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    11   59   18  A  P N             T        Y              
CTOSEL1H DS    CL8                                                              
CTOSEL1  DS    CL3     12    2    3  A  U N             T        Y              
CTOCON1H DS    CL8                                                              
CTOCON1  DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    7    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     14   17    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     14   23    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   38    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   43    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    14   59   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     17   17    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     17   23    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   38    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   43    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    17   59   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    7    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     20   17    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     20   23    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   38    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   43    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    20   59   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    7    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     23   17    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     23   23    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   38    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   43    1  A  U N             T        Y              
CTOCNTH  DS    CL8                                                              
CTOCNT   DS    CL18    23   59   18  A  P N             T        Y              
CTOTAGH  DS    CL8                                                              
CTOTAG   DS    CL1     24    2    1  A  P N             T        Y              
CTOLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CTOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1992 BYTES                            
