*          DATA SET RESFM96D   AT LEVEL 049 AS OF 05/22/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T81896D      DATE 05/22/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   17    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   32    6  A  P N             T        Y              
APBPGM1H DS    CL8                                                              
APBPGM1  DS    CL8      9    2    8  A  U N             T        Y              
APBREC1H DS    CL8                                                              
APBREC1  DS    CL8      9   17    8  A  U N             T        Y              
APBACC1H DS    CL8                                                              
APBACC1  DS    CL20     9   32   20  A  U N             T        Y              
APBPGM2H DS    CL8                                                              
APBPGM2  DS    CL8     10    2    8  A  U N             T        Y              
APBREC2H DS    CL8                                                              
APBREC2  DS    CL8     10   17    8  A  U N             T        Y              
APBACC2H DS    CL8                                                              
APBACC2  DS    CL20    10   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   32   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   32   20  A  U N             T        Y              
APBPGMXH DS    CL8                                                              
APBPGMX  DS    CL8     23    2    8  A  U N             T        Y              
APBRECXH DS    CL8                                                              
APBRECX  DS    CL8     23   17    8  A  U N             T        Y              
APBACCXH DS    CL8                                                              
APBACCX  DS    CL20    23   32   20  A  U N             T        Y              
APBPFKH  DS    CL8                                                              
APBPFK   DS    CL76    24    2   76  A  P N             T        Y              
APBLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
APBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1032 BYTES                            
