*          DATA SET RESFMECD   AT LEVEL 012 AS OF 07/01/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818ECD      DATE 07/01/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     6    2   14  A  P Z             T        Y              
AUCGRPH  DS    CL8                                                              
AUCGRP   DS    CL3      6   17    3  A  P N             T        Y   10         
AUCGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   60    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
AUCSTAH  DS    CL8                                                              
AUCSTA   DS    CL10     7   17   10  A  U N             T        Y   20         
AUCSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     7   33   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
AUCPERH  DS    CL8                                                              
AUCPER   DS    CL13     8   17   13  A  U N             T        Y   30         
AUCPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P H             T        Y              
AUCTYPH  DS    CL8                                                              
AUCTYP   DS    CL2      9   17    2  A  U N             T        Y   40         
AUCTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     9   33   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
AUCDAYH  DS    CL8                                                              
AUCDAY   DS    CL11    10   17   11  A  U N             T        Y   50         
AUCDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
AUCLENH  DS    CL8                                                              
AUCLEN   DS    CL19    11   17   19  A  U N             T        Y   60         
AUCLENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
AUCOWNH  DS    CL8                                                              
AUCOWN   DS    CL4     12   17    4  A  U N             T        Y   70         
AUCOWNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   33   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
AUCTVBH  DS    CL8                                                              
AUCTVB   DS    CL4     13   17    4  A  U N             T        Y   80         
AUCTVBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   33   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  P N             T        Y              
AUCRNKH  DS    CL8                                                              
AUCRNK   DS    CL3     14   17    3  A  U N             T        Y   90         
AUCRNKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   33   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
AUCASATH DS    CL8                                                              
AUCASAT  DS    CL9     15   17    9  A  U N             T        Y  100         
AUCASATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
AUCFMTH  DS    CL8                                                              
AUCFMT   DS    CL2     16   17    2  A  U N             T        Y  110         
AUCFMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    16   33   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
AUCFLTH  DS    CL8                                                              
AUCFLT   DS    CL11    17   17   11  A  U N             T        Y  120         
AUCFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17   33   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   44   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
AUCSDPTH DS    CL8                                                              
AUCSDPT  DS    CL2     18   17    2  A  U N             T        Y  130         
AUCSDPTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL31    18   33   31  A  P N             T        Y              
AUCSTOTH DS    CL8                                                              
AUCSTOT  DS    CL2     19   17    2  A  U N             T        Y  140         
AUCSTOTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    19   33   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    19   55   21  A  P N             T        Y              
AUCSTTLH DS    CL8                                                              
AUCSTTL  DS    CL2     20   17    2  A  U N             T        Y  140         
AUCSTTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    20   33   30  A  P N             T        Y              
AUCSDOLH DS    CL8                                                              
AUCSDOL  DS    CL2     21   17    2  A  U N             T        Y  150         
AUCSDOLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    21   33   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   55   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    22   33   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    23   33   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   76    1  A  U N             T        Y              
AUCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AUCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1064 BYTES                            
