*          DATA SET RESFMD4D   AT LEVEL 010 AS OF 08/06/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818D4D      DATE 08/06/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
HDRCONH  DS    CL8                                                              
HDRCON   DS    CL8      5   10    8  A   U    H         T    I   Y   10         
HDRCONX  DS    CL8                                                              
HDRSTNH  DS    CL8                                                              
HDRSTN   DS    CL6      5   20    6  A   P    N         T        Y              
HDRMKTNH DS    CL8                                                              
HDRMKTN  DS    CL20     5   28   20  A   P    N         T        Y              
HDRAGYH  DS    CL8                                                              
HDRAGY   DS    CL20     5   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
HDRHDRH  DS    CL8                                                              
HDRHDR   DS    CL8      6   10    8  A   U    H         T        Y   40         
HDRHDRX  DS    CL8                                                              
HDRDATEH DS    CL8                                                              
HDRDATE  DS    CL17     6   20   17  A   P    N         T        Y              
HDRADVH  DS    CL8                                                              
HDRADV   DS    CL20     6   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    Z         T        Y              
HDRLinH  DS    CL8                                                              
HDRLin   DS    CL8      7   10    8  A   P    Z         T        Y   30         
HDRLinX  DS    CL8                                                              
HDRSALH  DS    CL8                                                              
HDRSAL   DS    CL20     7   20   20  A   P    N         T        Y              
HDRPROH  DS    CL8                                                              
HDRPRO   DS    CL20     7   56   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   76    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      9    2    5  A   P    N         T        Y              
HDRBKSH  DS    CL8                                                              
HDRBKS   DS    CL60     9   10   60  A   U    H         T        Y   90         
HDRBKSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10    2    5  A   P    N         T        Y              
HDRDEMH  DS    CL8                                                              
HDRDEM   DS    CL65    10   10   65  A   U    H         T        Y  100         
HDRDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    H         T        Y              
HDRLENH  DS    CL8                                                              
HDRLEN   DS    CL30    11   10   30  A   U    H         T        Y  110         
HDRLENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13    2    5  A   P    Z         T        Y              
HDRWKSH  DS    CL8                                                              
HDRWKS   DS    CL18    13   10   18  A   P    Z         T        Y  120         
HDRWKSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13   30    5  A   P    Z         T        Y              
HDRDTSH  DS    CL8                                                              
HDRDTS   DS    CL18    13   36   18  A   P    Z         T        Y  125         
HDRDTSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13   56    4  A   P    Z         T        Y              
HDRCOSH  DS    CL8                                                              
HDRCOS   DS    CL9     13   62    9  A   P    Z         T        Y   50         
HDRCOSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   P    N         T        Y              
HDRPJ1H  DS    CL8                                                              
HDRPJ1   DS    CL44    14   10   44  A   U    H         T        Y  130         
HDRPJ1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   P    N         T        Y              
HDRPJ2H  DS    CL8                                                              
HDRPJ2   DS    CL44    15   10   44  A   U    H         T        Y  130         
HDRPJ2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
HDRCOM1H DS    CL8                                                              
HDRCOM1  DS    CL60    16   10   60  A   U    H         T        Y  150         
HDRCOM1X DS    CL8                                                              
HDRCOM2H DS    CL8                                                              
HDRCOM2  DS    CL60    17   10   60  A   U    H         T        Y  150         
HDRCOM2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18    2    4  A   P    N         T        Y              
HDRDPT1H DS    CL8                                                              
HDRDPT1  DS    CL60    18   10   60  A   U    H         T        Y  160         
HDRDPT1X DS    CL8                                                              
HDRDPT2H DS    CL8                                                              
HDRDPT2  DS    CL60    19   10   60  A   U    H         T        Y  160         
HDRDPT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    23    2   11  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    23   16   10  A   P    H         T        Y              
HDRLSTH  DS    CL8                                                              
HDRLST   DS    CL1     23   76    1  A   U    N         T        Y              
HDRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HDRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1200 BYTES                            
