*          DATA SET RESFMBAD   AT LEVEL 017 AS OF 09/13/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T818BAD      DATE 09/13/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
EOPTRAFH DS    CL8                                                              
EOPTRAF  DS    CL1      5   10    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
EOPSTATH DS    CL8                                                              
EOPSTAT  DS    CL7      5   28    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
EOPKADVH DS    CL8                                                              
EOPKADV  DS    CL4      6    7    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   13    3  A  P N             T        Y              
EOPKAGYH DS    CL8                                                              
EOPKAGY  DS    CL6      6   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   26    3  A  P N             T        Y              
EOPKOFFH DS    CL8                                                              
EOPKOFF  DS    CL2      6   31    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   35    3  A  P N             T        Y              
EOPKSALH DS    CL8                                                              
EOPKSAL  DS    CL3      6   40    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    7    8  A  P N             T        Y              
EOPHFLDH DS    CL8                                                              
EOPHFLD  DS    CL6      8   17    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     8   25   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   47    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   57    6  A  P N             T        Y              
EOPACTH  DS    CL8                                                              
EOPACT   DS    CL3      9    2    3  A  U N             T        Y              
EOPSTRTH DS    CL8                                                              
EOPSTRT  DS    CL8      9    7    8  A  U N             T        Y              
EOPCODEH DS    CL8                                                              
EOPCODE  DS    CL6      9   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     9   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   57    8  A  P N             T        Y              
EOPLACTH DS    CL8                                                              
EOPLACT  DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    7    8  A  U N             T        Y              
EOPLCDEH DS    CL8                                                              
EOPLCDE  DS    CL6     10   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    10   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   17    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    23   25   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   47    8  A  P N             T        Y              
EOPFINH  DS    CL8                                                              
EOPFIN   DS    CL8     23   57    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   79    1  A  P N             T        Y              
EOPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
EOPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
