*          DATA SET RESPLD9D   AT LEVEL 010 AS OF 06/14/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T808D9D      DATE 06/14/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
TITSTATH DS    CL8                                                              
TITSTAT  DS    CL7      6   18    7  A   U    N         T    I   Y              
TITMKTH  DS    CL8                                                              
TITMKT   DS    CL24     6   34   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
TITSVCH  DS    CL8                                                              
TITSVC   DS    CL1      7   18    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL39     7   34   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
TITDPTH  DS    CL8                                                              
TITDPT   DS    CL19     8   18   19  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
TITFILTH DS    CL8                                                              
TITFILT  DS    CL6      9   18    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
TITDETH  DS    CL8                                                              
TITDET   DS    CL1     10   18    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    10   34   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A   P    N         T        Y              
TITDELH  DS    CL8                                                              
TITDEL   DS    CL2     12   18    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24    12   34   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     14    2    9  A   P    N         T        Y              
TITTYPH  DS    CL8                                                              
TITTYP   DS    CL1     14   18    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL37    14   34   37  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    16    2   11  A   P    N         T        Y              
TITBKRGH DS    CL8                                                              
TITBKRG  DS    CL15    16   18   15  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL46    16   34   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    18    2   14  A   P    N         T        Y              
TITSTRTH DS    CL8                                                              
TITSTRT  DS    CL8     18   18    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19    2   12  A   P    N         T        Y              
TITENDH  DS    CL8                                                              
TITEND   DS    CL8     19   18    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A   P    N         T        Y              
TITREVH  DS    CL8                                                              
TITREV   DS    CL1     21   18    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL31    21   34   31  A   P    N         T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 625  BYTES                            
