*          DATA SET RESPLD8D   AT LEVEL 006 AS OF 05/13/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T808D8D      DATE 05/13/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
TITSRCEH DS    CL8                                                              
TITSRCE  DS    CL3      6   13    3  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A   P    N         T        Y              
TITBOOKH DS    CL8                                                              
TITBOOK  DS    CL7      7   13    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
TITTOH   DS    CL8                                                              
TITTO    DS    CL7      8   13    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
TITUPH   DS    CL8                                                              
TITUP    DS    CL25     9   13   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
TITSTATH DS    CL8                                                              
TITSTAT  DS    CL7     10   13    7  A   U    N         T        Y              
TITMKTH  DS    CL8                                                              
TITMKT   DS    CL24    10   22   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    N         T        Y              
TITDPTH  DS    CL8                                                              
TITDPT   DS    CL19    12   13   19  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
TITOPTH  DS    CL8                                                              
TITOPT   DS    CL2     14   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL26    14   22   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  A   P    N         T        Y              
TITSTRTH DS    CL8                                                              
TITSTRT  DS    CL9     15   13    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A   P    N         T        Y              
TITENDH  DS    CL8                                                              
TITEND   DS    CL9     16   13    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A   P    N         T        Y              
TITFILTH DS    CL8                                                              
TITFILT  DS    CL6     17   13    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A   P    N         T        Y              
TITDETH  DS    CL8                                                              
TITDET   DS    CL1     18   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL29    18   22   29  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19    2   10  A   P    N         T        Y              
TITACTH  DS    CL8                                                              
TITACT   DS    CL1     19   13    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL39    19   22   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   13    1  A   U    N         T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 545  BYTES                            
