*          DATA SET RESPLD7D   AT LEVEL 004 AS OF 05/13/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T808D7D      DATE 05/13/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
TITSRCEH DS    CL8                                                              
TITSRCE  DS    CL3      6   13    3  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    N         T        Y              
TITBOOKH DS    CL8                                                              
TITBOOK  DS    CL7      7   13    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
TITSTATH DS    CL8                                                              
TITSTAT  DS    CL7      8   13    7  A   U    N         T        Y              
TITMKTH  DS    CL8                                                              
TITMKT   DS    CL24     8   22   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    N         T        Y              
TITDPTH  DS    CL8                                                              
TITDPT   DS    CL19    10   13   19  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
TITOPTH  DS    CL8                                                              
TITOPT   DS    CL2     12   13    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL26    12   22   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A   P    N         T        Y              
TITSTRTH DS    CL8                                                              
TITSTRT  DS    CL9     13   13    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
TITENDH  DS    CL8                                                              
TITEND   DS    CL9     14   13    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A   P    N         T        Y              
TITFILTH DS    CL8                                                              
TITFILT  DS    CL6     15   13    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   13    1  A   U    N         T        Y              
TITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 325  BYTES                            
