*          DATA SET RESTRF5D   AT LEVEL 010 AS OF 09/06/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80EF5D      DATE 09/06/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
GKCSTATH DS    CL8                                                              
GKCSTAT  DS    CL7      5   10    7  A  U H             T        Y              
GKCLOCAH DS    CL8                                                              
GKCLOCA  DS    CL20     5   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
GKCPERIH DS    CL8                                                              
GKCPERI  DS    CL13     6   10   13  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  A  P N             T        Y              
GKCSGOLH DS    CL8                                                              
GKCSGOL  DS    CL3      6   48    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
GKCLDATH DS    CL8                                                              
GKCLDAT  DS    CL8      6   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
GKCDESCH DS    CL8                                                              
GKCDESC  DS    CL25     7   15   25  A  P N             T        Y              
GKCHGOLH DS    CL8                                                              
GKCHGOL  DS    CL76     9    2   76  A  P N             T        Y              
GKCGOALH DS    CL8                                                              
GKCGOAL  DS    CL76    10    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    11    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    12    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    13    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    14    2   76  A  U N             T        Y              
GKCLGOLH DS    CL8                                                              
GKCLGOL  DS    CL76    15    2   76  A  U N             T        Y              
GKCHKINH DS    CL8                                                              
GKCHKIN  DS    CL76    16    2   76  A  P N             T        Y              
GKCKINVH DS    CL8                                                              
GKCKINV  DS    CL76    17    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    18    2   76  A  U N             T        Y              
GKCLKINH DS    CL8                                                              
GKCLKIN  DS    CL76    19    2   76  A  U N             T        Y              
GKCHCMTH DS    CL8                                                              
GKCHCMT  DS    CL76    20    2   76  A  P N             T        Y              
GKCCMNTH DS    CL8                                                              
GKCCMNT  DS    CL76    21    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    22    2   76  A  U N             T        Y              
GKCLCMTH DS    CL8                                                              
GKCLCMT  DS    CL76    23    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     24    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   11    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   18    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   25    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   39    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   46    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   53    5  A  P H             T        Y              
GKCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
GKCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1568 BYTES                            
