*          DATA SET RESTRF4D   AT LEVEL 005 AS OF 03/17/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80EF4D      DATE 03/17/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
STLGRUPH DS    CL8                                                              
STLGRUP  DS    CL2      5   14    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
STLSTATH DS    CL8                                                              
STLSTAT  DS    CL7      6   14    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
STLPERIH DS    CL8                                                              
STLPERI  DS    CL13     7   14   13  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     9    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   35    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    10    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    11    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    12    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    13    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    14    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    15    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    16    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    17    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    18    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    19    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    20    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    21    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    22    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    23    7   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL72    24    7   72  A  P N             T        Y              
STLTAGH  DS    CL8                                                              
STLTAG   DS    CL1     24   80    1  A  P N             T        Y              
STLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
STLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1520 BYTES                            
