*          DATA SET RESTRF1D   AT LEVEL 020 AS OF 09/06/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80EF1D      DATE 09/06/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SITSTATH DS    CL8                                                              
SITSTAT  DS    CL7      5   10    7  A  U H             T        Y              
SITLOCAH DS    CL8                                                              
SITLOCA  DS    CL20     5   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SITPERIH DS    CL8                                                              
SITPERI  DS    CL13     6   10   13  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  A  P N             T        Y              
SITSGOLH DS    CL8                                                              
SITSGOL  DS    CL3      6   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
SITLDATH DS    CL8                                                              
SITLDAT  DS    CL8      6   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
SITDESCH DS    CL8                                                              
SITDESC  DS    CL25     7   15   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18     9   28   18  A  P N             T        Y              
SITHEADH DS    CL8                                                              
SITHEAD  DS    CL76    10    2   76  A  P N             T        Y              
SITTXTH  DS    CL8                                                              
SITTXT   DS    CL76    11    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    12    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    13    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    14    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    15    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    16    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    17    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    18    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    19    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    20    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    21    2   76  A  U N             T        Y              
SITLTXTH DS    CL8                                                              
SITLTXT  DS    CL76    22    2   76  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     24    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   11    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   18    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   32    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   39    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   46    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   53    5  A  P H             T        Y              
SITLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1432 BYTES                            
