*          DATA SET RESTRFBD   AT LEVEL 003 AS OF 02/17/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80EFBD      DATE 02/17/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     5    2   14  A  P H             T        Y              
SRPGRUPH DS    CL8                                                              
SRPGRUP  DS    CL2      5   24    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SRPSTATH DS    CL8                                                              
SRPSTAT  DS    CL7      6   24    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SRPPERIH DS    CL8                                                              
SRPPERI  DS    CL13     7   24   13  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL19     8    2   19  A  P N             T        Y              
SRPDATEH DS    CL8                                                              
SRPDATE  DS    CL10     8   24   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    10    2   29  A  P N             T        Y              
SRPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SRPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 184  BYTES                            
