*          DATA SET RESTRF9D   AT LEVEL 021 AS OF 03/17/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T80EF9D      DATE 03/17/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
ACCSTATH DS    CL8                                                              
ACCSTAT  DS    CL7      5   10    7  A  U H             T        Y              
ACCLOCAH DS    CL8                                                              
ACCLOCA  DS    CL20     5   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
ACCPERIH DS    CL8                                                              
ACCPERI  DS    CL13     6   10   13  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  A  P N             T        Y              
ACCSGOLH DS    CL8                                                              
ACCSGOL  DS    CL3      6   48    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
ACCLDATH DS    CL8                                                              
ACCLDAT  DS    CL8      6   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
ACCDESCH DS    CL8                                                              
ACCDESC  DS    CL25     7   15   25  A  P N             T        Y              
ACCPAGEH DS    CL8                                                              
ACCPAGE  DS    CL7      7   65    7  A  P N             T        Y              
ACCCREAH DS    CL8                                                              
ACCCREA  DS    CL40     8   38   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   34    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   48    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   55    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   67    7  A  P N             T        Y              
ACCHACCH DS    CL8                                                              
ACCHACC  DS    CL12    10    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   29    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   34    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   46    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   55    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   70    4  A  P N             T        Y              
ACCACCH  DS    CL8                                                              
ACCACC   DS    CL4     11    2    4  A  U N             T        Y              
ACCXACCH DS    CL8                                                              
ACCXACC  DS    CL20    11    7   20  A  P N             T        Y              
ACCOFFH  DS    CL8                                                              
ACCOFF   DS    CL2     11   29    2  A  U N             T        Y              
ACCPSHRH DS    CL8                                                              
ACCPSHR  DS    CL3     11   34    3  N  U N             T        Y              
ACCPDOLH DS    CL8                                                              
ACCPDOL  DS    CL12    11   41   12  N  U N             T        Y              
ACCSHGLH DS    CL8                                                              
ACCSHGL  DS    CL3     11   55    3  N  U N             T        Y              
ACCSDOLH DS    CL8                                                              
ACCSDOL  DS    CL12    11   62   12  N  U N             T        Y              
ACCACC2H DS    CL8                                                              
ACCACC2  DS    CL4     12    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   55    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   62   12  N  U N             T        Y              
ACCLACCH DS    CL8                                                              
ACCLACC  DS    CL4     22    2    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22    7   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   29    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   34    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   41   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   55    3  N  U N             T        Y              
ACCLSDLH DS    CL8                                                              
ACCLSDL  DS    CL12    22   62   12  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     24    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   11    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   18    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   25    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   32    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   39    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   46    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     24   60    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     24   69    7  A  P H             T        Y              
ACCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ACCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
