*          DATA SET RESUNF3D   AT LEVEL 001 AS OF 09/04/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T814F3D      DATE 09/04/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
SCBSTATH DS    CL8                                                              
SCBSTAT  DS    CL7      5   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25     6   27   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   10   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   35   11  A  P Z             T        Y              
SCBNAMEH DS    CL8                                                              
SCBNAME  DS    CL3      8    2    3  A  U N             T        Y              
SCBDESCH DS    CL8                                                              
SCBDESC  DS    CL20     8   10   20  A  U N             T        Y              
SCBRANKH DS    CL8                                                              
SCBRANK  DS    CL2      8   35    2  A  P N             T        Y              
SCBNAM2H DS    CL8                                                              
SCBNAM2  DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     9   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   35    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    10   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   35    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   35    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   35    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   35    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   35    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   35    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   35    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   10   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   35    2  A  P N             T        Y              
SCBTAGH  DS    CL8                                                              
SCBTAG   DS    CL1     17   78    1  A  P N             T        Y              
SCBLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 624  BYTES                            
