*          DATA SET RESUNF2D   AT LEVEL 014 AS OF 06/14/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T814F2D      DATE 06/14/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SOLSTATH DS    CL8                                                              
SOLSTAT  DS    CL7      5   11    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   21    6  A  P N             T        Y              
SOLBXIDH DS    CL8                                                              
SOLBXID  DS    CL3      5   29    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   34    6  A  P N             T        Y              
SOLFILTH DS    CL8                                                              
SOLFILT  DS    CL32     5   42   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37     7    2   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL34     7   39   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL36     8    2   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL29     8   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   69   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    24    6   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    24   34   24  A  P N             T        Y              
SOLTAGH  DS    CL8                                                              
SOLTAG   DS    CL1     24   79    1  A  P N             T        Y              
SOLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SOLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1800 BYTES                            
