*          DATA SET RESUNF1D   AT LEVEL 005 AS OF 09/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T814F1D      DATE 09/09/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SOMSTATH DS    CL8                                                              
SOMSTAT  DS    CL7      5   11    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   21    6  A  P H             T        Y              
SOMBOXIH DS    CL8                                                              
SOMBOXI  DS    CL3      5   29    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      5   35    8  A  P H             T        Y              
SOMCONTH DS    CL8                                                              
SOMCONT  DS    CL8      5   45    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SOMFRBXH DS    CL8                                                              
SOMFRBX  DS    CL3      7   11    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
SOMTOBXH DS    CL8                                                              
SOMTOBX  DS    CL3      8   11    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   20   12  A  P N             T        Y              
SOMAPPRH DS    CL8                                                              
SOMAPPR  DS    CL2      8   34    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SOMCOM1H DS    CL8                                                              
SOMCOM1  DS    CL65     9   10   65  A  U N             T        Y              
SOMCOM2H DS    CL8                                                              
SOMCOM2  DS    CL65    10   10   65  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    2   13  A  P N             T        Y              
SOMSFRPH DS    CL8                                                              
SOMSFRP  DS    CL11    11   20   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SOMHISTH DS    CL8                                                              
SOMHIST  DS    CL50    12   10   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL50    13   10   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL50    14   10   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL50    15   10   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL50    16   10   50  A  P N             T        Y              
SOMHENDH DS    CL8                                                              
SOMHEND  DS    CL50    17   10   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
SOMLCM1H DS    CL8                                                              
SOMLCM1  DS    CL65    18   15   65  A  P N             T        Y              
SOMLCM2H DS    CL8                                                              
SOMLCM2  DS    CL65    19   15   65  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
SOMAGYNH DS    CL8                                                              
SOMAGYN  DS    CL40    20   11   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
SOMADVNH DS    CL8                                                              
SOMADVN  DS    CL40    21   11   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
SOMPRODH DS    CL8                                                              
SOMPROD  DS    CL40    22   11   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23    2    6  A  P N             T        Y              
SOMOFFNH DS    CL8                                                              
SOMOFFN  DS    CL40    23   11   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     24    2    7  A  P N             T        Y              
SOMSALSH DS    CL8                                                              
SOMSALS  DS    CL40    24   11   40  A  P N             T        Y              
SOMTAGH  DS    CL8                                                              
SOMTAG   DS    CL1     24   78    1  A  P N             T        Y              
SOMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SOMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1232 BYTES                            
