*          DATA SET RETST01DX  AT LEVEL 006 AS OF 06/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T802F7D      DATE 06/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      3    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      3   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3   20    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      3   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      3   38    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL31     3   48   31  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   20    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      4   38    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   48    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     4   66   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     5   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   52    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      5   62    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      5   66    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   77    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30     6   12   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   45    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     6   55   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     7    8   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7   26   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7   44   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7   62   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    8   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   26   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   44   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   62   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9    8   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9   26   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9   44   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9   62   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    10    8   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    10   26   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    10   44   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    10   62   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    11   12   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    11   47   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    12   12   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    12   47   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    13   12   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    13   47   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    14   12   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    14   47   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    15   12   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    15   47   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    16   12   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    16   47   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   12   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   47   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   12   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   47   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL69    19   10   69  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL69    20   10   69  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL69    21   10   69  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL69    22   10   69  A  U N             T        Y              
tstLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
tstWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1992 BYTES                            
