*          DATA SET RETVBTAB   AT LEVEL 006 AS OF 01/31/96                      
*                                                                               
**********************************************************************          
*                                                                    *          
*       RETVBTAB --- TVB HARD CODED REGION TABLE                     *          
*                                                                    *          
* ------------------------------------------------------------------ *          
* UPDATE HISTORY:                                                    *          
*                                                                    *          
* MAY04/89 (MRR) --- ADD 'CR' - CENTRAL                              *          
*                                                                    *          
* OCT26/95 (BU ) --- ADD 'MW' - MIDWEST (KATZ)                       *          
*                                                                    *          
* JAN31/96 (BU ) --- ADD 'GO' (GOLD) AND 'GR' (GREEN)                *          
*                                                                    *          
*                                                                    *          
*                                                                    *          
**********************************************************************          
*                                                                               
TVBLST   DS    0CL20                                                            
         DC    CL2'NE',CL18'NEW ENGLAND       '                                 
         DC    CL2'MA',CL18'MIDDLE ATLANTIC   '                                 
         DC    CL2'EN',CL18'EAST NORTH CENTRAL'                                 
         DC    CL2'WN',CL18'WEST NORTH CENTRAL'                                 
         DC    CL2'SA',CL18'SOUTH ATLANTIC    '                                 
         DC    CL2'ES',CL18'EAST SOUTH CENTRAL'                                 
         DC    CL2'WS',CL18'WEST SOUTH CENTRAL'                                 
         DC    CL2'MO',CL18'MOUNTAIN          '                                 
         DC    CL2'PA',CL18'PACIFIC           '                                 
         DC    CL2'ER',CL18'EAST              '                                 
         DC    CL2'CR',CL18'CENTRAL           '                                 
         DC    CL2'MR',CL18'MIDWEST           '                                 
         DC    CL2'MW',CL18'MIDWEST           '                                 
         DC    CL2'WR',CL18'WEST              '                                 
         DC    CL2'PR',CL18'PENNSYLVANIA      '                                 
         DC    CL2'SR',CL18'SOUTH             '                                 
         DC    CL2'GO',CL18'GOLD              '                                 
         DC    CL2'GR',CL18'GREEN             '                                 
         DC    X'FF'                                                            
