*          DATA SET REVIEWFFD  AT LEVEL 001 AS OF 09/23/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T817FFD      DATE 09/23/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BASMSGH  DS    CL8                                                              
BASMSG   DS    CL60     1    2   60  L  P H     4       T        Y              
BASSRVH  DS    CL8                                                              
BASSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     2    2   10  L  P H             T        Y              
BASRECH  DS    CL8                                                              
BASREC   DS    CL8      2   13    8  A  U N             T    I   Y    0         
BASRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     2   23   10  L  P H             T        Y              
BASKEYH  DS    CL8                                                              
BASKEY   DS    CL44     2   34   44  A  U N             T        Y    0         
BASKEYX  DS    CL8                                                              
BASOLY1H DS    CL8                                                              
BASOLY1  DS    CL1      3    2    1  A  U N             T        Y              
BASPFKH  DS    CL8                                                              
BASPFK   DS    CL78    24    2   78  A  P N     4       T        Y  255         
BASPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
