*          DATA SET REWCFMAP   AT LEVEL 111 AS OF 05/02/06                      
*                                                                               
* ELEMENT HEADER ENTRY(MHELD DSECT)                                             
*   ELEMENT DATA ENTIRES(MDELD DSECT)                                           
*   X'00' END OF ELEMENT DATA MARKER                                            
* X'00' END OF HEADERS                                                          
*-------------------------------------------------------------------            
* HEADER MAPCODE EQUATES                                                        
*     HDRQ = RECIEVABLE MAP CODE                                                
*    DATAQ = SEND MAP CODE                                                      
*                                                                               
INITHDRQ EQU   1                                                                
LCONHDRQ EQU   3                                                                
DCONHDRQ EQU   4                                                                
RTGSHDRQ EQU   5                                                                
VHDRHDRQ EQU   6                                                                
**KSHDRQ EQU   7                                                                
STADATAQ EQU   8                                                                
BKSDATAQ EQU   9                                                                
DEMDATAQ EQU   10                                                               
SALDATAQ EQU   11                                                               
ADVDATAQ EQU   12                                                               
PRDDATAQ EQU   13                                                               
AGYDATAQ EQU   14                                                               
REPDATAQ EQU   15                                                               
CONDATAQ EQU   16                                                               
PRFDATAQ EQU   17                                                               
DCTDATAQ EQU   18                                                               
DSPDATAQ EQU   19                                                               
CNTDATAQ EQU   20                                                               
DPTDATAQ EQU   21                                                               
BUYDATAQ EQU   22                                                               
BDYDATAQ EQU   23                                                               
BDTDATAQ EQU   24                                                               
UCONHDRQ EQU   25                                                               
OCMDATAQ EQU   26                                                               
BCONHDRQ EQU   27                                                               
WKSDATAQ EQU   28                                                               
SAADATAQ EQU   29                                                               
MODDATAQ EQU   30                  MOD CODE DATE ELEMENT                        
ORCDATAQ EQU   31                  ORDER COMMENT ELEMENT                        
*___________________________________________________________________            
* ONE OF THESE WILL BE SENT WITH EVERY TRANSACTION                              
*  IF THERE IS AN FE AT THE START AND A FD AT THE END OF A TRANSACTION          
*   THEN DON'T SEND ANY WARNING MESSAGE TO THE PC                               
*                                                                               
FVERHDRQ EQU   X'FE'               VERSION HEADER W/CHECK                       
FVE2HDRQ EQU   X'FD'               VERSION HEADER W/O CHECK                     
*___________________________________________________________________            
FAMAP    DS    0X                  FALINK MAPTABLE                              
*********************************************************************           
* SPECIAL FALINK HEADERS                                                        
*********************************************************************           
*--------------------------------------------------------------------           
* VERSION INFO W/CHECK FOR WARNINGS OR HIGH VERSION REQUIRED                    
*--------------------------------------------------------------------           
FVERREQ  DC    AL1(FVERREQD-*),AL2(FVERHDRQ),AL2(FVERREQX-FVERREQ)              
         DC    X'80'                                                            
FVERREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(FVERVERQ),C'VER# ',AL1(MDTHXQ),AL1(004)          
         DC    X'00'                                                            
FVERREQX EQU   *                                                                
*                                                                               
FVERVERQ EQU   1                                                                
*--------------------------------------------------------------------           
* VERSION INFO W/O CHECK FOR WARNINGS OR HIGH VERSION REQUIRED                  
*--------------------------------------------------------------------           
FVE2REQ  DC    AL1(FVE2REQD-*),AL2(FVE2HDRQ),AL2(FVE2REQX-FVE2REQ)              
         DC    X'80'                                                            
FVE2REQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(FVERVERQ),C'VER# ',AL1(MDTHXQ),AL1(004)          
         DC    X'00'                                                            
FVE2REQX EQU   *                                                                
*********************************************************************           
* RECEIVE HEADERS                                                               
*********************************************************************           
*--------------------------------------------------------------------           
* INITIAL DOWNLOAD REQUEST                                                      
*--------------------------------------------------------------------           
INITREQ  DC    AL1(INITREQD-*),AL2(INITHDRQ),AL2(INITREQX-INITREQ)              
         DC    X'80'                                                            
INITREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(INITSALQ),C'SALSP',AL1(MDTCHQ),AL1(003)          
         DC    X'00'                                                            
INITREQX EQU   *                                                                
         SPACE 1                                                                
INITSALQ EQU   1                                                                
INITRSTQ EQU   2                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* LIST CONTRACT DOWNLOAD REQUEST                                                
*--------------------------------------------------------------------           
LCONREQ  DC    AL1(LCONREQD-*),AL2(LCONHDRQ),AL2(LCONREQX-LCONREQ) '            
         DC    X'80'                                                            
LCONREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(LCSALQ),C'SAL  ',AL1(MDTCHQ),AL1(003)            
FLDLEN   EQU   *-LCONREQD                                                       
         DC    AL1(FLDLEN),AL2(LCSTAQ),C'STA  ',AL1(MDTCHQ),AL1(005)            
         DC    AL1(FLDLEN),AL2(LCFLTSTQ),C'FLTST',AL1(MDTJDQ),AL1(003)          
         DC    AL1(FLDLEN),AL2(LCFLTENQ),C'FLTEN',AL1(MDTJDQ),AL1(003)          
         DC    AL1(FLDLEN),AL2(LCAGYQ),C'AGY  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(LCAOFQ),C'AOF  ',AL1(MDTCHQ),AL1(002)            
         DC    AL1(FLDLEN),AL2(LCADVQ),C'ADV  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(LCSTWQ),C'STA-W',AL1(MDTMDQ),AL1(000)            
         DC    AL1(FLDLEN),AL2(LC#ONQ),C'#ONLY',AL1(MDTMDQ),AL1(000)            
         DC    X'00'                                                            
LCONREQX EQU   *                                                                
         SPACE 3                                                                
LCSALQ   EQU   1                                                                
LCSTAQ   EQU   2                                                                
LCFLTSTQ EQU   3                                                                
LCFLTENQ EQU   4                                                                
LCAGYQ   EQU   5                                                                
LCAOFQ   EQU   6                                                                
LCADVQ   EQU   7                                                                
LCSTWQ   EQU   8                                                                
LC#ONQ   EQU   9                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* LIST CONTRACT DOWNLOAD REQUEST FOR WEB INTERFACE                              
*--------------------------------------------------------------------           
BCONREQ  DC    AL1(BCONREQD-*),AL2(BCONHDRQ),AL2(BCONREQX-BCONREQ) '            
         DC    X'80'                                                            
BCONREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(BCFLTSTQ),C'FLTST',AL1(MDTJDQ),AL1(003)          
         DC    AL1(FLDLEN),AL2(BCFLTENQ),C'FLTEN',AL1(MDTJDQ),AL1(003)          
         DC    AL1(FLDLEN),AL2(BCAGYQ),C'AGY  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(BCAOFQ),C'AOF  ',AL1(MDTCHQ),AL1(002)            
         DC    AL1(FLDLEN),AL2(BCADVQ),C'ADV  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(BCSTWQ),C'STA-W',AL1(MDTMDQ),AL1(000)            
         DC    AL1(FLDLEN),AL2(BC#ONQ),C'#ONLY',AL1(MDTMDQ),AL1(000)            
         DC    AL1(FLDLEN),AL2(BCDETQ),C'DETAL',AL1(MDTMDQ),AL1(000)            
         DC    AL1(FLDLEN),AL2(BCSDAQ),C'S-DAT',AL1(MDTJDQ),AL1(003)            
         DC    AL1(FLDLEN),AL2(BCSTMQ),C'S-TIM',AL1(MDTCHQ),AL1(006)            
         DC    X'00'                                                            
BCONREQX EQU   *                                                                
         SPACE 3                                                                
BCFLTSTQ EQU   1                                                                
BCFLTENQ EQU   2                                                                
BCAGYQ   EQU   3                                                                
BCAOFQ   EQU   4                                                                
BCADVQ   EQU   5                                                                
BCSTWQ   EQU   6                                                                
BC#ONQ   EQU   7                                                                
BCDETQ   EQU   8                                                                
BCSDAQ   EQU   9                                                                
BCSTMQ   EQU   10                                                               
         SPACE 3                                                                
*--------------------------------------------------------------------           
* RATING DATA  DOWNLOAD REQUEST                                                 
*--------------------------------------------------------------------           
RTGSREQ  DC    AL1(RTGSREQD-*),AL2(RTGSHDRQ),AL2(RTGSREQX-RTGSREQ) '            
         DC    X'80'                                                            
RTGSREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(RTRTSRVQ),C'RTSRV',AL1(MDTCHQ),AL1(001)          
         DC    AL1(FLDLEN),AL2(RTTPBKQ),C'TPBK ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(RTT4BKQ),C'T4BK ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(RTPVBKQ),C'PVBK ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(RTTPUPGQ),C'TPUPG',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(RTT4UPGQ),C'T4UPG',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(RTPVUPGQ),C'PVUPG',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(RTDEMOQ),C'DEMO ',AL1(MDTCHQ),AL1(000)           
*                                                                               
         DC    AL1(FLDLEN),AL2(RTSTAQ),C'STA  ',AL1(MDTCHQ),AL1(005)            
         DC    AL1(FLDLEN),AL2(RTDAYQ),C'DAY  ',AL1(MDTBIQ),AL1(001)            
         DC    AL1(FLDLEN),AL2(RTSTIMQ),C'S-TIM',AL1(MDTBIQ),AL1(002)           
         DC    AL1(FLDLEN),AL2(RTETIMQ),C'E-TIM',AL1(MDTBIQ),AL1(002)           
         DC    AL1(FLDLEN),AL2(RTXTIMQ),C'X-TIM',AL1(MDTBIQ),AL1(002)           
         DC    AL1(FLDLEN),AL2(RTDATEQ),C'DATE ',AL1(MDTJDQ),AL1(003)           
         DC    AL1(FLDLEN),AL2(RTEMRKQ),C'EMARK',AL1(MDTMDQ),AL1(000)           
         DC    X'00'                                                            
RTGSREQX EQU   *                                                                
         SPACE 3                                                                
RTRTSRVQ EQU   1                                                                
RTBOOKQ  EQU   2                                                                
RTTPBKQ  EQU   3                                                                
RTT4BKQ  EQU   4                                                                
RTPVBKQ  EQU   5                                                                
RTUPGQ   EQU   6                                                                
RTTPUPGQ EQU   7                                                                
RTT4UPGQ EQU   8                                                                
RTPVUPGQ EQU   9                                                                
RTDEMOQ  EQU   10                                                               
RTSTAQ   EQU   11                                                               
RTDAYQ   EQU   12                                                               
RTSTIMQ  EQU   13                                                               
RTETIMQ  EQU   14                  END TIME FOR PROGRAM                         
RTXTIMQ  EQU   15                  END TIME FOR ORBITS                          
RTDATEQ  EQU   16                  EFFECTIVE DATE(REPLACES END TIME)            
RTEMRKQ  EQU   17                  END OF REQUEST MARKER                        
         SPACE 3                                                                
*--------------------------------------------------------------------           
* VALIDATE HEADER REQUEST                                                       
*--------------------------------------------------------------------           
VHDRREQ  DC    AL1(VHDRREQD-*),AL2(VHDRHDRQ),AL2(VHDRREQX-VHDRREQ) '            
         DC    X'80'                                                            
VHDRREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(VBRTSRVQ),C'RTSRV',AL1(MDTCHQ),AL1(001)          
         DC    AL1(FLDLEN),AL2(VBBOOKQ),C'BOOK ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(VBUPGRDQ),C'UPGRD',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(VBDEMOQ),C'DEMO ',AL1(MDTCHQ),AL1(000)           
         DC    AL1(FLDLEN),AL2(VBUPGNMQ),C'UPGNM',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(VHSTAQ),C'STA  ',AL1(MDTCHQ),AL1(005)            
         DC    AL1(FLDLEN),AL2(VHADVQ),C'ADV  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(VHPRDQ),C'PRD  ',AL1(MDTCHQ),AL1(003)            
         DC    AL1(FLDLEN),AL2(VHAGYQ),C'AGY  ',AL1(MDTCHQ),AL1(004)            
         DC    AL1(FLDLEN),AL2(VHAOFQ),C'AGYOF',AL1(MDTCHQ),AL1(002)            
         DC    AL1(FLDLEN),AL2(VHFLSQ),C'FLTST',AL1(MDTJDQ),AL1(000)            
         DC    AL1(FLDLEN),AL2(VHFLEQ),C'FLTEF',AL1(MDTJDQ),AL1(000)            
         DC    AL1(FLDLEN),AL2(VHCTYPQ),C'CTYP ',AL1(MDTCHQ),AL1(001)           
         DC    AL1(FLDLEN),AL2(VHDCTQ),C'DCTYP',AL1(MDTCHQ),AL1(002)            
         DC    AL1(FLDLEN),AL2(VHDSPQ),C'DSAL ',AL1(MDTCHQ),AL1(003)            
         DC    AL1(FLDLEN),AL2(VHSALQ),C'SAL  ',AL1(MDTCHQ),AL1(003)            
         DC    X'00'                                                            
VHDRREQX EQU   *                                                                
         SPACE 3                                                                
VBRTSRVQ EQU   1                                                                
VBBOOKQ  EQU   2                                                                
VBINBKQ  EQU   30                                                               
VBUPGRDQ EQU   3                                                                
VBNIUPGQ EQU   40                                                               
VBDEMOQ  EQU   4                                                                
VBUPGNMQ EQU   5                   UPGRADE NAME                                 
*                                                                               
VHSTAQ   EQU   10                                                               
VHADVQ   EQU   11                                                               
VHPRDQ   EQU   12                                                               
VHAGYQ   EQU   13                                                               
VHAOFQ   EQU   14                                                               
VHFLSQ   EQU   15                                                               
VHFLEQ   EQU   16                                                               
VHCTYPQ  EQU   17                                                               
VHDCTQ   EQU   18                                                               
VHDSPQ   EQU   19                                                               
VHSALQ   EQU   20                                                               
         SPACE 3                                                                
         EJECT                                                                  
*--------------------------------------------------------------------           
* DOWNLOAD CONTRACT HEADER FIELDS REQUEST                                       
*--------------------------------------------------------------------           
DCONREQ  DC    AL1(DCONREQD-*),AL2(DCONHDRQ),AL2(DCONREQX-DCONREQ) '            
         DC    X'80'                                                            
DCONREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(DCONCONQ),C'CON# ',AL1(MDTPKQ),AL1(005)          
         DC    AL1(FLDLEN),AL2(DCONBUYQ),C'BUYS ',AL1(MDTMDQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(DCONPSDQ),C'POSTS',AL1(MDTJDQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(DCONPEDQ),C'POSTE',AL1(MDTJDQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(DCONSTWQ),C'STA-W',AL1(MDTMDQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(DCONNODQ),C'NODET',AL1(MDTMDQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(DCONNOCQ),C'NOCOM',AL1(MDTMDQ),AL1(000)          
         DC    X'00'                                                            
DCONREQX EQU   *                                                                
         SPACE 1                                                                
DCONCONQ EQU   1                                                                
DCONBUYQ EQU   2                                                                
DCONPSDQ EQU   3                                                                
DCONPEDQ EQU   4                                                                
DCONSTWQ EQU   5                                                                
DCONNODQ EQU   6                                                                
DCONNOCQ EQU   7                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* UPDATE CONTRACT HEADER FIELDS REQUEST                                         
*--------------------------------------------------------------------           
UCONREQ  DC    AL1(UCONREQD-*),AL2(UCONHDRQ),AL2(UCONREQX-UCONREQ) '            
         DC    X'80'                                                            
UCONREQD DS    0AL1                                                             
         DC    AL1(FLDLEN),AL2(UCONCONQ),C'CON# ',AL1(MDTPKQ),AL1(005)          
         DC    AL1(FLDLEN),AL2(UCONACTQ),C'ACTN ',AL1(MDTCHQ),AL1(001)          
         DC    AL1(FLDLEN),AL2(UCONVERQ),C'VER# ',AL1(MDTBIQ),AL1(001)          
         DC    AL1(FLDLEN),AL2(UCONOCMQ),C'OCM  ',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(UCONMKGQ),C'MG-YN',AL1(MDTCHQ),AL1(001)          
         DC    AL1(FLDLEN),AL2(UCONTRFQ),C'UTRAF',AL1(MDTCHQ),AL1(010)          
*MNECS                                                                          
         DC    AL1(FLDLEN),AL2(UCONAGYQ),C'TRAGY',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(UCONADVQ),C'TRADV',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(UCONSOFQ),C'TRSOF',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(UCONSLSQ),C'TRSLS',AL1(MDTCHQ),AL1(000)          
*MNECE                                                                          
*        THE FOLLOWING THREE ENTRIES ARE RECURRING GROUPS                       
         DC    AL1(FLDLEN),AL2(UCONLINQ),C'BUY# ',AL1(MDTBIQ),AL1(001)          
         DC    AL1(FLDLEN),AL2(UCONBOCQ),C'B-OCM',AL1(MDTCHQ),AL1(000)          
         DC    AL1(FLDLEN),AL2(UCONEOBQ),C'EOB  ',AL1(MDTMDQ),AL1(000)          
         DC    X'00'                                                            
UCONREQX EQU   *                                                                
                                                                                
UCONCONQ EQU   1            FALINK : 1=A                                        
UCONACTQ EQU   2                     2=B                                        
UCONVERQ EQU   3                     3=C                                        
UCONOCMQ EQU   4                     4=D                                        
UCONMKGQ EQU   5                     5=E                                        
UCONTRFQ EQU   6                     6=F                                        
*MNECS                                                                          
UCONAGYQ EQU   7                     7=G                                        
UCONADVQ EQU   8                     8=H                                        
UCONSOFQ EQU   9                     9=I                                        
UCONSLSQ EQU   10                   10=J                                        
                                                                                
UCONLINQ EQU   20                   20=T                                        
UCONBOCQ EQU   21                   21=U                                        
UCONEOBQ EQU   30                   30=3                                        
*MNECE                                                                          
                                                                                
         EJECT                                                                  
*********************************************************************           
* SEND HEADERS                                                                  
*********************************************************************           
*--------------------------------------------------------------------           
* STATION DATA                                                                  
*--------------------------------------------------------------------           
STADATA  DC    AL1(STADATAD-*),AL2(STADATAQ),AL2(STADATAX-STADATA)              
         DC    X'80'                                                            
STADATAD DS    0AL1                                                             
STASTAEL DC    AL1(FLDLEN),AL2(0001),C'STA  ',AL1(MDTCHQ),AL1(005)              
STACSTEL DC    AL1(FLDLEN),AL2(0002),C'CSTA ',AL1(MDTCHQ),AL1(005)              
STAMKTEL DC    AL1(FLDLEN),AL2(0003),C'MKT  ',AL1(MDTCHQ),AL1(000)              
STACHNEL DC    AL1(FLDLEN),AL2(0004),C'CHAN ',AL1(MDTCHQ),AL1(003)              
STAAFFEL DC    AL1(FLDLEN),AL2(0005),C'AFFIL',AL1(MDTCHQ),AL1(003)              
STABTYEL DC    AL1(FLDLEN),AL2(0006),C'BKTYP',AL1(MDTCHQ),AL1(001)              
STABKEL  DC    AL1(FLDLEN),AL2(0007),C'BOOK ',AL1(MDTCHQ),AL1(000)              
STAREPEL DC    AL1(FLDLEN),AL2(0008),C'REP  ',AL1(MDTCHQ),AL1(002)              
STAEMLEL DC    AL1(FLDLEN),AL2(0009),C'EMAIL',AL1(MDTCHQ),AL1(000)              
STAMASEL DC    AL1(FLDLEN),AL2(0010),C'MSREP',AL1(MDTCHQ),AL1(002)              
STAEMLYN DC    AL1(FLDLEN),AL2(0011),C'EMLYN',AL1(MDTCHQ),AL1(001)              
*MNECS                                                                          
STATRAF  DC    AL1(FLDLEN),AL2(0012),C'STRAF',AL1(MDTCHQ),AL1(001)              
STAEOPRQ DC    AL1(FLDLEN),AL2(0013),C'EOPRQ',AL1(MDTBIQ),AL1(001)              
STAECYN  DC    AL1(FLDLEN),AL2(0014),C'EC-YN',AL1(MDTBIQ),AL1(001)              
*MNECE                                                                          
         DC    X'00'                                                            
STADATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* BOOK - CONTAINS BOOK INFO FOR AN INVENTORY ITEM/PROGRAM                       
*--------------------------------------------------------------------           
BKSDATA  DC    AL1(BKSDATAD-*),AL2(BKSDATAQ),AL2(BKSDATAX-BKSDATA)              
         DC    X'80'                                                            
BKSDATAD DS    0AL1                                                             
BKSPRGEL DC    AL1(FLDLEN),AL2(0001),C'PSEQ#',AL1(MDTPKQ),AL1(005)              
BKSSEQEL DC    AL1(FLDLEN),AL2(0002),C'BSEQ#',AL1(MDTBIQ),AL1(001)              
BKSUPGEL DC    AL1(FLDLEN),AL2(0003),C'USEQ#',AL1(MDTBIQ),AL1(001)              
BKSFOOEL DC    AL1(FLDLEN),AL2(0004),C'FLUFF',AL1(MDTBIQ),AL1(002)              
BKSFTNEL DC    AL1(FLDLEN),AL2(0005),C'FNOTE',AL1(MDTCHQ),AL1(000)              
BKSNAMEL DC    AL1(FLDLEN),AL2(0006),C'NAME ',AL1(MDTCHQ),AL1(000)              
BKSINVEL DC    AL1(FLDLEN),AL2(0007),C'ISINV',AL1(MDTMDQ),AL1(000)              
         DC    X'00'                                                            
BKSDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* DEMO - CONTAINS DEMO INFO FOR A BOOK                                          
*--------------------------------------------------------------------           
DEMDATA  DC    AL1(DEMDATAD-*),AL2(DEMDATAQ),AL2(DEMDATAX-DEMDATA)              
         DC    X'80'                                                            
DEMDATAD DS    0AL1                                                             
DEMSEQEL DC    AL1(FLDLEN),AL2(0001),C'SEQ# ',AL1(MDTBIQ),AL1(001)              
DEMRTGEL DC    AL1(FLDLEN),AL2(0002),C'RTG  ',AL1(MDTBIQ),AL1(004)              
DEMSHREL DC    AL1(FLDLEN),AL2(0003),C'SHARE',AL1(MDTBIQ),AL1(004)              
DEMLVLEL DC    AL1(FLDLEN),AL2(0004),C'LEVEL',AL1(MDTBIQ),AL1(004)              
DEMNAMEL DC    AL1(FLDLEN),AL2(0005),C'NAME ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
DEMDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* CONTRACT TYPE                                                                 
*--------------------------------------------------------------------           
CNTDATA  DC    AL1(CNTDATAD-*),AL2(CNTDATAQ),AL2(CNTDATAX-CNTDATA)              
         DC    X'80'                                                            
CNTDATAD DS    0AL1                                                             
CNTCTYEL DC    AL1(FLDLEN),AL2(0001),C'CTYPE',AL1(MDTCHQ),AL1(001)              
CNTDSCEL DC    AL1(FLDLEN),AL2(0002),C'DESC ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
CNTDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* DEVELOPMENTAL CONTRACT TYPE                                                   
*--------------------------------------------------------------------           
DCTDATA  DC    AL1(DCTDATAD-*),AL2(DCTDATAQ),AL2(DCTDATAX-DCTDATA)              
         DC    X'80'                                                            
DCTDATAD DS    0AL1                                                             
DCTCTYEL DC    AL1(FLDLEN),AL2(0001),C'DCTYP',AL1(MDTCHQ),AL1(002)              
DCTNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
DCTDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* REP COMPANY                                                                   
*--------------------------------------------------------------------           
REPDATA  DC    AL1(REPDATAD-*),AL2(REPDATAQ),AL2(REPDATAX-REPDATA)              
         DC    X'80'                                                            
REPDATAD DS    0AL1                                                             
REPNAMEL DC    AL1(FLDLEN),AL2(0001),C'NAME ',AL1(MDTCHQ),AL1(033)              
REPADDEL DC    AL1(FLDLEN),AL2(0002),C'ADDR ',AL1(MDTCHQ),AL1(033)              
REPDLREL DC    AL1(FLDLEN),AL2(0003),C'LOWRD',AL1(MDTBIQ),AL1(001)              
REPDHREL DC    AL1(FLDLEN),AL2(0004),C'HIRD ',AL1(MDTBIQ),AL1(001)              
         DC    X'00'                                                            
REPDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* ADVERTISER                                                                    
*--------------------------------------------------------------------           
ADVDATA  DC    AL1(ADVDATAD-*),AL2(ADVDATAQ),AL2(ADVDATAX-ADVDATA)              
         DC    X'80'                                                            
ADVDATAD DS    0AL1                                                             
ADVCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(004)              
ADVNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
ADVDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* PRODUCT                                                                       
*--------------------------------------------------------------------           
PRDDATA  DC    AL1(PRDDATAD-*),AL2(PRDDATAQ),AL2(PRDDATAX-PRDDATA)              
         DC    X'80'                                                            
PRDDATAD DS    0AL1                                                             
PRDCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(003)              
PRDNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
PRDIFFEL DC    AL1(FLDLEN),AL2(0003),C'IS_FF',AL1(MDTMDQ),AL1(000)              
         DC    X'00'                                                            
PRDDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* AGENCY                                                                        
*--------------------------------------------------------------------           
AGYDATA  DC    AL1(AGYDATAD-*),AL2(AGYDATAQ),AL2(AGYDATAX-AGYDATA)              
         DC    X'80'                                                            
AGYDATAD DS    0AL1                                                             
AGYCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(004)              
AGYOFFEL DC    AL1(FLDLEN),AL2(0002),C'OFFCE',AL1(MDTCHQ),AL1(002)              
AGYNAMEL DC    AL1(FLDLEN),AL2(0003),C'NAME ',AL1(MDTCHQ),AL1(000)              
AGYAD0EL DC    AL1(FLDLEN),AL2(0004),C'ADDR0',AL1(MDTCHQ),AL1(000)              
AGYAD1EL DC    AL1(FLDLEN),AL2(0005),C'ADDR1',AL1(MDTCHQ),AL1(000)              
AGYAD2EL DC    AL1(FLDLEN),AL2(0006),C'ADDR2',AL1(MDTCHQ),AL1(000)              
AGYAD3EL DC    AL1(FLDLEN),AL2(0007),C'ADDR3',AL1(MDTCHQ),AL1(000)              
AGYONMEL DC    AL1(FLDLEN),AL2(0008),C'OVNAM',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
AGYDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* SALESPERSON ASSISTNAT                                                         
*--------------------------------------------------------------------           
SAADATA  DC    AL1(SAADATAD-*),AL2(SAADATAQ),AL2(SAADATAX-SAADATA)              
         DC    X'80'                                                            
SAADATAD DS    0AL1                                                             
SAANAMEL DC    AL1(FLDLEN),AL2(0001),C'NAME ',AL1(MDTCHQ),AL1(020)              
SAAEFLEL DC    AL1(FLDLEN),AL2(0002),C'EFLAG',AL1(MDTMDQ),AL1(000)              
SAAEMLEL DC    AL1(FLDLEN),AL2(0003),C'EMAIL',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
SAADATAX EQU   *                                                                
*--------------------------------------------------------------------           
* MOD CODE DATA ELEMENT                                                         
*--------------------------------------------------------------------           
MODDATA  DC    AL1(MODDATAD-*),AL2(MODDATAQ),AL2(MODDATAX-MODDATA)              
         DC    X'80'                                                            
MODDATAD DS    0AL1                                                             
MODVEREL DC    AL1(FLDLEN),AL2(0001),C'VER #',AL1(MDTBIQ),AL1(001)              
MODMODEL DC    AL1(FLDLEN),AL2(0002),C'MODCD',AL1(MDTCHQ),AL1(002)              
         DC    X'00'                                                            
MODDATAX EQU   *                                                                
*--------------------------------------------------------------------           
* ORDER COMMENT ELEMENT (BUYLINE)                                               
*--------------------------------------------------------------------           
ORCDATA  DC    AL1(ORCDATAD-*),AL2(ORCDATAQ),AL2(ORCDATAX-ORCDATA)              
         DC    X'80'                                                            
ORCDATAD DS    0AL1                                                             
ORCCOMEL DC    AL1(FLDLEN),AL2(0001),C'ORDCM',AL1(MDTCHQ),AL1(060)              
         DC    X'00'                                                            
ORCDATAX EQU   *                                                                
*--------------------------------------------------------------------           
* SALESPERSON                                                                   
*--------------------------------------------------------------------           
SALDATA  DC    AL1(SALDATAD-*),AL2(SALDATAQ),AL2(SALDATAX-SALDATA)              
         DC    X'80'                                                            
SALDATAD DS    0AL1                                                             
SALCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(003)              
SALNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
SALTELEL DC    AL1(FLDLEN),AL2(0003),C'TEL# ',AL1(MDTCHQ),AL1(012)              
SALFAXEL DC    AL1(FLDLEN),AL2(0004),C'FAX# ',AL1(MDTCHQ),AL1(012)              
SALTEMEL DC    AL1(FLDLEN),AL2(0005),C'TEAMC',AL1(MDTCHQ),AL1(000)              
SALDIVEL DC    AL1(FLDLEN),AL2(0006),C'DIV  ',AL1(MDTCHQ),AL1(000)              
SALTNMEL DC    AL1(FLDLEN),AL2(0007),C'TEAMN',AL1(MDTCHQ),AL1(000)              
SALSTXEL DC    AL1(FLDLEN),AL2(0008),C'STAEX',AL1(MDTCHQ),AL1(005)              
SALEMLEL DC    AL1(FLDLEN),AL2(0009),C'EMAIL',AL1(MDTCHQ),AL1(000)              
SALOFFEL DC    AL1(FLDLEN),AL2(0010),C'OFF  ',AL1(MDTCHQ),AL1(002)              
SALOFNEL DC    AL1(FLDLEN),AL2(0011),C'OFFNM',AL1(MDTCHQ),AL1(020)              
SALMGREL DC    AL1(FLDLEN),AL2(0012),C'ISMGR',AL1(MDTMDQ),AL1(000)              
SALADDEL DC    AL1(FLDLEN),AL2(0013),C'ADDR ',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
SALDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* DEVELOPMENT SALESPERSON                                                       
*--------------------------------------------------------------------           
DSPDATA  DC    AL1(DSPDATAD-*),AL2(DSPDATAQ),AL2(DSPDATAX-DSPDATA)              
         DC    X'80'                                                            
DSPDATAD DS    0AL1                                                             
DSPCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(003)              
DSPNAMEL DC    AL1(FLDLEN),AL2(0002),C'NAME ',AL1(MDTCHQ),AL1(000)              
DSPTELEL DC    AL1(FLDLEN),AL2(0003),C'TEL# ',AL1(MDTCHQ),AL1(012)              
DSPFAXEL DC    AL1(FLDLEN),AL2(0004),C'FAX# ',AL1(MDTCHQ),AL1(012)              
         DC    X'00'                                                            
DSPDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* CONTRACT DATA (NOT COVERED ELSE WHERE)                                        
*--------------------------------------------------------------------           
CONDATA  DC    AL1(CONDATAD-*),AL2(CONDATAQ),AL2(CONDATAX-CONDATA)              
         DC    X'80'                                                            
CONDATAD DS    0AL1                                                             
CONNUMEL DC    AL1(FLDLEN),AL2(0001),C'CON# ',AL1(MDTPKQ),AL1(005)              
CONFLSEL DC    AL1(FLDLEN),AL2(0002),C'FLTST',AL1(MDTJDQ),AL1(000)              
CONFLEEL DC    AL1(FLDLEN),AL2(0003),C'FLTEN',AL1(MDTJDQ),AL1(000)              
CONBYREL DC    AL1(FLDLEN),AL2(0004),C'BUYER',AL1(MDTCHQ),AL1(020)              
CONAGYEL DC    AL1(FLDLEN),AL2(0005),C'AGY  ',AL1(MDTCHQ),AL1(004)              
CONAOFEL DC    AL1(FLDLEN),AL2(0006),C'AGYOF',AL1(MDTCHQ),AL1(002)              
CONADVEL DC    AL1(FLDLEN),AL2(0007),C'ADV  ',AL1(MDTCHQ),AL1(004)              
CONPRDEL DC    AL1(FLDLEN),AL2(0008),C'P-NAM',AL1(MDTCHQ),AL1(020)              
CONDEMEL DC    AL1(FLDLEN),AL2(0009),C'DEMO ',AL1(MDTCHQ),AL1(006)              
CONDSPEL DC    AL1(FLDLEN),AL2(0010),C'DSAL ',AL1(MDTCHQ),AL1(003)              
CONSALEL DC    AL1(FLDLEN),AL2(0011),C'SAL  ',AL1(MDTCHQ),AL1(003)              
CONDCTEL DC    AL1(FLDLEN),AL2(0012),C'DCTYP',AL1(MDTCHQ),AL1(002)              
CONCTYEL DC    AL1(FLDLEN),AL2(0013),C'CTYP ',AL1(MDTCHQ),AL1(001)              
CONSTAEL DC    AL1(FLDLEN),AL2(0014),C'STA  ',AL1(MDTCHQ),AL1(005)              
CONSIDEL DC    AL1(FLDLEN),AL2(0015),C'SIDE ',AL1(MDTCHQ),AL1(001)              
CONSNDEL DC    AL1(FLDLEN),AL2(0016),C'SENT ',AL1(MDTCHQ),AL1(001)              
CONVEREL DC    AL1(FLDLEN),AL2(0017),C'VER# ',AL1(MDTBIQ),AL1(001)              
CONSDTEL DC    AL1(FLDLEN),AL2(0018),C'SDATE',AL1(MDTCDQ),AL1(000)              
CONSTMEL DC    AL1(FLDLEN),AL2(0019),C'STIME',AL1(MDTCHQ),AL1(006)              
CONREPEL DC    AL1(FLDLEN),AL2(0020),C'REP  ',AL1(MDTCHQ),AL1(002)              
CONTOTEL DC    AL1(FLDLEN),AL2(0021),C'B-TOT',AL1(MDTPKQ),AL1(010)              
CONMODEL DC    AL1(FLDLEN),AL2(0022),C'MOD# ',AL1(MDTBIQ),AL1(001)              
CONWIPEL DC    AL1(FLDLEN),AL2(0023),C'WIP-S',AL1(MDTBIQ),AL1(001)              
CONPCDEL DC    AL1(FLDLEN),AL2(0024),C'PCODE',AL1(MDTCHQ),AL1(003)              
CONMONEL DC    AL1(FLDLEN),AL2(0025),C'MONTH',AL1(MDTJDQ),AL1(000)              
CONDOLEL DC    AL1(FLDLEN),AL2(0026),C'DOL  ',AL1(MDTBIQ),AL1(004)              
CONXOTEL DC    AL1(FLDLEN),AL2(0027),C'T-TOT',AL1(MDTPKQ),AL1(010)              
CONOFFEL DC    AL1(FLDLEN),AL2(0028),C'SAOFF',AL1(MDTCHQ),AL1(002)              
CONSCFEL DC    AL1(FLDLEN),AL2(0029),C'STACF',AL1(MDTMDQ),AL1(000)              
CONSCDEL DC    AL1(FLDLEN),AL2(0030),C'SCFDT',AL1(MDTCDQ),AL1(000)              
CONSCTEL DC    AL1(FLDLEN),AL2(0031),C'SCFTM',AL1(MDTHXQ),AL1(003)              
CONBOOKS DC    AL1(FLDLEN),AL2(0032),C'BOOKS',AL1(MDTCHQ),AL1(008)              
CONCOMNT DC    AL1(FLDLEN),AL2(0033),C'COMNT',AL1(MDTCHQ),AL1(000)              
CONADV   DC    AL1(FLDLEN),AL2(0034),C'ADV  ',AL1(MDTCHQ),AL1(004)              
CONPRD1  DC    AL1(FLDLEN),AL2(0035),C'PRD1 ',AL1(MDTCHQ),AL1(004)              
CONPRD2  DC    AL1(FLDLEN),AL2(0036),C'PRD2 ',AL1(MDTCHQ),AL1(004)              
CONEST   DC    AL1(FLDLEN),AL2(0037),C'EST  ',AL1(MDTCHQ),AL1(010)              
CONTRAF  DC    AL1(FLDLEN),AL2(0038),C'CTRAF',AL1(MDTCHQ),AL1(010)              
*MNECS                                                                          
CONTRAGY DC    AL1(FLDLEN),AL2(0039),C'TRAGY',AL1(MDTCHQ),AL1(010)              
CONEOAGY DC    AL1(FLDLEN),AL2(0039),C'TRAGY',AL1(MDTCHQ),AL1(000)              
                                                                                
CONTRADV DC    AL1(FLDLEN),AL2(0040),C'TRADV',AL1(MDTCHQ),AL1(010)              
CONEOADV DC    AL1(FLDLEN),AL2(0040),C'TRADV',AL1(MDTCHQ),AL1(000)              
                                                                                
CONTRSOF DC    AL1(FLDLEN),AL2(0041),C'TRSOF',AL1(MDTCHQ),AL1(006)              
CONEOSOF DC    AL1(FLDLEN),AL2(0041),C'TRSOF',AL1(MDTCHQ),AL1(006)              
                                                                                
CONTRSLS DC    AL1(FLDLEN),AL2(0042),C'TRSLS',AL1(MDTCHQ),AL1(006)              
CONEOSLS DC    AL1(FLDLEN),AL2(0042),C'TRSLS',AL1(MDTCHQ),AL1(006)              
                                                                                
CONECFLG DC    AL1(FLDLEN),AL2(0043),C'TRECF',AL1(MDTBIQ),AL1(001)              
*MNECE                                                                          
         DC    X'00'                                                            
CONDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* PROFILE DATA                                                                  
*--------------------------------------------------------------------           
PRFDATA  DC    AL1(PRFDATAD-*),AL2(PRFDATAQ),AL2(PRFDATAX-PRFDATA)              
         DC    X'80'                                                            
PRFDATAD DS    0AL1                                                             
PRFCNT1L DC    AL1(FLDLEN),AL2(0001),C'CNT-1',AL1(MDTUSQ),AL1(004)              
PRFCNT2L DC    AL1(FLDLEN),AL2(0002),C'CNT-2',AL1(MDTUSQ),AL1(004)              
PRFWCF1L DC    AL1(FLDLEN),AL2(0003),C'WCF-1',AL1(MDTUSQ),AL1(004)              
         DC    X'00'                                                            
PRFDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* DAYPART (FROM DAYPART ALL MENU DURING INIT REQUEST)                           
*--------------------------------------------------------------------           
DPTDATA  DC    AL1(DPTDATAD-*),AL2(DPTDATAQ),AL2(DPTDATAX-DPTDATA)              
         DC    X'80'                                                            
DPTDATAD DS    0AL1                                                             
DPTCODEL DC    AL1(FLDLEN),AL2(0001),C'CODE ',AL1(MDTCHQ),AL1(000)              
DPTSNMEL DC    AL1(FLDLEN),AL2(0002),C'SNAME',AL1(MDTCHQ),AL1(000)              
DPTLNMEL DC    AL1(FLDLEN),AL2(0003),C'LNAME',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
DPTDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* CONTRACT HEADER ORDER COMMENT                                                 
*--------------------------------------------------------------------           
OCMDATA  DC    AL1(OCMDATAD-*),AL2(OCMDATAQ),AL2(OCMDATAX-OCMDATA)              
         DC    X'80'                                                            
OCMDATAD DS    0AL1                                                             
OCMREPEL DC    AL1(FLDLEN),AL2(0001),C'R-ORD',AL1(MDTCHQ),AL1(000)              
OCMSTAEL DC    AL1(FLDLEN),AL2(0002),C'S-ORD',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
OCMDATAX EQU   *                                                                
         SPACE 3                                                                
*&&DO                                                                           
*  THIS TABLE HAS BEEN MOVED TO REWCF11 AS THAT IS THE ONLY                     
* PLACE IT IS USED. THEY SHOULD BE KEPT IN SYNC THOUGH                          
*--------------------------------------------------------------------           
* CONTRACT HEADER ORDER WORKSHEET DATA                                          
*--------------------------------------------------------------------           
WKSDATA  DC    AL1(WKSDATAD-*),AL2(WKSDATAQ),AL2(WKSDATAX-WKSDATA)              
         DC    X'80'                                                            
WKSDATAD DS    0AL1                                                             
WKSCON   DC    AL1(FLDLEN),AL2(0001),C'CON# ',AL1(MDTCHQ),AL1(008)              
WKSGDATE DC    AL1(FLDLEN),AL2(0002),C'GDATE',AL1(MDTDTQ),AL1(000)              
WKSGTIME DC    AL1(FLDLEN),AL2(0003),C'GTIME',AL1(MDTCHQ),AL1(000)              
WKSVSTAT DC    AL1(FLDLEN),AL2(0004),C'VER  ',AL1(MDTCHQ),AL1(030)              
WKSREVIS DC    AL1(FLDLEN),AL2(0005),C'REVIS',AL1(MDTMDQ),AL1(000)              
WKSCOMBO DC    AL1(FLDLEN),AL2(0006),C'COMBO',AL1(MDTMDQ),AL1(000)              
WKSSTANM DC    AL1(FLDLEN),AL2(0007),C'STA  ',AL1(MDTCHQ),AL1(007)              
WKSREPNM DC    AL1(FLDLEN),AL2(0008),C'REPNM',AL1(MDTCHQ),AL1(033)              
WKSSALNM DC    AL1(FLDLEN),AL2(0009),C'SALNM',AL1(MDTCHQ),AL1(020)              
WKSSALPH DC    AL1(FLDLEN),AL2(0010),C'SALPH',AL1(MDTCHQ),AL1(012)              
WKSSALAS DC    AL1(FLDLEN),AL2(0011),C'SALAS',AL1(MDTCHQ),AL1(009)              
WKSOFFNM DC    AL1(FLDLEN),AL2(0012),C'OFFNM',AL1(MDTCHQ),AL1(020)              
WKSFAX#  DC    AL1(FLDLEN),AL2(0013),C'OFFNM',AL1(MDTCHQ),AL1(030)              
WKSAGYNM DC    AL1(FLDLEN),AL2(0014),C'AGYNM',AL1(MDTCHQ),AL1(033)              
WKSAGYPH DC    AL1(FLDLEN),AL2(0015),C'AGYPH',AL1(MDTCHQ),AL1(012)              
WKSAGYFX DC    AL1(FLDLEN),AL2(0016),C'AGYFX',AL1(MDTCHQ),AL1(012)              
WKSAGYA1 DC    AL1(FLDLEN),AL2(0017),C'AGYA1',AL1(MDTCHQ),AL1(034)              
WKSAGYA2 DC    AL1(FLDLEN),AL2(0018),C'AGYA2',AL1(MDTCHQ),AL1(036)              
WKSAGYA3 DC    AL1(FLDLEN),AL2(0019),C'AGYA3',AL1(MDTCHQ),AL1(036)              
WKSBUYNM DC    AL1(FLDLEN),AL2(0020),C'BUYER',AL1(MDTCHQ),AL1(020)              
WKSADVNM DC    AL1(FLDLEN),AL2(0021),C'ADVNM',AL1(MDTCHQ),AL1(030)              
WKSPROD  DC    AL1(FLDLEN),AL2(0022),C'PROD ',AL1(MDTCHQ),AL1(020)              
WKSEIADV DC    AL1(FLDLEN),AL2(0023),C'EIADV',AL1(MDTCHQ),AL1(004)              
WKSEIPRD DC    AL1(FLDLEN),AL2(0024),C'EIPRD',AL1(MDTCHQ),AL1(004)              
WKSEIEST DC    AL1(FLDLEN),AL2(0025),C'EIEST',AL1(MDTCHQ),AL1(010)              
WKSEIPR2 DC    AL1(FLDLEN),AL2(0026),C'EIPR2',AL1(MDTCHQ),AL1(004)              
WKSPTPNM DC    AL1(FLDLEN),AL2(0027),C'PTPNM',AL1(MDTCHQ),AL1(020)              
WKSFLTST DC    AL1(FLDLEN),AL2(0028),C'FLTST',AL1(MDTDTQ),AL1(000)              
WKSFLTEN DC    AL1(FLDLEN),AL2(0029),C'FLTEN',AL1(MDTDTQ),AL1(000)              
WKSROCM  DC    AL1(FLDLEN),AL2(0030),C'R-OCM',AL1(MDTCHQ),AL1(000)              
WKSSOCM  DC    AL1(FLDLEN),AL2(0031),C'S-OCM',AL1(MDTCHQ),AL1(000)              
WKSCTYP  DC    AL1(FLDLEN),AL2(0032),C'CTYPE',AL1(MDTCHQ),AL1(020)              
WKSDCTY  DC    AL1(FLDLEN),AL2(0033),C'DCTYP',AL1(MDTCHQ),AL1(020)              
WKSDCTYC DC    AL1(FLDLEN),AL2(0034),C'CTCMT',AL1(MDTCHQ),AL1(000)              
WKSDRLK  DC    AL1(FLDLEN),AL2(0035),C'DRLK#',AL1(MDTCHQ),AL1(008)              
WKSDRBRN DC    AL1(FLDLEN),AL2(0036),C'DRBRN',AL1(MDTMDQ),AL1(000)              
WKSDRVAR DC    AL1(FLDLEN),AL2(0037),C'DRVAR',AL1(MDTMDQ),AL1(000)              
WKSDRVO# DC    AL1(FLDLEN),AL2(0038),C'DRVO#',AL1(MDTCHQ),AL1(008)              
WKSDRVC# DC    AL1(FLDLEN),AL2(0039),C'DRVC#',AL1(MDTCHQ),AL1(008)              
WKSDRTP# DC    AL1(FLDLEN),AL2(0040),C'DRTP#',AL1(MDTCHQ),AL1(008)              
WKSHIADT DC    AL1(FLDLEN),AL2(0041),C'HATUS',AL1(MDTCDQ),AL1(000)              
WKSHIACM DC    AL1(FLDLEN),AL2(0042),C'HATCM',AL1(MDTCHQ),AL1(000)              
WKSCHCMT DC    AL1(FLDLEN),AL2(0043),C'CHCMT',AL1(MDTCHQ),AL1(000)              
WKSAGCMT DC    AL1(FLDLEN),AL2(0044),C'AGCMT',AL1(MDTCHQ),AL1(000)              
WKSAGRSK DC    AL1(FLDLEN),AL2(0045),C'AGRSK',AL1(MDTCHQ),AL1(040)              
WKSAGLIA DC    AL1(FLDLEN),AL2(0046),C'AGLIA',AL1(MDTCHQ),AL1(000)              
WKSCVTXT DC    AL1(FLDLEN),AL2(0047),C'CVTXT',AL1(MDTCHQ),AL1(000)              
WKSCVCTL DC    AL1(FLDLEN),AL2(0048),C'CVCTL',AL1(MDTCHQ),AL1(001)              
WKSSPLFC DC    AL1(FLDLEN),AL2(0049),C'SPLFC',AL1(MDTBIQ),AL1(004)              
WKSSPLBD DC    AL1(FLDLEN),AL2(0050),C'SPLBD',AL1(MDTBIQ),AL1(004)              
WKSSPLNA DC    AL1(FLDLEN),AL2(0051),C'SPLNA',AL1(MDTMDQ),AL1(000)              
WKSSPLTT DC    AL1(FLDLEN),AL2(0052),C'SPLTT',AL1(MDTBIQ),AL1(004)              
WKSSPLST DC    AL1(FLDLEN),AL2(0053),C'SPLST',AL1(MDTCHQ),AL1(007)              
WKSSPL$$ DC    AL1(FLDLEN),AL2(0054),C'SPL$$',AL1(MDTBIQ),AL1(004)              
WKSSPLPC DC    AL1(FLDLEN),AL2(0055),C'SPL%%',AL1(MDTBIQ),AL1(004)              
WKSSPLCM DC    AL1(FLDLEN),AL2(0056),C'SPLCM',AL1(MDTBIQ),AL1(000)              
WKSBRTGS DC    AL1(FLDLEN),AL2(0057),C'RTGS ',AL1(MDTCHQ),AL1(003)              
WKSBBOOK DC    AL1(FLDLEN),AL2(0058),C'BBOOK',AL1(MDTCHQ),AL1(009)              
WKSBDEMO DC    AL1(FLDLEN),AL2(0059),C'BDEMO',AL1(MDTCHQ),AL1(010)              
WKSBMKT  DC    AL1(FLDLEN),AL2(0060),C'BMKT ',AL1(MDTCHQ),AL1(003)              
WKSSAEML DC    AL1(FLDLEN),AL2(0061),C'SAEML',AL1(MDTCHQ),AL1(000)              
WKSPTPEM DC    AL1(FLDLEN),AL2(0062),C'PTPEM',AL1(MDTCHQ),AL1(000)              
WKMKTTOT DC    AL1(FLDLEN),AL2(0063),C'MKTTL',AL1(MDTPKQ),AL1(010)              
         DC    X'00'                                                            
WKSDATAX EQU   *                                                                
*&&                                                                             
         SPACE 3                                                                
*--------------------------------------------------------------------           
* BUY DETAILS                                                                   
*--------------------------------------------------------------------           
BUYDATA  DC    AL1(BUYDATAD-*),AL2(BUYDATAQ),AL2(BUYDATAX-BUYDATA)              
         DC    X'80'                                                            
BUYDATAD DS    0AL1                                                             
BUYMLNEL DC    AL1(FLDLEN),AL2(0001),C'MLINE',AL1(MDTBIQ),AL1(001)              
BUYLINEL DC    AL1(FLDLEN),AL2(0002),C'LINE ',AL1(MDTBIQ),AL1(001)              
BUYCOSEL DC    AL1(FLDLEN),AL2(0003),C'COST ',AL1(MDTBIQ),AL1(004)              
BUYTSPEL DC    AL1(FLDLEN),AL2(0004),C'TSPTS',AL1(MDTBIQ),AL1(004)              
BUYTCSEL DC    AL1(FLDLEN),AL2(0005),C'TCOST',AL1(MDTBIQ),AL1(004)              
BUYTWKEL DC    AL1(FLDLEN),AL2(0006),C'TWKS ',AL1(MDTBIQ),AL1(001)              
BUYSDYEL DC    AL1(FLDLEN),AL2(0007),C'SDAY ',AL1(MDTBIQ),AL1(001)              
BUYEDYEL DC    AL1(FLDLEN),AL2(0008),C'EDAY ',AL1(MDTBIQ),AL1(001)              
BUYMINEL DC    AL1(FLDLEN),AL2(0009),C'MIN  ',AL1(MDTMDQ),AL1(000)              
BUYLENEL DC    AL1(FLDLEN),AL2(0010),C'LEN  ',AL1(MDTBIQ),AL1(002)              
BUYDPTEL DC    AL1(FLDLEN),AL2(0011),C'DPT  ',AL1(MDTCHQ),AL1(001)              
BUYDALEL DC    AL1(FLDLEN),AL2(0012),C'DAILY',AL1(MDTMDQ),AL1(000)              
BUYSDTEL DC    AL1(FLDLEN),AL2(0013),C'SDATE',AL1(MDTBDQ),AL1(003)              
BUYEDTEL DC    AL1(FLDLEN),AL2(0014),C'EDATE',AL1(MDTBDQ),AL1(003)              
BUYCOMEL DC    AL1(FLDLEN),AL2(0015),C'COMM1',AL1(MDTCHQ),AL1(000)              
BUYPGMEL DC    AL1(FLDLEN),AL2(0016),C'PGM  ',AL1(MDTCHQ),AL1(000)              
BUYOCMEL DC    AL1(FLDLEN),AL2(0017),C'BOCM ',AL1(MDTCHQ),AL1(000)              
BUYMODEL DC    AL1(FLDLEN),AL2(0018),C'BMOD ',AL1(MDTCHQ),AL1(002)              
BUYREPEL DC    AL1(FLDLEN),AL2(0019),C'BREP ',AL1(MDTCHQ),AL1(002)              
BUYFLTEL DC    AL1(FLDLEN),AL2(0020),C'FLGHT',AL1(MDTBIQ),AL1(001)              
BUYNPWEL DC    AL1(FLDLEN),AL2(0021),C'NPW  ',AL1(MDTBIQ),AL1(001)              
BUYTRDEL DC    AL1(FLDLEN),AL2(0022),C'TRADE',AL1(MDTMDQ),AL1(000)              
BUYSTYEL DC    AL1(FLDLEN),AL2(0023),C'SPTYP',AL1(MDTCHQ),AL1(001)              
BUYSC1EL DC    AL1(FLDLEN),AL2(0024),C'SCOM1',AL1(MDTCHQ),AL1(000)              
BUYSC2EL DC    AL1(FLDLEN),AL2(0025),C'SCOM2',AL1(MDTCHQ),AL1(000)              
BUYVEREL DC    AL1(FLDLEN),AL2(0026),C'VER# ',AL1(MDTBIQ),AL1(001)              
BUYADEMO DC    AL1(FLDLEN),AL2(0027),C'ADEMO',AL1(MDTCHQ),AL1(000)              
BUYPRTG  DC    AL1(FLDLEN),AL2(0028),C'RTG  ',AL1(MDTPKQ),AL1(005)              
BUYRDEMO DC    AL1(FLDLEN),AL2(0029),C'RDEMO',AL1(MDTCHQ),AL1(000)              
BUYPPRTG DC    AL1(FLDLEN),AL2(0030),C'P-RTG',AL1(MDTPKQ),AL1(005)              
BUYDAYPT DC    AL1(FLDLEN),AL2(0031),C'DAYPT',AL1(MDTCHQ),AL1(001)              
BUYSECTN DC    AL1(FLDLEN),AL2(0032),C'SECTN',AL1(MDTCHQ),AL1(003)              
BUYCLASS DC    AL1(FLDLEN),AL2(0033),C'CLASS',AL1(MDTCHQ),AL1(003)              
BUYPLANC DC    AL1(FLDLEN),AL2(0034),C'PLAN ',AL1(MDTCHQ),AL1(003)              
BUYPATRN DC    AL1(FLDLEN),AL2(0035),C'PATRN',AL1(MDTCHQ),AL1(010)              
BUYNOTAT DC    AL1(FLDLEN),AL2(0036),C'NOTAT',AL1(MDTCHQ),AL1(015)              
* THESE ENTRIES ARE GOING TO BE ON ORIGINAL BUY                                 
BUYMGOOR DC    AL1(FLDLEN),AL2(0037),C'MGOOR',AL1(MDTCHQ),AL1(000)              
BUYMGOMG DC    AL1(FLDLEN),AL2(0038),C'MGOMG',AL1(MDTCHQ),AL1(000)              
         DC    X'00'                                                            
BUYDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* BUY DAY/TIME                                                                  
*--------------------------------------------------------------------           
BDYDATA  DC    AL1(BDYDATAD-*),AL2(BDYDATAQ),AL2(BDYDATAX-BDYDATA)              
         DC    X'80'                                                            
BDYDATAD DS    0AL1                                                             
BDYSDYEL DC    AL1(FLDLEN),AL2(0001),C'SDAY ',AL1(MDTBIQ),AL1(001)              
BDYEDYEL DC    AL1(FLDLEN),AL2(0002),C'EDAY ',AL1(MDTBIQ),AL1(001)              
BDYDAYEL DC    AL1(FLDLEN),AL2(0003),C'DAYS ',AL1(MDTBIQ),AL1(001)              
BDYSTMEL DC    AL1(FLDLEN),AL2(0004),C'STIM ',AL1(MDTBIQ),AL1(002)              
BDYETMEL DC    AL1(FLDLEN),AL2(0005),C'ETIM ',AL1(MDTBIQ),AL1(002)              
BDYDWTEL DC    AL1(FLDLEN),AL2(0006),C'DAYWT',AL1(MDTBIQ),AL1(001)              
BDYECCEL DC    AL1(FLDLEN),AL2(0007),C'ET-CC',AL1(MDTMDQ),AL1(000)              
BDYTMXEL DC    AL1(FLDLEN),AL2(0008),C'TMTXT',AL1(MDTCHQ),AL1(004)              
         DC    X'00'                                                            
BDYDATAX EQU   *                                                                
         SPACE 3                                                                
*--------------------------------------------------------------------           
* BUY EFFECTIVE DATE                                                            
*--------------------------------------------------------------------           
BDTDATA  DC    AL1(BDTDATAD-*),AL2(BDTDATAQ),AL2(BDTDATAX-BDTDATA)              
         DC    X'80'                                                            
BDTDATAD DS    0AL1                                                             
BDTSDTEL DC    AL1(FLDLEN),AL2(0001),C'SDATE',AL1(MDTJDQ),AL1(003)              
BDTEDTEL DC    AL1(FLDLEN),AL2(0002),C'EDATE',AL1(MDTJDQ),AL1(003)              
BDTWKSEL DC    AL1(FLDLEN),AL2(0003),C'WEEKS',AL1(MDTBIQ),AL1(001)              
BDTEWKEL DC    AL1(FLDLEN),AL2(0004),C'ALLWK',AL1(MDTMDQ),AL1(000)              
BDTAWKEL DC    AL1(FLDLEN),AL2(0005),C'ALTWK',AL1(MDTMDQ),AL1(000)              
BDTSPWEL DC    AL1(FLDLEN),AL2(0006),C'SP/WK',AL1(MDTBIQ),AL1(004)              
         DC    X'00'                                                            
BDTDATAX EQU   *                                                                
         SPACE 3                                                                
         EJECT                                                                  
*END OF MAPTABLE ====================================================           
         DC    X'00'               EOT                                          
