*          DATA SET REWRKFED   AT LEVEL 002 AS OF 03/20/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T811FED      DATE 03/20/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
SRVECAH  DS    CL8                                                              
SRVECA   DS    CL6      6    2    6   A    P    N         T         Y           
SRVECH   DS    CL8                                                              
SRVEC    DS    CL69     6   11   69   A    P    N         T         Y           
SRVEH1H  DS    CL8                                                              
SRVEH1   DS    CL78     8    2   78   A    P    N         T         Y           
SRVEH2H  DS    CL8                                                              
SRVEH2   DS    CL78     9    2   78   A    P    N         T         Y           
SRVED1H  DS    CL8                                                              
SRVED1   DS    CL7     10    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    10   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    10   53   20   A    P    N         T         Y           
SRVED2H  DS    CL8                                                              
SRVED2   DS    CL7     11    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    11   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    11   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    12   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    12   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    13   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    13   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    14   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    14   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    15   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    15   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     16    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    16   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    16   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     17    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    17   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    17   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     18    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    18   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    18   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     19    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    19   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    19   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    20   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    20   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     21    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    21   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    21   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     22    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    22   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    22   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     23    2    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    23   11   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    23   53   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     24   11    1   A    U    N         T         Y           
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1549 BYTES                            
