*          DATA SET REWRISTBD  AT LEVEL 001 AS OF 06/20/95                      
* - COVERS STATION TABLE DATA IN REWRIDRV,REWRIIO                               
*                                                                               
STADBLD  DSECT                   STATION TABLE DATA DSECT                       
STDSTA   DS    CL(L'RESTA)                                                      
STDOWN   DS    CL(L'REOWN)                                                      
STDRNK   DS    CL(L'RERNK)                                                      
STDTVB   DS    CL(L'RETVB)                                                      
STDMCD   DS    CL(L'REMCD)                                                      
STDLENE  EQU   *-STDSTA                                                         
