*          DATA SET REWRIF2D   AT LEVEL 001 AS OF 02/13/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T821F2D      DATE 02/13/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
PNDRFLH  DS    CL8                                                              
PNDRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
PNDRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
PNDREGH  DS    CL8                                                              
PNDREG   DS    CL3      7   10    3  A  U N             T        Y    1         
PNDREGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
PNDOFFH  DS    CL8                                                              
PNDOFF   DS    CL3      7   30    3  A  U N             T        Y    4         
PNDOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   38    6  A  P N             T        Y              
PNDPERH  DS    CL8                                                              
PNDPER   DS    CL17     7   46   17  A  U N             T        Y    6         
PNDPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
PNDGRPH  DS    CL8                                                              
PNDGRP   DS    CL3      8   10    3  A  U N             T        Y   10         
PNDGRPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P N             T        Y              
PNDSTAH  DS    CL8                                                              
PNDSTA   DS    CL7      8   30    7  A  U N             T        Y   14         
PNDSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P N             T        Y              
PNDADTEH DS    CL8                                                              
PNDADTE  DS    CL17     8   46   17  A  U N             T        Y   16         
PNDADTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
PNDSALH  DS    CL8                                                              
PNDSAL   DS    CL4      9   14    4  A  U N             T        Y   20         
PNDSALX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9   20    8  A  P N             T        Y              
PNDTEMH  DS    CL8                                                              
PNDTEM   DS    CL3      9   30    3  A  U N             T        Y   24         
PNDTEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9   38   10  A  P N             T        Y              
PNDADVH  DS    CL8                                                              
PNDADV   DS    CL4      9   49    4  A  U N             T        Y   26         
PNDADVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9   56    6  A  P N             T        Y              
PNDAGYH  DS    CL8                                                              
PNDAGY   DS    CL7      9   64    7  A  U N             T        Y   26         
PNDAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
PNDCLSH  DS    CL8                                                              
PNDCLS   DS    CL3     10   10    3  A  U N             T        Y   30         
PNDCLSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10   20    8  A  P N             T        Y              
PNDCATH  DS    CL8                                                              
PNDCAT   DS    CL3     10   30    3  A  U N             T        Y   34         
PNDCATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
PNDFILTH DS    CL8                                                              
PNDFILT  DS    CL26    11   10   26  A  U N             T        Y   40         
PNDFILTX DS    CL8                                                              
PNDLSTH  DS    CL8                                                              
PNDLST   DS    CL1     11   76    1  A  U N             T        Y              
PNDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PNDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 640  BYTES                            
